; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_44.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_101/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badSink", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !42}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 21, scope: !52)
!57 = !DILocalVariable(name: "i", scope: !58, file: !45, line: 38, type: !23)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 37, column: 5)
!59 = !DILocation(line: 38, column: 13, scope: !58)
!60 = !DILocalVariable(name: "n", scope: !58, file: !45, line: 38, type: !23)
!61 = !DILocation(line: 38, column: 16, scope: !58)
!62 = !DILocalVariable(name: "intVariable", scope: !58, file: !45, line: 38, type: !23)
!63 = !DILocation(line: 38, column: 19, scope: !58)
!64 = !DILocation(line: 39, column: 20, scope: !65)
!65 = distinct !DILexicalBlock(scope: !58, file: !45, line: 39, column: 13)
!66 = !DILocation(line: 39, column: 13, scope: !65)
!67 = !DILocation(line: 39, column: 36, scope: !65)
!68 = !DILocation(line: 39, column: 13, scope: !58)
!69 = !DILocation(line: 42, column: 25, scope: !70)
!70 = distinct !DILexicalBlock(scope: !65, file: !45, line: 40, column: 9)
!71 = !DILocation(line: 43, column: 20, scope: !72)
!72 = distinct !DILexicalBlock(scope: !70, file: !45, line: 43, column: 13)
!73 = !DILocation(line: 43, column: 18, scope: !72)
!74 = !DILocation(line: 43, column: 25, scope: !75)
!75 = distinct !DILexicalBlock(scope: !72, file: !45, line: 43, column: 13)
!76 = !DILocation(line: 43, column: 29, scope: !75)
!77 = !DILocation(line: 43, column: 27, scope: !75)
!78 = !DILocation(line: 43, column: 13, scope: !72)
!79 = !DILocation(line: 46, column: 28, scope: !80)
!80 = distinct !DILexicalBlock(scope: !75, file: !45, line: 44, column: 13)
!81 = !DILocation(line: 47, column: 13, scope: !80)
!82 = !DILocation(line: 43, column: 33, scope: !75)
!83 = !DILocation(line: 43, column: 13, scope: !75)
!84 = distinct !{!84, !78, !85, !86}
!85 = !DILocation(line: 47, column: 13, scope: !72)
!86 = !{!"llvm.loop.mustprogress"}
!87 = !DILocation(line: 48, column: 26, scope: !70)
!88 = !DILocation(line: 48, column: 13, scope: !70)
!89 = !DILocation(line: 49, column: 9, scope: !70)
!90 = !DILocation(line: 51, column: 1, scope: !52)
!91 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_44_bad", scope: !45, file: !45, line: 53, type: !92, scopeLine: 54, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!92 = !DISubroutineType(types: !93)
!93 = !{null}
!94 = !DILocalVariable(name: "data", scope: !91, file: !45, line: 55, type: !42)
!95 = !DILocation(line: 55, column: 12, scope: !91)
!96 = !DILocalVariable(name: "funcPtr", scope: !91, file: !45, line: 57, type: !97)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!98 = !DILocation(line: 57, column: 12, scope: !91)
!99 = !DILocalVariable(name: "dataBuffer", scope: !91, file: !45, line: 58, type: !100)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 100)
!103 = !DILocation(line: 58, column: 10, scope: !91)
!104 = !DILocation(line: 59, column: 12, scope: !91)
!105 = !DILocation(line: 59, column: 10, scope: !91)
!106 = !DILocalVariable(name: "dataLen", scope: !107, file: !45, line: 62, type: !108)
!107 = distinct !DILexicalBlock(scope: !91, file: !45, line: 60, column: 5)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DILocation(line: 62, column: 16, scope: !107)
!112 = !DILocation(line: 62, column: 33, scope: !107)
!113 = !DILocation(line: 62, column: 26, scope: !107)
!114 = !DILocalVariable(name: "pFile", scope: !107, file: !45, line: 63, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !117, line: 7, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !119, line: 49, size: 1728, elements: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !136, !138, !139, !140, !144, !145, !147, !151, !154, !156, !159, !162, !163, !164, !165, !166}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !118, file: !119, line: 51, baseType: !23, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !118, file: !119, line: 54, baseType: !42, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !118, file: !119, line: 55, baseType: !42, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !118, file: !119, line: 56, baseType: !42, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !118, file: !119, line: 57, baseType: !42, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !118, file: !119, line: 58, baseType: !42, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !118, file: !119, line: 59, baseType: !42, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !118, file: !119, line: 60, baseType: !42, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !118, file: !119, line: 61, baseType: !42, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !118, file: !119, line: 64, baseType: !42, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !118, file: !119, line: 65, baseType: !42, size: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !118, file: !119, line: 66, baseType: !42, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !118, file: !119, line: 68, baseType: !134, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !119, line: 36, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !118, file: !119, line: 70, baseType: !137, size: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !118, file: !119, line: 72, baseType: !23, size: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !118, file: !119, line: 73, baseType: !23, size: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !118, file: !119, line: 74, baseType: !141, size: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !142, line: 152, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!143 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !118, file: !119, line: 77, baseType: !24, size: 16, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !118, file: !119, line: 78, baseType: !146, size: 8, offset: 1040)
!146 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !118, file: !119, line: 79, baseType: !148, size: 8, offset: 1048)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 1)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !118, file: !119, line: 81, baseType: !152, size: 64, offset: 1088)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !119, line: 43, baseType: null)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !118, file: !119, line: 89, baseType: !155, size: 64, offset: 1152)
!155 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !142, line: 153, baseType: !143)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !118, file: !119, line: 91, baseType: !157, size: 64, offset: 1216)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !119, line: 37, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !118, file: !119, line: 92, baseType: !160, size: 64, offset: 1280)
!160 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !161, size: 64)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !119, line: 38, flags: DIFlagFwdDecl)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !118, file: !119, line: 93, baseType: !137, size: 64, offset: 1344)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !118, file: !119, line: 94, baseType: !22, size: 64, offset: 1408)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !118, file: !119, line: 95, baseType: !108, size: 64, offset: 1472)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !118, file: !119, line: 96, baseType: !23, size: 32, offset: 1536)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !118, file: !119, line: 98, baseType: !167, size: 160, offset: 1568)
!167 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !168)
!168 = !{!169}
!169 = !DISubrange(count: 20)
!170 = !DILocation(line: 63, column: 16, scope: !107)
!171 = !DILocation(line: 65, column: 17, scope: !172)
!172 = distinct !DILexicalBlock(scope: !107, file: !45, line: 65, column: 13)
!173 = !DILocation(line: 65, column: 16, scope: !172)
!174 = !DILocation(line: 65, column: 25, scope: !172)
!175 = !DILocation(line: 65, column: 13, scope: !107)
!176 = !DILocation(line: 67, column: 21, scope: !177)
!177 = distinct !DILexicalBlock(scope: !172, file: !45, line: 66, column: 9)
!178 = !DILocation(line: 67, column: 19, scope: !177)
!179 = !DILocation(line: 68, column: 17, scope: !180)
!180 = distinct !DILexicalBlock(scope: !177, file: !45, line: 68, column: 17)
!181 = !DILocation(line: 68, column: 23, scope: !180)
!182 = !DILocation(line: 68, column: 17, scope: !177)
!183 = !DILocation(line: 71, column: 27, scope: !184)
!184 = distinct !DILexicalBlock(scope: !185, file: !45, line: 71, column: 21)
!185 = distinct !DILexicalBlock(scope: !180, file: !45, line: 69, column: 13)
!186 = !DILocation(line: 71, column: 32, scope: !184)
!187 = !DILocation(line: 71, column: 31, scope: !184)
!188 = !DILocation(line: 71, column: 51, scope: !184)
!189 = !DILocation(line: 71, column: 50, scope: !184)
!190 = !DILocation(line: 71, column: 41, scope: !184)
!191 = !DILocation(line: 71, column: 61, scope: !184)
!192 = !DILocation(line: 71, column: 21, scope: !184)
!193 = !DILocation(line: 71, column: 68, scope: !184)
!194 = !DILocation(line: 71, column: 21, scope: !185)
!195 = !DILocation(line: 73, column: 21, scope: !196)
!196 = distinct !DILexicalBlock(scope: !184, file: !45, line: 72, column: 17)
!197 = !DILocation(line: 75, column: 21, scope: !196)
!198 = !DILocation(line: 75, column: 26, scope: !196)
!199 = !DILocation(line: 75, column: 35, scope: !196)
!200 = !DILocation(line: 76, column: 17, scope: !196)
!201 = !DILocation(line: 77, column: 24, scope: !185)
!202 = !DILocation(line: 77, column: 17, scope: !185)
!203 = !DILocation(line: 78, column: 13, scope: !185)
!204 = !DILocation(line: 79, column: 9, scope: !177)
!205 = !DILocation(line: 82, column: 5, scope: !91)
!206 = !DILocation(line: 82, column: 13, scope: !91)
!207 = !DILocation(line: 83, column: 1, scope: !91)
!208 = distinct !DISubprogram(name: "goodG2BSink", scope: !45, file: !45, line: 90, type: !53, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!209 = !DILocalVariable(name: "data", arg: 1, scope: !208, file: !45, line: 90, type: !42)
!210 = !DILocation(line: 90, column: 25, scope: !208)
!211 = !DILocalVariable(name: "i", scope: !212, file: !45, line: 93, type: !23)
!212 = distinct !DILexicalBlock(scope: !208, file: !45, line: 92, column: 5)
!213 = !DILocation(line: 93, column: 13, scope: !212)
!214 = !DILocalVariable(name: "n", scope: !212, file: !45, line: 93, type: !23)
!215 = !DILocation(line: 93, column: 16, scope: !212)
!216 = !DILocalVariable(name: "intVariable", scope: !212, file: !45, line: 93, type: !23)
!217 = !DILocation(line: 93, column: 19, scope: !212)
!218 = !DILocation(line: 94, column: 20, scope: !219)
!219 = distinct !DILexicalBlock(scope: !212, file: !45, line: 94, column: 13)
!220 = !DILocation(line: 94, column: 13, scope: !219)
!221 = !DILocation(line: 94, column: 36, scope: !219)
!222 = !DILocation(line: 94, column: 13, scope: !212)
!223 = !DILocation(line: 97, column: 25, scope: !224)
!224 = distinct !DILexicalBlock(scope: !219, file: !45, line: 95, column: 9)
!225 = !DILocation(line: 98, column: 20, scope: !226)
!226 = distinct !DILexicalBlock(scope: !224, file: !45, line: 98, column: 13)
!227 = !DILocation(line: 98, column: 18, scope: !226)
!228 = !DILocation(line: 98, column: 25, scope: !229)
!229 = distinct !DILexicalBlock(scope: !226, file: !45, line: 98, column: 13)
!230 = !DILocation(line: 98, column: 29, scope: !229)
!231 = !DILocation(line: 98, column: 27, scope: !229)
!232 = !DILocation(line: 98, column: 13, scope: !226)
!233 = !DILocation(line: 101, column: 28, scope: !234)
!234 = distinct !DILexicalBlock(scope: !229, file: !45, line: 99, column: 13)
!235 = !DILocation(line: 102, column: 13, scope: !234)
!236 = !DILocation(line: 98, column: 33, scope: !229)
!237 = !DILocation(line: 98, column: 13, scope: !229)
!238 = distinct !{!238, !232, !239, !86}
!239 = !DILocation(line: 102, column: 13, scope: !226)
!240 = !DILocation(line: 103, column: 26, scope: !224)
!241 = !DILocation(line: 103, column: 13, scope: !224)
!242 = !DILocation(line: 104, column: 9, scope: !224)
!243 = !DILocation(line: 106, column: 1, scope: !208)
!244 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 108, type: !92, scopeLine: 109, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!245 = !DILocalVariable(name: "data", scope: !244, file: !45, line: 110, type: !42)
!246 = !DILocation(line: 110, column: 12, scope: !244)
!247 = !DILocalVariable(name: "funcPtr", scope: !244, file: !45, line: 111, type: !97)
!248 = !DILocation(line: 111, column: 12, scope: !244)
!249 = !DILocalVariable(name: "dataBuffer", scope: !244, file: !45, line: 112, type: !100)
!250 = !DILocation(line: 112, column: 10, scope: !244)
!251 = !DILocation(line: 113, column: 12, scope: !244)
!252 = !DILocation(line: 113, column: 10, scope: !244)
!253 = !DILocation(line: 115, column: 12, scope: !244)
!254 = !DILocation(line: 115, column: 5, scope: !244)
!255 = !DILocation(line: 116, column: 5, scope: !244)
!256 = !DILocation(line: 116, column: 13, scope: !244)
!257 = !DILocation(line: 117, column: 1, scope: !244)
!258 = distinct !DISubprogram(name: "goodB2GSink", scope: !45, file: !45, line: 120, type: !53, scopeLine: 121, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!259 = !DILocalVariable(name: "data", arg: 1, scope: !258, file: !45, line: 120, type: !42)
!260 = !DILocation(line: 120, column: 25, scope: !258)
!261 = !DILocalVariable(name: "i", scope: !262, file: !45, line: 123, type: !23)
!262 = distinct !DILexicalBlock(scope: !258, file: !45, line: 122, column: 5)
!263 = !DILocation(line: 123, column: 13, scope: !262)
!264 = !DILocalVariable(name: "n", scope: !262, file: !45, line: 123, type: !23)
!265 = !DILocation(line: 123, column: 16, scope: !262)
!266 = !DILocalVariable(name: "intVariable", scope: !262, file: !45, line: 123, type: !23)
!267 = !DILocation(line: 123, column: 19, scope: !262)
!268 = !DILocation(line: 124, column: 20, scope: !269)
!269 = distinct !DILexicalBlock(scope: !262, file: !45, line: 124, column: 13)
!270 = !DILocation(line: 124, column: 13, scope: !269)
!271 = !DILocation(line: 124, column: 36, scope: !269)
!272 = !DILocation(line: 124, column: 13, scope: !262)
!273 = !DILocation(line: 127, column: 17, scope: !274)
!274 = distinct !DILexicalBlock(scope: !275, file: !45, line: 127, column: 17)
!275 = distinct !DILexicalBlock(scope: !269, file: !45, line: 125, column: 9)
!276 = !DILocation(line: 127, column: 19, scope: !274)
!277 = !DILocation(line: 127, column: 17, scope: !275)
!278 = !DILocation(line: 129, column: 29, scope: !279)
!279 = distinct !DILexicalBlock(scope: !274, file: !45, line: 128, column: 13)
!280 = !DILocation(line: 130, column: 24, scope: !281)
!281 = distinct !DILexicalBlock(scope: !279, file: !45, line: 130, column: 17)
!282 = !DILocation(line: 130, column: 22, scope: !281)
!283 = !DILocation(line: 130, column: 29, scope: !284)
!284 = distinct !DILexicalBlock(scope: !281, file: !45, line: 130, column: 17)
!285 = !DILocation(line: 130, column: 33, scope: !284)
!286 = !DILocation(line: 130, column: 31, scope: !284)
!287 = !DILocation(line: 130, column: 17, scope: !281)
!288 = !DILocation(line: 133, column: 32, scope: !289)
!289 = distinct !DILexicalBlock(scope: !284, file: !45, line: 131, column: 17)
!290 = !DILocation(line: 134, column: 17, scope: !289)
!291 = !DILocation(line: 130, column: 37, scope: !284)
!292 = !DILocation(line: 130, column: 17, scope: !284)
!293 = distinct !{!293, !287, !294, !86}
!294 = !DILocation(line: 134, column: 17, scope: !281)
!295 = !DILocation(line: 135, column: 30, scope: !279)
!296 = !DILocation(line: 135, column: 17, scope: !279)
!297 = !DILocation(line: 136, column: 13, scope: !279)
!298 = !DILocation(line: 137, column: 9, scope: !275)
!299 = !DILocation(line: 139, column: 1, scope: !258)
!300 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 141, type: !92, scopeLine: 142, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!301 = !DILocalVariable(name: "data", scope: !300, file: !45, line: 143, type: !42)
!302 = !DILocation(line: 143, column: 12, scope: !300)
!303 = !DILocalVariable(name: "funcPtr", scope: !300, file: !45, line: 144, type: !97)
!304 = !DILocation(line: 144, column: 12, scope: !300)
!305 = !DILocalVariable(name: "dataBuffer", scope: !300, file: !45, line: 145, type: !100)
!306 = !DILocation(line: 145, column: 10, scope: !300)
!307 = !DILocation(line: 146, column: 12, scope: !300)
!308 = !DILocation(line: 146, column: 10, scope: !300)
!309 = !DILocalVariable(name: "dataLen", scope: !310, file: !45, line: 149, type: !108)
!310 = distinct !DILexicalBlock(scope: !300, file: !45, line: 147, column: 5)
!311 = !DILocation(line: 149, column: 16, scope: !310)
!312 = !DILocation(line: 149, column: 33, scope: !310)
!313 = !DILocation(line: 149, column: 26, scope: !310)
!314 = !DILocalVariable(name: "pFile", scope: !310, file: !45, line: 150, type: !115)
!315 = !DILocation(line: 150, column: 16, scope: !310)
!316 = !DILocation(line: 152, column: 17, scope: !317)
!317 = distinct !DILexicalBlock(scope: !310, file: !45, line: 152, column: 13)
!318 = !DILocation(line: 152, column: 16, scope: !317)
!319 = !DILocation(line: 152, column: 25, scope: !317)
!320 = !DILocation(line: 152, column: 13, scope: !310)
!321 = !DILocation(line: 154, column: 21, scope: !322)
!322 = distinct !DILexicalBlock(scope: !317, file: !45, line: 153, column: 9)
!323 = !DILocation(line: 154, column: 19, scope: !322)
!324 = !DILocation(line: 155, column: 17, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !45, line: 155, column: 17)
!326 = !DILocation(line: 155, column: 23, scope: !325)
!327 = !DILocation(line: 155, column: 17, scope: !322)
!328 = !DILocation(line: 158, column: 27, scope: !329)
!329 = distinct !DILexicalBlock(scope: !330, file: !45, line: 158, column: 21)
!330 = distinct !DILexicalBlock(scope: !325, file: !45, line: 156, column: 13)
!331 = !DILocation(line: 158, column: 32, scope: !329)
!332 = !DILocation(line: 158, column: 31, scope: !329)
!333 = !DILocation(line: 158, column: 51, scope: !329)
!334 = !DILocation(line: 158, column: 50, scope: !329)
!335 = !DILocation(line: 158, column: 41, scope: !329)
!336 = !DILocation(line: 158, column: 61, scope: !329)
!337 = !DILocation(line: 158, column: 21, scope: !329)
!338 = !DILocation(line: 158, column: 68, scope: !329)
!339 = !DILocation(line: 158, column: 21, scope: !330)
!340 = !DILocation(line: 160, column: 21, scope: !341)
!341 = distinct !DILexicalBlock(scope: !329, file: !45, line: 159, column: 17)
!342 = !DILocation(line: 162, column: 21, scope: !341)
!343 = !DILocation(line: 162, column: 26, scope: !341)
!344 = !DILocation(line: 162, column: 35, scope: !341)
!345 = !DILocation(line: 163, column: 17, scope: !341)
!346 = !DILocation(line: 164, column: 24, scope: !330)
!347 = !DILocation(line: 164, column: 17, scope: !330)
!348 = !DILocation(line: 165, column: 13, scope: !330)
!349 = !DILocation(line: 166, column: 9, scope: !322)
!350 = !DILocation(line: 168, column: 5, scope: !300)
!351 = !DILocation(line: 168, column: 13, scope: !300)
!352 = !DILocation(line: 169, column: 1, scope: !300)
!353 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_44_good", scope: !45, file: !45, line: 171, type: !92, scopeLine: 172, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!354 = !DILocation(line: 173, column: 5, scope: !353)
!355 = !DILocation(line: 174, column: 5, scope: !353)
!356 = !DILocation(line: 175, column: 1, scope: !353)
!357 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !53, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!358 = !DILocalVariable(name: "line", arg: 1, scope: !357, file: !3, line: 11, type: !42)
!359 = !DILocation(line: 11, column: 25, scope: !357)
!360 = !DILocation(line: 13, column: 1, scope: !357)
!361 = !DILocation(line: 14, column: 8, scope: !362)
!362 = distinct !DILexicalBlock(scope: !357, file: !3, line: 14, column: 8)
!363 = !DILocation(line: 14, column: 13, scope: !362)
!364 = !DILocation(line: 14, column: 8, scope: !357)
!365 = !DILocation(line: 16, column: 24, scope: !366)
!366 = distinct !DILexicalBlock(scope: !362, file: !3, line: 15, column: 5)
!367 = !DILocation(line: 16, column: 9, scope: !366)
!368 = !DILocation(line: 17, column: 5, scope: !366)
!369 = !DILocation(line: 18, column: 5, scope: !357)
!370 = !DILocation(line: 19, column: 1, scope: !357)
!371 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !53, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!372 = !DILocalVariable(name: "line", arg: 1, scope: !371, file: !3, line: 20, type: !42)
!373 = !DILocation(line: 20, column: 29, scope: !371)
!374 = !DILocation(line: 22, column: 8, scope: !375)
!375 = distinct !DILexicalBlock(scope: !371, file: !3, line: 22, column: 8)
!376 = !DILocation(line: 22, column: 13, scope: !375)
!377 = !DILocation(line: 22, column: 8, scope: !371)
!378 = !DILocation(line: 24, column: 24, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 23, column: 5)
!380 = !DILocation(line: 24, column: 9, scope: !379)
!381 = !DILocation(line: 25, column: 5, scope: !379)
!382 = !DILocation(line: 26, column: 1, scope: !371)
!383 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !384, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!384 = !DISubroutineType(types: !385)
!385 = !{null, !386}
!386 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !387, size: 64)
!387 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !109, line: 74, baseType: !23)
!388 = !DILocalVariable(name: "line", arg: 1, scope: !383, file: !3, line: 27, type: !386)
!389 = !DILocation(line: 27, column: 29, scope: !383)
!390 = !DILocation(line: 29, column: 8, scope: !391)
!391 = distinct !DILexicalBlock(scope: !383, file: !3, line: 29, column: 8)
!392 = !DILocation(line: 29, column: 13, scope: !391)
!393 = !DILocation(line: 29, column: 8, scope: !383)
!394 = !DILocation(line: 31, column: 27, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !3, line: 30, column: 5)
!396 = !DILocation(line: 31, column: 9, scope: !395)
!397 = !DILocation(line: 32, column: 5, scope: !395)
!398 = !DILocation(line: 33, column: 1, scope: !383)
!399 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !400, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !23}
!402 = !DILocalVariable(name: "intNumber", arg: 1, scope: !399, file: !3, line: 35, type: !23)
!403 = !DILocation(line: 35, column: 24, scope: !399)
!404 = !DILocation(line: 37, column: 20, scope: !399)
!405 = !DILocation(line: 37, column: 5, scope: !399)
!406 = !DILocation(line: 38, column: 1, scope: !399)
!407 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !408, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410}
!410 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!411 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !407, file: !3, line: 40, type: !410)
!412 = !DILocation(line: 40, column: 28, scope: !407)
!413 = !DILocation(line: 42, column: 21, scope: !407)
!414 = !DILocation(line: 42, column: 5, scope: !407)
!415 = !DILocation(line: 43, column: 1, scope: !407)
!416 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !417, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !419}
!419 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!420 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !416, file: !3, line: 45, type: !419)
!421 = !DILocation(line: 45, column: 28, scope: !416)
!422 = !DILocation(line: 47, column: 20, scope: !416)
!423 = !DILocation(line: 47, column: 5, scope: !416)
!424 = !DILocation(line: 48, column: 1, scope: !416)
!425 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !426, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !143}
!428 = !DILocalVariable(name: "longNumber", arg: 1, scope: !425, file: !3, line: 50, type: !143)
!429 = !DILocation(line: 50, column: 26, scope: !425)
!430 = !DILocation(line: 52, column: 21, scope: !425)
!431 = !DILocation(line: 52, column: 5, scope: !425)
!432 = !DILocation(line: 53, column: 1, scope: !425)
!433 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !434, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !436}
!436 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !437, line: 27, baseType: !438)
!437 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !142, line: 44, baseType: !143)
!439 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !433, file: !3, line: 55, type: !436)
!440 = !DILocation(line: 55, column: 33, scope: !433)
!441 = !DILocation(line: 57, column: 29, scope: !433)
!442 = !DILocation(line: 57, column: 5, scope: !433)
!443 = !DILocation(line: 58, column: 1, scope: !433)
!444 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !445, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!445 = !DISubroutineType(types: !446)
!446 = !{null, !108}
!447 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !444, file: !3, line: 60, type: !108)
!448 = !DILocation(line: 60, column: 29, scope: !444)
!449 = !DILocation(line: 62, column: 21, scope: !444)
!450 = !DILocation(line: 62, column: 5, scope: !444)
!451 = !DILocation(line: 63, column: 1, scope: !444)
!452 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !453, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !43}
!455 = !DILocalVariable(name: "charHex", arg: 1, scope: !452, file: !3, line: 65, type: !43)
!456 = !DILocation(line: 65, column: 29, scope: !452)
!457 = !DILocation(line: 67, column: 22, scope: !452)
!458 = !DILocation(line: 67, column: 5, scope: !452)
!459 = !DILocation(line: 68, column: 1, scope: !452)
!460 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !461, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !387}
!463 = !DILocalVariable(name: "wideChar", arg: 1, scope: !460, file: !3, line: 70, type: !387)
!464 = !DILocation(line: 70, column: 29, scope: !460)
!465 = !DILocalVariable(name: "s", scope: !460, file: !3, line: 74, type: !466)
!466 = !DICompositeType(tag: DW_TAG_array_type, baseType: !387, size: 64, elements: !467)
!467 = !{!468}
!468 = !DISubrange(count: 2)
!469 = !DILocation(line: 74, column: 13, scope: !460)
!470 = !DILocation(line: 75, column: 16, scope: !460)
!471 = !DILocation(line: 75, column: 9, scope: !460)
!472 = !DILocation(line: 75, column: 14, scope: !460)
!473 = !DILocation(line: 76, column: 9, scope: !460)
!474 = !DILocation(line: 76, column: 14, scope: !460)
!475 = !DILocation(line: 77, column: 21, scope: !460)
!476 = !DILocation(line: 77, column: 5, scope: !460)
!477 = !DILocation(line: 78, column: 1, scope: !460)
!478 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !479, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !7}
!481 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !478, file: !3, line: 80, type: !7)
!482 = !DILocation(line: 80, column: 33, scope: !478)
!483 = !DILocation(line: 82, column: 20, scope: !478)
!484 = !DILocation(line: 82, column: 5, scope: !478)
!485 = !DILocation(line: 83, column: 1, scope: !478)
!486 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !487, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !25}
!489 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !486, file: !3, line: 85, type: !25)
!490 = !DILocation(line: 85, column: 45, scope: !486)
!491 = !DILocation(line: 87, column: 22, scope: !486)
!492 = !DILocation(line: 87, column: 5, scope: !486)
!493 = !DILocation(line: 88, column: 1, scope: !486)
!494 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !495, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !497}
!497 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!498 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !494, file: !3, line: 90, type: !497)
!499 = !DILocation(line: 90, column: 29, scope: !494)
!500 = !DILocation(line: 92, column: 20, scope: !494)
!501 = !DILocation(line: 92, column: 5, scope: !494)
!502 = !DILocation(line: 93, column: 1, scope: !494)
!503 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !504, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!504 = !DISubroutineType(types: !505)
!505 = !{null, !506}
!506 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !507, size: 64)
!507 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !508, line: 100, baseType: !509)
!508 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_101/source_code")
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !508, line: 96, size: 64, elements: !510)
!510 = !{!511, !512}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !509, file: !508, line: 98, baseType: !23, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !509, file: !508, line: 99, baseType: !23, size: 32, offset: 32)
!513 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !503, file: !3, line: 95, type: !506)
!514 = !DILocation(line: 95, column: 40, scope: !503)
!515 = !DILocation(line: 97, column: 26, scope: !503)
!516 = !DILocation(line: 97, column: 47, scope: !503)
!517 = !DILocation(line: 97, column: 55, scope: !503)
!518 = !DILocation(line: 97, column: 76, scope: !503)
!519 = !DILocation(line: 97, column: 5, scope: !503)
!520 = !DILocation(line: 98, column: 1, scope: !503)
!521 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !522, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524, !108}
!524 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!525 = !DILocalVariable(name: "bytes", arg: 1, scope: !521, file: !3, line: 100, type: !524)
!526 = !DILocation(line: 100, column: 38, scope: !521)
!527 = !DILocalVariable(name: "numBytes", arg: 2, scope: !521, file: !3, line: 100, type: !108)
!528 = !DILocation(line: 100, column: 52, scope: !521)
!529 = !DILocalVariable(name: "i", scope: !521, file: !3, line: 102, type: !108)
!530 = !DILocation(line: 102, column: 12, scope: !521)
!531 = !DILocation(line: 103, column: 12, scope: !532)
!532 = distinct !DILexicalBlock(scope: !521, file: !3, line: 103, column: 5)
!533 = !DILocation(line: 103, column: 10, scope: !532)
!534 = !DILocation(line: 103, column: 17, scope: !535)
!535 = distinct !DILexicalBlock(scope: !532, file: !3, line: 103, column: 5)
!536 = !DILocation(line: 103, column: 21, scope: !535)
!537 = !DILocation(line: 103, column: 19, scope: !535)
!538 = !DILocation(line: 103, column: 5, scope: !532)
!539 = !DILocation(line: 105, column: 24, scope: !540)
!540 = distinct !DILexicalBlock(scope: !535, file: !3, line: 104, column: 5)
!541 = !DILocation(line: 105, column: 30, scope: !540)
!542 = !DILocation(line: 105, column: 9, scope: !540)
!543 = !DILocation(line: 106, column: 5, scope: !540)
!544 = !DILocation(line: 103, column: 31, scope: !535)
!545 = !DILocation(line: 103, column: 5, scope: !535)
!546 = distinct !{!546, !538, !547, !86}
!547 = !DILocation(line: 106, column: 5, scope: !532)
!548 = !DILocation(line: 107, column: 5, scope: !521)
!549 = !DILocation(line: 108, column: 1, scope: !521)
!550 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !551, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!551 = !DISubroutineType(types: !552)
!552 = !{!108, !524, !108, !42}
!553 = !DILocalVariable(name: "bytes", arg: 1, scope: !550, file: !3, line: 113, type: !524)
!554 = !DILocation(line: 113, column: 39, scope: !550)
!555 = !DILocalVariable(name: "numBytes", arg: 2, scope: !550, file: !3, line: 113, type: !108)
!556 = !DILocation(line: 113, column: 53, scope: !550)
!557 = !DILocalVariable(name: "hex", arg: 3, scope: !550, file: !3, line: 113, type: !42)
!558 = !DILocation(line: 113, column: 71, scope: !550)
!559 = !DILocalVariable(name: "numWritten", scope: !550, file: !3, line: 115, type: !108)
!560 = !DILocation(line: 115, column: 12, scope: !550)
!561 = !DILocation(line: 121, column: 5, scope: !550)
!562 = !DILocation(line: 121, column: 12, scope: !550)
!563 = !DILocation(line: 121, column: 25, scope: !550)
!564 = !DILocation(line: 121, column: 23, scope: !550)
!565 = !DILocation(line: 121, column: 34, scope: !550)
!566 = !DILocation(line: 121, column: 37, scope: !550)
!567 = !DILocation(line: 121, column: 67, scope: !550)
!568 = !DILocation(line: 121, column: 70, scope: !550)
!569 = !DILocation(line: 0, scope: !550)
!570 = !DILocalVariable(name: "byte", scope: !571, file: !3, line: 123, type: !23)
!571 = distinct !DILexicalBlock(scope: !550, file: !3, line: 122, column: 5)
!572 = !DILocation(line: 123, column: 13, scope: !571)
