; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_44.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_44.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badSink(i8* %data) #0 !dbg !10 {
entry:
  %data.addr = alloca i8*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4
  %intVariable = alloca i32, align 4
  store i8* %data, i8** %data.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !15, metadata !DIExpression()), !dbg !16
  call void @llvm.dbg.declare(metadata i32* %i, metadata !17, metadata !DIExpression()), !dbg !19

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_44.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_101/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "badSink", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DILocalVariable(name: "data", arg: 1, scope: !10, file: !1, line: 35, type: !13)
!16 = !DILocation(line: 35, column: 21, scope: !10)
!17 = !DILocalVariable(name: "i", scope: !18, file: !1, line: 38, type: !5)
!18 = distinct !DILexicalBlock(scope: !10, file: !1, line: 37, column: 5)
!19 = !DILocation(line: 38, column: 13, scope: !18)
!20 = !DILocalVariable(name: "n", scope: !18, file: !1, line: 38, type: !5)
!21 = !DILocation(line: 38, column: 16, scope: !18)
!22 = !DILocalVariable(name: "intVariable", scope: !18, file: !1, line: 38, type: !5)
!23 = !DILocation(line: 38, column: 19, scope: !18)
!24 = !DILocation(line: 39, column: 20, scope: !25)
!25 = distinct !DILexicalBlock(scope: !18, file: !1, line: 39, column: 13)
!26 = !DILocation(line: 39, column: 13, scope: !25)
!27 = !DILocation(line: 39, column: 36, scope: !25)
!28 = !DILocation(line: 39, column: 13, scope: !18)
!29 = !DILocation(line: 42, column: 25, scope: !30)
!30 = distinct !DILexicalBlock(scope: !25, file: !1, line: 40, column: 9)
!31 = !DILocation(line: 43, column: 20, scope: !32)
!32 = distinct !DILexicalBlock(scope: !30, file: !1, line: 43, column: 13)
!33 = !DILocation(line: 43, column: 18, scope: !32)
!34 = !DILocation(line: 43, column: 25, scope: !35)
!35 = distinct !DILexicalBlock(scope: !32, file: !1, line: 43, column: 13)
!36 = !DILocation(line: 43, column: 29, scope: !35)
!37 = !DILocation(line: 43, column: 27, scope: !35)
!38 = !DILocation(line: 43, column: 13, scope: !32)
!39 = !DILocation(line: 46, column: 28, scope: !40)
!40 = distinct !DILexicalBlock(scope: !35, file: !1, line: 44, column: 13)
!41 = !DILocation(line: 47, column: 13, scope: !40)
!42 = !DILocation(line: 43, column: 33, scope: !35)
!43 = !DILocation(line: 43, column: 13, scope: !35)
!44 = distinct !{!44, !38, !45, !46}
!45 = !DILocation(line: 47, column: 13, scope: !32)
!46 = !{!"llvm.loop.mustprogress"}
!47 = !DILocation(line: 48, column: 26, scope: !30)
!48 = !DILocation(line: 48, column: 13, scope: !30)
!49 = !DILocation(line: 49, column: 9, scope: !30)
!50 = !DILocation(line: 51, column: 1, scope: !10)
!51 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_44_bad", scope: !1, file: !1, line: 53, type: !52, scopeLine: 54, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!52 = !DISubroutineType(types: !53)
!53 = !{null}
!54 = !DILocalVariable(name: "data", scope: !51, file: !1, line: 55, type: !13)
!55 = !DILocation(line: 55, column: 12, scope: !51)
!56 = !DILocalVariable(name: "funcPtr", scope: !51, file: !1, line: 57, type: !57)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!58 = !DILocation(line: 57, column: 12, scope: !51)
!59 = !DILocalVariable(name: "dataBuffer", scope: !51, file: !1, line: 58, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 800, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 100)
!63 = !DILocation(line: 58, column: 10, scope: !51)
!64 = !DILocation(line: 59, column: 12, scope: !51)
!65 = !DILocation(line: 59, column: 10, scope: !51)
!66 = !DILocalVariable(name: "dataLen", scope: !67, file: !1, line: 62, type: !68)
!67 = distinct !DILexicalBlock(scope: !51, file: !1, line: 60, column: 5)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 62, column: 16, scope: !67)
!72 = !DILocation(line: 62, column: 33, scope: !67)
!73 = !DILocation(line: 62, column: 26, scope: !67)
!74 = !DILocalVariable(name: "pFile", scope: !67, file: !1, line: 63, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !5, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !13, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !13, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !13, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !13, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !13, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !13, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !13, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !13, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !13, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !13, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !13, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !5, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !5, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !105, size: 16, offset: 1024)
!105 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !4, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !5, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocation(line: 63, column: 16, scope: !67)
!132 = !DILocation(line: 65, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !67, file: !1, line: 65, column: 13)
!134 = !DILocation(line: 65, column: 16, scope: !133)
!135 = !DILocation(line: 65, column: 25, scope: !133)
!136 = !DILocation(line: 65, column: 13, scope: !67)
!137 = !DILocation(line: 67, column: 21, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !1, line: 66, column: 9)
!139 = !DILocation(line: 67, column: 19, scope: !138)
!140 = !DILocation(line: 68, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !138, file: !1, line: 68, column: 17)
!142 = !DILocation(line: 68, column: 23, scope: !141)
!143 = !DILocation(line: 68, column: 17, scope: !138)
!144 = !DILocation(line: 71, column: 27, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !1, line: 71, column: 21)
!146 = distinct !DILexicalBlock(scope: !141, file: !1, line: 69, column: 13)
!147 = !DILocation(line: 71, column: 32, scope: !145)
!148 = !DILocation(line: 71, column: 31, scope: !145)
!149 = !DILocation(line: 71, column: 51, scope: !145)
!150 = !DILocation(line: 71, column: 50, scope: !145)
!151 = !DILocation(line: 71, column: 41, scope: !145)
!152 = !DILocation(line: 71, column: 61, scope: !145)
!153 = !DILocation(line: 71, column: 21, scope: !145)
!154 = !DILocation(line: 71, column: 68, scope: !145)
!155 = !DILocation(line: 71, column: 21, scope: !146)
!156 = !DILocation(line: 73, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !1, line: 72, column: 17)
!158 = !DILocation(line: 75, column: 21, scope: !157)
!159 = !DILocation(line: 75, column: 26, scope: !157)
!160 = !DILocation(line: 75, column: 35, scope: !157)
!161 = !DILocation(line: 76, column: 17, scope: !157)
!162 = !DILocation(line: 77, column: 24, scope: !146)
!163 = !DILocation(line: 77, column: 17, scope: !146)
!164 = !DILocation(line: 78, column: 13, scope: !146)
!165 = !DILocation(line: 79, column: 9, scope: !138)
!166 = !DILocation(line: 82, column: 5, scope: !51)
!167 = !DILocation(line: 82, column: 13, scope: !51)
!168 = !DILocation(line: 83, column: 1, scope: !51)
!169 = distinct !DISubprogram(name: "goodG2BSink", scope: !1, file: !1, line: 90, type: !11, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!170 = !DILocalVariable(name: "data", arg: 1, scope: !169, file: !1, line: 90, type: !13)
!171 = !DILocation(line: 90, column: 25, scope: !169)
!172 = !DILocalVariable(name: "i", scope: !173, file: !1, line: 93, type: !5)
!173 = distinct !DILexicalBlock(scope: !169, file: !1, line: 92, column: 5)
!174 = !DILocation(line: 93, column: 13, scope: !173)
!175 = !DILocalVariable(name: "n", scope: !173, file: !1, line: 93, type: !5)
!176 = !DILocation(line: 93, column: 16, scope: !173)
!177 = !DILocalVariable(name: "intVariable", scope: !173, file: !1, line: 93, type: !5)
!178 = !DILocation(line: 93, column: 19, scope: !173)
!179 = !DILocation(line: 94, column: 20, scope: !180)
!180 = distinct !DILexicalBlock(scope: !173, file: !1, line: 94, column: 13)
!181 = !DILocation(line: 94, column: 13, scope: !180)
!182 = !DILocation(line: 94, column: 36, scope: !180)
!183 = !DILocation(line: 94, column: 13, scope: !173)
!184 = !DILocation(line: 97, column: 25, scope: !185)
!185 = distinct !DILexicalBlock(scope: !180, file: !1, line: 95, column: 9)
!186 = !DILocation(line: 98, column: 20, scope: !187)
!187 = distinct !DILexicalBlock(scope: !185, file: !1, line: 98, column: 13)
!188 = !DILocation(line: 98, column: 18, scope: !187)
!189 = !DILocation(line: 98, column: 25, scope: !190)
!190 = distinct !DILexicalBlock(scope: !187, file: !1, line: 98, column: 13)
