; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_998/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !50, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_998/source_code")
!50 = !{!41}
!51 = !{!"clang version 12.0.0"}
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64_bad", scope: !45, file: !45, line: 35, type: !56, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!56 = !DISubroutineType(types: !57)
!57 = !{null}
!58 = !DILocalVariable(name: "data", scope: !55, file: !45, line: 37, type: !42)
!59 = !DILocation(line: 37, column: 12, scope: !55)
!60 = !DILocalVariable(name: "dataBuffer", scope: !55, file: !45, line: 38, type: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 100)
!64 = !DILocation(line: 38, column: 10, scope: !55)
!65 = !DILocation(line: 39, column: 12, scope: !55)
!66 = !DILocation(line: 39, column: 10, scope: !55)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 42, type: !69)
!68 = distinct !DILexicalBlock(scope: !55, file: !45, line: 40, column: 5)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DILocation(line: 42, column: 16, scope: !68)
!73 = !DILocation(line: 42, column: 33, scope: !68)
!74 = !DILocation(line: 42, column: 26, scope: !68)
!75 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 43, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !99, !100, !101, !105, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !23, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !42, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !42, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !42, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !42, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !42, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !42, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !42, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !42, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !42, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !42, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !42, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !23, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !23, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 152, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!104 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !24, size: 16, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 153, baseType: !104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !98, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !22, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !69, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !23, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocation(line: 43, column: 16, scope: !68)
!132 = !DILocation(line: 45, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !68, file: !45, line: 45, column: 13)
!134 = !DILocation(line: 45, column: 16, scope: !133)
!135 = !DILocation(line: 45, column: 25, scope: !133)
!136 = !DILocation(line: 45, column: 13, scope: !68)
!137 = !DILocation(line: 47, column: 21, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !45, line: 46, column: 9)
!139 = !DILocation(line: 47, column: 19, scope: !138)
!140 = !DILocation(line: 48, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !138, file: !45, line: 48, column: 17)
!142 = !DILocation(line: 48, column: 23, scope: !141)
!143 = !DILocation(line: 48, column: 17, scope: !138)
!144 = !DILocation(line: 51, column: 27, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !45, line: 51, column: 21)
!146 = distinct !DILexicalBlock(scope: !141, file: !45, line: 49, column: 13)
!147 = !DILocation(line: 51, column: 32, scope: !145)
!148 = !DILocation(line: 51, column: 31, scope: !145)
!149 = !DILocation(line: 51, column: 51, scope: !145)
!150 = !DILocation(line: 51, column: 50, scope: !145)
!151 = !DILocation(line: 51, column: 41, scope: !145)
!152 = !DILocation(line: 51, column: 61, scope: !145)
!153 = !DILocation(line: 51, column: 21, scope: !145)
!154 = !DILocation(line: 51, column: 68, scope: !145)
!155 = !DILocation(line: 51, column: 21, scope: !146)
!156 = !DILocation(line: 53, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !45, line: 52, column: 17)
!158 = !DILocation(line: 55, column: 21, scope: !157)
!159 = !DILocation(line: 55, column: 26, scope: !157)
!160 = !DILocation(line: 55, column: 35, scope: !157)
!161 = !DILocation(line: 56, column: 17, scope: !157)
!162 = !DILocation(line: 57, column: 24, scope: !146)
!163 = !DILocation(line: 57, column: 17, scope: !146)
!164 = !DILocation(line: 58, column: 13, scope: !146)
!165 = !DILocation(line: 59, column: 9, scope: !138)
!166 = !DILocation(line: 61, column: 70, scope: !55)
!167 = !DILocation(line: 61, column: 5, scope: !55)
!168 = !DILocation(line: 62, column: 1, scope: !55)
!169 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 70, type: !56, scopeLine: 71, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!170 = !DILocalVariable(name: "data", scope: !169, file: !45, line: 72, type: !42)
!171 = !DILocation(line: 72, column: 12, scope: !169)
!172 = !DILocalVariable(name: "dataBuffer", scope: !169, file: !45, line: 73, type: !61)
!173 = !DILocation(line: 73, column: 10, scope: !169)
!174 = !DILocation(line: 74, column: 12, scope: !169)
!175 = !DILocation(line: 74, column: 10, scope: !169)
!176 = !DILocation(line: 76, column: 12, scope: !169)
!177 = !DILocation(line: 76, column: 5, scope: !169)
!178 = !DILocation(line: 77, column: 74, scope: !169)
!179 = !DILocation(line: 77, column: 5, scope: !169)
!180 = !DILocation(line: 78, column: 1, scope: !169)
!181 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 82, type: !56, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!182 = !DILocalVariable(name: "data", scope: !181, file: !45, line: 84, type: !42)
!183 = !DILocation(line: 84, column: 12, scope: !181)
!184 = !DILocalVariable(name: "dataBuffer", scope: !181, file: !45, line: 85, type: !61)
!185 = !DILocation(line: 85, column: 10, scope: !181)
!186 = !DILocation(line: 86, column: 12, scope: !181)
!187 = !DILocation(line: 86, column: 10, scope: !181)
!188 = !DILocalVariable(name: "dataLen", scope: !189, file: !45, line: 89, type: !69)
!189 = distinct !DILexicalBlock(scope: !181, file: !45, line: 87, column: 5)
!190 = !DILocation(line: 89, column: 16, scope: !189)
!191 = !DILocation(line: 89, column: 33, scope: !189)
!192 = !DILocation(line: 89, column: 26, scope: !189)
!193 = !DILocalVariable(name: "pFile", scope: !189, file: !45, line: 90, type: !76)
!194 = !DILocation(line: 90, column: 16, scope: !189)
!195 = !DILocation(line: 92, column: 17, scope: !196)
!196 = distinct !DILexicalBlock(scope: !189, file: !45, line: 92, column: 13)
!197 = !DILocation(line: 92, column: 16, scope: !196)
!198 = !DILocation(line: 92, column: 25, scope: !196)
!199 = !DILocation(line: 92, column: 13, scope: !189)
!200 = !DILocation(line: 94, column: 21, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !45, line: 93, column: 9)
!202 = !DILocation(line: 94, column: 19, scope: !201)
!203 = !DILocation(line: 95, column: 17, scope: !204)
!204 = distinct !DILexicalBlock(scope: !201, file: !45, line: 95, column: 17)
!205 = !DILocation(line: 95, column: 23, scope: !204)
!206 = !DILocation(line: 95, column: 17, scope: !201)
!207 = !DILocation(line: 98, column: 27, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !45, line: 98, column: 21)
!209 = distinct !DILexicalBlock(scope: !204, file: !45, line: 96, column: 13)
!210 = !DILocation(line: 98, column: 32, scope: !208)
!211 = !DILocation(line: 98, column: 31, scope: !208)
!212 = !DILocation(line: 98, column: 51, scope: !208)
!213 = !DILocation(line: 98, column: 50, scope: !208)
!214 = !DILocation(line: 98, column: 41, scope: !208)
!215 = !DILocation(line: 98, column: 61, scope: !208)
!216 = !DILocation(line: 98, column: 21, scope: !208)
!217 = !DILocation(line: 98, column: 68, scope: !208)
!218 = !DILocation(line: 98, column: 21, scope: !209)
!219 = !DILocation(line: 100, column: 21, scope: !220)
!220 = distinct !DILexicalBlock(scope: !208, file: !45, line: 99, column: 17)
!221 = !DILocation(line: 102, column: 21, scope: !220)
!222 = !DILocation(line: 102, column: 26, scope: !220)
!223 = !DILocation(line: 102, column: 35, scope: !220)
!224 = !DILocation(line: 103, column: 17, scope: !220)
!225 = !DILocation(line: 104, column: 24, scope: !209)
!226 = !DILocation(line: 104, column: 17, scope: !209)
!227 = !DILocation(line: 105, column: 13, scope: !209)
!228 = !DILocation(line: 106, column: 9, scope: !201)
!229 = !DILocation(line: 108, column: 74, scope: !181)
!230 = !DILocation(line: 108, column: 5, scope: !181)
!231 = !DILocation(line: 109, column: 1, scope: !181)
!232 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64_good", scope: !45, file: !45, line: 111, type: !56, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!233 = !DILocation(line: 113, column: 5, scope: !232)
!234 = !DILocation(line: 114, column: 5, scope: !232)
!235 = !DILocation(line: 115, column: 1, scope: !232)
!236 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64b_badSink", scope: !49, file: !49, line: 32, type: !237, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !22}
!239 = !DILocalVariable(name: "dataVoidPtr", arg: 1, scope: !236, file: !49, line: 32, type: !22)
!240 = !DILocation(line: 32, column: 78, scope: !236)
!241 = !DILocalVariable(name: "dataPtr", scope: !236, file: !49, line: 35, type: !41)
!242 = !DILocation(line: 35, column: 14, scope: !236)
!243 = !DILocation(line: 35, column: 34, scope: !236)
!244 = !DILocation(line: 35, column: 24, scope: !236)
!245 = !DILocalVariable(name: "data", scope: !236, file: !49, line: 37, type: !42)
!246 = !DILocation(line: 37, column: 12, scope: !236)
!247 = !DILocation(line: 37, column: 21, scope: !236)
!248 = !DILocation(line: 37, column: 20, scope: !236)
!249 = !DILocation(line: 39, column: 13, scope: !236)
!250 = !DILocation(line: 39, column: 21, scope: !236)
!251 = !DILocation(line: 39, column: 5, scope: !236)
!252 = !DILocation(line: 40, column: 1, scope: !236)
!253 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64b_goodG2BSink", scope: !49, file: !49, line: 47, type: !237, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!254 = !DILocalVariable(name: "dataVoidPtr", arg: 1, scope: !253, file: !49, line: 47, type: !22)
!255 = !DILocation(line: 47, column: 82, scope: !253)
!256 = !DILocalVariable(name: "dataPtr", scope: !253, file: !49, line: 50, type: !41)
!257 = !DILocation(line: 50, column: 14, scope: !253)
!258 = !DILocation(line: 50, column: 34, scope: !253)
!259 = !DILocation(line: 50, column: 24, scope: !253)
!260 = !DILocalVariable(name: "data", scope: !253, file: !49, line: 52, type: !42)
!261 = !DILocation(line: 52, column: 12, scope: !253)
!262 = !DILocation(line: 52, column: 21, scope: !253)
!263 = !DILocation(line: 52, column: 20, scope: !253)
!264 = !DILocation(line: 54, column: 13, scope: !253)
!265 = !DILocation(line: 54, column: 21, scope: !253)
!266 = !DILocation(line: 54, column: 5, scope: !253)
!267 = !DILocation(line: 55, column: 1, scope: !253)
!268 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_64b_goodB2GSink", scope: !49, file: !49, line: 58, type: !237, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!269 = !DILocalVariable(name: "dataVoidPtr", arg: 1, scope: !268, file: !49, line: 58, type: !22)
!270 = !DILocation(line: 58, column: 82, scope: !268)
!271 = !DILocalVariable(name: "dataPtr", scope: !268, file: !49, line: 61, type: !41)
!272 = !DILocation(line: 61, column: 14, scope: !268)
!273 = !DILocation(line: 61, column: 34, scope: !268)
!274 = !DILocation(line: 61, column: 24, scope: !268)
!275 = !DILocalVariable(name: "data", scope: !268, file: !49, line: 63, type: !42)
!276 = !DILocation(line: 63, column: 12, scope: !268)
!277 = !DILocation(line: 63, column: 21, scope: !268)
!278 = !DILocation(line: 63, column: 20, scope: !268)
!279 = !DILocation(line: 65, column: 13, scope: !268)
!280 = !DILocation(line: 65, column: 29, scope: !268)
!281 = !DILocation(line: 65, column: 5, scope: !268)
!282 = !DILocation(line: 66, column: 1, scope: !268)
!283 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !284, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!284 = !DISubroutineType(types: !285)
!285 = !{null, !42}
!286 = !DILocalVariable(name: "line", arg: 1, scope: !283, file: !3, line: 11, type: !42)
!287 = !DILocation(line: 11, column: 25, scope: !283)
!288 = !DILocation(line: 13, column: 1, scope: !283)
!289 = !DILocation(line: 14, column: 8, scope: !290)
!290 = distinct !DILexicalBlock(scope: !283, file: !3, line: 14, column: 8)
!291 = !DILocation(line: 14, column: 13, scope: !290)
!292 = !DILocation(line: 14, column: 8, scope: !283)
!293 = !DILocation(line: 16, column: 24, scope: !294)
!294 = distinct !DILexicalBlock(scope: !290, file: !3, line: 15, column: 5)
!295 = !DILocation(line: 16, column: 9, scope: !294)
!296 = !DILocation(line: 17, column: 5, scope: !294)
!297 = !DILocation(line: 18, column: 5, scope: !283)
!298 = !DILocation(line: 19, column: 1, scope: !283)
!299 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !284, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!300 = !DILocalVariable(name: "line", arg: 1, scope: !299, file: !3, line: 20, type: !42)
!301 = !DILocation(line: 20, column: 29, scope: !299)
!302 = !DILocation(line: 22, column: 8, scope: !303)
!303 = distinct !DILexicalBlock(scope: !299, file: !3, line: 22, column: 8)
!304 = !DILocation(line: 22, column: 13, scope: !303)
!305 = !DILocation(line: 22, column: 8, scope: !299)
!306 = !DILocation(line: 24, column: 24, scope: !307)
!307 = distinct !DILexicalBlock(scope: !303, file: !3, line: 23, column: 5)
!308 = !DILocation(line: 24, column: 9, scope: !307)
!309 = !DILocation(line: 25, column: 5, scope: !307)
!310 = !DILocation(line: 26, column: 1, scope: !299)
!311 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !312, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314}
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !315, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !70, line: 74, baseType: !23)
!316 = !DILocalVariable(name: "line", arg: 1, scope: !311, file: !3, line: 27, type: !314)
!317 = !DILocation(line: 27, column: 29, scope: !311)
!318 = !DILocation(line: 29, column: 8, scope: !319)
!319 = distinct !DILexicalBlock(scope: !311, file: !3, line: 29, column: 8)
!320 = !DILocation(line: 29, column: 13, scope: !319)
!321 = !DILocation(line: 29, column: 8, scope: !311)
!322 = !DILocation(line: 31, column: 27, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !3, line: 30, column: 5)
!324 = !DILocation(line: 31, column: 9, scope: !323)
!325 = !DILocation(line: 32, column: 5, scope: !323)
!326 = !DILocation(line: 33, column: 1, scope: !311)
!327 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !328, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!328 = !DISubroutineType(types: !329)
!329 = !{null, !23}
!330 = !DILocalVariable(name: "intNumber", arg: 1, scope: !327, file: !3, line: 35, type: !23)
!331 = !DILocation(line: 35, column: 24, scope: !327)
!332 = !DILocation(line: 37, column: 20, scope: !327)
!333 = !DILocation(line: 37, column: 5, scope: !327)
!334 = !DILocation(line: 38, column: 1, scope: !327)
!335 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !336, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!336 = !DISubroutineType(types: !337)
!337 = !{null, !338}
!338 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!339 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !335, file: !3, line: 40, type: !338)
!340 = !DILocation(line: 40, column: 28, scope: !335)
!341 = !DILocation(line: 42, column: 21, scope: !335)
!342 = !DILocation(line: 42, column: 5, scope: !335)
!343 = !DILocation(line: 43, column: 1, scope: !335)
!344 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !345, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!348 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !344, file: !3, line: 45, type: !347)
!349 = !DILocation(line: 45, column: 28, scope: !344)
!350 = !DILocation(line: 47, column: 20, scope: !344)
!351 = !DILocation(line: 47, column: 5, scope: !344)
!352 = !DILocation(line: 48, column: 1, scope: !344)
!353 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !354, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !104}
!356 = !DILocalVariable(name: "longNumber", arg: 1, scope: !353, file: !3, line: 50, type: !104)
!357 = !DILocation(line: 50, column: 26, scope: !353)
!358 = !DILocation(line: 52, column: 21, scope: !353)
!359 = !DILocation(line: 52, column: 5, scope: !353)
!360 = !DILocation(line: 53, column: 1, scope: !353)
!361 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !362, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !364}
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !365, line: 27, baseType: !366)
!365 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !103, line: 44, baseType: !104)
!367 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !361, file: !3, line: 55, type: !364)
!368 = !DILocation(line: 55, column: 33, scope: !361)
!369 = !DILocation(line: 57, column: 29, scope: !361)
!370 = !DILocation(line: 57, column: 5, scope: !361)
!371 = !DILocation(line: 58, column: 1, scope: !361)
!372 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !373, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !69}
!375 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !372, file: !3, line: 60, type: !69)
!376 = !DILocation(line: 60, column: 29, scope: !372)
!377 = !DILocation(line: 62, column: 21, scope: !372)
!378 = !DILocation(line: 62, column: 5, scope: !372)
!379 = !DILocation(line: 63, column: 1, scope: !372)
!380 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !381, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !43}
!383 = !DILocalVariable(name: "charHex", arg: 1, scope: !380, file: !3, line: 65, type: !43)
!384 = !DILocation(line: 65, column: 29, scope: !380)
!385 = !DILocation(line: 67, column: 22, scope: !380)
!386 = !DILocation(line: 67, column: 5, scope: !380)
!387 = !DILocation(line: 68, column: 1, scope: !380)
!388 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !389, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !315}
!391 = !DILocalVariable(name: "wideChar", arg: 1, scope: !388, file: !3, line: 70, type: !315)
!392 = !DILocation(line: 70, column: 29, scope: !388)
!393 = !DILocalVariable(name: "s", scope: !388, file: !3, line: 74, type: !394)
!394 = !DICompositeType(tag: DW_TAG_array_type, baseType: !315, size: 64, elements: !395)
!395 = !{!396}
!396 = !DISubrange(count: 2)
!397 = !DILocation(line: 74, column: 13, scope: !388)
!398 = !DILocation(line: 75, column: 16, scope: !388)
!399 = !DILocation(line: 75, column: 9, scope: !388)
!400 = !DILocation(line: 75, column: 14, scope: !388)
!401 = !DILocation(line: 76, column: 9, scope: !388)
!402 = !DILocation(line: 76, column: 14, scope: !388)
!403 = !DILocation(line: 77, column: 21, scope: !388)
!404 = !DILocation(line: 77, column: 5, scope: !388)
!405 = !DILocation(line: 78, column: 1, scope: !388)
!406 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !407, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !7}
!409 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !406, file: !3, line: 80, type: !7)
!410 = !DILocation(line: 80, column: 33, scope: !406)
!411 = !DILocation(line: 82, column: 20, scope: !406)
!412 = !DILocation(line: 82, column: 5, scope: !406)
!413 = !DILocation(line: 83, column: 1, scope: !406)
!414 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !415, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !25}
!417 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !414, file: !3, line: 85, type: !25)
!418 = !DILocation(line: 85, column: 45, scope: !414)
!419 = !DILocation(line: 87, column: 22, scope: !414)
!420 = !DILocation(line: 87, column: 5, scope: !414)
!421 = !DILocation(line: 88, column: 1, scope: !414)
!422 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !423, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!426 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !422, file: !3, line: 90, type: !425)
!427 = !DILocation(line: 90, column: 29, scope: !422)
!428 = !DILocation(line: 92, column: 20, scope: !422)
!429 = !DILocation(line: 92, column: 5, scope: !422)
!430 = !DILocation(line: 93, column: 1, scope: !422)
!431 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !432, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !434}
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !435, size: 64)
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !436, line: 100, baseType: !437)
!436 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_998/source_code")
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !436, line: 96, size: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !437, file: !436, line: 98, baseType: !23, size: 32)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !437, file: !436, line: 99, baseType: !23, size: 32, offset: 32)
!441 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !431, file: !3, line: 95, type: !434)
!442 = !DILocation(line: 95, column: 40, scope: !431)
!443 = !DILocation(line: 97, column: 26, scope: !431)
!444 = !DILocation(line: 97, column: 47, scope: !431)
!445 = !DILocation(line: 97, column: 55, scope: !431)
!446 = !DILocation(line: 97, column: 76, scope: !431)
!447 = !DILocation(line: 97, column: 5, scope: !431)
!448 = !DILocation(line: 98, column: 1, scope: !431)
!449 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !450, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !452, !69}
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!453 = !DILocalVariable(name: "bytes", arg: 1, scope: !449, file: !3, line: 100, type: !452)
!454 = !DILocation(line: 100, column: 38, scope: !449)
!455 = !DILocalVariable(name: "numBytes", arg: 2, scope: !449, file: !3, line: 100, type: !69)
!456 = !DILocation(line: 100, column: 52, scope: !449)
!457 = !DILocalVariable(name: "i", scope: !449, file: !3, line: 102, type: !69)
!458 = !DILocation(line: 102, column: 12, scope: !449)
!459 = !DILocation(line: 103, column: 12, scope: !460)
!460 = distinct !DILexicalBlock(scope: !449, file: !3, line: 103, column: 5)
!461 = !DILocation(line: 103, column: 10, scope: !460)
!462 = !DILocation(line: 103, column: 17, scope: !463)
!463 = distinct !DILexicalBlock(scope: !460, file: !3, line: 103, column: 5)
!464 = !DILocation(line: 103, column: 21, scope: !463)
!465 = !DILocation(line: 103, column: 19, scope: !463)
!466 = !DILocation(line: 103, column: 5, scope: !460)
!467 = !DILocation(line: 105, column: 24, scope: !468)
!468 = distinct !DILexicalBlock(scope: !463, file: !3, line: 104, column: 5)
!469 = !DILocation(line: 105, column: 30, scope: !468)
!470 = !DILocation(line: 105, column: 9, scope: !468)
!471 = !DILocation(line: 106, column: 5, scope: !468)
!472 = !DILocation(line: 103, column: 31, scope: !463)
!473 = !DILocation(line: 103, column: 5, scope: !463)
!474 = distinct !{!474, !466, !475, !476}
!475 = !DILocation(line: 106, column: 5, scope: !460)
!476 = !{!"llvm.loop.mustprogress"}
!477 = !DILocation(line: 107, column: 5, scope: !449)
!478 = !DILocation(line: 108, column: 1, scope: !449)
!479 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !480, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!480 = !DISubroutineType(types: !481)
!481 = !{!69, !452, !69, !42}
!482 = !DILocalVariable(name: "bytes", arg: 1, scope: !479, file: !3, line: 113, type: !452)
!483 = !DILocation(line: 113, column: 39, scope: !479)
!484 = !DILocalVariable(name: "numBytes", arg: 2, scope: !479, file: !3, line: 113, type: !69)
!485 = !DILocation(line: 113, column: 53, scope: !479)
!486 = !DILocalVariable(name: "hex", arg: 3, scope: !479, file: !3, line: 113, type: !42)
!487 = !DILocation(line: 113, column: 71, scope: !479)
!488 = !DILocalVariable(name: "numWritten", scope: !479, file: !3, line: 115, type: !69)
!489 = !DILocation(line: 115, column: 12, scope: !479)
!490 = !DILocation(line: 121, column: 5, scope: !479)
!491 = !DILocation(line: 121, column: 12, scope: !479)
!492 = !DILocation(line: 121, column: 25, scope: !479)
!493 = !DILocation(line: 121, column: 23, scope: !479)
!494 = !DILocation(line: 121, column: 34, scope: !479)
!495 = !DILocation(line: 121, column: 37, scope: !479)
!496 = !DILocation(line: 121, column: 67, scope: !479)
!497 = !DILocation(line: 121, column: 70, scope: !479)
!498 = !DILocation(line: 0, scope: !479)
!499 = !DILocalVariable(name: "byte", scope: !500, file: !3, line: 123, type: !23)
!500 = distinct !DILexicalBlock(scope: !479, file: !3, line: 122, column: 5)
