; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3.6 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_995/source_code")
!46 = !{}
!47 = distinct !DICompileUnit(language: DW_LANG_C99, file: !48, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !49, splitDebugInlining: false, nameTableKind: None)
!48 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_995/source_code")
!49 = !{!22, !23}
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61_bad", scope: !45, file: !45, line: 35, type: !55, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 37, type: !42)
!58 = !DILocation(line: 37, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 38, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 100)
!63 = !DILocation(line: 38, column: 10, scope: !54)
!64 = !DILocation(line: 39, column: 12, scope: !54)
!65 = !DILocation(line: 39, column: 10, scope: !54)
!66 = !DILocation(line: 40, column: 79, scope: !54)
!67 = !DILocation(line: 40, column: 12, scope: !54)
!68 = !DILocation(line: 40, column: 10, scope: !54)
!69 = !DILocation(line: 42, column: 13, scope: !54)
!70 = !DILocation(line: 42, column: 21, scope: !54)
!71 = !DILocation(line: 42, column: 5, scope: !54)
!72 = !DILocation(line: 43, column: 1, scope: !54)
!73 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 51, type: !55, scopeLine: 52, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!74 = !DILocalVariable(name: "data", scope: !73, file: !45, line: 53, type: !42)
!75 = !DILocation(line: 53, column: 12, scope: !73)
!76 = !DILocalVariable(name: "dataBuffer", scope: !73, file: !45, line: 54, type: !60)
!77 = !DILocation(line: 54, column: 10, scope: !73)
!78 = !DILocation(line: 55, column: 12, scope: !73)
!79 = !DILocation(line: 55, column: 10, scope: !73)
!80 = !DILocation(line: 56, column: 83, scope: !73)
!81 = !DILocation(line: 56, column: 12, scope: !73)
!82 = !DILocation(line: 56, column: 10, scope: !73)
!83 = !DILocation(line: 58, column: 13, scope: !73)
!84 = !DILocation(line: 58, column: 21, scope: !73)
!85 = !DILocation(line: 58, column: 5, scope: !73)
!86 = !DILocation(line: 59, column: 1, scope: !73)
!87 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 63, type: !55, scopeLine: 64, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!88 = !DILocalVariable(name: "data", scope: !87, file: !45, line: 65, type: !42)
!89 = !DILocation(line: 65, column: 12, scope: !87)
!90 = !DILocalVariable(name: "dataBuffer", scope: !87, file: !45, line: 66, type: !60)
!91 = !DILocation(line: 66, column: 10, scope: !87)
!92 = !DILocation(line: 67, column: 12, scope: !87)
!93 = !DILocation(line: 67, column: 10, scope: !87)
!94 = !DILocation(line: 68, column: 83, scope: !87)
!95 = !DILocation(line: 68, column: 12, scope: !87)
!96 = !DILocation(line: 68, column: 10, scope: !87)
!97 = !DILocation(line: 70, column: 13, scope: !87)
!98 = !DILocation(line: 70, column: 29, scope: !87)
!99 = !DILocation(line: 70, column: 5, scope: !87)
!100 = !DILocation(line: 71, column: 1, scope: !87)
!101 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61_good", scope: !45, file: !45, line: 73, type: !55, scopeLine: 74, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!102 = !DILocation(line: 75, column: 5, scope: !101)
!103 = !DILocation(line: 76, column: 5, scope: !101)
!104 = !DILocation(line: 77, column: 1, scope: !101)
!105 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61b_badSource", scope: !48, file: !48, line: 32, type: !106, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !46)
!106 = !DISubroutineType(types: !107)
!107 = !{!42, !42}
!108 = !DILocalVariable(name: "data", arg: 1, scope: !105, file: !48, line: 32, type: !42)
!109 = !DILocation(line: 32, column: 82, scope: !105)
!110 = !DILocalVariable(name: "dataLen", scope: !111, file: !48, line: 36, type: !112)
!111 = distinct !DILexicalBlock(scope: !105, file: !48, line: 34, column: 5)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !113, line: 46, baseType: !114)
!113 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!114 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!115 = !DILocation(line: 36, column: 16, scope: !111)
!116 = !DILocation(line: 36, column: 33, scope: !111)
!117 = !DILocation(line: 36, column: 26, scope: !111)
!118 = !DILocalVariable(name: "pFile", scope: !111, file: !48, line: 37, type: !119)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !121, line: 7, baseType: !122)
!121 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!122 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !123, line: 49, size: 1728, elements: !124)
!123 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !140, !142, !143, !144, !148, !149, !151, !155, !158, !160, !163, !166, !167, !168, !169, !170}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !122, file: !123, line: 51, baseType: !23, size: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !122, file: !123, line: 54, baseType: !42, size: 64, offset: 64)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !122, file: !123, line: 55, baseType: !42, size: 64, offset: 128)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !122, file: !123, line: 56, baseType: !42, size: 64, offset: 192)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !122, file: !123, line: 57, baseType: !42, size: 64, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !122, file: !123, line: 58, baseType: !42, size: 64, offset: 320)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !122, file: !123, line: 59, baseType: !42, size: 64, offset: 384)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !122, file: !123, line: 60, baseType: !42, size: 64, offset: 448)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !122, file: !123, line: 61, baseType: !42, size: 64, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !122, file: !123, line: 64, baseType: !42, size: 64, offset: 576)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !122, file: !123, line: 65, baseType: !42, size: 64, offset: 640)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !122, file: !123, line: 66, baseType: !42, size: 64, offset: 704)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !122, file: !123, line: 68, baseType: !138, size: 64, offset: 768)
!138 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !139, size: 64)
!139 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !123, line: 36, flags: DIFlagFwdDecl)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !122, file: !123, line: 70, baseType: !141, size: 64, offset: 832)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !122, file: !123, line: 72, baseType: !23, size: 32, offset: 896)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !122, file: !123, line: 73, baseType: !23, size: 32, offset: 928)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !122, file: !123, line: 74, baseType: !145, size: 64, offset: 960)
!145 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !146, line: 152, baseType: !147)
!146 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!147 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !122, file: !123, line: 77, baseType: !24, size: 16, offset: 1024)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !122, file: !123, line: 78, baseType: !150, size: 8, offset: 1040)
!150 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !122, file: !123, line: 79, baseType: !152, size: 8, offset: 1048)
!152 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !153)
!153 = !{!154}
!154 = !DISubrange(count: 1)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !122, file: !123, line: 81, baseType: !156, size: 64, offset: 1088)
!156 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !157, size: 64)
!157 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !123, line: 43, baseType: null)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !122, file: !123, line: 89, baseType: !159, size: 64, offset: 1152)
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !146, line: 153, baseType: !147)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !122, file: !123, line: 91, baseType: !161, size: 64, offset: 1216)
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !123, line: 37, flags: DIFlagFwdDecl)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !122, file: !123, line: 92, baseType: !164, size: 64, offset: 1280)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !123, line: 38, flags: DIFlagFwdDecl)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !122, file: !123, line: 93, baseType: !141, size: 64, offset: 1344)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !122, file: !123, line: 94, baseType: !22, size: 64, offset: 1408)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !122, file: !123, line: 95, baseType: !112, size: 64, offset: 1472)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !122, file: !123, line: 96, baseType: !23, size: 32, offset: 1536)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !122, file: !123, line: 98, baseType: !171, size: 160, offset: 1568)
!171 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !172)
!172 = !{!173}
!173 = !DISubrange(count: 20)
!174 = !DILocation(line: 37, column: 16, scope: !111)
!175 = !DILocation(line: 39, column: 17, scope: !176)
!176 = distinct !DILexicalBlock(scope: !111, file: !48, line: 39, column: 13)
!177 = !DILocation(line: 39, column: 16, scope: !176)
!178 = !DILocation(line: 39, column: 25, scope: !176)
!179 = !DILocation(line: 39, column: 13, scope: !111)
!180 = !DILocation(line: 41, column: 21, scope: !181)
!181 = distinct !DILexicalBlock(scope: !176, file: !48, line: 40, column: 9)
!182 = !DILocation(line: 41, column: 19, scope: !181)
!183 = !DILocation(line: 42, column: 17, scope: !184)
!184 = distinct !DILexicalBlock(scope: !181, file: !48, line: 42, column: 17)
!185 = !DILocation(line: 42, column: 23, scope: !184)
!186 = !DILocation(line: 42, column: 17, scope: !181)
!187 = !DILocation(line: 45, column: 27, scope: !188)
!188 = distinct !DILexicalBlock(scope: !189, file: !48, line: 45, column: 21)
!189 = distinct !DILexicalBlock(scope: !184, file: !48, line: 43, column: 13)
!190 = !DILocation(line: 45, column: 32, scope: !188)
!191 = !DILocation(line: 45, column: 31, scope: !188)
!192 = !DILocation(line: 45, column: 51, scope: !188)
!193 = !DILocation(line: 45, column: 50, scope: !188)
!194 = !DILocation(line: 45, column: 41, scope: !188)
!195 = !DILocation(line: 45, column: 61, scope: !188)
!196 = !DILocation(line: 45, column: 21, scope: !188)
!197 = !DILocation(line: 45, column: 68, scope: !188)
!198 = !DILocation(line: 45, column: 21, scope: !189)
!199 = !DILocation(line: 47, column: 21, scope: !200)
!200 = distinct !DILexicalBlock(scope: !188, file: !48, line: 46, column: 17)
!201 = !DILocation(line: 49, column: 21, scope: !200)
!202 = !DILocation(line: 49, column: 26, scope: !200)
!203 = !DILocation(line: 49, column: 35, scope: !200)
!204 = !DILocation(line: 50, column: 17, scope: !200)
!205 = !DILocation(line: 51, column: 24, scope: !189)
!206 = !DILocation(line: 51, column: 17, scope: !189)
!207 = !DILocation(line: 52, column: 13, scope: !189)
!208 = !DILocation(line: 53, column: 9, scope: !181)
!209 = !DILocation(line: 55, column: 12, scope: !105)
!210 = !DILocation(line: 55, column: 5, scope: !105)
!211 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61b_goodG2BSource", scope: !48, file: !48, line: 63, type: !106, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !46)
!212 = !DILocalVariable(name: "data", arg: 1, scope: !211, file: !48, line: 63, type: !42)
!213 = !DILocation(line: 63, column: 86, scope: !211)
!214 = !DILocation(line: 66, column: 12, scope: !211)
!215 = !DILocation(line: 66, column: 5, scope: !211)
!216 = !DILocation(line: 67, column: 12, scope: !211)
!217 = !DILocation(line: 67, column: 5, scope: !211)
!218 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_61b_goodB2GSource", scope: !48, file: !48, line: 71, type: !106, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !46)
!219 = !DILocalVariable(name: "data", arg: 1, scope: !218, file: !48, line: 71, type: !42)
!220 = !DILocation(line: 71, column: 86, scope: !218)
!221 = !DILocalVariable(name: "dataLen", scope: !222, file: !48, line: 75, type: !112)
!222 = distinct !DILexicalBlock(scope: !218, file: !48, line: 73, column: 5)
!223 = !DILocation(line: 75, column: 16, scope: !222)
!224 = !DILocation(line: 75, column: 33, scope: !222)
!225 = !DILocation(line: 75, column: 26, scope: !222)
!226 = !DILocalVariable(name: "pFile", scope: !222, file: !48, line: 76, type: !119)
!227 = !DILocation(line: 76, column: 16, scope: !222)
!228 = !DILocation(line: 78, column: 17, scope: !229)
!229 = distinct !DILexicalBlock(scope: !222, file: !48, line: 78, column: 13)
!230 = !DILocation(line: 78, column: 16, scope: !229)
!231 = !DILocation(line: 78, column: 25, scope: !229)
!232 = !DILocation(line: 78, column: 13, scope: !222)
!233 = !DILocation(line: 80, column: 21, scope: !234)
!234 = distinct !DILexicalBlock(scope: !229, file: !48, line: 79, column: 9)
!235 = !DILocation(line: 80, column: 19, scope: !234)
!236 = !DILocation(line: 81, column: 17, scope: !237)
!237 = distinct !DILexicalBlock(scope: !234, file: !48, line: 81, column: 17)
!238 = !DILocation(line: 81, column: 23, scope: !237)
!239 = !DILocation(line: 81, column: 17, scope: !234)
!240 = !DILocation(line: 84, column: 27, scope: !241)
!241 = distinct !DILexicalBlock(scope: !242, file: !48, line: 84, column: 21)
!242 = distinct !DILexicalBlock(scope: !237, file: !48, line: 82, column: 13)
!243 = !DILocation(line: 84, column: 32, scope: !241)
!244 = !DILocation(line: 84, column: 31, scope: !241)
!245 = !DILocation(line: 84, column: 51, scope: !241)
!246 = !DILocation(line: 84, column: 50, scope: !241)
!247 = !DILocation(line: 84, column: 41, scope: !241)
!248 = !DILocation(line: 84, column: 61, scope: !241)
!249 = !DILocation(line: 84, column: 21, scope: !241)
!250 = !DILocation(line: 84, column: 68, scope: !241)
!251 = !DILocation(line: 84, column: 21, scope: !242)
!252 = !DILocation(line: 86, column: 21, scope: !253)
!253 = distinct !DILexicalBlock(scope: !241, file: !48, line: 85, column: 17)
!254 = !DILocation(line: 88, column: 21, scope: !253)
!255 = !DILocation(line: 88, column: 26, scope: !253)
!256 = !DILocation(line: 88, column: 35, scope: !253)
!257 = !DILocation(line: 89, column: 17, scope: !253)
!258 = !DILocation(line: 90, column: 24, scope: !242)
!259 = !DILocation(line: 90, column: 17, scope: !242)
!260 = !DILocation(line: 91, column: 13, scope: !242)
!261 = !DILocation(line: 92, column: 9, scope: !234)
!262 = !DILocation(line: 94, column: 12, scope: !218)
!263 = !DILocation(line: 94, column: 5, scope: !218)
!264 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !265, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!265 = !DISubroutineType(types: !266)
!266 = !{null, !42}
!267 = !DILocalVariable(name: "line", arg: 1, scope: !264, file: !3, line: 11, type: !42)
!268 = !DILocation(line: 11, column: 25, scope: !264)
!269 = !DILocation(line: 13, column: 1, scope: !264)
!270 = !DILocation(line: 14, column: 8, scope: !271)
!271 = distinct !DILexicalBlock(scope: !264, file: !3, line: 14, column: 8)
!272 = !DILocation(line: 14, column: 13, scope: !271)
!273 = !DILocation(line: 14, column: 8, scope: !264)
!274 = !DILocation(line: 16, column: 24, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !3, line: 15, column: 5)
!276 = !DILocation(line: 16, column: 9, scope: !275)
!277 = !DILocation(line: 17, column: 5, scope: !275)
!278 = !DILocation(line: 18, column: 5, scope: !264)
!279 = !DILocation(line: 19, column: 1, scope: !264)
!280 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !265, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!281 = !DILocalVariable(name: "line", arg: 1, scope: !280, file: !3, line: 20, type: !42)
!282 = !DILocation(line: 20, column: 29, scope: !280)
!283 = !DILocation(line: 22, column: 8, scope: !284)
!284 = distinct !DILexicalBlock(scope: !280, file: !3, line: 22, column: 8)
!285 = !DILocation(line: 22, column: 13, scope: !284)
!286 = !DILocation(line: 22, column: 8, scope: !280)
!287 = !DILocation(line: 24, column: 24, scope: !288)
!288 = distinct !DILexicalBlock(scope: !284, file: !3, line: 23, column: 5)
!289 = !DILocation(line: 24, column: 9, scope: !288)
!290 = !DILocation(line: 25, column: 5, scope: !288)
!291 = !DILocation(line: 26, column: 1, scope: !280)
!292 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !293, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!293 = !DISubroutineType(types: !294)
!294 = !{null, !295}
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64)
!296 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !113, line: 74, baseType: !23)
!297 = !DILocalVariable(name: "line", arg: 1, scope: !292, file: !3, line: 27, type: !295)
!298 = !DILocation(line: 27, column: 29, scope: !292)
!299 = !DILocation(line: 29, column: 8, scope: !300)
!300 = distinct !DILexicalBlock(scope: !292, file: !3, line: 29, column: 8)
!301 = !DILocation(line: 29, column: 13, scope: !300)
!302 = !DILocation(line: 29, column: 8, scope: !292)
!303 = !DILocation(line: 31, column: 27, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !3, line: 30, column: 5)
!305 = !DILocation(line: 31, column: 9, scope: !304)
!306 = !DILocation(line: 32, column: 5, scope: !304)
!307 = !DILocation(line: 33, column: 1, scope: !292)
!308 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !309, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !23}
!311 = !DILocalVariable(name: "intNumber", arg: 1, scope: !308, file: !3, line: 35, type: !23)
!312 = !DILocation(line: 35, column: 24, scope: !308)
!313 = !DILocation(line: 37, column: 20, scope: !308)
!314 = !DILocation(line: 37, column: 5, scope: !308)
!315 = !DILocation(line: 38, column: 1, scope: !308)
!316 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !317, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !319}
!319 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!320 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !316, file: !3, line: 40, type: !319)
!321 = !DILocation(line: 40, column: 28, scope: !316)
!322 = !DILocation(line: 42, column: 21, scope: !316)
!323 = !DILocation(line: 42, column: 5, scope: !316)
!324 = !DILocation(line: 43, column: 1, scope: !316)
!325 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !326, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!326 = !DISubroutineType(types: !327)
!327 = !{null, !328}
!328 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!329 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !325, file: !3, line: 45, type: !328)
!330 = !DILocation(line: 45, column: 28, scope: !325)
!331 = !DILocation(line: 47, column: 20, scope: !325)
!332 = !DILocation(line: 47, column: 5, scope: !325)
!333 = !DILocation(line: 48, column: 1, scope: !325)
!334 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !335, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !147}
!337 = !DILocalVariable(name: "longNumber", arg: 1, scope: !334, file: !3, line: 50, type: !147)
!338 = !DILocation(line: 50, column: 26, scope: !334)
!339 = !DILocation(line: 52, column: 21, scope: !334)
!340 = !DILocation(line: 52, column: 5, scope: !334)
!341 = !DILocation(line: 53, column: 1, scope: !334)
!342 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !343, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !345}
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !346, line: 27, baseType: !347)
!346 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!347 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !146, line: 44, baseType: !147)
!348 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !342, file: !3, line: 55, type: !345)
!349 = !DILocation(line: 55, column: 33, scope: !342)
!350 = !DILocation(line: 57, column: 29, scope: !342)
!351 = !DILocation(line: 57, column: 5, scope: !342)
!352 = !DILocation(line: 58, column: 1, scope: !342)
!353 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !354, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !112}
!356 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !353, file: !3, line: 60, type: !112)
!357 = !DILocation(line: 60, column: 29, scope: !353)
!358 = !DILocation(line: 62, column: 21, scope: !353)
!359 = !DILocation(line: 62, column: 5, scope: !353)
!360 = !DILocation(line: 63, column: 1, scope: !353)
!361 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !362, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !43}
!364 = !DILocalVariable(name: "charHex", arg: 1, scope: !361, file: !3, line: 65, type: !43)
!365 = !DILocation(line: 65, column: 29, scope: !361)
!366 = !DILocation(line: 67, column: 22, scope: !361)
!367 = !DILocation(line: 67, column: 5, scope: !361)
!368 = !DILocation(line: 68, column: 1, scope: !361)
!369 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !370, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!370 = !DISubroutineType(types: !371)
!371 = !{null, !296}
!372 = !DILocalVariable(name: "wideChar", arg: 1, scope: !369, file: !3, line: 70, type: !296)
!373 = !DILocation(line: 70, column: 29, scope: !369)
!374 = !DILocalVariable(name: "s", scope: !369, file: !3, line: 74, type: !375)
!375 = !DICompositeType(tag: DW_TAG_array_type, baseType: !296, size: 64, elements: !376)
!376 = !{!377}
!377 = !DISubrange(count: 2)
!378 = !DILocation(line: 74, column: 13, scope: !369)
!379 = !DILocation(line: 75, column: 16, scope: !369)
!380 = !DILocation(line: 75, column: 9, scope: !369)
!381 = !DILocation(line: 75, column: 14, scope: !369)
!382 = !DILocation(line: 76, column: 9, scope: !369)
!383 = !DILocation(line: 76, column: 14, scope: !369)
!384 = !DILocation(line: 77, column: 21, scope: !369)
!385 = !DILocation(line: 77, column: 5, scope: !369)
!386 = !DILocation(line: 78, column: 1, scope: !369)
!387 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !388, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !7}
!390 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !387, file: !3, line: 80, type: !7)
!391 = !DILocation(line: 80, column: 33, scope: !387)
!392 = !DILocation(line: 82, column: 20, scope: !387)
!393 = !DILocation(line: 82, column: 5, scope: !387)
!394 = !DILocation(line: 83, column: 1, scope: !387)
!395 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !396, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !25}
!398 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !395, file: !3, line: 85, type: !25)
!399 = !DILocation(line: 85, column: 45, scope: !395)
!400 = !DILocation(line: 87, column: 22, scope: !395)
!401 = !DILocation(line: 87, column: 5, scope: !395)
!402 = !DILocation(line: 88, column: 1, scope: !395)
!403 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !404, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !406}
!406 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!407 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !403, file: !3, line: 90, type: !406)
!408 = !DILocation(line: 90, column: 29, scope: !403)
!409 = !DILocation(line: 92, column: 20, scope: !403)
!410 = !DILocation(line: 92, column: 5, scope: !403)
!411 = !DILocation(line: 93, column: 1, scope: !403)
!412 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !413, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !417, line: 100, baseType: !418)
!417 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_995/source_code")
!418 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !417, line: 96, size: 64, elements: !419)
!419 = !{!420, !421}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !418, file: !417, line: 98, baseType: !23, size: 32)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !418, file: !417, line: 99, baseType: !23, size: 32, offset: 32)
!422 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !412, file: !3, line: 95, type: !415)
!423 = !DILocation(line: 95, column: 40, scope: !412)
!424 = !DILocation(line: 97, column: 26, scope: !412)
!425 = !DILocation(line: 97, column: 47, scope: !412)
!426 = !DILocation(line: 97, column: 55, scope: !412)
!427 = !DILocation(line: 97, column: 76, scope: !412)
!428 = !DILocation(line: 97, column: 5, scope: !412)
!429 = !DILocation(line: 98, column: 1, scope: !412)
!430 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !431, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !433, !112}
!433 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!434 = !DILocalVariable(name: "bytes", arg: 1, scope: !430, file: !3, line: 100, type: !433)
!435 = !DILocation(line: 100, column: 38, scope: !430)
!436 = !DILocalVariable(name: "numBytes", arg: 2, scope: !430, file: !3, line: 100, type: !112)
!437 = !DILocation(line: 100, column: 52, scope: !430)
!438 = !DILocalVariable(name: "i", scope: !430, file: !3, line: 102, type: !112)
!439 = !DILocation(line: 102, column: 12, scope: !430)
!440 = !DILocation(line: 103, column: 12, scope: !441)
!441 = distinct !DILexicalBlock(scope: !430, file: !3, line: 103, column: 5)
!442 = !DILocation(line: 103, column: 10, scope: !441)
!443 = !DILocation(line: 103, column: 17, scope: !444)
!444 = distinct !DILexicalBlock(scope: !441, file: !3, line: 103, column: 5)
!445 = !DILocation(line: 103, column: 21, scope: !444)
!446 = !DILocation(line: 103, column: 19, scope: !444)
!447 = !DILocation(line: 103, column: 5, scope: !441)
!448 = !DILocation(line: 105, column: 24, scope: !449)
!449 = distinct !DILexicalBlock(scope: !444, file: !3, line: 104, column: 5)
!450 = !DILocation(line: 105, column: 30, scope: !449)
!451 = !DILocation(line: 105, column: 9, scope: !449)
!452 = !DILocation(line: 106, column: 5, scope: !449)
!453 = !DILocation(line: 103, column: 31, scope: !444)
!454 = !DILocation(line: 103, column: 5, scope: !444)
!455 = distinct !{!455, !447, !456, !457}
!456 = !DILocation(line: 106, column: 5, scope: !441)
!457 = !{!"llvm.loop.mustprogress"}
!458 = !DILocation(line: 107, column: 5, scope: !430)
!459 = !DILocation(line: 108, column: 1, scope: !430)
!460 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !461, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!461 = !DISubroutineType(types: !462)
!462 = !{!112, !433, !112, !42}
!463 = !DILocalVariable(name: "bytes", arg: 1, scope: !460, file: !3, line: 113, type: !433)
!464 = !DILocation(line: 113, column: 39, scope: !460)
!465 = !DILocalVariable(name: "numBytes", arg: 2, scope: !460, file: !3, line: 113, type: !112)
!466 = !DILocation(line: 113, column: 53, scope: !460)
!467 = !DILocalVariable(name: "hex", arg: 3, scope: !460, file: !3, line: 113, type: !42)
!468 = !DILocation(line: 113, column: 71, scope: !460)
!469 = !DILocalVariable(name: "numWritten", scope: !460, file: !3, line: 115, type: !112)
!470 = !DILocation(line: 115, column: 12, scope: !460)
!471 = !DILocation(line: 121, column: 5, scope: !460)
!472 = !DILocation(line: 121, column: 12, scope: !460)
!473 = !DILocation(line: 121, column: 25, scope: !460)
!474 = !DILocation(line: 121, column: 23, scope: !460)
!475 = !DILocation(line: 121, column: 34, scope: !460)
!476 = !DILocation(line: 121, column: 37, scope: !460)
!477 = !DILocation(line: 121, column: 67, scope: !460)
!478 = !DILocation(line: 121, column: 70, scope: !460)
!479 = !DILocation(line: 0, scope: !460)
!480 = !DILocalVariable(name: "byte", scope: !481, file: !3, line: 123, type: !23)
!481 = distinct !DILexicalBlock(scope: !460, file: !3, line: 122, column: 5)
