; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_997/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_997/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63_bad", scope: !45, file: !45, line: 35, type: !55, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 37, type: !42)
!58 = !DILocation(line: 37, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 38, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 100)
!63 = !DILocation(line: 38, column: 10, scope: !54)
!64 = !DILocation(line: 39, column: 12, scope: !54)
!65 = !DILocation(line: 39, column: 10, scope: !54)
!66 = !DILocalVariable(name: "dataLen", scope: !67, file: !45, line: 42, type: !68)
!67 = distinct !DILexicalBlock(scope: !54, file: !45, line: 40, column: 5)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 42, column: 16, scope: !67)
!72 = !DILocation(line: 42, column: 33, scope: !67)
!73 = !DILocation(line: 42, column: 26, scope: !67)
!74 = !DILocalVariable(name: "pFile", scope: !67, file: !45, line: 43, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !23, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !42, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !42, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !42, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !42, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !42, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !42, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !42, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !42, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !42, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !42, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !23, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !23, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !24, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !22, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !23, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 43, column: 16, scope: !67)
!131 = !DILocation(line: 45, column: 17, scope: !132)
!132 = distinct !DILexicalBlock(scope: !67, file: !45, line: 45, column: 13)
!133 = !DILocation(line: 45, column: 16, scope: !132)
!134 = !DILocation(line: 45, column: 25, scope: !132)
!135 = !DILocation(line: 45, column: 13, scope: !67)
!136 = !DILocation(line: 47, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !45, line: 46, column: 9)
!138 = !DILocation(line: 47, column: 19, scope: !137)
!139 = !DILocation(line: 48, column: 17, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !45, line: 48, column: 17)
!141 = !DILocation(line: 48, column: 23, scope: !140)
!142 = !DILocation(line: 48, column: 17, scope: !137)
!143 = !DILocation(line: 51, column: 27, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !45, line: 51, column: 21)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 49, column: 13)
!146 = !DILocation(line: 51, column: 32, scope: !144)
!147 = !DILocation(line: 51, column: 31, scope: !144)
!148 = !DILocation(line: 51, column: 51, scope: !144)
!149 = !DILocation(line: 51, column: 50, scope: !144)
!150 = !DILocation(line: 51, column: 41, scope: !144)
!151 = !DILocation(line: 51, column: 61, scope: !144)
!152 = !DILocation(line: 51, column: 21, scope: !144)
!153 = !DILocation(line: 51, column: 68, scope: !144)
!154 = !DILocation(line: 51, column: 21, scope: !145)
!155 = !DILocation(line: 53, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !45, line: 52, column: 17)
!157 = !DILocation(line: 55, column: 21, scope: !156)
!158 = !DILocation(line: 55, column: 26, scope: !156)
!159 = !DILocation(line: 55, column: 35, scope: !156)
!160 = !DILocation(line: 56, column: 17, scope: !156)
!161 = !DILocation(line: 57, column: 24, scope: !145)
!162 = !DILocation(line: 57, column: 17, scope: !145)
!163 = !DILocation(line: 58, column: 13, scope: !145)
!164 = !DILocation(line: 59, column: 9, scope: !137)
!165 = !DILocation(line: 61, column: 5, scope: !54)
!166 = !DILocation(line: 62, column: 1, scope: !54)
!167 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 70, type: !55, scopeLine: 71, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!168 = !DILocalVariable(name: "data", scope: !167, file: !45, line: 72, type: !42)
!169 = !DILocation(line: 72, column: 12, scope: !167)
!170 = !DILocalVariable(name: "dataBuffer", scope: !167, file: !45, line: 73, type: !60)
!171 = !DILocation(line: 73, column: 10, scope: !167)
!172 = !DILocation(line: 74, column: 12, scope: !167)
!173 = !DILocation(line: 74, column: 10, scope: !167)
!174 = !DILocation(line: 76, column: 12, scope: !167)
!175 = !DILocation(line: 76, column: 5, scope: !167)
!176 = !DILocation(line: 77, column: 5, scope: !167)
!177 = !DILocation(line: 78, column: 1, scope: !167)
!178 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 82, type: !55, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!179 = !DILocalVariable(name: "data", scope: !178, file: !45, line: 84, type: !42)
!180 = !DILocation(line: 84, column: 12, scope: !178)
!181 = !DILocalVariable(name: "dataBuffer", scope: !178, file: !45, line: 85, type: !60)
!182 = !DILocation(line: 85, column: 10, scope: !178)
!183 = !DILocation(line: 86, column: 12, scope: !178)
!184 = !DILocation(line: 86, column: 10, scope: !178)
!185 = !DILocalVariable(name: "dataLen", scope: !186, file: !45, line: 89, type: !68)
!186 = distinct !DILexicalBlock(scope: !178, file: !45, line: 87, column: 5)
!187 = !DILocation(line: 89, column: 16, scope: !186)
!188 = !DILocation(line: 89, column: 33, scope: !186)
!189 = !DILocation(line: 89, column: 26, scope: !186)
!190 = !DILocalVariable(name: "pFile", scope: !186, file: !45, line: 90, type: !75)
!191 = !DILocation(line: 90, column: 16, scope: !186)
!192 = !DILocation(line: 92, column: 17, scope: !193)
!193 = distinct !DILexicalBlock(scope: !186, file: !45, line: 92, column: 13)
!194 = !DILocation(line: 92, column: 16, scope: !193)
!195 = !DILocation(line: 92, column: 25, scope: !193)
!196 = !DILocation(line: 92, column: 13, scope: !186)
!197 = !DILocation(line: 94, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !45, line: 93, column: 9)
!199 = !DILocation(line: 94, column: 19, scope: !198)
!200 = !DILocation(line: 95, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !45, line: 95, column: 17)
!202 = !DILocation(line: 95, column: 23, scope: !201)
!203 = !DILocation(line: 95, column: 17, scope: !198)
!204 = !DILocation(line: 98, column: 27, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !45, line: 98, column: 21)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 96, column: 13)
!207 = !DILocation(line: 98, column: 32, scope: !205)
!208 = !DILocation(line: 98, column: 31, scope: !205)
!209 = !DILocation(line: 98, column: 51, scope: !205)
!210 = !DILocation(line: 98, column: 50, scope: !205)
!211 = !DILocation(line: 98, column: 41, scope: !205)
!212 = !DILocation(line: 98, column: 61, scope: !205)
!213 = !DILocation(line: 98, column: 21, scope: !205)
!214 = !DILocation(line: 98, column: 68, scope: !205)
!215 = !DILocation(line: 98, column: 21, scope: !206)
!216 = !DILocation(line: 100, column: 21, scope: !217)
!217 = distinct !DILexicalBlock(scope: !205, file: !45, line: 99, column: 17)
!218 = !DILocation(line: 102, column: 21, scope: !217)
!219 = !DILocation(line: 102, column: 26, scope: !217)
!220 = !DILocation(line: 102, column: 35, scope: !217)
!221 = !DILocation(line: 103, column: 17, scope: !217)
!222 = !DILocation(line: 104, column: 24, scope: !206)
!223 = !DILocation(line: 104, column: 17, scope: !206)
!224 = !DILocation(line: 105, column: 13, scope: !206)
!225 = !DILocation(line: 106, column: 9, scope: !198)
!226 = !DILocation(line: 108, column: 5, scope: !178)
!227 = !DILocation(line: 109, column: 1, scope: !178)
!228 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63_good", scope: !45, file: !45, line: 111, type: !55, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!229 = !DILocation(line: 113, column: 5, scope: !228)
!230 = !DILocation(line: 114, column: 5, scope: !228)
!231 = !DILocation(line: 115, column: 1, scope: !228)
!232 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63b_badSink", scope: !49, file: !49, line: 32, type: !233, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !41}
!235 = !DILocalVariable(name: "dataPtr", arg: 1, scope: !232, file: !49, line: 32, type: !41)
!236 = !DILocation(line: 32, column: 80, scope: !232)
!237 = !DILocalVariable(name: "data", scope: !232, file: !49, line: 34, type: !42)
!238 = !DILocation(line: 34, column: 12, scope: !232)
!239 = !DILocation(line: 34, column: 20, scope: !232)
!240 = !DILocation(line: 34, column: 19, scope: !232)
!241 = !DILocation(line: 36, column: 13, scope: !232)
!242 = !DILocation(line: 36, column: 21, scope: !232)
!243 = !DILocation(line: 36, column: 5, scope: !232)
!244 = !DILocation(line: 37, column: 1, scope: !232)
!245 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63b_goodG2BSink", scope: !49, file: !49, line: 44, type: !233, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!246 = !DILocalVariable(name: "dataPtr", arg: 1, scope: !245, file: !49, line: 44, type: !41)
!247 = !DILocation(line: 44, column: 84, scope: !245)
!248 = !DILocalVariable(name: "data", scope: !245, file: !49, line: 46, type: !42)
!249 = !DILocation(line: 46, column: 12, scope: !245)
!250 = !DILocation(line: 46, column: 20, scope: !245)
!251 = !DILocation(line: 46, column: 19, scope: !245)
!252 = !DILocation(line: 48, column: 13, scope: !245)
!253 = !DILocation(line: 48, column: 21, scope: !245)
!254 = !DILocation(line: 48, column: 5, scope: !245)
!255 = !DILocation(line: 49, column: 1, scope: !245)
!256 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_63b_goodB2GSink", scope: !49, file: !49, line: 52, type: !233, scopeLine: 53, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!257 = !DILocalVariable(name: "dataPtr", arg: 1, scope: !256, file: !49, line: 52, type: !41)
!258 = !DILocation(line: 52, column: 84, scope: !256)
!259 = !DILocalVariable(name: "data", scope: !256, file: !49, line: 54, type: !42)
!260 = !DILocation(line: 54, column: 12, scope: !256)
!261 = !DILocation(line: 54, column: 20, scope: !256)
!262 = !DILocation(line: 54, column: 19, scope: !256)
!263 = !DILocation(line: 56, column: 13, scope: !256)
!264 = !DILocation(line: 56, column: 29, scope: !256)
!265 = !DILocation(line: 56, column: 5, scope: !256)
!266 = !DILocation(line: 57, column: 1, scope: !256)
!267 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !268, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!268 = !DISubroutineType(types: !269)
!269 = !{null, !42}
!270 = !DILocalVariable(name: "line", arg: 1, scope: !267, file: !3, line: 11, type: !42)
!271 = !DILocation(line: 11, column: 25, scope: !267)
!272 = !DILocation(line: 13, column: 1, scope: !267)
!273 = !DILocation(line: 14, column: 8, scope: !274)
!274 = distinct !DILexicalBlock(scope: !267, file: !3, line: 14, column: 8)
!275 = !DILocation(line: 14, column: 13, scope: !274)
!276 = !DILocation(line: 14, column: 8, scope: !267)
!277 = !DILocation(line: 16, column: 24, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !3, line: 15, column: 5)
!279 = !DILocation(line: 16, column: 9, scope: !278)
!280 = !DILocation(line: 17, column: 5, scope: !278)
!281 = !DILocation(line: 18, column: 5, scope: !267)
!282 = !DILocation(line: 19, column: 1, scope: !267)
!283 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !268, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!284 = !DILocalVariable(name: "line", arg: 1, scope: !283, file: !3, line: 20, type: !42)
!285 = !DILocation(line: 20, column: 29, scope: !283)
!286 = !DILocation(line: 22, column: 8, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !3, line: 22, column: 8)
!288 = !DILocation(line: 22, column: 13, scope: !287)
!289 = !DILocation(line: 22, column: 8, scope: !283)
!290 = !DILocation(line: 24, column: 24, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !3, line: 23, column: 5)
!292 = !DILocation(line: 24, column: 9, scope: !291)
!293 = !DILocation(line: 25, column: 5, scope: !291)
!294 = !DILocation(line: 26, column: 1, scope: !283)
!295 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !296, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !298}
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64)
!299 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !23)
!300 = !DILocalVariable(name: "line", arg: 1, scope: !295, file: !3, line: 27, type: !298)
!301 = !DILocation(line: 27, column: 29, scope: !295)
!302 = !DILocation(line: 29, column: 8, scope: !303)
!303 = distinct !DILexicalBlock(scope: !295, file: !3, line: 29, column: 8)
!304 = !DILocation(line: 29, column: 13, scope: !303)
!305 = !DILocation(line: 29, column: 8, scope: !295)
!306 = !DILocation(line: 31, column: 27, scope: !307)
!307 = distinct !DILexicalBlock(scope: !303, file: !3, line: 30, column: 5)
!308 = !DILocation(line: 31, column: 9, scope: !307)
!309 = !DILocation(line: 32, column: 5, scope: !307)
!310 = !DILocation(line: 33, column: 1, scope: !295)
!311 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !312, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !23}
!314 = !DILocalVariable(name: "intNumber", arg: 1, scope: !311, file: !3, line: 35, type: !23)
!315 = !DILocation(line: 35, column: 24, scope: !311)
!316 = !DILocation(line: 37, column: 20, scope: !311)
!317 = !DILocation(line: 37, column: 5, scope: !311)
!318 = !DILocation(line: 38, column: 1, scope: !311)
!319 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !320, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322}
!322 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!323 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !319, file: !3, line: 40, type: !322)
!324 = !DILocation(line: 40, column: 28, scope: !319)
!325 = !DILocation(line: 42, column: 21, scope: !319)
!326 = !DILocation(line: 42, column: 5, scope: !319)
!327 = !DILocation(line: 43, column: 1, scope: !319)
!328 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !329, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331}
!331 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!332 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !328, file: !3, line: 45, type: !331)
!333 = !DILocation(line: 45, column: 28, scope: !328)
!334 = !DILocation(line: 47, column: 20, scope: !328)
!335 = !DILocation(line: 47, column: 5, scope: !328)
!336 = !DILocation(line: 48, column: 1, scope: !328)
!337 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !338, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !103}
!340 = !DILocalVariable(name: "longNumber", arg: 1, scope: !337, file: !3, line: 50, type: !103)
!341 = !DILocation(line: 50, column: 26, scope: !337)
!342 = !DILocation(line: 52, column: 21, scope: !337)
!343 = !DILocation(line: 52, column: 5, scope: !337)
!344 = !DILocation(line: 53, column: 1, scope: !337)
!345 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !346, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !348}
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !349, line: 27, baseType: !350)
!349 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 44, baseType: !103)
!351 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !345, file: !3, line: 55, type: !348)
!352 = !DILocation(line: 55, column: 33, scope: !345)
!353 = !DILocation(line: 57, column: 29, scope: !345)
!354 = !DILocation(line: 57, column: 5, scope: !345)
!355 = !DILocation(line: 58, column: 1, scope: !345)
!356 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !357, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !68}
!359 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !356, file: !3, line: 60, type: !68)
!360 = !DILocation(line: 60, column: 29, scope: !356)
!361 = !DILocation(line: 62, column: 21, scope: !356)
!362 = !DILocation(line: 62, column: 5, scope: !356)
!363 = !DILocation(line: 63, column: 1, scope: !356)
!364 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !365, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !43}
!367 = !DILocalVariable(name: "charHex", arg: 1, scope: !364, file: !3, line: 65, type: !43)
!368 = !DILocation(line: 65, column: 29, scope: !364)
!369 = !DILocation(line: 67, column: 22, scope: !364)
!370 = !DILocation(line: 67, column: 5, scope: !364)
!371 = !DILocation(line: 68, column: 1, scope: !364)
!372 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !373, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !299}
!375 = !DILocalVariable(name: "wideChar", arg: 1, scope: !372, file: !3, line: 70, type: !299)
!376 = !DILocation(line: 70, column: 29, scope: !372)
!377 = !DILocalVariable(name: "s", scope: !372, file: !3, line: 74, type: !378)
!378 = !DICompositeType(tag: DW_TAG_array_type, baseType: !299, size: 64, elements: !379)
!379 = !{!380}
!380 = !DISubrange(count: 2)
!381 = !DILocation(line: 74, column: 13, scope: !372)
!382 = !DILocation(line: 75, column: 16, scope: !372)
!383 = !DILocation(line: 75, column: 9, scope: !372)
!384 = !DILocation(line: 75, column: 14, scope: !372)
!385 = !DILocation(line: 76, column: 9, scope: !372)
!386 = !DILocation(line: 76, column: 14, scope: !372)
!387 = !DILocation(line: 77, column: 21, scope: !372)
!388 = !DILocation(line: 77, column: 5, scope: !372)
!389 = !DILocation(line: 78, column: 1, scope: !372)
!390 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !391, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !7}
!393 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !390, file: !3, line: 80, type: !7)
!394 = !DILocation(line: 80, column: 33, scope: !390)
!395 = !DILocation(line: 82, column: 20, scope: !390)
!396 = !DILocation(line: 82, column: 5, scope: !390)
!397 = !DILocation(line: 83, column: 1, scope: !390)
!398 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !399, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !25}
!401 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !398, file: !3, line: 85, type: !25)
!402 = !DILocation(line: 85, column: 45, scope: !398)
!403 = !DILocation(line: 87, column: 22, scope: !398)
!404 = !DILocation(line: 87, column: 5, scope: !398)
!405 = !DILocation(line: 88, column: 1, scope: !398)
!406 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !407, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409}
!409 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!410 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !406, file: !3, line: 90, type: !409)
!411 = !DILocation(line: 90, column: 29, scope: !406)
!412 = !DILocation(line: 92, column: 20, scope: !406)
!413 = !DILocation(line: 92, column: 5, scope: !406)
!414 = !DILocation(line: 93, column: 1, scope: !406)
!415 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !416, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !419, size: 64)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !420, line: 100, baseType: !421)
!420 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_997/source_code")
!421 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !420, line: 96, size: 64, elements: !422)
!422 = !{!423, !424}
!423 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !421, file: !420, line: 98, baseType: !23, size: 32)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !421, file: !420, line: 99, baseType: !23, size: 32, offset: 32)
!425 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !415, file: !3, line: 95, type: !418)
!426 = !DILocation(line: 95, column: 40, scope: !415)
!427 = !DILocation(line: 97, column: 26, scope: !415)
!428 = !DILocation(line: 97, column: 47, scope: !415)
!429 = !DILocation(line: 97, column: 55, scope: !415)
!430 = !DILocation(line: 97, column: 76, scope: !415)
!431 = !DILocation(line: 97, column: 5, scope: !415)
!432 = !DILocation(line: 98, column: 1, scope: !415)
!433 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !434, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !436, !68}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!437 = !DILocalVariable(name: "bytes", arg: 1, scope: !433, file: !3, line: 100, type: !436)
!438 = !DILocation(line: 100, column: 38, scope: !433)
!439 = !DILocalVariable(name: "numBytes", arg: 2, scope: !433, file: !3, line: 100, type: !68)
!440 = !DILocation(line: 100, column: 52, scope: !433)
!441 = !DILocalVariable(name: "i", scope: !433, file: !3, line: 102, type: !68)
!442 = !DILocation(line: 102, column: 12, scope: !433)
!443 = !DILocation(line: 103, column: 12, scope: !444)
!444 = distinct !DILexicalBlock(scope: !433, file: !3, line: 103, column: 5)
!445 = !DILocation(line: 103, column: 10, scope: !444)
!446 = !DILocation(line: 103, column: 17, scope: !447)
!447 = distinct !DILexicalBlock(scope: !444, file: !3, line: 103, column: 5)
!448 = !DILocation(line: 103, column: 21, scope: !447)
!449 = !DILocation(line: 103, column: 19, scope: !447)
!450 = !DILocation(line: 103, column: 5, scope: !444)
!451 = !DILocation(line: 105, column: 24, scope: !452)
!452 = distinct !DILexicalBlock(scope: !447, file: !3, line: 104, column: 5)
!453 = !DILocation(line: 105, column: 30, scope: !452)
!454 = !DILocation(line: 105, column: 9, scope: !452)
!455 = !DILocation(line: 106, column: 5, scope: !452)
!456 = !DILocation(line: 103, column: 31, scope: !447)
!457 = !DILocation(line: 103, column: 5, scope: !447)
!458 = distinct !{!458, !450, !459, !460}
!459 = !DILocation(line: 106, column: 5, scope: !444)
!460 = !{!"llvm.loop.mustprogress"}
!461 = !DILocation(line: 107, column: 5, scope: !433)
!462 = !DILocation(line: 108, column: 1, scope: !433)
!463 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !464, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!464 = !DISubroutineType(types: !465)
!465 = !{!68, !436, !68, !42}
!466 = !DILocalVariable(name: "bytes", arg: 1, scope: !463, file: !3, line: 113, type: !436)
!467 = !DILocation(line: 113, column: 39, scope: !463)
!468 = !DILocalVariable(name: "numBytes", arg: 2, scope: !463, file: !3, line: 113, type: !68)
!469 = !DILocation(line: 113, column: 53, scope: !463)
!470 = !DILocalVariable(name: "hex", arg: 3, scope: !463, file: !3, line: 113, type: !42)
!471 = !DILocation(line: 113, column: 71, scope: !463)
!472 = !DILocalVariable(name: "numWritten", scope: !463, file: !3, line: 115, type: !68)
!473 = !DILocation(line: 115, column: 12, scope: !463)
!474 = !DILocation(line: 121, column: 5, scope: !463)
!475 = !DILocation(line: 121, column: 12, scope: !463)
!476 = !DILocation(line: 121, column: 25, scope: !463)
!477 = !DILocation(line: 121, column: 23, scope: !463)
!478 = !DILocation(line: 121, column: 34, scope: !463)
!479 = !DILocation(line: 121, column: 37, scope: !463)
!480 = !DILocation(line: 121, column: 67, scope: !463)
!481 = !DILocation(line: 121, column: 70, scope: !463)
!482 = !DILocation(line: 0, scope: !463)
!483 = !DILocalVariable(name: "byte", scope: !484, file: !3, line: 123, type: !23)
!484 = distinct !DILexicalBlock(scope: !463, file: !3, line: 122, column: 5)
