; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_999/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_999/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65_bad", scope: !45, file: !45, line: 35, type: !55, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 37, type: !42)
!58 = !DILocation(line: 37, column: 12, scope: !54)
!59 = !DILocalVariable(name: "funcPtr", scope: !54, file: !45, line: 39, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !42}
!63 = !DILocation(line: 39, column: 12, scope: !54)
!64 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 40, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 100)
!68 = !DILocation(line: 40, column: 10, scope: !54)
!69 = !DILocation(line: 41, column: 12, scope: !54)
!70 = !DILocation(line: 41, column: 10, scope: !54)
!71 = !DILocalVariable(name: "dataLen", scope: !72, file: !45, line: 44, type: !73)
!72 = distinct !DILexicalBlock(scope: !54, file: !45, line: 42, column: 5)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DILocation(line: 44, column: 16, scope: !72)
!77 = !DILocation(line: 44, column: 33, scope: !72)
!78 = !DILocation(line: 44, column: 26, scope: !72)
!79 = !DILocalVariable(name: "pFile", scope: !72, file: !45, line: 45, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !23, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !42, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !42, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !42, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !42, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !42, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !42, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !42, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !42, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !42, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !42, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !42, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !23, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !23, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !24, size: 16, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !102, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !22, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !73, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !23, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DILocation(line: 45, column: 16, scope: !72)
!136 = !DILocation(line: 47, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !72, file: !45, line: 47, column: 13)
!138 = !DILocation(line: 47, column: 16, scope: !137)
!139 = !DILocation(line: 47, column: 25, scope: !137)
!140 = !DILocation(line: 47, column: 13, scope: !72)
!141 = !DILocation(line: 49, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !45, line: 48, column: 9)
!143 = !DILocation(line: 49, column: 19, scope: !142)
!144 = !DILocation(line: 50, column: 17, scope: !145)
!145 = distinct !DILexicalBlock(scope: !142, file: !45, line: 50, column: 17)
!146 = !DILocation(line: 50, column: 23, scope: !145)
!147 = !DILocation(line: 50, column: 17, scope: !142)
!148 = !DILocation(line: 53, column: 27, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !45, line: 53, column: 21)
!150 = distinct !DILexicalBlock(scope: !145, file: !45, line: 51, column: 13)
!151 = !DILocation(line: 53, column: 32, scope: !149)
!152 = !DILocation(line: 53, column: 31, scope: !149)
!153 = !DILocation(line: 53, column: 51, scope: !149)
!154 = !DILocation(line: 53, column: 50, scope: !149)
!155 = !DILocation(line: 53, column: 41, scope: !149)
!156 = !DILocation(line: 53, column: 61, scope: !149)
!157 = !DILocation(line: 53, column: 21, scope: !149)
!158 = !DILocation(line: 53, column: 68, scope: !149)
!159 = !DILocation(line: 53, column: 21, scope: !150)
!160 = !DILocation(line: 55, column: 21, scope: !161)
!161 = distinct !DILexicalBlock(scope: !149, file: !45, line: 54, column: 17)
!162 = !DILocation(line: 57, column: 21, scope: !161)
!163 = !DILocation(line: 57, column: 26, scope: !161)
!164 = !DILocation(line: 57, column: 35, scope: !161)
!165 = !DILocation(line: 58, column: 17, scope: !161)
!166 = !DILocation(line: 59, column: 24, scope: !150)
!167 = !DILocation(line: 59, column: 17, scope: !150)
!168 = !DILocation(line: 60, column: 13, scope: !150)
!169 = !DILocation(line: 61, column: 9, scope: !142)
!170 = !DILocation(line: 64, column: 5, scope: !54)
!171 = !DILocation(line: 64, column: 13, scope: !54)
!172 = !DILocation(line: 65, column: 1, scope: !54)
!173 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 73, type: !55, scopeLine: 74, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!174 = !DILocalVariable(name: "data", scope: !173, file: !45, line: 75, type: !42)
!175 = !DILocation(line: 75, column: 12, scope: !173)
!176 = !DILocalVariable(name: "funcPtr", scope: !173, file: !45, line: 76, type: !60)
!177 = !DILocation(line: 76, column: 12, scope: !173)
!178 = !DILocalVariable(name: "dataBuffer", scope: !173, file: !45, line: 77, type: !65)
!179 = !DILocation(line: 77, column: 10, scope: !173)
!180 = !DILocation(line: 78, column: 12, scope: !173)
!181 = !DILocation(line: 78, column: 10, scope: !173)
!182 = !DILocation(line: 80, column: 12, scope: !173)
!183 = !DILocation(line: 80, column: 5, scope: !173)
!184 = !DILocation(line: 81, column: 5, scope: !173)
!185 = !DILocation(line: 81, column: 13, scope: !173)
!186 = !DILocation(line: 82, column: 1, scope: !173)
!187 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 86, type: !55, scopeLine: 87, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!188 = !DILocalVariable(name: "data", scope: !187, file: !45, line: 88, type: !42)
!189 = !DILocation(line: 88, column: 12, scope: !187)
!190 = !DILocalVariable(name: "funcPtr", scope: !187, file: !45, line: 89, type: !60)
!191 = !DILocation(line: 89, column: 12, scope: !187)
!192 = !DILocalVariable(name: "dataBuffer", scope: !187, file: !45, line: 90, type: !65)
!193 = !DILocation(line: 90, column: 10, scope: !187)
!194 = !DILocation(line: 91, column: 12, scope: !187)
!195 = !DILocation(line: 91, column: 10, scope: !187)
!196 = !DILocalVariable(name: "dataLen", scope: !197, file: !45, line: 94, type: !73)
!197 = distinct !DILexicalBlock(scope: !187, file: !45, line: 92, column: 5)
!198 = !DILocation(line: 94, column: 16, scope: !197)
!199 = !DILocation(line: 94, column: 33, scope: !197)
!200 = !DILocation(line: 94, column: 26, scope: !197)
!201 = !DILocalVariable(name: "pFile", scope: !197, file: !45, line: 95, type: !80)
!202 = !DILocation(line: 95, column: 16, scope: !197)
!203 = !DILocation(line: 97, column: 17, scope: !204)
!204 = distinct !DILexicalBlock(scope: !197, file: !45, line: 97, column: 13)
!205 = !DILocation(line: 97, column: 16, scope: !204)
!206 = !DILocation(line: 97, column: 25, scope: !204)
!207 = !DILocation(line: 97, column: 13, scope: !197)
!208 = !DILocation(line: 99, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !204, file: !45, line: 98, column: 9)
!210 = !DILocation(line: 99, column: 19, scope: !209)
!211 = !DILocation(line: 100, column: 17, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !45, line: 100, column: 17)
!213 = !DILocation(line: 100, column: 23, scope: !212)
!214 = !DILocation(line: 100, column: 17, scope: !209)
!215 = !DILocation(line: 103, column: 27, scope: !216)
!216 = distinct !DILexicalBlock(scope: !217, file: !45, line: 103, column: 21)
!217 = distinct !DILexicalBlock(scope: !212, file: !45, line: 101, column: 13)
!218 = !DILocation(line: 103, column: 32, scope: !216)
!219 = !DILocation(line: 103, column: 31, scope: !216)
!220 = !DILocation(line: 103, column: 51, scope: !216)
!221 = !DILocation(line: 103, column: 50, scope: !216)
!222 = !DILocation(line: 103, column: 41, scope: !216)
!223 = !DILocation(line: 103, column: 61, scope: !216)
!224 = !DILocation(line: 103, column: 21, scope: !216)
!225 = !DILocation(line: 103, column: 68, scope: !216)
!226 = !DILocation(line: 103, column: 21, scope: !217)
!227 = !DILocation(line: 105, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !216, file: !45, line: 104, column: 17)
!229 = !DILocation(line: 107, column: 21, scope: !228)
!230 = !DILocation(line: 107, column: 26, scope: !228)
!231 = !DILocation(line: 107, column: 35, scope: !228)
!232 = !DILocation(line: 108, column: 17, scope: !228)
!233 = !DILocation(line: 109, column: 24, scope: !217)
!234 = !DILocation(line: 109, column: 17, scope: !217)
!235 = !DILocation(line: 110, column: 13, scope: !217)
!236 = !DILocation(line: 111, column: 9, scope: !209)
!237 = !DILocation(line: 113, column: 5, scope: !187)
!238 = !DILocation(line: 113, column: 13, scope: !187)
!239 = !DILocation(line: 114, column: 1, scope: !187)
!240 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65_good", scope: !45, file: !45, line: 116, type: !55, scopeLine: 117, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!241 = !DILocation(line: 118, column: 5, scope: !240)
!242 = !DILocation(line: 119, column: 5, scope: !240)
!243 = !DILocation(line: 120, column: 1, scope: !240)
!244 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65b_badSink", scope: !49, file: !49, line: 32, type: !61, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!245 = !DILocalVariable(name: "data", arg: 1, scope: !244, file: !49, line: 32, type: !42)
!246 = !DILocation(line: 32, column: 78, scope: !244)
!247 = !DILocation(line: 35, column: 13, scope: !244)
!248 = !DILocation(line: 35, column: 21, scope: !244)
!249 = !DILocation(line: 35, column: 5, scope: !244)
!250 = !DILocation(line: 36, column: 1, scope: !244)
!251 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65b_goodG2BSink", scope: !49, file: !49, line: 43, type: !61, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!252 = !DILocalVariable(name: "data", arg: 1, scope: !251, file: !49, line: 43, type: !42)
!253 = !DILocation(line: 43, column: 82, scope: !251)
!254 = !DILocation(line: 46, column: 13, scope: !251)
!255 = !DILocation(line: 46, column: 21, scope: !251)
!256 = !DILocation(line: 46, column: 5, scope: !251)
!257 = !DILocation(line: 47, column: 1, scope: !251)
!258 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_65b_goodB2GSink", scope: !49, file: !49, line: 50, type: !61, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!259 = !DILocalVariable(name: "data", arg: 1, scope: !258, file: !49, line: 50, type: !42)
!260 = !DILocation(line: 50, column: 82, scope: !258)
!261 = !DILocation(line: 53, column: 13, scope: !258)
!262 = !DILocation(line: 53, column: 29, scope: !258)
!263 = !DILocation(line: 53, column: 5, scope: !258)
!264 = !DILocation(line: 54, column: 1, scope: !258)
!265 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !61, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!266 = !DILocalVariable(name: "line", arg: 1, scope: !265, file: !3, line: 11, type: !42)
!267 = !DILocation(line: 11, column: 25, scope: !265)
!268 = !DILocation(line: 13, column: 1, scope: !265)
!269 = !DILocation(line: 14, column: 8, scope: !270)
!270 = distinct !DILexicalBlock(scope: !265, file: !3, line: 14, column: 8)
!271 = !DILocation(line: 14, column: 13, scope: !270)
!272 = !DILocation(line: 14, column: 8, scope: !265)
!273 = !DILocation(line: 16, column: 24, scope: !274)
!274 = distinct !DILexicalBlock(scope: !270, file: !3, line: 15, column: 5)
!275 = !DILocation(line: 16, column: 9, scope: !274)
!276 = !DILocation(line: 17, column: 5, scope: !274)
!277 = !DILocation(line: 18, column: 5, scope: !265)
!278 = !DILocation(line: 19, column: 1, scope: !265)
!279 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !61, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!280 = !DILocalVariable(name: "line", arg: 1, scope: !279, file: !3, line: 20, type: !42)
!281 = !DILocation(line: 20, column: 29, scope: !279)
!282 = !DILocation(line: 22, column: 8, scope: !283)
!283 = distinct !DILexicalBlock(scope: !279, file: !3, line: 22, column: 8)
!284 = !DILocation(line: 22, column: 13, scope: !283)
!285 = !DILocation(line: 22, column: 8, scope: !279)
!286 = !DILocation(line: 24, column: 24, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !3, line: 23, column: 5)
!288 = !DILocation(line: 24, column: 9, scope: !287)
!289 = !DILocation(line: 25, column: 5, scope: !287)
!290 = !DILocation(line: 26, column: 1, scope: !279)
!291 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !292, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!292 = !DISubroutineType(types: !293)
!293 = !{null, !294}
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64)
!295 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !74, line: 74, baseType: !23)
!296 = !DILocalVariable(name: "line", arg: 1, scope: !291, file: !3, line: 27, type: !294)
!297 = !DILocation(line: 27, column: 29, scope: !291)
!298 = !DILocation(line: 29, column: 8, scope: !299)
!299 = distinct !DILexicalBlock(scope: !291, file: !3, line: 29, column: 8)
!300 = !DILocation(line: 29, column: 13, scope: !299)
!301 = !DILocation(line: 29, column: 8, scope: !291)
!302 = !DILocation(line: 31, column: 27, scope: !303)
!303 = distinct !DILexicalBlock(scope: !299, file: !3, line: 30, column: 5)
!304 = !DILocation(line: 31, column: 9, scope: !303)
!305 = !DILocation(line: 32, column: 5, scope: !303)
!306 = !DILocation(line: 33, column: 1, scope: !291)
!307 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !308, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!308 = !DISubroutineType(types: !309)
!309 = !{null, !23}
!310 = !DILocalVariable(name: "intNumber", arg: 1, scope: !307, file: !3, line: 35, type: !23)
!311 = !DILocation(line: 35, column: 24, scope: !307)
!312 = !DILocation(line: 37, column: 20, scope: !307)
!313 = !DILocation(line: 37, column: 5, scope: !307)
!314 = !DILocation(line: 38, column: 1, scope: !307)
!315 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !316, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!316 = !DISubroutineType(types: !317)
!317 = !{null, !318}
!318 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!319 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !315, file: !3, line: 40, type: !318)
!320 = !DILocation(line: 40, column: 28, scope: !315)
!321 = !DILocation(line: 42, column: 21, scope: !315)
!322 = !DILocation(line: 42, column: 5, scope: !315)
!323 = !DILocation(line: 43, column: 1, scope: !315)
!324 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !325, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !327}
!327 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!328 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !324, file: !3, line: 45, type: !327)
!329 = !DILocation(line: 45, column: 28, scope: !324)
!330 = !DILocation(line: 47, column: 20, scope: !324)
!331 = !DILocation(line: 47, column: 5, scope: !324)
!332 = !DILocation(line: 48, column: 1, scope: !324)
!333 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !334, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!334 = !DISubroutineType(types: !335)
!335 = !{null, !108}
!336 = !DILocalVariable(name: "longNumber", arg: 1, scope: !333, file: !3, line: 50, type: !108)
!337 = !DILocation(line: 50, column: 26, scope: !333)
!338 = !DILocation(line: 52, column: 21, scope: !333)
!339 = !DILocation(line: 52, column: 5, scope: !333)
!340 = !DILocation(line: 53, column: 1, scope: !333)
!341 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !342, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!342 = !DISubroutineType(types: !343)
!343 = !{null, !344}
!344 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !345, line: 27, baseType: !346)
!345 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 44, baseType: !108)
!347 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !341, file: !3, line: 55, type: !344)
!348 = !DILocation(line: 55, column: 33, scope: !341)
!349 = !DILocation(line: 57, column: 29, scope: !341)
!350 = !DILocation(line: 57, column: 5, scope: !341)
!351 = !DILocation(line: 58, column: 1, scope: !341)
!352 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !353, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !73}
!355 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !352, file: !3, line: 60, type: !73)
!356 = !DILocation(line: 60, column: 29, scope: !352)
!357 = !DILocation(line: 62, column: 21, scope: !352)
!358 = !DILocation(line: 62, column: 5, scope: !352)
!359 = !DILocation(line: 63, column: 1, scope: !352)
!360 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !361, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !43}
!363 = !DILocalVariable(name: "charHex", arg: 1, scope: !360, file: !3, line: 65, type: !43)
!364 = !DILocation(line: 65, column: 29, scope: !360)
!365 = !DILocation(line: 67, column: 22, scope: !360)
!366 = !DILocation(line: 67, column: 5, scope: !360)
!367 = !DILocation(line: 68, column: 1, scope: !360)
!368 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !369, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !295}
!371 = !DILocalVariable(name: "wideChar", arg: 1, scope: !368, file: !3, line: 70, type: !295)
!372 = !DILocation(line: 70, column: 29, scope: !368)
!373 = !DILocalVariable(name: "s", scope: !368, file: !3, line: 74, type: !374)
!374 = !DICompositeType(tag: DW_TAG_array_type, baseType: !295, size: 64, elements: !375)
!375 = !{!376}
!376 = !DISubrange(count: 2)
!377 = !DILocation(line: 74, column: 13, scope: !368)
!378 = !DILocation(line: 75, column: 16, scope: !368)
!379 = !DILocation(line: 75, column: 9, scope: !368)
!380 = !DILocation(line: 75, column: 14, scope: !368)
!381 = !DILocation(line: 76, column: 9, scope: !368)
!382 = !DILocation(line: 76, column: 14, scope: !368)
!383 = !DILocation(line: 77, column: 21, scope: !368)
!384 = !DILocation(line: 77, column: 5, scope: !368)
!385 = !DILocation(line: 78, column: 1, scope: !368)
!386 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !387, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !7}
!389 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !386, file: !3, line: 80, type: !7)
!390 = !DILocation(line: 80, column: 33, scope: !386)
!391 = !DILocation(line: 82, column: 20, scope: !386)
!392 = !DILocation(line: 82, column: 5, scope: !386)
!393 = !DILocation(line: 83, column: 1, scope: !386)
!394 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !395, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !25}
!397 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !394, file: !3, line: 85, type: !25)
!398 = !DILocation(line: 85, column: 45, scope: !394)
!399 = !DILocation(line: 87, column: 22, scope: !394)
!400 = !DILocation(line: 87, column: 5, scope: !394)
!401 = !DILocation(line: 88, column: 1, scope: !394)
!402 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !403, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !405}
!405 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!406 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !402, file: !3, line: 90, type: !405)
!407 = !DILocation(line: 90, column: 29, scope: !402)
!408 = !DILocation(line: 92, column: 20, scope: !402)
!409 = !DILocation(line: 92, column: 5, scope: !402)
!410 = !DILocation(line: 93, column: 1, scope: !402)
!411 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !412, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414}
!414 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !415, size: 64)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !416, line: 100, baseType: !417)
!416 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_999/source_code")
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !416, line: 96, size: 64, elements: !418)
!418 = !{!419, !420}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !417, file: !416, line: 98, baseType: !23, size: 32)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !417, file: !416, line: 99, baseType: !23, size: 32, offset: 32)
!421 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !411, file: !3, line: 95, type: !414)
!422 = !DILocation(line: 95, column: 40, scope: !411)
!423 = !DILocation(line: 97, column: 26, scope: !411)
!424 = !DILocation(line: 97, column: 47, scope: !411)
!425 = !DILocation(line: 97, column: 55, scope: !411)
!426 = !DILocation(line: 97, column: 76, scope: !411)
!427 = !DILocation(line: 97, column: 5, scope: !411)
!428 = !DILocation(line: 98, column: 1, scope: !411)
!429 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !430, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !432, !73}
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!433 = !DILocalVariable(name: "bytes", arg: 1, scope: !429, file: !3, line: 100, type: !432)
!434 = !DILocation(line: 100, column: 38, scope: !429)
!435 = !DILocalVariable(name: "numBytes", arg: 2, scope: !429, file: !3, line: 100, type: !73)
!436 = !DILocation(line: 100, column: 52, scope: !429)
!437 = !DILocalVariable(name: "i", scope: !429, file: !3, line: 102, type: !73)
!438 = !DILocation(line: 102, column: 12, scope: !429)
!439 = !DILocation(line: 103, column: 12, scope: !440)
!440 = distinct !DILexicalBlock(scope: !429, file: !3, line: 103, column: 5)
!441 = !DILocation(line: 103, column: 10, scope: !440)
!442 = !DILocation(line: 103, column: 17, scope: !443)
!443 = distinct !DILexicalBlock(scope: !440, file: !3, line: 103, column: 5)
!444 = !DILocation(line: 103, column: 21, scope: !443)
!445 = !DILocation(line: 103, column: 19, scope: !443)
!446 = !DILocation(line: 103, column: 5, scope: !440)
!447 = !DILocation(line: 105, column: 24, scope: !448)
!448 = distinct !DILexicalBlock(scope: !443, file: !3, line: 104, column: 5)
!449 = !DILocation(line: 105, column: 30, scope: !448)
!450 = !DILocation(line: 105, column: 9, scope: !448)
!451 = !DILocation(line: 106, column: 5, scope: !448)
!452 = !DILocation(line: 103, column: 31, scope: !443)
!453 = !DILocation(line: 103, column: 5, scope: !443)
!454 = distinct !{!454, !446, !455, !456}
!455 = !DILocation(line: 106, column: 5, scope: !440)
!456 = !{!"llvm.loop.mustprogress"}
!457 = !DILocation(line: 107, column: 5, scope: !429)
!458 = !DILocation(line: 108, column: 1, scope: !429)
!459 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !460, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{!73, !432, !73, !42}
!462 = !DILocalVariable(name: "bytes", arg: 1, scope: !459, file: !3, line: 113, type: !432)
!463 = !DILocation(line: 113, column: 39, scope: !459)
!464 = !DILocalVariable(name: "numBytes", arg: 2, scope: !459, file: !3, line: 113, type: !73)
!465 = !DILocation(line: 113, column: 53, scope: !459)
!466 = !DILocalVariable(name: "hex", arg: 3, scope: !459, file: !3, line: 113, type: !42)
!467 = !DILocation(line: 113, column: 71, scope: !459)
!468 = !DILocalVariable(name: "numWritten", scope: !459, file: !3, line: 115, type: !73)
!469 = !DILocation(line: 115, column: 12, scope: !459)
!470 = !DILocation(line: 121, column: 5, scope: !459)
!471 = !DILocation(line: 121, column: 12, scope: !459)
!472 = !DILocation(line: 121, column: 25, scope: !459)
!473 = !DILocation(line: 121, column: 23, scope: !459)
!474 = !DILocation(line: 121, column: 34, scope: !459)
!475 = !DILocation(line: 121, column: 37, scope: !459)
!476 = !DILocation(line: 121, column: 67, scope: !459)
!477 = !DILocation(line: 121, column: 70, scope: !459)
!478 = !DILocation(line: 0, scope: !459)
!479 = !DILocalVariable(name: "byte", scope: !480, file: !3, line: 123, type: !23)
!480 = distinct !DILexicalBlock(scope: !459, file: !3, line: 122, column: 5)
