; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_44.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_037/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badSink", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !42}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 33, type: !42)
!56 = !DILocation(line: 33, column: 21, scope: !52)
!57 = !DILocation(line: 36, column: 12, scope: !52)
!58 = !DILocation(line: 36, column: 5, scope: !52)
!59 = !DILocation(line: 37, column: 1, scope: !52)
!60 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_44_bad", scope: !45, file: !45, line: 39, type: !61, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !DILocalVariable(name: "data", scope: !60, file: !45, line: 41, type: !42)
!64 = !DILocation(line: 41, column: 12, scope: !60)
!65 = !DILocalVariable(name: "funcPtr", scope: !60, file: !45, line: 43, type: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!67 = !DILocation(line: 43, column: 12, scope: !60)
!68 = !DILocalVariable(name: "dataBuffer", scope: !60, file: !45, line: 44, type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DILocation(line: 44, column: 10, scope: !60)
!73 = !DILocation(line: 45, column: 12, scope: !60)
!74 = !DILocation(line: 45, column: 10, scope: !60)
!75 = !DILocalVariable(name: "dataLen", scope: !76, file: !45, line: 48, type: !77)
!76 = distinct !DILexicalBlock(scope: !60, file: !45, line: 46, column: 5)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DILocation(line: 48, column: 16, scope: !76)
!81 = !DILocation(line: 48, column: 33, scope: !76)
!82 = !DILocation(line: 48, column: 26, scope: !76)
!83 = !DILocalVariable(name: "pFile", scope: !76, file: !45, line: 49, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !86, line: 7, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !88, line: 49, size: 1728, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !107, !108, !109, !113, !114, !116, !120, !123, !125, !128, !131, !132, !133, !134, !135}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !87, file: !88, line: 51, baseType: !23, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !87, file: !88, line: 54, baseType: !42, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !87, file: !88, line: 55, baseType: !42, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !87, file: !88, line: 56, baseType: !42, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !87, file: !88, line: 57, baseType: !42, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !87, file: !88, line: 58, baseType: !42, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !87, file: !88, line: 59, baseType: !42, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !87, file: !88, line: 60, baseType: !42, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !87, file: !88, line: 61, baseType: !42, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !87, file: !88, line: 64, baseType: !42, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !87, file: !88, line: 65, baseType: !42, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !87, file: !88, line: 66, baseType: !42, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !87, file: !88, line: 68, baseType: !103, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !88, line: 36, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !87, file: !88, line: 70, baseType: !106, size: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !87, file: !88, line: 72, baseType: !23, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !87, file: !88, line: 73, baseType: !23, size: 32, offset: 928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !87, file: !88, line: 74, baseType: !110, size: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !87, file: !88, line: 77, baseType: !24, size: 16, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !87, file: !88, line: 78, baseType: !115, size: 8, offset: 1040)
!115 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !87, file: !88, line: 79, baseType: !117, size: 8, offset: 1048)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !87, file: !88, line: 81, baseType: !121, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !88, line: 43, baseType: null)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !87, file: !88, line: 89, baseType: !124, size: 64, offset: 1152)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !112)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !87, file: !88, line: 91, baseType: !126, size: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !88, line: 37, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !87, file: !88, line: 92, baseType: !129, size: 64, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !88, line: 38, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !87, file: !88, line: 93, baseType: !106, size: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !87, file: !88, line: 94, baseType: !22, size: 64, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !87, file: !88, line: 95, baseType: !77, size: 64, offset: 1472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !87, file: !88, line: 96, baseType: !23, size: 32, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !87, file: !88, line: 98, baseType: !136, size: 160, offset: 1568)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 20)
!139 = !DILocation(line: 49, column: 16, scope: !76)
!140 = !DILocation(line: 51, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !76, file: !45, line: 51, column: 13)
!142 = !DILocation(line: 51, column: 16, scope: !141)
!143 = !DILocation(line: 51, column: 25, scope: !141)
!144 = !DILocation(line: 51, column: 13, scope: !76)
!145 = !DILocation(line: 53, column: 21, scope: !146)
!146 = distinct !DILexicalBlock(scope: !141, file: !45, line: 52, column: 9)
!147 = !DILocation(line: 53, column: 19, scope: !146)
!148 = !DILocation(line: 54, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !146, file: !45, line: 54, column: 17)
!150 = !DILocation(line: 54, column: 23, scope: !149)
!151 = !DILocation(line: 54, column: 17, scope: !146)
!152 = !DILocation(line: 57, column: 27, scope: !153)
!153 = distinct !DILexicalBlock(scope: !154, file: !45, line: 57, column: 21)
!154 = distinct !DILexicalBlock(scope: !149, file: !45, line: 55, column: 13)
!155 = !DILocation(line: 57, column: 32, scope: !153)
!156 = !DILocation(line: 57, column: 31, scope: !153)
!157 = !DILocation(line: 57, column: 51, scope: !153)
!158 = !DILocation(line: 57, column: 50, scope: !153)
!159 = !DILocation(line: 57, column: 41, scope: !153)
!160 = !DILocation(line: 57, column: 61, scope: !153)
!161 = !DILocation(line: 57, column: 21, scope: !153)
!162 = !DILocation(line: 57, column: 68, scope: !153)
!163 = !DILocation(line: 57, column: 21, scope: !154)
!164 = !DILocation(line: 59, column: 21, scope: !165)
!165 = distinct !DILexicalBlock(scope: !153, file: !45, line: 58, column: 17)
!166 = !DILocation(line: 61, column: 21, scope: !165)
!167 = !DILocation(line: 61, column: 26, scope: !165)
!168 = !DILocation(line: 61, column: 35, scope: !165)
!169 = !DILocation(line: 62, column: 17, scope: !165)
!170 = !DILocation(line: 63, column: 24, scope: !154)
!171 = !DILocation(line: 63, column: 17, scope: !154)
!172 = !DILocation(line: 64, column: 13, scope: !154)
!173 = !DILocation(line: 65, column: 9, scope: !146)
!174 = !DILocation(line: 68, column: 5, scope: !60)
!175 = !DILocation(line: 68, column: 13, scope: !60)
!176 = !DILocation(line: 69, column: 1, scope: !60)
!177 = distinct !DISubprogram(name: "goodG2BSink", scope: !45, file: !45, line: 76, type: !53, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!178 = !DILocalVariable(name: "data", arg: 1, scope: !177, file: !45, line: 76, type: !42)
!179 = !DILocation(line: 76, column: 25, scope: !177)
!180 = !DILocation(line: 79, column: 12, scope: !177)
!181 = !DILocation(line: 79, column: 5, scope: !177)
!182 = !DILocation(line: 80, column: 1, scope: !177)
!183 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 82, type: !61, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!184 = !DILocalVariable(name: "data", scope: !183, file: !45, line: 84, type: !42)
!185 = !DILocation(line: 84, column: 12, scope: !183)
!186 = !DILocalVariable(name: "funcPtr", scope: !183, file: !45, line: 85, type: !66)
!187 = !DILocation(line: 85, column: 12, scope: !183)
!188 = !DILocalVariable(name: "dataBuffer", scope: !183, file: !45, line: 86, type: !69)
!189 = !DILocation(line: 86, column: 10, scope: !183)
!190 = !DILocation(line: 87, column: 12, scope: !183)
!191 = !DILocation(line: 87, column: 10, scope: !183)
!192 = !DILocation(line: 89, column: 12, scope: !183)
!193 = !DILocation(line: 89, column: 5, scope: !183)
!194 = !DILocation(line: 90, column: 5, scope: !183)
!195 = !DILocation(line: 90, column: 13, scope: !183)
!196 = !DILocation(line: 91, column: 1, scope: !183)
!197 = distinct !DISubprogram(name: "goodB2GSink", scope: !45, file: !45, line: 94, type: !53, scopeLine: 95, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!198 = !DILocalVariable(name: "data", arg: 1, scope: !197, file: !45, line: 94, type: !42)
!199 = !DILocation(line: 94, column: 25, scope: !197)
!200 = !DILocation(line: 97, column: 20, scope: !197)
!201 = !DILocation(line: 97, column: 5, scope: !197)
!202 = !DILocation(line: 98, column: 1, scope: !197)
!203 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 100, type: !61, scopeLine: 101, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!204 = !DILocalVariable(name: "data", scope: !203, file: !45, line: 102, type: !42)
!205 = !DILocation(line: 102, column: 12, scope: !203)
!206 = !DILocalVariable(name: "funcPtr", scope: !203, file: !45, line: 103, type: !66)
!207 = !DILocation(line: 103, column: 12, scope: !203)
!208 = !DILocalVariable(name: "dataBuffer", scope: !203, file: !45, line: 104, type: !69)
!209 = !DILocation(line: 104, column: 10, scope: !203)
!210 = !DILocation(line: 105, column: 12, scope: !203)
!211 = !DILocation(line: 105, column: 10, scope: !203)
!212 = !DILocalVariable(name: "dataLen", scope: !213, file: !45, line: 108, type: !77)
!213 = distinct !DILexicalBlock(scope: !203, file: !45, line: 106, column: 5)
!214 = !DILocation(line: 108, column: 16, scope: !213)
!215 = !DILocation(line: 108, column: 33, scope: !213)
!216 = !DILocation(line: 108, column: 26, scope: !213)
!217 = !DILocalVariable(name: "pFile", scope: !213, file: !45, line: 109, type: !84)
!218 = !DILocation(line: 109, column: 16, scope: !213)
!219 = !DILocation(line: 111, column: 17, scope: !220)
!220 = distinct !DILexicalBlock(scope: !213, file: !45, line: 111, column: 13)
!221 = !DILocation(line: 111, column: 16, scope: !220)
!222 = !DILocation(line: 111, column: 25, scope: !220)
!223 = !DILocation(line: 111, column: 13, scope: !213)
!224 = !DILocation(line: 113, column: 21, scope: !225)
!225 = distinct !DILexicalBlock(scope: !220, file: !45, line: 112, column: 9)
!226 = !DILocation(line: 113, column: 19, scope: !225)
!227 = !DILocation(line: 114, column: 17, scope: !228)
!228 = distinct !DILexicalBlock(scope: !225, file: !45, line: 114, column: 17)
!229 = !DILocation(line: 114, column: 23, scope: !228)
!230 = !DILocation(line: 114, column: 17, scope: !225)
!231 = !DILocation(line: 117, column: 27, scope: !232)
!232 = distinct !DILexicalBlock(scope: !233, file: !45, line: 117, column: 21)
!233 = distinct !DILexicalBlock(scope: !228, file: !45, line: 115, column: 13)
!234 = !DILocation(line: 117, column: 32, scope: !232)
!235 = !DILocation(line: 117, column: 31, scope: !232)
!236 = !DILocation(line: 117, column: 51, scope: !232)
!237 = !DILocation(line: 117, column: 50, scope: !232)
!238 = !DILocation(line: 117, column: 41, scope: !232)
!239 = !DILocation(line: 117, column: 61, scope: !232)
!240 = !DILocation(line: 117, column: 21, scope: !232)
!241 = !DILocation(line: 117, column: 68, scope: !232)
!242 = !DILocation(line: 117, column: 21, scope: !233)
!243 = !DILocation(line: 119, column: 21, scope: !244)
!244 = distinct !DILexicalBlock(scope: !232, file: !45, line: 118, column: 17)
!245 = !DILocation(line: 121, column: 21, scope: !244)
!246 = !DILocation(line: 121, column: 26, scope: !244)
!247 = !DILocation(line: 121, column: 35, scope: !244)
!248 = !DILocation(line: 122, column: 17, scope: !244)
!249 = !DILocation(line: 123, column: 24, scope: !233)
!250 = !DILocation(line: 123, column: 17, scope: !233)
!251 = !DILocation(line: 124, column: 13, scope: !233)
!252 = !DILocation(line: 125, column: 9, scope: !225)
!253 = !DILocation(line: 127, column: 5, scope: !203)
!254 = !DILocation(line: 127, column: 13, scope: !203)
!255 = !DILocation(line: 128, column: 1, scope: !203)
!256 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_44_good", scope: !45, file: !45, line: 130, type: !61, scopeLine: 131, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!257 = !DILocation(line: 132, column: 5, scope: !256)
!258 = !DILocation(line: 133, column: 5, scope: !256)
!259 = !DILocation(line: 134, column: 1, scope: !256)
!260 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !53, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!261 = !DILocalVariable(name: "line", arg: 1, scope: !260, file: !3, line: 11, type: !42)
!262 = !DILocation(line: 11, column: 25, scope: !260)
!263 = !DILocation(line: 13, column: 1, scope: !260)
!264 = !DILocation(line: 14, column: 8, scope: !265)
!265 = distinct !DILexicalBlock(scope: !260, file: !3, line: 14, column: 8)
!266 = !DILocation(line: 14, column: 13, scope: !265)
!267 = !DILocation(line: 14, column: 8, scope: !260)
!268 = !DILocation(line: 16, column: 24, scope: !269)
!269 = distinct !DILexicalBlock(scope: !265, file: !3, line: 15, column: 5)
!270 = !DILocation(line: 16, column: 9, scope: !269)
!271 = !DILocation(line: 17, column: 5, scope: !269)
!272 = !DILocation(line: 18, column: 5, scope: !260)
!273 = !DILocation(line: 19, column: 1, scope: !260)
!274 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !53, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!275 = !DILocalVariable(name: "line", arg: 1, scope: !274, file: !3, line: 20, type: !42)
!276 = !DILocation(line: 20, column: 29, scope: !274)
!277 = !DILocation(line: 22, column: 8, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !3, line: 22, column: 8)
!279 = !DILocation(line: 22, column: 13, scope: !278)
!280 = !DILocation(line: 22, column: 8, scope: !274)
!281 = !DILocation(line: 24, column: 24, scope: !282)
!282 = distinct !DILexicalBlock(scope: !278, file: !3, line: 23, column: 5)
!283 = !DILocation(line: 24, column: 9, scope: !282)
!284 = !DILocation(line: 25, column: 5, scope: !282)
!285 = !DILocation(line: 26, column: 1, scope: !274)
!286 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !287, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!287 = !DISubroutineType(types: !288)
!288 = !{null, !289}
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !290, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !78, line: 74, baseType: !23)
!291 = !DILocalVariable(name: "line", arg: 1, scope: !286, file: !3, line: 27, type: !289)
!292 = !DILocation(line: 27, column: 29, scope: !286)
!293 = !DILocation(line: 29, column: 8, scope: !294)
!294 = distinct !DILexicalBlock(scope: !286, file: !3, line: 29, column: 8)
!295 = !DILocation(line: 29, column: 13, scope: !294)
!296 = !DILocation(line: 29, column: 8, scope: !286)
!297 = !DILocation(line: 31, column: 27, scope: !298)
!298 = distinct !DILexicalBlock(scope: !294, file: !3, line: 30, column: 5)
!299 = !DILocation(line: 31, column: 9, scope: !298)
!300 = !DILocation(line: 32, column: 5, scope: !298)
!301 = !DILocation(line: 33, column: 1, scope: !286)
!302 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !303, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!303 = !DISubroutineType(types: !304)
!304 = !{null, !23}
!305 = !DILocalVariable(name: "intNumber", arg: 1, scope: !302, file: !3, line: 35, type: !23)
!306 = !DILocation(line: 35, column: 24, scope: !302)
!307 = !DILocation(line: 37, column: 20, scope: !302)
!308 = !DILocation(line: 37, column: 5, scope: !302)
!309 = !DILocation(line: 38, column: 1, scope: !302)
!310 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !311, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!311 = !DISubroutineType(types: !312)
!312 = !{null, !313}
!313 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!314 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !310, file: !3, line: 40, type: !313)
!315 = !DILocation(line: 40, column: 28, scope: !310)
!316 = !DILocation(line: 42, column: 21, scope: !310)
!317 = !DILocation(line: 42, column: 5, scope: !310)
!318 = !DILocation(line: 43, column: 1, scope: !310)
!319 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !320, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!320 = !DISubroutineType(types: !321)
!321 = !{null, !322}
!322 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!323 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !319, file: !3, line: 45, type: !322)
!324 = !DILocation(line: 45, column: 28, scope: !319)
!325 = !DILocation(line: 47, column: 20, scope: !319)
!326 = !DILocation(line: 47, column: 5, scope: !319)
!327 = !DILocation(line: 48, column: 1, scope: !319)
!328 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !329, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !112}
!331 = !DILocalVariable(name: "longNumber", arg: 1, scope: !328, file: !3, line: 50, type: !112)
!332 = !DILocation(line: 50, column: 26, scope: !328)
!333 = !DILocation(line: 52, column: 21, scope: !328)
!334 = !DILocation(line: 52, column: 5, scope: !328)
!335 = !DILocation(line: 53, column: 1, scope: !328)
!336 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !337, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !339}
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !340, line: 27, baseType: !341)
!340 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!341 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 44, baseType: !112)
!342 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !336, file: !3, line: 55, type: !339)
!343 = !DILocation(line: 55, column: 33, scope: !336)
!344 = !DILocation(line: 57, column: 29, scope: !336)
!345 = !DILocation(line: 57, column: 5, scope: !336)
!346 = !DILocation(line: 58, column: 1, scope: !336)
!347 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !348, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !77}
!350 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !347, file: !3, line: 60, type: !77)
!351 = !DILocation(line: 60, column: 29, scope: !347)
!352 = !DILocation(line: 62, column: 21, scope: !347)
!353 = !DILocation(line: 62, column: 5, scope: !347)
!354 = !DILocation(line: 63, column: 1, scope: !347)
!355 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !356, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !43}
!358 = !DILocalVariable(name: "charHex", arg: 1, scope: !355, file: !3, line: 65, type: !43)
!359 = !DILocation(line: 65, column: 29, scope: !355)
!360 = !DILocation(line: 67, column: 22, scope: !355)
!361 = !DILocation(line: 67, column: 5, scope: !355)
!362 = !DILocation(line: 68, column: 1, scope: !355)
!363 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !364, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !290}
!366 = !DILocalVariable(name: "wideChar", arg: 1, scope: !363, file: !3, line: 70, type: !290)
!367 = !DILocation(line: 70, column: 29, scope: !363)
!368 = !DILocalVariable(name: "s", scope: !363, file: !3, line: 74, type: !369)
!369 = !DICompositeType(tag: DW_TAG_array_type, baseType: !290, size: 64, elements: !370)
!370 = !{!371}
!371 = !DISubrange(count: 2)
!372 = !DILocation(line: 74, column: 13, scope: !363)
!373 = !DILocation(line: 75, column: 16, scope: !363)
!374 = !DILocation(line: 75, column: 9, scope: !363)
!375 = !DILocation(line: 75, column: 14, scope: !363)
!376 = !DILocation(line: 76, column: 9, scope: !363)
!377 = !DILocation(line: 76, column: 14, scope: !363)
!378 = !DILocation(line: 77, column: 21, scope: !363)
!379 = !DILocation(line: 77, column: 5, scope: !363)
!380 = !DILocation(line: 78, column: 1, scope: !363)
!381 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !382, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !7}
!384 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !381, file: !3, line: 80, type: !7)
!385 = !DILocation(line: 80, column: 33, scope: !381)
!386 = !DILocation(line: 82, column: 20, scope: !381)
!387 = !DILocation(line: 82, column: 5, scope: !381)
!388 = !DILocation(line: 83, column: 1, scope: !381)
!389 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !390, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !25}
!392 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !389, file: !3, line: 85, type: !25)
!393 = !DILocation(line: 85, column: 45, scope: !389)
!394 = !DILocation(line: 87, column: 22, scope: !389)
!395 = !DILocation(line: 87, column: 5, scope: !389)
!396 = !DILocation(line: 88, column: 1, scope: !389)
!397 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !398, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400}
!400 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!401 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !397, file: !3, line: 90, type: !400)
!402 = !DILocation(line: 90, column: 29, scope: !397)
!403 = !DILocation(line: 92, column: 20, scope: !397)
!404 = !DILocation(line: 92, column: 5, scope: !397)
!405 = !DILocation(line: 93, column: 1, scope: !397)
!406 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !407, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !409}
!409 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !410, size: 64)
!410 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !411, line: 100, baseType: !412)
!411 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_037/source_code")
!412 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !411, line: 96, size: 64, elements: !413)
!413 = !{!414, !415}
!414 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !412, file: !411, line: 98, baseType: !23, size: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !412, file: !411, line: 99, baseType: !23, size: 32, offset: 32)
!416 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !406, file: !3, line: 95, type: !409)
!417 = !DILocation(line: 95, column: 40, scope: !406)
!418 = !DILocation(line: 97, column: 26, scope: !406)
!419 = !DILocation(line: 97, column: 47, scope: !406)
!420 = !DILocation(line: 97, column: 55, scope: !406)
!421 = !DILocation(line: 97, column: 76, scope: !406)
!422 = !DILocation(line: 97, column: 5, scope: !406)
!423 = !DILocation(line: 98, column: 1, scope: !406)
!424 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !425, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427, !77}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!428 = !DILocalVariable(name: "bytes", arg: 1, scope: !424, file: !3, line: 100, type: !427)
!429 = !DILocation(line: 100, column: 38, scope: !424)
!430 = !DILocalVariable(name: "numBytes", arg: 2, scope: !424, file: !3, line: 100, type: !77)
!431 = !DILocation(line: 100, column: 52, scope: !424)
!432 = !DILocalVariable(name: "i", scope: !424, file: !3, line: 102, type: !77)
!433 = !DILocation(line: 102, column: 12, scope: !424)
!434 = !DILocation(line: 103, column: 12, scope: !435)
!435 = distinct !DILexicalBlock(scope: !424, file: !3, line: 103, column: 5)
!436 = !DILocation(line: 103, column: 10, scope: !435)
!437 = !DILocation(line: 103, column: 17, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !3, line: 103, column: 5)
!439 = !DILocation(line: 103, column: 21, scope: !438)
!440 = !DILocation(line: 103, column: 19, scope: !438)
!441 = !DILocation(line: 103, column: 5, scope: !435)
!442 = !DILocation(line: 105, column: 24, scope: !443)
!443 = distinct !DILexicalBlock(scope: !438, file: !3, line: 104, column: 5)
!444 = !DILocation(line: 105, column: 30, scope: !443)
!445 = !DILocation(line: 105, column: 9, scope: !443)
!446 = !DILocation(line: 106, column: 5, scope: !443)
!447 = !DILocation(line: 103, column: 31, scope: !438)
!448 = !DILocation(line: 103, column: 5, scope: !438)
!449 = distinct !{!449, !441, !450, !451}
!450 = !DILocation(line: 106, column: 5, scope: !435)
!451 = !{!"llvm.loop.mustprogress"}
!452 = !DILocation(line: 107, column: 5, scope: !424)
!453 = !DILocation(line: 108, column: 1, scope: !424)
!454 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !455, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!455 = !DISubroutineType(types: !456)
!456 = !{!77, !427, !77, !42}
!457 = !DILocalVariable(name: "bytes", arg: 1, scope: !454, file: !3, line: 113, type: !427)
!458 = !DILocation(line: 113, column: 39, scope: !454)
!459 = !DILocalVariable(name: "numBytes", arg: 2, scope: !454, file: !3, line: 113, type: !77)
!460 = !DILocation(line: 113, column: 53, scope: !454)
!461 = !DILocalVariable(name: "hex", arg: 3, scope: !454, file: !3, line: 113, type: !42)
!462 = !DILocation(line: 113, column: 71, scope: !454)
!463 = !DILocalVariable(name: "numWritten", scope: !454, file: !3, line: 115, type: !77)
!464 = !DILocation(line: 115, column: 12, scope: !454)
!465 = !DILocation(line: 121, column: 5, scope: !454)
!466 = !DILocation(line: 121, column: 12, scope: !454)
!467 = !DILocation(line: 121, column: 25, scope: !454)
!468 = !DILocation(line: 121, column: 23, scope: !454)
!469 = !DILocation(line: 121, column: 34, scope: !454)
!470 = !DILocation(line: 121, column: 37, scope: !454)
!471 = !DILocation(line: 121, column: 67, scope: !454)
!472 = !DILocation(line: 121, column: 70, scope: !454)
!473 = !DILocation(line: 0, scope: !454)
!474 = !DILocalVariable(name: "byte", scope: !475, file: !3, line: 123, type: !23)
!475 = distinct !DILexicalBlock(scope: !454, file: !3, line: 122, column: 5)
