; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_094/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_31.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_094/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_31_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 42, type: !66)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 40, column: 5)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DILocation(line: 42, column: 16, scope: !65)
!70 = !DILocation(line: 42, column: 33, scope: !65)
!71 = !DILocation(line: 42, column: 26, scope: !65)
!72 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 43, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !102, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 51, baseType: !23, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 54, baseType: !42, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 55, baseType: !42, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 56, baseType: !42, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 57, baseType: !42, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 58, baseType: !42, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 59, baseType: !42, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 60, baseType: !42, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 61, baseType: !42, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 64, baseType: !42, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 65, baseType: !42, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 66, baseType: !42, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 72, baseType: !23, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 73, baseType: !23, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 77, baseType: !24, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 153, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !76, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !77, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !76, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !77, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !76, file: !77, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !76, file: !77, line: 94, baseType: !22, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 95, baseType: !66, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 96, baseType: !23, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocation(line: 43, column: 16, scope: !65)
!129 = !DILocation(line: 45, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !65, file: !45, line: 45, column: 13)
!131 = !DILocation(line: 45, column: 16, scope: !130)
!132 = !DILocation(line: 45, column: 25, scope: !130)
!133 = !DILocation(line: 45, column: 13, scope: !65)
!134 = !DILocation(line: 47, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !45, line: 46, column: 9)
!136 = !DILocation(line: 47, column: 19, scope: !135)
!137 = !DILocation(line: 48, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !45, line: 48, column: 17)
!139 = !DILocation(line: 48, column: 23, scope: !138)
!140 = !DILocation(line: 48, column: 17, scope: !135)
!141 = !DILocation(line: 51, column: 27, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !45, line: 51, column: 21)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 49, column: 13)
!144 = !DILocation(line: 51, column: 32, scope: !142)
!145 = !DILocation(line: 51, column: 31, scope: !142)
!146 = !DILocation(line: 51, column: 51, scope: !142)
!147 = !DILocation(line: 51, column: 50, scope: !142)
!148 = !DILocation(line: 51, column: 41, scope: !142)
!149 = !DILocation(line: 51, column: 61, scope: !142)
!150 = !DILocation(line: 51, column: 21, scope: !142)
!151 = !DILocation(line: 51, column: 68, scope: !142)
!152 = !DILocation(line: 51, column: 21, scope: !143)
!153 = !DILocation(line: 53, column: 21, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !45, line: 52, column: 17)
!155 = !DILocation(line: 55, column: 21, scope: !154)
!156 = !DILocation(line: 55, column: 26, scope: !154)
!157 = !DILocation(line: 55, column: 35, scope: !154)
!158 = !DILocation(line: 56, column: 17, scope: !154)
!159 = !DILocation(line: 57, column: 24, scope: !143)
!160 = !DILocation(line: 57, column: 17, scope: !143)
!161 = !DILocation(line: 58, column: 13, scope: !143)
!162 = !DILocation(line: 59, column: 9, scope: !135)
!163 = !DILocalVariable(name: "dataCopy", scope: !164, file: !45, line: 62, type: !42)
!164 = distinct !DILexicalBlock(scope: !52, file: !45, line: 61, column: 5)
!165 = !DILocation(line: 62, column: 16, scope: !164)
!166 = !DILocation(line: 62, column: 27, scope: !164)
!167 = !DILocalVariable(name: "data", scope: !164, file: !45, line: 63, type: !42)
!168 = !DILocation(line: 63, column: 16, scope: !164)
!169 = !DILocation(line: 63, column: 23, scope: !164)
!170 = !DILocalVariable(name: "i", scope: !171, file: !45, line: 65, type: !23)
!171 = distinct !DILexicalBlock(scope: !164, file: !45, line: 64, column: 9)
!172 = !DILocation(line: 65, column: 17, scope: !171)
!173 = !DILocalVariable(name: "n", scope: !171, file: !45, line: 65, type: !23)
!174 = !DILocation(line: 65, column: 20, scope: !171)
!175 = !DILocalVariable(name: "intVariable", scope: !171, file: !45, line: 65, type: !23)
!176 = !DILocation(line: 65, column: 23, scope: !171)
!177 = !DILocation(line: 66, column: 24, scope: !178)
!178 = distinct !DILexicalBlock(scope: !171, file: !45, line: 66, column: 17)
!179 = !DILocation(line: 66, column: 17, scope: !178)
!180 = !DILocation(line: 66, column: 40, scope: !178)
!181 = !DILocation(line: 66, column: 17, scope: !171)
!182 = !DILocation(line: 69, column: 29, scope: !183)
!183 = distinct !DILexicalBlock(scope: !178, file: !45, line: 67, column: 13)
!184 = !DILocation(line: 70, column: 24, scope: !185)
!185 = distinct !DILexicalBlock(scope: !183, file: !45, line: 70, column: 17)
!186 = !DILocation(line: 70, column: 22, scope: !185)
!187 = !DILocation(line: 70, column: 29, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !45, line: 70, column: 17)
!189 = !DILocation(line: 70, column: 33, scope: !188)
!190 = !DILocation(line: 70, column: 31, scope: !188)
!191 = !DILocation(line: 70, column: 17, scope: !185)
!192 = !DILocation(line: 73, column: 32, scope: !193)
!193 = distinct !DILexicalBlock(scope: !188, file: !45, line: 71, column: 17)
!194 = !DILocation(line: 74, column: 17, scope: !193)
!195 = !DILocation(line: 70, column: 37, scope: !188)
!196 = !DILocation(line: 70, column: 17, scope: !188)
!197 = distinct !{!197, !191, !198, !199}
!198 = !DILocation(line: 74, column: 17, scope: !185)
!199 = !{!"llvm.loop.mustprogress"}
!200 = !DILocation(line: 75, column: 30, scope: !183)
!201 = !DILocation(line: 75, column: 17, scope: !183)
!202 = !DILocation(line: 76, column: 13, scope: !183)
!203 = !DILocation(line: 79, column: 1, scope: !52)
!204 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 86, type: !53, scopeLine: 87, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!205 = !DILocalVariable(name: "data", scope: !204, file: !45, line: 88, type: !42)
!206 = !DILocation(line: 88, column: 12, scope: !204)
!207 = !DILocalVariable(name: "dataBuffer", scope: !204, file: !45, line: 89, type: !58)
!208 = !DILocation(line: 89, column: 10, scope: !204)
!209 = !DILocation(line: 90, column: 12, scope: !204)
!210 = !DILocation(line: 90, column: 10, scope: !204)
!211 = !DILocation(line: 92, column: 12, scope: !204)
!212 = !DILocation(line: 92, column: 5, scope: !204)
!213 = !DILocalVariable(name: "dataCopy", scope: !214, file: !45, line: 94, type: !42)
!214 = distinct !DILexicalBlock(scope: !204, file: !45, line: 93, column: 5)
!215 = !DILocation(line: 94, column: 16, scope: !214)
!216 = !DILocation(line: 94, column: 27, scope: !214)
!217 = !DILocalVariable(name: "data", scope: !214, file: !45, line: 95, type: !42)
!218 = !DILocation(line: 95, column: 16, scope: !214)
!219 = !DILocation(line: 95, column: 23, scope: !214)
!220 = !DILocalVariable(name: "i", scope: !221, file: !45, line: 97, type: !23)
!221 = distinct !DILexicalBlock(scope: !214, file: !45, line: 96, column: 9)
!222 = !DILocation(line: 97, column: 17, scope: !221)
!223 = !DILocalVariable(name: "n", scope: !221, file: !45, line: 97, type: !23)
!224 = !DILocation(line: 97, column: 20, scope: !221)
!225 = !DILocalVariable(name: "intVariable", scope: !221, file: !45, line: 97, type: !23)
!226 = !DILocation(line: 97, column: 23, scope: !221)
!227 = !DILocation(line: 98, column: 24, scope: !228)
!228 = distinct !DILexicalBlock(scope: !221, file: !45, line: 98, column: 17)
!229 = !DILocation(line: 98, column: 17, scope: !228)
!230 = !DILocation(line: 98, column: 40, scope: !228)
!231 = !DILocation(line: 98, column: 17, scope: !221)
!232 = !DILocation(line: 101, column: 29, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !45, line: 99, column: 13)
!234 = !DILocation(line: 102, column: 24, scope: !235)
!235 = distinct !DILexicalBlock(scope: !233, file: !45, line: 102, column: 17)
!236 = !DILocation(line: 102, column: 22, scope: !235)
!237 = !DILocation(line: 102, column: 29, scope: !238)
!238 = distinct !DILexicalBlock(scope: !235, file: !45, line: 102, column: 17)
!239 = !DILocation(line: 102, column: 33, scope: !238)
!240 = !DILocation(line: 102, column: 31, scope: !238)
!241 = !DILocation(line: 102, column: 17, scope: !235)
!242 = !DILocation(line: 105, column: 32, scope: !243)
!243 = distinct !DILexicalBlock(scope: !238, file: !45, line: 103, column: 17)
!244 = !DILocation(line: 106, column: 17, scope: !243)
!245 = !DILocation(line: 102, column: 37, scope: !238)
!246 = !DILocation(line: 102, column: 17, scope: !238)
!247 = distinct !{!247, !241, !248, !199}
!248 = !DILocation(line: 106, column: 17, scope: !235)
!249 = !DILocation(line: 107, column: 30, scope: !233)
!250 = !DILocation(line: 107, column: 17, scope: !233)
!251 = !DILocation(line: 108, column: 13, scope: !233)
!252 = !DILocation(line: 111, column: 1, scope: !204)
!253 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 114, type: !53, scopeLine: 115, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!254 = !DILocalVariable(name: "data", scope: !253, file: !45, line: 116, type: !42)
!255 = !DILocation(line: 116, column: 12, scope: !253)
!256 = !DILocalVariable(name: "dataBuffer", scope: !253, file: !45, line: 117, type: !58)
!257 = !DILocation(line: 117, column: 10, scope: !253)
!258 = !DILocation(line: 118, column: 12, scope: !253)
!259 = !DILocation(line: 118, column: 10, scope: !253)
!260 = !DILocalVariable(name: "dataLen", scope: !261, file: !45, line: 121, type: !66)
!261 = distinct !DILexicalBlock(scope: !253, file: !45, line: 119, column: 5)
!262 = !DILocation(line: 121, column: 16, scope: !261)
!263 = !DILocation(line: 121, column: 33, scope: !261)
!264 = !DILocation(line: 121, column: 26, scope: !261)
!265 = !DILocalVariable(name: "pFile", scope: !261, file: !45, line: 122, type: !73)
!266 = !DILocation(line: 122, column: 16, scope: !261)
!267 = !DILocation(line: 124, column: 17, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !45, line: 124, column: 13)
!269 = !DILocation(line: 124, column: 16, scope: !268)
!270 = !DILocation(line: 124, column: 25, scope: !268)
!271 = !DILocation(line: 124, column: 13, scope: !261)
!272 = !DILocation(line: 126, column: 21, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !45, line: 125, column: 9)
!274 = !DILocation(line: 126, column: 19, scope: !273)
!275 = !DILocation(line: 127, column: 17, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !45, line: 127, column: 17)
!277 = !DILocation(line: 127, column: 23, scope: !276)
!278 = !DILocation(line: 127, column: 17, scope: !273)
!279 = !DILocation(line: 130, column: 27, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !45, line: 130, column: 21)
!281 = distinct !DILexicalBlock(scope: !276, file: !45, line: 128, column: 13)
!282 = !DILocation(line: 130, column: 32, scope: !280)
!283 = !DILocation(line: 130, column: 31, scope: !280)
!284 = !DILocation(line: 130, column: 51, scope: !280)
!285 = !DILocation(line: 130, column: 50, scope: !280)
!286 = !DILocation(line: 130, column: 41, scope: !280)
!287 = !DILocation(line: 130, column: 61, scope: !280)
!288 = !DILocation(line: 130, column: 21, scope: !280)
!289 = !DILocation(line: 130, column: 68, scope: !280)
!290 = !DILocation(line: 130, column: 21, scope: !281)
!291 = !DILocation(line: 132, column: 21, scope: !292)
!292 = distinct !DILexicalBlock(scope: !280, file: !45, line: 131, column: 17)
!293 = !DILocation(line: 134, column: 21, scope: !292)
!294 = !DILocation(line: 134, column: 26, scope: !292)
!295 = !DILocation(line: 134, column: 35, scope: !292)
!296 = !DILocation(line: 135, column: 17, scope: !292)
!297 = !DILocation(line: 136, column: 24, scope: !281)
!298 = !DILocation(line: 136, column: 17, scope: !281)
!299 = !DILocation(line: 137, column: 13, scope: !281)
!300 = !DILocation(line: 138, column: 9, scope: !273)
!301 = !DILocalVariable(name: "dataCopy", scope: !302, file: !45, line: 141, type: !42)
!302 = distinct !DILexicalBlock(scope: !253, file: !45, line: 140, column: 5)
!303 = !DILocation(line: 141, column: 16, scope: !302)
!304 = !DILocation(line: 141, column: 27, scope: !302)
!305 = !DILocalVariable(name: "data", scope: !302, file: !45, line: 142, type: !42)
!306 = !DILocation(line: 142, column: 16, scope: !302)
!307 = !DILocation(line: 142, column: 23, scope: !302)
!308 = !DILocalVariable(name: "i", scope: !309, file: !45, line: 144, type: !23)
!309 = distinct !DILexicalBlock(scope: !302, file: !45, line: 143, column: 9)
!310 = !DILocation(line: 144, column: 17, scope: !309)
!311 = !DILocalVariable(name: "n", scope: !309, file: !45, line: 144, type: !23)
!312 = !DILocation(line: 144, column: 20, scope: !309)
!313 = !DILocalVariable(name: "intVariable", scope: !309, file: !45, line: 144, type: !23)
!314 = !DILocation(line: 144, column: 23, scope: !309)
!315 = !DILocation(line: 145, column: 24, scope: !316)
!316 = distinct !DILexicalBlock(scope: !309, file: !45, line: 145, column: 17)
!317 = !DILocation(line: 145, column: 17, scope: !316)
!318 = !DILocation(line: 145, column: 40, scope: !316)
!319 = !DILocation(line: 145, column: 17, scope: !309)
!320 = !DILocation(line: 148, column: 21, scope: !321)
!321 = distinct !DILexicalBlock(scope: !322, file: !45, line: 148, column: 21)
!322 = distinct !DILexicalBlock(scope: !316, file: !45, line: 146, column: 13)
!323 = !DILocation(line: 148, column: 23, scope: !321)
!324 = !DILocation(line: 148, column: 21, scope: !322)
!325 = !DILocation(line: 150, column: 33, scope: !326)
!326 = distinct !DILexicalBlock(scope: !321, file: !45, line: 149, column: 17)
!327 = !DILocation(line: 151, column: 28, scope: !328)
!328 = distinct !DILexicalBlock(scope: !326, file: !45, line: 151, column: 21)
!329 = !DILocation(line: 151, column: 26, scope: !328)
!330 = !DILocation(line: 151, column: 33, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !45, line: 151, column: 21)
!332 = !DILocation(line: 151, column: 37, scope: !331)
!333 = !DILocation(line: 151, column: 35, scope: !331)
!334 = !DILocation(line: 151, column: 21, scope: !328)
!335 = !DILocation(line: 154, column: 36, scope: !336)
!336 = distinct !DILexicalBlock(scope: !331, file: !45, line: 152, column: 21)
!337 = !DILocation(line: 155, column: 21, scope: !336)
!338 = !DILocation(line: 151, column: 41, scope: !331)
!339 = !DILocation(line: 151, column: 21, scope: !331)
!340 = distinct !{!340, !334, !341, !199}
!341 = !DILocation(line: 155, column: 21, scope: !328)
!342 = !DILocation(line: 156, column: 34, scope: !326)
!343 = !DILocation(line: 156, column: 21, scope: !326)
!344 = !DILocation(line: 157, column: 17, scope: !326)
!345 = !DILocation(line: 158, column: 13, scope: !322)
!346 = !DILocation(line: 161, column: 1, scope: !253)
!347 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_31_good", scope: !45, file: !45, line: 163, type: !53, scopeLine: 164, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!348 = !DILocation(line: 165, column: 5, scope: !347)
!349 = !DILocation(line: 166, column: 5, scope: !347)
!350 = !DILocation(line: 167, column: 1, scope: !347)
!351 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !352, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!352 = !DISubroutineType(types: !353)
!353 = !{null, !42}
!354 = !DILocalVariable(name: "line", arg: 1, scope: !351, file: !3, line: 11, type: !42)
!355 = !DILocation(line: 11, column: 25, scope: !351)
!356 = !DILocation(line: 13, column: 1, scope: !351)
!357 = !DILocation(line: 14, column: 8, scope: !358)
!358 = distinct !DILexicalBlock(scope: !351, file: !3, line: 14, column: 8)
!359 = !DILocation(line: 14, column: 13, scope: !358)
!360 = !DILocation(line: 14, column: 8, scope: !351)
!361 = !DILocation(line: 16, column: 24, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !3, line: 15, column: 5)
!363 = !DILocation(line: 16, column: 9, scope: !362)
!364 = !DILocation(line: 17, column: 5, scope: !362)
!365 = !DILocation(line: 18, column: 5, scope: !351)
!366 = !DILocation(line: 19, column: 1, scope: !351)
!367 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !352, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!368 = !DILocalVariable(name: "line", arg: 1, scope: !367, file: !3, line: 20, type: !42)
!369 = !DILocation(line: 20, column: 29, scope: !367)
!370 = !DILocation(line: 22, column: 8, scope: !371)
!371 = distinct !DILexicalBlock(scope: !367, file: !3, line: 22, column: 8)
!372 = !DILocation(line: 22, column: 13, scope: !371)
!373 = !DILocation(line: 22, column: 8, scope: !367)
!374 = !DILocation(line: 24, column: 24, scope: !375)
!375 = distinct !DILexicalBlock(scope: !371, file: !3, line: 23, column: 5)
!376 = !DILocation(line: 24, column: 9, scope: !375)
!377 = !DILocation(line: 25, column: 5, scope: !375)
!378 = !DILocation(line: 26, column: 1, scope: !367)
!379 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !380, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382}
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64)
!383 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !67, line: 74, baseType: !23)
!384 = !DILocalVariable(name: "line", arg: 1, scope: !379, file: !3, line: 27, type: !382)
!385 = !DILocation(line: 27, column: 29, scope: !379)
!386 = !DILocation(line: 29, column: 8, scope: !387)
!387 = distinct !DILexicalBlock(scope: !379, file: !3, line: 29, column: 8)
!388 = !DILocation(line: 29, column: 13, scope: !387)
!389 = !DILocation(line: 29, column: 8, scope: !379)
!390 = !DILocation(line: 31, column: 27, scope: !391)
!391 = distinct !DILexicalBlock(scope: !387, file: !3, line: 30, column: 5)
!392 = !DILocation(line: 31, column: 9, scope: !391)
!393 = !DILocation(line: 32, column: 5, scope: !391)
!394 = !DILocation(line: 33, column: 1, scope: !379)
!395 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !396, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !23}
!398 = !DILocalVariable(name: "intNumber", arg: 1, scope: !395, file: !3, line: 35, type: !23)
!399 = !DILocation(line: 35, column: 24, scope: !395)
!400 = !DILocation(line: 37, column: 20, scope: !395)
!401 = !DILocation(line: 37, column: 5, scope: !395)
!402 = !DILocation(line: 38, column: 1, scope: !395)
!403 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !404, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !406}
!406 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!407 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !403, file: !3, line: 40, type: !406)
!408 = !DILocation(line: 40, column: 28, scope: !403)
!409 = !DILocation(line: 42, column: 21, scope: !403)
!410 = !DILocation(line: 42, column: 5, scope: !403)
!411 = !DILocation(line: 43, column: 1, scope: !403)
!412 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !413, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !415}
!415 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!416 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !412, file: !3, line: 45, type: !415)
!417 = !DILocation(line: 45, column: 28, scope: !412)
!418 = !DILocation(line: 47, column: 20, scope: !412)
!419 = !DILocation(line: 47, column: 5, scope: !412)
!420 = !DILocation(line: 48, column: 1, scope: !412)
!421 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !422, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !101}
!424 = !DILocalVariable(name: "longNumber", arg: 1, scope: !421, file: !3, line: 50, type: !101)
!425 = !DILocation(line: 50, column: 26, scope: !421)
!426 = !DILocation(line: 52, column: 21, scope: !421)
!427 = !DILocation(line: 52, column: 5, scope: !421)
!428 = !DILocation(line: 53, column: 1, scope: !421)
!429 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !430, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !432}
!432 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !433, line: 27, baseType: !434)
!433 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!434 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !100, line: 44, baseType: !101)
!435 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !429, file: !3, line: 55, type: !432)
!436 = !DILocation(line: 55, column: 33, scope: !429)
!437 = !DILocation(line: 57, column: 29, scope: !429)
!438 = !DILocation(line: 57, column: 5, scope: !429)
!439 = !DILocation(line: 58, column: 1, scope: !429)
!440 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !441, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !66}
!443 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !440, file: !3, line: 60, type: !66)
!444 = !DILocation(line: 60, column: 29, scope: !440)
!445 = !DILocation(line: 62, column: 21, scope: !440)
!446 = !DILocation(line: 62, column: 5, scope: !440)
!447 = !DILocation(line: 63, column: 1, scope: !440)
!448 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !449, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !43}
!451 = !DILocalVariable(name: "charHex", arg: 1, scope: !448, file: !3, line: 65, type: !43)
!452 = !DILocation(line: 65, column: 29, scope: !448)
!453 = !DILocation(line: 67, column: 22, scope: !448)
!454 = !DILocation(line: 67, column: 5, scope: !448)
!455 = !DILocation(line: 68, column: 1, scope: !448)
!456 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !457, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!457 = !DISubroutineType(types: !458)
!458 = !{null, !383}
!459 = !DILocalVariable(name: "wideChar", arg: 1, scope: !456, file: !3, line: 70, type: !383)
!460 = !DILocation(line: 70, column: 29, scope: !456)
!461 = !DILocalVariable(name: "s", scope: !456, file: !3, line: 74, type: !462)
!462 = !DICompositeType(tag: DW_TAG_array_type, baseType: !383, size: 64, elements: !463)
!463 = !{!464}
!464 = !DISubrange(count: 2)
!465 = !DILocation(line: 74, column: 13, scope: !456)
!466 = !DILocation(line: 75, column: 16, scope: !456)
!467 = !DILocation(line: 75, column: 9, scope: !456)
!468 = !DILocation(line: 75, column: 14, scope: !456)
!469 = !DILocation(line: 76, column: 9, scope: !456)
!470 = !DILocation(line: 76, column: 14, scope: !456)
!471 = !DILocation(line: 77, column: 21, scope: !456)
!472 = !DILocation(line: 77, column: 5, scope: !456)
!473 = !DILocation(line: 78, column: 1, scope: !456)
!474 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !475, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !7}
!477 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !474, file: !3, line: 80, type: !7)
!478 = !DILocation(line: 80, column: 33, scope: !474)
!479 = !DILocation(line: 82, column: 20, scope: !474)
!480 = !DILocation(line: 82, column: 5, scope: !474)
!481 = !DILocation(line: 83, column: 1, scope: !474)
!482 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !483, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !25}
!485 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !482, file: !3, line: 85, type: !25)
!486 = !DILocation(line: 85, column: 45, scope: !482)
!487 = !DILocation(line: 87, column: 22, scope: !482)
!488 = !DILocation(line: 87, column: 5, scope: !482)
!489 = !DILocation(line: 88, column: 1, scope: !482)
!490 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !491, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !493}
!493 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!494 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !490, file: !3, line: 90, type: !493)
!495 = !DILocation(line: 90, column: 29, scope: !490)
!496 = !DILocation(line: 92, column: 20, scope: !490)
!497 = !DILocation(line: 92, column: 5, scope: !490)
!498 = !DILocation(line: 93, column: 1, scope: !490)
!499 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !500, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !502}
!502 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !504, line: 100, baseType: !505)
!504 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_094/source_code")
!505 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !504, line: 96, size: 64, elements: !506)
!506 = !{!507, !508}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !505, file: !504, line: 98, baseType: !23, size: 32)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !505, file: !504, line: 99, baseType: !23, size: 32, offset: 32)
!509 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !499, file: !3, line: 95, type: !502)
!510 = !DILocation(line: 95, column: 40, scope: !499)
!511 = !DILocation(line: 97, column: 26, scope: !499)
!512 = !DILocation(line: 97, column: 47, scope: !499)
!513 = !DILocation(line: 97, column: 55, scope: !499)
!514 = !DILocation(line: 97, column: 76, scope: !499)
!515 = !DILocation(line: 97, column: 5, scope: !499)
!516 = !DILocation(line: 98, column: 1, scope: !499)
!517 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !518, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !520, !66}
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!521 = !DILocalVariable(name: "bytes", arg: 1, scope: !517, file: !3, line: 100, type: !520)
!522 = !DILocation(line: 100, column: 38, scope: !517)
!523 = !DILocalVariable(name: "numBytes", arg: 2, scope: !517, file: !3, line: 100, type: !66)
!524 = !DILocation(line: 100, column: 52, scope: !517)
!525 = !DILocalVariable(name: "i", scope: !517, file: !3, line: 102, type: !66)
!526 = !DILocation(line: 102, column: 12, scope: !517)
!527 = !DILocation(line: 103, column: 12, scope: !528)
!528 = distinct !DILexicalBlock(scope: !517, file: !3, line: 103, column: 5)
!529 = !DILocation(line: 103, column: 10, scope: !528)
!530 = !DILocation(line: 103, column: 17, scope: !531)
!531 = distinct !DILexicalBlock(scope: !528, file: !3, line: 103, column: 5)
!532 = !DILocation(line: 103, column: 21, scope: !531)
!533 = !DILocation(line: 103, column: 19, scope: !531)
!534 = !DILocation(line: 103, column: 5, scope: !528)
!535 = !DILocation(line: 105, column: 24, scope: !536)
!536 = distinct !DILexicalBlock(scope: !531, file: !3, line: 104, column: 5)
!537 = !DILocation(line: 105, column: 30, scope: !536)
!538 = !DILocation(line: 105, column: 9, scope: !536)
!539 = !DILocation(line: 106, column: 5, scope: !536)
!540 = !DILocation(line: 103, column: 31, scope: !531)
!541 = !DILocation(line: 103, column: 5, scope: !531)
!542 = distinct !{!542, !534, !543, !199}
!543 = !DILocation(line: 106, column: 5, scope: !528)
!544 = !DILocation(line: 107, column: 5, scope: !517)
!545 = !DILocation(line: 108, column: 1, scope: !517)
!546 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !547, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!547 = !DISubroutineType(types: !548)
!548 = !{!66, !520, !66, !42}
!549 = !DILocalVariable(name: "bytes", arg: 1, scope: !546, file: !3, line: 113, type: !520)
!550 = !DILocation(line: 113, column: 39, scope: !546)
!551 = !DILocalVariable(name: "numBytes", arg: 2, scope: !546, file: !3, line: 113, type: !66)
!552 = !DILocation(line: 113, column: 53, scope: !546)
!553 = !DILocalVariable(name: "hex", arg: 3, scope: !546, file: !3, line: 113, type: !42)
!554 = !DILocation(line: 113, column: 71, scope: !546)
!555 = !DILocalVariable(name: "numWritten", scope: !546, file: !3, line: 115, type: !66)
!556 = !DILocation(line: 115, column: 12, scope: !546)
!557 = !DILocation(line: 121, column: 5, scope: !546)
!558 = !DILocation(line: 121, column: 12, scope: !546)
!559 = !DILocation(line: 121, column: 25, scope: !546)
!560 = !DILocation(line: 121, column: 23, scope: !546)
!561 = !DILocation(line: 121, column: 34, scope: !546)
!562 = !DILocation(line: 121, column: 37, scope: !546)
!563 = !DILocation(line: 121, column: 67, scope: !546)
!564 = !DILocation(line: 121, column: 70, scope: !546)
!565 = !DILocation(line: 0, scope: !546)
!566 = !DILocalVariable(name: "byte", scope: !567, file: !3, line: 123, type: !23)
!567 = distinct !DILexicalBlock(scope: !546, file: !3, line: 122, column: 5)
!568 = !DILocation(line: 123, column: 13, scope: !567)
