; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_07.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_07.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@staticFive = dso_local global i32 5, align 4, !dbg !0
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_07_bad() #0 !dbg !13 {
entry:
  %data = alloca i8*, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "staticFive", scope: !2, file: !3, line: 36, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_07.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_080/source_code")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0}
!9 = !{i32 7, !"Dwarf Version", i32 4}
!10 = !{i32 2, !"Debug Info Version", i32 3}
!11 = !{i32 1, !"wchar_size", i32 4}
!12 = !{!"clang version 12.0.0"}
!13 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_07_bad", scope: !3, file: !3, line: 40, type: !14, scopeLine: 41, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!14 = !DISubroutineType(types: !15)
!15 = !{null}
!16 = !DILocalVariable(name: "data", scope: !13, file: !3, line: 42, type: !17)
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !18, size: 64)
!18 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!19 = !DILocation(line: 42, column: 12, scope: !13)
!20 = !DILocalVariable(name: "dataBuffer", scope: !13, file: !3, line: 43, type: !21)
!21 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 800, elements: !22)
!22 = !{!23}
!23 = !DISubrange(count: 100)
!24 = !DILocation(line: 43, column: 10, scope: !13)
!25 = !DILocation(line: 44, column: 12, scope: !13)
!26 = !DILocation(line: 44, column: 10, scope: !13)
!27 = !DILocation(line: 45, column: 8, scope: !28)
!28 = distinct !DILexicalBlock(scope: !13, file: !3, line: 45, column: 8)
!29 = !DILocation(line: 45, column: 18, scope: !28)
!30 = !DILocation(line: 45, column: 8, scope: !13)
!31 = !DILocalVariable(name: "dataLen", scope: !32, file: !3, line: 49, type: !34)
!32 = distinct !DILexicalBlock(scope: !33, file: !3, line: 47, column: 9)
!33 = distinct !DILexicalBlock(scope: !28, file: !3, line: 46, column: 5)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DILocation(line: 49, column: 20, scope: !32)
!38 = !DILocation(line: 49, column: 37, scope: !32)
!39 = !DILocation(line: 49, column: 30, scope: !32)
!40 = !DILocalVariable(name: "pFile", scope: !32, file: !3, line: 50, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !43, line: 7, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !62, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !91, !92, !93}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !44, file: !45, line: 51, baseType: !7, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !44, file: !45, line: 54, baseType: !17, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !44, file: !45, line: 55, baseType: !17, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !44, file: !45, line: 56, baseType: !17, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !44, file: !45, line: 57, baseType: !17, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !44, file: !45, line: 58, baseType: !17, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !44, file: !45, line: 59, baseType: !17, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !44, file: !45, line: 60, baseType: !17, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !44, file: !45, line: 61, baseType: !17, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !44, file: !45, line: 64, baseType: !17, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !44, file: !45, line: 65, baseType: !17, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !44, file: !45, line: 66, baseType: !17, size: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !44, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !45, line: 36, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !44, file: !45, line: 70, baseType: !63, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !44, file: !45, line: 72, baseType: !7, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !44, file: !45, line: 73, baseType: !7, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !44, file: !45, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !44, file: !45, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !44, file: !45, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !44, file: !45, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !44, file: !45, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !45, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !44, file: !45, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !44, file: !45, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !45, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !44, file: !45, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !45, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !44, file: !45, line: 93, baseType: !63, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !44, file: !45, line: 94, baseType: !6, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !44, file: !45, line: 95, baseType: !34, size: 64, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !44, file: !45, line: 96, baseType: !7, size: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !44, file: !45, line: 98, baseType: !94, size: 160, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !18, size: 160, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DILocation(line: 50, column: 20, scope: !32)
!98 = !DILocation(line: 52, column: 21, scope: !99)
!99 = distinct !DILexicalBlock(scope: !32, file: !3, line: 52, column: 17)
!100 = !DILocation(line: 52, column: 20, scope: !99)
!101 = !DILocation(line: 52, column: 29, scope: !99)
!102 = !DILocation(line: 52, column: 17, scope: !32)
!103 = !DILocation(line: 54, column: 25, scope: !104)
!104 = distinct !DILexicalBlock(scope: !99, file: !3, line: 53, column: 13)
!105 = !DILocation(line: 54, column: 23, scope: !104)
!106 = !DILocation(line: 55, column: 21, scope: !107)
!107 = distinct !DILexicalBlock(scope: !104, file: !3, line: 55, column: 21)
!108 = !DILocation(line: 55, column: 27, scope: !107)
!109 = !DILocation(line: 55, column: 21, scope: !104)
!110 = !DILocation(line: 58, column: 31, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !3, line: 58, column: 25)
!112 = distinct !DILexicalBlock(scope: !107, file: !3, line: 56, column: 17)
!113 = !DILocation(line: 58, column: 36, scope: !111)
!114 = !DILocation(line: 58, column: 35, scope: !111)
!115 = !DILocation(line: 58, column: 55, scope: !111)
!116 = !DILocation(line: 58, column: 54, scope: !111)
!117 = !DILocation(line: 58, column: 45, scope: !111)
!118 = !DILocation(line: 58, column: 65, scope: !111)
!119 = !DILocation(line: 58, column: 25, scope: !111)
!120 = !DILocation(line: 58, column: 72, scope: !111)
!121 = !DILocation(line: 58, column: 25, scope: !112)
!122 = !DILocation(line: 60, column: 25, scope: !123)
!123 = distinct !DILexicalBlock(scope: !111, file: !3, line: 59, column: 21)
!124 = !DILocation(line: 62, column: 25, scope: !123)
!125 = !DILocation(line: 62, column: 30, scope: !123)
!126 = !DILocation(line: 62, column: 39, scope: !123)
!127 = !DILocation(line: 63, column: 21, scope: !123)
!128 = !DILocation(line: 64, column: 28, scope: !112)
!129 = !DILocation(line: 64, column: 21, scope: !112)
!130 = !DILocation(line: 65, column: 17, scope: !112)
!131 = !DILocation(line: 66, column: 13, scope: !104)
!132 = !DILocation(line: 68, column: 5, scope: !33)
!133 = !DILocation(line: 69, column: 8, scope: !134)
!134 = distinct !DILexicalBlock(scope: !13, file: !3, line: 69, column: 8)
!135 = !DILocation(line: 69, column: 18, scope: !134)
!136 = !DILocation(line: 69, column: 8, scope: !13)
!137 = !DILocalVariable(name: "i", scope: !138, file: !3, line: 72, type: !7)
!138 = distinct !DILexicalBlock(scope: !139, file: !3, line: 71, column: 9)
!139 = distinct !DILexicalBlock(scope: !134, file: !3, line: 70, column: 5)
!140 = !DILocation(line: 72, column: 17, scope: !138)
!141 = !DILocalVariable(name: "n", scope: !138, file: !3, line: 72, type: !7)
!142 = !DILocation(line: 72, column: 20, scope: !138)
!143 = !DILocalVariable(name: "intVariable", scope: !138, file: !3, line: 72, type: !7)
!144 = !DILocation(line: 72, column: 23, scope: !138)
!145 = !DILocation(line: 73, column: 24, scope: !146)
!146 = distinct !DILexicalBlock(scope: !138, file: !3, line: 73, column: 17)
!147 = !DILocation(line: 73, column: 17, scope: !146)
!148 = !DILocation(line: 73, column: 40, scope: !146)
!149 = !DILocation(line: 73, column: 17, scope: !138)
!150 = !DILocation(line: 76, column: 29, scope: !151)
!151 = distinct !DILexicalBlock(scope: !146, file: !3, line: 74, column: 13)
!152 = !DILocation(line: 77, column: 24, scope: !153)
!153 = distinct !DILexicalBlock(scope: !151, file: !3, line: 77, column: 17)
!154 = !DILocation(line: 77, column: 22, scope: !153)
!155 = !DILocation(line: 77, column: 29, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !3, line: 77, column: 17)
!157 = !DILocation(line: 77, column: 33, scope: !156)
!158 = !DILocation(line: 77, column: 31, scope: !156)
!159 = !DILocation(line: 77, column: 17, scope: !153)
