; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%union.CWE134_Uncontrolled_Format_String__char_file_vprintf_34_unionType = type { i8* }
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_TRUE", scope: !2, file: !3, line: 174, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_177/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_34.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_177/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badVaSink", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !42, null}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 23, scope: !52)
!57 = !DILocalVariable(name: "args", scope: !58, file: !45, line: 38, type: !59)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 37, column: 5)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !60, line: 52, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !62, line: 32, baseType: !63)
!62 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !45, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 192, elements: !71)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !65, file: !45, line: 38, baseType: !7, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !65, file: !45, line: 38, baseType: !7, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !65, file: !45, line: 38, baseType: !22, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !65, file: !45, line: 38, baseType: !22, size: 64, offset: 128)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DILocation(line: 38, column: 17, scope: !58)
!74 = !DILocation(line: 39, column: 9, scope: !58)
!75 = !DILocation(line: 41, column: 17, scope: !58)
!76 = !DILocation(line: 41, column: 23, scope: !58)
!77 = !DILocation(line: 41, column: 9, scope: !58)
!78 = !DILocation(line: 42, column: 9, scope: !58)
!79 = !DILocation(line: 44, column: 1, scope: !52)
!80 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_34_bad", scope: !45, file: !45, line: 46, type: !81, scopeLine: 47, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!81 = !DISubroutineType(types: !82)
!82 = !{null}
!83 = !DILocalVariable(name: "data", scope: !80, file: !45, line: 48, type: !42)
!84 = !DILocation(line: 48, column: 12, scope: !80)
!85 = !DILocalVariable(name: "dataBuffer", scope: !80, file: !45, line: 49, type: !86)
!86 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !87)
!87 = !{!88}
!88 = !DISubrange(count: 100)
!89 = !DILocation(line: 49, column: 10, scope: !80)
!90 = !DILocation(line: 50, column: 12, scope: !80)
!91 = !DILocation(line: 50, column: 10, scope: !80)
!92 = !DILocalVariable(name: "dataLen", scope: !93, file: !45, line: 53, type: !94)
!93 = distinct !DILexicalBlock(scope: !80, file: !45, line: 51, column: 5)
!94 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !95, line: 46, baseType: !96)
!95 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!96 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!97 = !DILocation(line: 53, column: 16, scope: !93)
!98 = !DILocation(line: 53, column: 33, scope: !93)
!99 = !DILocation(line: 53, column: 26, scope: !93)
!100 = !DILocalVariable(name: "pFile", scope: !93, file: !45, line: 54, type: !101)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !103, line: 7, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!104 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !105, line: 49, size: 1728, elements: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!106 = !{!107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119, !122, !124, !125, !126, !130, !131, !133, !135, !138, !140, !143, !146, !147, !148, !149, !150}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !104, file: !105, line: 51, baseType: !23, size: 32)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !104, file: !105, line: 54, baseType: !42, size: 64, offset: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !104, file: !105, line: 55, baseType: !42, size: 64, offset: 128)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !104, file: !105, line: 56, baseType: !42, size: 64, offset: 192)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !104, file: !105, line: 57, baseType: !42, size: 64, offset: 256)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !104, file: !105, line: 58, baseType: !42, size: 64, offset: 320)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !104, file: !105, line: 59, baseType: !42, size: 64, offset: 384)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !104, file: !105, line: 60, baseType: !42, size: 64, offset: 448)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !104, file: !105, line: 61, baseType: !42, size: 64, offset: 512)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !104, file: !105, line: 64, baseType: !42, size: 64, offset: 576)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !104, file: !105, line: 65, baseType: !42, size: 64, offset: 640)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !104, file: !105, line: 66, baseType: !42, size: 64, offset: 704)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !104, file: !105, line: 68, baseType: !120, size: 64, offset: 768)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !105, line: 36, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !104, file: !105, line: 70, baseType: !123, size: 64, offset: 832)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !104, file: !105, line: 72, baseType: !23, size: 32, offset: 896)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !104, file: !105, line: 73, baseType: !23, size: 32, offset: 928)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !104, file: !105, line: 74, baseType: !127, size: 64, offset: 960)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !128, line: 152, baseType: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!129 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !104, file: !105, line: 77, baseType: !24, size: 16, offset: 1024)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !104, file: !105, line: 78, baseType: !132, size: 8, offset: 1040)
!132 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !104, file: !105, line: 79, baseType: !134, size: 8, offset: 1048)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !71)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !104, file: !105, line: 81, baseType: !136, size: 64, offset: 1088)
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !105, line: 43, baseType: null)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !104, file: !105, line: 89, baseType: !139, size: 64, offset: 1152)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !128, line: 153, baseType: !129)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !104, file: !105, line: 91, baseType: !141, size: 64, offset: 1216)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64)
!142 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !105, line: 37, flags: DIFlagFwdDecl)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !104, file: !105, line: 92, baseType: !144, size: 64, offset: 1280)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !145, size: 64)
!145 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !105, line: 38, flags: DIFlagFwdDecl)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !104, file: !105, line: 93, baseType: !123, size: 64, offset: 1344)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !104, file: !105, line: 94, baseType: !22, size: 64, offset: 1408)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !104, file: !105, line: 95, baseType: !94, size: 64, offset: 1472)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !104, file: !105, line: 96, baseType: !23, size: 32, offset: 1536)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !104, file: !105, line: 98, baseType: !151, size: 160, offset: 1568)
!151 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !152)
!152 = !{!153}
!153 = !DISubrange(count: 20)
!154 = !DILocation(line: 54, column: 16, scope: !93)
!155 = !DILocation(line: 56, column: 17, scope: !156)
!156 = distinct !DILexicalBlock(scope: !93, file: !45, line: 56, column: 13)
!157 = !DILocation(line: 56, column: 16, scope: !156)
!158 = !DILocation(line: 56, column: 25, scope: !156)
!159 = !DILocation(line: 56, column: 13, scope: !93)
!160 = !DILocation(line: 58, column: 21, scope: !161)
!161 = distinct !DILexicalBlock(scope: !156, file: !45, line: 57, column: 9)
!162 = !DILocation(line: 58, column: 19, scope: !161)
!163 = !DILocation(line: 59, column: 17, scope: !164)
!164 = distinct !DILexicalBlock(scope: !161, file: !45, line: 59, column: 17)
!165 = !DILocation(line: 59, column: 23, scope: !164)
!166 = !DILocation(line: 59, column: 17, scope: !161)
!167 = !DILocation(line: 62, column: 27, scope: !168)
!168 = distinct !DILexicalBlock(scope: !169, file: !45, line: 62, column: 21)
!169 = distinct !DILexicalBlock(scope: !164, file: !45, line: 60, column: 13)
!170 = !DILocation(line: 62, column: 32, scope: !168)
!171 = !DILocation(line: 62, column: 31, scope: !168)
!172 = !DILocation(line: 62, column: 51, scope: !168)
!173 = !DILocation(line: 62, column: 50, scope: !168)
!174 = !DILocation(line: 62, column: 41, scope: !168)
!175 = !DILocation(line: 62, column: 61, scope: !168)
!176 = !DILocation(line: 62, column: 21, scope: !168)
!177 = !DILocation(line: 62, column: 68, scope: !168)
!178 = !DILocation(line: 62, column: 21, scope: !169)
!179 = !DILocation(line: 64, column: 21, scope: !180)
!180 = distinct !DILexicalBlock(scope: !168, file: !45, line: 63, column: 17)
!181 = !DILocation(line: 66, column: 21, scope: !180)
!182 = !DILocation(line: 66, column: 26, scope: !180)
!183 = !DILocation(line: 66, column: 35, scope: !180)
!184 = !DILocation(line: 67, column: 17, scope: !180)
!185 = !DILocation(line: 68, column: 24, scope: !169)
!186 = !DILocation(line: 68, column: 17, scope: !169)
!187 = !DILocation(line: 69, column: 13, scope: !169)
!188 = !DILocation(line: 70, column: 9, scope: !161)
!189 = !DILocalVariable(name: "dataCopy", scope: !190, file: !45, line: 73, type: !42)
!190 = distinct !DILexicalBlock(scope: !80, file: !45, line: 72, column: 5)
!191 = !DILocation(line: 73, column: 16, scope: !190)
!192 = !DILocation(line: 73, column: 27, scope: !190)
!193 = !DILocalVariable(name: "data", scope: !190, file: !45, line: 74, type: !42)
!194 = !DILocation(line: 74, column: 16, scope: !190)
!195 = !DILocation(line: 74, column: 23, scope: !190)
!196 = !DILocation(line: 75, column: 19, scope: !190)
!197 = !DILocation(line: 75, column: 25, scope: !190)
!198 = !DILocation(line: 75, column: 9, scope: !190)
!199 = !DILocation(line: 77, column: 1, scope: !80)
!200 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !45, file: !45, line: 84, type: !53, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!201 = !DILocalVariable(name: "data", arg: 1, scope: !200, file: !45, line: 84, type: !42)
!202 = !DILocation(line: 84, column: 27, scope: !200)
!203 = !DILocalVariable(name: "args", scope: !204, file: !45, line: 87, type: !59)
!204 = distinct !DILexicalBlock(scope: !200, file: !45, line: 86, column: 5)
!205 = !DILocation(line: 87, column: 17, scope: !204)
!206 = !DILocation(line: 88, column: 9, scope: !204)
!207 = !DILocation(line: 90, column: 17, scope: !204)
!208 = !DILocation(line: 90, column: 23, scope: !204)
!209 = !DILocation(line: 90, column: 9, scope: !204)
!210 = !DILocation(line: 91, column: 9, scope: !204)
!211 = !DILocation(line: 93, column: 1, scope: !200)
!212 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 95, type: !81, scopeLine: 96, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!213 = !DILocalVariable(name: "data", scope: !212, file: !45, line: 97, type: !42)
!214 = !DILocation(line: 97, column: 12, scope: !212)
!215 = !DILocalVariable(name: "myUnion", scope: !212, file: !45, line: 98, type: !216)
!216 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_34_unionType", file: !217, line: 9, baseType: !218)
!217 = !DIFile(filename: "./_costom_header_.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_177/source_code")
!218 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !217, line: 5, size: 64, elements: !219)
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "unionFirst", scope: !218, file: !217, line: 7, baseType: !42, size: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "unionSecond", scope: !218, file: !217, line: 8, baseType: !42, size: 64)
!222 = !DILocation(line: 98, column: 71, scope: !212)
!223 = !DILocalVariable(name: "dataBuffer", scope: !212, file: !45, line: 99, type: !86)
!224 = !DILocation(line: 99, column: 10, scope: !212)
!225 = !DILocation(line: 100, column: 12, scope: !212)
!226 = !DILocation(line: 100, column: 10, scope: !212)
!227 = !DILocation(line: 102, column: 12, scope: !212)
!228 = !DILocation(line: 102, column: 5, scope: !212)
!229 = !DILocation(line: 103, column: 26, scope: !212)
!230 = !DILocation(line: 103, column: 13, scope: !212)
!231 = !DILocation(line: 103, column: 24, scope: !212)
!232 = !DILocalVariable(name: "data", scope: !233, file: !45, line: 105, type: !42)
!233 = distinct !DILexicalBlock(scope: !212, file: !45, line: 104, column: 5)
!234 = !DILocation(line: 105, column: 16, scope: !233)
!235 = !DILocation(line: 105, column: 31, scope: !233)
!236 = !DILocation(line: 106, column: 23, scope: !233)
!237 = !DILocation(line: 106, column: 29, scope: !233)
!238 = !DILocation(line: 106, column: 9, scope: !233)
!239 = !DILocation(line: 108, column: 1, scope: !212)
!240 = distinct !DISubprogram(name: "goodB2GVaSink", scope: !45, file: !45, line: 111, type: !53, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!241 = !DILocalVariable(name: "data", arg: 1, scope: !240, file: !45, line: 111, type: !42)
!242 = !DILocation(line: 111, column: 27, scope: !240)
!243 = !DILocalVariable(name: "args", scope: !244, file: !45, line: 114, type: !59)
!244 = distinct !DILexicalBlock(scope: !240, file: !45, line: 113, column: 5)
!245 = !DILocation(line: 114, column: 17, scope: !244)
!246 = !DILocation(line: 115, column: 9, scope: !244)
!247 = !DILocation(line: 117, column: 23, scope: !244)
!248 = !DILocation(line: 117, column: 9, scope: !244)
!249 = !DILocation(line: 118, column: 9, scope: !244)
!250 = !DILocation(line: 120, column: 1, scope: !240)
!251 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 122, type: !81, scopeLine: 123, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!252 = !DILocalVariable(name: "data", scope: !251, file: !45, line: 124, type: !42)
!253 = !DILocation(line: 124, column: 12, scope: !251)
!254 = !DILocalVariable(name: "myUnion", scope: !251, file: !45, line: 125, type: !216)
!255 = !DILocation(line: 125, column: 71, scope: !251)
!256 = !DILocalVariable(name: "dataBuffer", scope: !251, file: !45, line: 126, type: !86)
!257 = !DILocation(line: 126, column: 10, scope: !251)
!258 = !DILocation(line: 127, column: 12, scope: !251)
!259 = !DILocation(line: 127, column: 10, scope: !251)
!260 = !DILocalVariable(name: "dataLen", scope: !261, file: !45, line: 130, type: !94)
!261 = distinct !DILexicalBlock(scope: !251, file: !45, line: 128, column: 5)
!262 = !DILocation(line: 130, column: 16, scope: !261)
!263 = !DILocation(line: 130, column: 33, scope: !261)
!264 = !DILocation(line: 130, column: 26, scope: !261)
!265 = !DILocalVariable(name: "pFile", scope: !261, file: !45, line: 131, type: !101)
!266 = !DILocation(line: 131, column: 16, scope: !261)
!267 = !DILocation(line: 133, column: 17, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !45, line: 133, column: 13)
!269 = !DILocation(line: 133, column: 16, scope: !268)
!270 = !DILocation(line: 133, column: 25, scope: !268)
!271 = !DILocation(line: 133, column: 13, scope: !261)
!272 = !DILocation(line: 135, column: 21, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !45, line: 134, column: 9)
!274 = !DILocation(line: 135, column: 19, scope: !273)
!275 = !DILocation(line: 136, column: 17, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !45, line: 136, column: 17)
!277 = !DILocation(line: 136, column: 23, scope: !276)
!278 = !DILocation(line: 136, column: 17, scope: !273)
!279 = !DILocation(line: 139, column: 27, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !45, line: 139, column: 21)
!281 = distinct !DILexicalBlock(scope: !276, file: !45, line: 137, column: 13)
!282 = !DILocation(line: 139, column: 32, scope: !280)
!283 = !DILocation(line: 139, column: 31, scope: !280)
!284 = !DILocation(line: 139, column: 51, scope: !280)
!285 = !DILocation(line: 139, column: 50, scope: !280)
!286 = !DILocation(line: 139, column: 41, scope: !280)
!287 = !DILocation(line: 139, column: 61, scope: !280)
!288 = !DILocation(line: 139, column: 21, scope: !280)
!289 = !DILocation(line: 139, column: 68, scope: !280)
!290 = !DILocation(line: 139, column: 21, scope: !281)
!291 = !DILocation(line: 141, column: 21, scope: !292)
!292 = distinct !DILexicalBlock(scope: !280, file: !45, line: 140, column: 17)
!293 = !DILocation(line: 143, column: 21, scope: !292)
!294 = !DILocation(line: 143, column: 26, scope: !292)
!295 = !DILocation(line: 143, column: 35, scope: !292)
!296 = !DILocation(line: 144, column: 17, scope: !292)
!297 = !DILocation(line: 145, column: 24, scope: !281)
!298 = !DILocation(line: 145, column: 17, scope: !281)
!299 = !DILocation(line: 146, column: 13, scope: !281)
!300 = !DILocation(line: 147, column: 9, scope: !273)
!301 = !DILocation(line: 149, column: 26, scope: !251)
!302 = !DILocation(line: 149, column: 13, scope: !251)
!303 = !DILocation(line: 149, column: 24, scope: !251)
!304 = !DILocalVariable(name: "data", scope: !305, file: !45, line: 151, type: !42)
!305 = distinct !DILexicalBlock(scope: !251, file: !45, line: 150, column: 5)
!306 = !DILocation(line: 151, column: 16, scope: !305)
!307 = !DILocation(line: 151, column: 31, scope: !305)
!308 = !DILocation(line: 152, column: 23, scope: !305)
!309 = !DILocation(line: 152, column: 29, scope: !305)
!310 = !DILocation(line: 152, column: 9, scope: !305)
!311 = !DILocation(line: 154, column: 1, scope: !251)
!312 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_34_good", scope: !45, file: !45, line: 156, type: !81, scopeLine: 157, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!313 = !DILocation(line: 158, column: 5, scope: !312)
!314 = !DILocation(line: 159, column: 5, scope: !312)
!315 = !DILocation(line: 160, column: 1, scope: !312)
!316 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !317, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !42}
!319 = !DILocalVariable(name: "line", arg: 1, scope: !316, file: !3, line: 11, type: !42)
!320 = !DILocation(line: 11, column: 25, scope: !316)
!321 = !DILocation(line: 13, column: 1, scope: !316)
!322 = !DILocation(line: 14, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !316, file: !3, line: 14, column: 8)
!324 = !DILocation(line: 14, column: 13, scope: !323)
!325 = !DILocation(line: 14, column: 8, scope: !316)
!326 = !DILocation(line: 16, column: 24, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !3, line: 15, column: 5)
!328 = !DILocation(line: 16, column: 9, scope: !327)
!329 = !DILocation(line: 17, column: 5, scope: !327)
!330 = !DILocation(line: 18, column: 5, scope: !316)
!331 = !DILocation(line: 19, column: 1, scope: !316)
!332 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !317, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!333 = !DILocalVariable(name: "line", arg: 1, scope: !332, file: !3, line: 20, type: !42)
!334 = !DILocation(line: 20, column: 29, scope: !332)
!335 = !DILocation(line: 22, column: 8, scope: !336)
!336 = distinct !DILexicalBlock(scope: !332, file: !3, line: 22, column: 8)
!337 = !DILocation(line: 22, column: 13, scope: !336)
!338 = !DILocation(line: 22, column: 8, scope: !332)
!339 = !DILocation(line: 24, column: 24, scope: !340)
!340 = distinct !DILexicalBlock(scope: !336, file: !3, line: 23, column: 5)
!341 = !DILocation(line: 24, column: 9, scope: !340)
!342 = !DILocation(line: 25, column: 5, scope: !340)
!343 = !DILocation(line: 26, column: 1, scope: !332)
!344 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !345, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !95, line: 74, baseType: !23)
!349 = !DILocalVariable(name: "line", arg: 1, scope: !344, file: !3, line: 27, type: !347)
!350 = !DILocation(line: 27, column: 29, scope: !344)
!351 = !DILocation(line: 29, column: 8, scope: !352)
!352 = distinct !DILexicalBlock(scope: !344, file: !3, line: 29, column: 8)
!353 = !DILocation(line: 29, column: 13, scope: !352)
!354 = !DILocation(line: 29, column: 8, scope: !344)
!355 = !DILocation(line: 31, column: 27, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 30, column: 5)
!357 = !DILocation(line: 31, column: 9, scope: !356)
!358 = !DILocation(line: 32, column: 5, scope: !356)
!359 = !DILocation(line: 33, column: 1, scope: !344)
!360 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !361, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !23}
!363 = !DILocalVariable(name: "intNumber", arg: 1, scope: !360, file: !3, line: 35, type: !23)
!364 = !DILocation(line: 35, column: 24, scope: !360)
!365 = !DILocation(line: 37, column: 20, scope: !360)
!366 = !DILocation(line: 37, column: 5, scope: !360)
!367 = !DILocation(line: 38, column: 1, scope: !360)
!368 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !369, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !371}
!371 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!372 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !368, file: !3, line: 40, type: !371)
!373 = !DILocation(line: 40, column: 28, scope: !368)
!374 = !DILocation(line: 42, column: 21, scope: !368)
!375 = !DILocation(line: 42, column: 5, scope: !368)
!376 = !DILocation(line: 43, column: 1, scope: !368)
!377 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !378, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380}
!380 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!381 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !377, file: !3, line: 45, type: !380)
!382 = !DILocation(line: 45, column: 28, scope: !377)
!383 = !DILocation(line: 47, column: 20, scope: !377)
!384 = !DILocation(line: 47, column: 5, scope: !377)
!385 = !DILocation(line: 48, column: 1, scope: !377)
!386 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !387, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !129}
!389 = !DILocalVariable(name: "longNumber", arg: 1, scope: !386, file: !3, line: 50, type: !129)
!390 = !DILocation(line: 50, column: 26, scope: !386)
!391 = !DILocation(line: 52, column: 21, scope: !386)
!392 = !DILocation(line: 52, column: 5, scope: !386)
!393 = !DILocation(line: 53, column: 1, scope: !386)
!394 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !395, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !397}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !398, line: 27, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !128, line: 44, baseType: !129)
!400 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !394, file: !3, line: 55, type: !397)
!401 = !DILocation(line: 55, column: 33, scope: !394)
!402 = !DILocation(line: 57, column: 29, scope: !394)
!403 = !DILocation(line: 57, column: 5, scope: !394)
!404 = !DILocation(line: 58, column: 1, scope: !394)
!405 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !406, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !94}
!408 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !405, file: !3, line: 60, type: !94)
!409 = !DILocation(line: 60, column: 29, scope: !405)
!410 = !DILocation(line: 62, column: 21, scope: !405)
!411 = !DILocation(line: 62, column: 5, scope: !405)
!412 = !DILocation(line: 63, column: 1, scope: !405)
!413 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !414, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !43}
!416 = !DILocalVariable(name: "charHex", arg: 1, scope: !413, file: !3, line: 65, type: !43)
!417 = !DILocation(line: 65, column: 29, scope: !413)
!418 = !DILocation(line: 67, column: 22, scope: !413)
!419 = !DILocation(line: 67, column: 5, scope: !413)
!420 = !DILocation(line: 68, column: 1, scope: !413)
!421 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !422, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !348}
!424 = !DILocalVariable(name: "wideChar", arg: 1, scope: !421, file: !3, line: 70, type: !348)
!425 = !DILocation(line: 70, column: 29, scope: !421)
!426 = !DILocalVariable(name: "s", scope: !421, file: !3, line: 74, type: !427)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DILocation(line: 74, column: 13, scope: !421)
!431 = !DILocation(line: 75, column: 16, scope: !421)
!432 = !DILocation(line: 75, column: 9, scope: !421)
!433 = !DILocation(line: 75, column: 14, scope: !421)
!434 = !DILocation(line: 76, column: 9, scope: !421)
!435 = !DILocation(line: 76, column: 14, scope: !421)
!436 = !DILocation(line: 77, column: 21, scope: !421)
!437 = !DILocation(line: 77, column: 5, scope: !421)
!438 = !DILocation(line: 78, column: 1, scope: !421)
!439 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !440, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !7}
!442 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !439, file: !3, line: 80, type: !7)
!443 = !DILocation(line: 80, column: 33, scope: !439)
!444 = !DILocation(line: 82, column: 20, scope: !439)
!445 = !DILocation(line: 82, column: 5, scope: !439)
!446 = !DILocation(line: 83, column: 1, scope: !439)
!447 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !448, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !25}
!450 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !447, file: !3, line: 85, type: !25)
!451 = !DILocation(line: 85, column: 45, scope: !447)
!452 = !DILocation(line: 87, column: 22, scope: !447)
!453 = !DILocation(line: 87, column: 5, scope: !447)
!454 = !DILocation(line: 88, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !456, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !458}
!458 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!459 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !455, file: !3, line: 90, type: !458)
!460 = !DILocation(line: 90, column: 29, scope: !455)
!461 = !DILocation(line: 92, column: 20, scope: !455)
!462 = !DILocation(line: 92, column: 5, scope: !455)
!463 = !DILocation(line: 93, column: 1, scope: !455)
!464 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !465, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !469, line: 100, baseType: !470)
!469 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_177/source_code")
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !469, line: 96, size: 64, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !470, file: !469, line: 98, baseType: !23, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !470, file: !469, line: 99, baseType: !23, size: 32, offset: 32)
!474 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !464, file: !3, line: 95, type: !467)
!475 = !DILocation(line: 95, column: 40, scope: !464)
!476 = !DILocation(line: 97, column: 26, scope: !464)
!477 = !DILocation(line: 97, column: 47, scope: !464)
!478 = !DILocation(line: 97, column: 55, scope: !464)
!479 = !DILocation(line: 97, column: 76, scope: !464)
!480 = !DILocation(line: 97, column: 5, scope: !464)
!481 = !DILocation(line: 98, column: 1, scope: !464)
!482 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !483, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !485, !94}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!486 = !DILocalVariable(name: "bytes", arg: 1, scope: !482, file: !3, line: 100, type: !485)
!487 = !DILocation(line: 100, column: 38, scope: !482)
!488 = !DILocalVariable(name: "numBytes", arg: 2, scope: !482, file: !3, line: 100, type: !94)
!489 = !DILocation(line: 100, column: 52, scope: !482)
!490 = !DILocalVariable(name: "i", scope: !482, file: !3, line: 102, type: !94)
!491 = !DILocation(line: 102, column: 12, scope: !482)
!492 = !DILocation(line: 103, column: 12, scope: !493)
!493 = distinct !DILexicalBlock(scope: !482, file: !3, line: 103, column: 5)
!494 = !DILocation(line: 103, column: 10, scope: !493)
!495 = !DILocation(line: 103, column: 17, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !3, line: 103, column: 5)
!497 = !DILocation(line: 103, column: 21, scope: !496)
!498 = !DILocation(line: 103, column: 19, scope: !496)
!499 = !DILocation(line: 103, column: 5, scope: !493)
!500 = !DILocation(line: 105, column: 24, scope: !501)
!501 = distinct !DILexicalBlock(scope: !496, file: !3, line: 104, column: 5)
!502 = !DILocation(line: 105, column: 30, scope: !501)
!503 = !DILocation(line: 105, column: 9, scope: !501)
!504 = !DILocation(line: 106, column: 5, scope: !501)
!505 = !DILocation(line: 103, column: 31, scope: !496)
!506 = !DILocation(line: 103, column: 5, scope: !496)
!507 = distinct !{!507, !499, !508, !509}
!508 = !DILocation(line: 106, column: 5, scope: !493)
!509 = !{!"llvm.loop.mustprogress"}
!510 = !DILocation(line: 107, column: 5, scope: !482)
!511 = !DILocation(line: 108, column: 1, scope: !482)
!512 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !513, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!513 = !DISubroutineType(types: !514)
!514 = !{!94, !485, !94, !42}
!515 = !DILocalVariable(name: "bytes", arg: 1, scope: !512, file: !3, line: 113, type: !485)
!516 = !DILocation(line: 113, column: 39, scope: !512)
!517 = !DILocalVariable(name: "numBytes", arg: 2, scope: !512, file: !3, line: 113, type: !94)
!518 = !DILocation(line: 113, column: 53, scope: !512)
!519 = !DILocalVariable(name: "hex", arg: 3, scope: !512, file: !3, line: 113, type: !42)
!520 = !DILocation(line: 113, column: 71, scope: !512)
!521 = !DILocalVariable(name: "numWritten", scope: !512, file: !3, line: 115, type: !94)
!522 = !DILocation(line: 115, column: 12, scope: !512)
!523 = !DILocation(line: 121, column: 5, scope: !512)
!524 = !DILocation(line: 121, column: 12, scope: !512)
!525 = !DILocation(line: 121, column: 25, scope: !512)
!526 = !DILocation(line: 121, column: 23, scope: !512)
!527 = !DILocation(line: 121, column: 34, scope: !512)
!528 = !DILocation(line: 121, column: 37, scope: !512)
!529 = !DILocation(line: 121, column: 67, scope: !512)
!530 = !DILocation(line: 121, column: 70, scope: !512)
!531 = !DILocation(line: 0, scope: !512)
!532 = !DILocalVariable(name: "byte", scope: !533, file: !3, line: 123, type: !23)
!533 = distinct !DILexicalBlock(scope: !512, file: !3, line: 122, column: 5)
