; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_badGlobal = dso_local global i32 0, align 4, !dbg !0
@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G1Global = dso_local global i32 0, align 4, !dbg !9
@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G2Global = dso_local global i32 0, align 4, !dbg !11
@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodG2BGlobal = dso_local global i32 0, align 4, !dbg !13
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8

!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !36, globals: !39, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_981/source_code")
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !22, size: 32, elements: !23)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!36 = !{!6, !7, !37, !38}
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!15, !40, !42, !44, !46, !48, !50, !52}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !17, file: !18, line: 175, type: !7, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !17, file: !18, line: 176, type: !7, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "globalTrue", scope: !17, file: !18, line: 181, type: !7, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "globalFalse", scope: !17, file: !18, line: 182, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalFive", scope: !17, file: !18, line: 183, type: !7, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "globalArgc", scope: !17, file: !18, line: 214, type: !7, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "globalArgv", scope: !17, file: !18, line: 215, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_981/source_code")
!59 = !{!"clang version 12.0.0"}
!60 = !{i32 7, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_bad", scope: !3, file: !3, line: 37, type: !64, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!64 = !DISubroutineType(types: !65)
!65 = !{null}
!66 = !DILocalVariable(name: "data", scope: !63, file: !3, line: 39, type: !55)
!67 = !DILocation(line: 39, column: 12, scope: !63)
!68 = !DILocalVariable(name: "dataBuffer", scope: !63, file: !3, line: 40, type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 800, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DILocation(line: 40, column: 10, scope: !63)
!73 = !DILocation(line: 41, column: 12, scope: !63)
!74 = !DILocation(line: 41, column: 10, scope: !63)
!75 = !DILocalVariable(name: "dataLen", scope: !76, file: !3, line: 44, type: !77)
!76 = distinct !DILexicalBlock(scope: !63, file: !3, line: 42, column: 5)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DILocation(line: 44, column: 16, scope: !76)
!81 = !DILocation(line: 44, column: 33, scope: !76)
!82 = !DILocation(line: 44, column: 26, scope: !76)
!83 = !DILocalVariable(name: "pFile", scope: !76, file: !3, line: 45, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !86, line: 7, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !88, line: 49, size: 1728, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !107, !108, !109, !113, !114, !116, !120, !123, !125, !128, !131, !132, !133, !134, !135}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !87, file: !88, line: 51, baseType: !7, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !87, file: !88, line: 54, baseType: !55, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !87, file: !88, line: 55, baseType: !55, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !87, file: !88, line: 56, baseType: !55, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !87, file: !88, line: 57, baseType: !55, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !87, file: !88, line: 58, baseType: !55, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !87, file: !88, line: 59, baseType: !55, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !87, file: !88, line: 60, baseType: !55, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !87, file: !88, line: 61, baseType: !55, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !87, file: !88, line: 64, baseType: !55, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !87, file: !88, line: 65, baseType: !55, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !87, file: !88, line: 66, baseType: !55, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !87, file: !88, line: 68, baseType: !103, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !88, line: 36, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !87, file: !88, line: 70, baseType: !106, size: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !87, file: !88, line: 72, baseType: !7, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !87, file: !88, line: 73, baseType: !7, size: 32, offset: 928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !87, file: !88, line: 74, baseType: !110, size: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !87, file: !88, line: 77, baseType: !37, size: 16, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !87, file: !88, line: 78, baseType: !115, size: 8, offset: 1040)
!115 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !87, file: !88, line: 79, baseType: !117, size: 8, offset: 1048)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !87, file: !88, line: 81, baseType: !121, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !88, line: 43, baseType: null)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !87, file: !88, line: 89, baseType: !124, size: 64, offset: 1152)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !112)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !87, file: !88, line: 91, baseType: !126, size: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !88, line: 37, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !87, file: !88, line: 92, baseType: !129, size: 64, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !88, line: 38, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !87, file: !88, line: 93, baseType: !106, size: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !87, file: !88, line: 94, baseType: !6, size: 64, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !87, file: !88, line: 95, baseType: !77, size: 64, offset: 1472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !87, file: !88, line: 96, baseType: !7, size: 32, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !87, file: !88, line: 98, baseType: !136, size: 160, offset: 1568)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 20)
!139 = !DILocation(line: 45, column: 16, scope: !76)
!140 = !DILocation(line: 47, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !76, file: !3, line: 47, column: 13)
!142 = !DILocation(line: 47, column: 16, scope: !141)
!143 = !DILocation(line: 47, column: 25, scope: !141)
!144 = !DILocation(line: 47, column: 13, scope: !76)
!145 = !DILocation(line: 49, column: 21, scope: !146)
!146 = distinct !DILexicalBlock(scope: !141, file: !3, line: 48, column: 9)
!147 = !DILocation(line: 49, column: 19, scope: !146)
!148 = !DILocation(line: 50, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !146, file: !3, line: 50, column: 17)
!150 = !DILocation(line: 50, column: 23, scope: !149)
!151 = !DILocation(line: 50, column: 17, scope: !146)
!152 = !DILocation(line: 53, column: 27, scope: !153)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 53, column: 21)
!154 = distinct !DILexicalBlock(scope: !149, file: !3, line: 51, column: 13)
!155 = !DILocation(line: 53, column: 32, scope: !153)
!156 = !DILocation(line: 53, column: 31, scope: !153)
!157 = !DILocation(line: 53, column: 51, scope: !153)
!158 = !DILocation(line: 53, column: 50, scope: !153)
!159 = !DILocation(line: 53, column: 41, scope: !153)
!160 = !DILocation(line: 53, column: 61, scope: !153)
!161 = !DILocation(line: 53, column: 21, scope: !153)
!162 = !DILocation(line: 53, column: 68, scope: !153)
!163 = !DILocation(line: 53, column: 21, scope: !154)
!164 = !DILocation(line: 55, column: 21, scope: !165)
!165 = distinct !DILexicalBlock(scope: !153, file: !3, line: 54, column: 17)
!166 = !DILocation(line: 57, column: 21, scope: !165)
!167 = !DILocation(line: 57, column: 26, scope: !165)
!168 = !DILocation(line: 57, column: 35, scope: !165)
!169 = !DILocation(line: 58, column: 17, scope: !165)
!170 = !DILocation(line: 59, column: 24, scope: !154)
!171 = !DILocation(line: 59, column: 17, scope: !154)
!172 = !DILocation(line: 60, column: 13, scope: !154)
!173 = !DILocation(line: 61, column: 9, scope: !146)
!174 = !DILocation(line: 63, column: 71, scope: !63)
!175 = !DILocation(line: 64, column: 69, scope: !63)
!176 = !DILocation(line: 64, column: 5, scope: !63)
!177 = !DILocation(line: 65, column: 1, scope: !63)
!178 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 78, type: !64, scopeLine: 79, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!179 = !DILocalVariable(name: "data", scope: !178, file: !3, line: 80, type: !55)
!180 = !DILocation(line: 80, column: 12, scope: !178)
!181 = !DILocalVariable(name: "dataBuffer", scope: !178, file: !3, line: 81, type: !69)
!182 = !DILocation(line: 81, column: 10, scope: !178)
!183 = !DILocation(line: 82, column: 12, scope: !178)
!184 = !DILocation(line: 82, column: 10, scope: !178)
!185 = !DILocalVariable(name: "dataLen", scope: !186, file: !3, line: 85, type: !77)
!186 = distinct !DILexicalBlock(scope: !178, file: !3, line: 83, column: 5)
!187 = !DILocation(line: 85, column: 16, scope: !186)
!188 = !DILocation(line: 85, column: 33, scope: !186)
!189 = !DILocation(line: 85, column: 26, scope: !186)
!190 = !DILocalVariable(name: "pFile", scope: !186, file: !3, line: 86, type: !84)
!191 = !DILocation(line: 86, column: 16, scope: !186)
!192 = !DILocation(line: 88, column: 17, scope: !193)
!193 = distinct !DILexicalBlock(scope: !186, file: !3, line: 88, column: 13)
!194 = !DILocation(line: 88, column: 16, scope: !193)
!195 = !DILocation(line: 88, column: 25, scope: !193)
!196 = !DILocation(line: 88, column: 13, scope: !186)
!197 = !DILocation(line: 90, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !3, line: 89, column: 9)
!199 = !DILocation(line: 90, column: 19, scope: !198)
!200 = !DILocation(line: 91, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 91, column: 17)
!202 = !DILocation(line: 91, column: 23, scope: !201)
!203 = !DILocation(line: 91, column: 17, scope: !198)
!204 = !DILocation(line: 94, column: 27, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 94, column: 21)
!206 = distinct !DILexicalBlock(scope: !201, file: !3, line: 92, column: 13)
!207 = !DILocation(line: 94, column: 32, scope: !205)
!208 = !DILocation(line: 94, column: 31, scope: !205)
!209 = !DILocation(line: 94, column: 51, scope: !205)
!210 = !DILocation(line: 94, column: 50, scope: !205)
!211 = !DILocation(line: 94, column: 41, scope: !205)
!212 = !DILocation(line: 94, column: 61, scope: !205)
!213 = !DILocation(line: 94, column: 21, scope: !205)
!214 = !DILocation(line: 94, column: 68, scope: !205)
!215 = !DILocation(line: 94, column: 21, scope: !206)
!216 = !DILocation(line: 96, column: 21, scope: !217)
!217 = distinct !DILexicalBlock(scope: !205, file: !3, line: 95, column: 17)
!218 = !DILocation(line: 98, column: 21, scope: !217)
!219 = !DILocation(line: 98, column: 26, scope: !217)
!220 = !DILocation(line: 98, column: 35, scope: !217)
!221 = !DILocation(line: 99, column: 17, scope: !217)
!222 = !DILocation(line: 100, column: 24, scope: !206)
!223 = !DILocation(line: 100, column: 17, scope: !206)
!224 = !DILocation(line: 101, column: 13, scope: !206)
!225 = !DILocation(line: 102, column: 9, scope: !198)
!226 = !DILocation(line: 104, column: 76, scope: !178)
!227 = !DILocation(line: 105, column: 74, scope: !178)
!228 = !DILocation(line: 105, column: 5, scope: !178)
!229 = !DILocation(line: 106, column: 1, scope: !178)
!230 = distinct !DISubprogram(name: "goodB2G2", scope: !3, file: !3, line: 110, type: !64, scopeLine: 111, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!231 = !DILocalVariable(name: "data", scope: !230, file: !3, line: 112, type: !55)
!232 = !DILocation(line: 112, column: 12, scope: !230)
!233 = !DILocalVariable(name: "dataBuffer", scope: !230, file: !3, line: 113, type: !69)
!234 = !DILocation(line: 113, column: 10, scope: !230)
!235 = !DILocation(line: 114, column: 12, scope: !230)
!236 = !DILocation(line: 114, column: 10, scope: !230)
!237 = !DILocalVariable(name: "dataLen", scope: !238, file: !3, line: 117, type: !77)
!238 = distinct !DILexicalBlock(scope: !230, file: !3, line: 115, column: 5)
!239 = !DILocation(line: 117, column: 16, scope: !238)
!240 = !DILocation(line: 117, column: 33, scope: !238)
!241 = !DILocation(line: 117, column: 26, scope: !238)
!242 = !DILocalVariable(name: "pFile", scope: !238, file: !3, line: 118, type: !84)
!243 = !DILocation(line: 118, column: 16, scope: !238)
!244 = !DILocation(line: 120, column: 17, scope: !245)
!245 = distinct !DILexicalBlock(scope: !238, file: !3, line: 120, column: 13)
!246 = !DILocation(line: 120, column: 16, scope: !245)
!247 = !DILocation(line: 120, column: 25, scope: !245)
!248 = !DILocation(line: 120, column: 13, scope: !238)
!249 = !DILocation(line: 122, column: 21, scope: !250)
!250 = distinct !DILexicalBlock(scope: !245, file: !3, line: 121, column: 9)
!251 = !DILocation(line: 122, column: 19, scope: !250)
!252 = !DILocation(line: 123, column: 17, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !3, line: 123, column: 17)
!254 = !DILocation(line: 123, column: 23, scope: !253)
!255 = !DILocation(line: 123, column: 17, scope: !250)
!256 = !DILocation(line: 126, column: 27, scope: !257)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 126, column: 21)
!258 = distinct !DILexicalBlock(scope: !253, file: !3, line: 124, column: 13)
!259 = !DILocation(line: 126, column: 32, scope: !257)
!260 = !DILocation(line: 126, column: 31, scope: !257)
!261 = !DILocation(line: 126, column: 51, scope: !257)
!262 = !DILocation(line: 126, column: 50, scope: !257)
!263 = !DILocation(line: 126, column: 41, scope: !257)
!264 = !DILocation(line: 126, column: 61, scope: !257)
!265 = !DILocation(line: 126, column: 21, scope: !257)
!266 = !DILocation(line: 126, column: 68, scope: !257)
!267 = !DILocation(line: 126, column: 21, scope: !258)
!268 = !DILocation(line: 128, column: 21, scope: !269)
!269 = distinct !DILexicalBlock(scope: !257, file: !3, line: 127, column: 17)
!270 = !DILocation(line: 130, column: 21, scope: !269)
!271 = !DILocation(line: 130, column: 26, scope: !269)
!272 = !DILocation(line: 130, column: 35, scope: !269)
!273 = !DILocation(line: 131, column: 17, scope: !269)
!274 = !DILocation(line: 132, column: 24, scope: !258)
!275 = !DILocation(line: 132, column: 17, scope: !258)
!276 = !DILocation(line: 133, column: 13, scope: !258)
!277 = !DILocation(line: 134, column: 9, scope: !250)
!278 = !DILocation(line: 136, column: 76, scope: !230)
!279 = !DILocation(line: 137, column: 74, scope: !230)
!280 = !DILocation(line: 137, column: 5, scope: !230)
!281 = !DILocation(line: 138, column: 1, scope: !230)
!282 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 142, type: !64, scopeLine: 143, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!283 = !DILocalVariable(name: "data", scope: !282, file: !3, line: 144, type: !55)
!284 = !DILocation(line: 144, column: 12, scope: !282)
!285 = !DILocalVariable(name: "dataBuffer", scope: !282, file: !3, line: 145, type: !69)
!286 = !DILocation(line: 145, column: 10, scope: !282)
!287 = !DILocation(line: 146, column: 12, scope: !282)
!288 = !DILocation(line: 146, column: 10, scope: !282)
!289 = !DILocation(line: 148, column: 12, scope: !282)
!290 = !DILocation(line: 148, column: 5, scope: !282)
!291 = !DILocation(line: 149, column: 75, scope: !282)
!292 = !DILocation(line: 150, column: 73, scope: !282)
!293 = !DILocation(line: 150, column: 5, scope: !282)
!294 = !DILocation(line: 151, column: 1, scope: !282)
!295 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_good", scope: !3, file: !3, line: 153, type: !64, scopeLine: 154, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!296 = !DILocation(line: 155, column: 5, scope: !295)
!297 = !DILocation(line: 156, column: 5, scope: !295)
!298 = !DILocation(line: 157, column: 5, scope: !295)
!299 = !DILocation(line: 158, column: 1, scope: !295)
!300 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_badSink", scope: !58, file: !58, line: 29, type: !301, scopeLine: 30, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !55}
!303 = !DILocalVariable(name: "data", arg: 1, scope: !300, file: !58, line: 29, type: !55)
!304 = !DILocation(line: 29, column: 77, scope: !300)
!305 = !DILocation(line: 31, column: 8, scope: !306)
!306 = distinct !DILexicalBlock(scope: !300, file: !58, line: 31, column: 8)
!307 = !DILocation(line: 31, column: 8, scope: !300)
!308 = !DILocation(line: 34, column: 17, scope: !309)
!309 = distinct !DILexicalBlock(scope: !306, file: !58, line: 32, column: 5)
!310 = !DILocation(line: 34, column: 25, scope: !309)
!311 = !DILocation(line: 34, column: 9, scope: !309)
!312 = !DILocation(line: 35, column: 5, scope: !309)
!313 = !DILocation(line: 36, column: 1, scope: !300)
!314 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G1Sink", scope: !58, file: !58, line: 48, type: !301, scopeLine: 49, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!315 = !DILocalVariable(name: "data", arg: 1, scope: !314, file: !58, line: 48, type: !55)
!316 = !DILocation(line: 48, column: 82, scope: !314)
!317 = !DILocation(line: 50, column: 8, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !58, line: 50, column: 8)
!319 = !DILocation(line: 50, column: 8, scope: !314)
!320 = !DILocation(line: 53, column: 9, scope: !321)
!321 = distinct !DILexicalBlock(scope: !318, file: !58, line: 51, column: 5)
!322 = !DILocation(line: 54, column: 5, scope: !321)
!323 = !DILocation(line: 58, column: 17, scope: !324)
!324 = distinct !DILexicalBlock(scope: !318, file: !58, line: 56, column: 5)
!325 = !DILocation(line: 58, column: 33, scope: !324)
!326 = !DILocation(line: 58, column: 9, scope: !324)
!327 = !DILocation(line: 60, column: 1, scope: !314)
!328 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G2Sink", scope: !58, file: !58, line: 63, type: !301, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!329 = !DILocalVariable(name: "data", arg: 1, scope: !328, file: !58, line: 63, type: !55)
!330 = !DILocation(line: 63, column: 82, scope: !328)
!331 = !DILocation(line: 65, column: 8, scope: !332)
!332 = distinct !DILexicalBlock(scope: !328, file: !58, line: 65, column: 8)
!333 = !DILocation(line: 65, column: 8, scope: !328)
!334 = !DILocation(line: 68, column: 17, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !58, line: 66, column: 5)
!336 = !DILocation(line: 68, column: 33, scope: !335)
!337 = !DILocation(line: 68, column: 9, scope: !335)
!338 = !DILocation(line: 69, column: 5, scope: !335)
!339 = !DILocation(line: 70, column: 1, scope: !328)
!340 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodG2BSink", scope: !58, file: !58, line: 73, type: !301, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!341 = !DILocalVariable(name: "data", arg: 1, scope: !340, file: !58, line: 73, type: !55)
!342 = !DILocation(line: 73, column: 81, scope: !340)
!343 = !DILocation(line: 75, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !340, file: !58, line: 75, column: 8)
!345 = !DILocation(line: 75, column: 8, scope: !340)
!346 = !DILocation(line: 78, column: 17, scope: !347)
!347 = distinct !DILexicalBlock(scope: !344, file: !58, line: 76, column: 5)
!348 = !DILocation(line: 78, column: 25, scope: !347)
!349 = !DILocation(line: 78, column: 9, scope: !347)
!350 = !DILocation(line: 79, column: 5, scope: !347)
!351 = !DILocation(line: 80, column: 1, scope: !340)
!352 = distinct !DISubprogram(name: "printLine", scope: !18, file: !18, line: 11, type: !301, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!353 = !DILocalVariable(name: "line", arg: 1, scope: !352, file: !18, line: 11, type: !55)
!354 = !DILocation(line: 11, column: 25, scope: !352)
!355 = !DILocation(line: 13, column: 1, scope: !352)
!356 = !DILocation(line: 14, column: 8, scope: !357)
!357 = distinct !DILexicalBlock(scope: !352, file: !18, line: 14, column: 8)
!358 = !DILocation(line: 14, column: 13, scope: !357)
!359 = !DILocation(line: 14, column: 8, scope: !352)
!360 = !DILocation(line: 16, column: 24, scope: !361)
!361 = distinct !DILexicalBlock(scope: !357, file: !18, line: 15, column: 5)
!362 = !DILocation(line: 16, column: 9, scope: !361)
!363 = !DILocation(line: 17, column: 5, scope: !361)
!364 = !DILocation(line: 18, column: 5, scope: !352)
!365 = !DILocation(line: 19, column: 1, scope: !352)
!366 = distinct !DISubprogram(name: "printSinkLine", scope: !18, file: !18, line: 20, type: !301, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!367 = !DILocalVariable(name: "line", arg: 1, scope: !366, file: !18, line: 20, type: !55)
!368 = !DILocation(line: 20, column: 29, scope: !366)
!369 = !DILocation(line: 22, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !18, line: 22, column: 8)
!371 = !DILocation(line: 22, column: 13, scope: !370)
!372 = !DILocation(line: 22, column: 8, scope: !366)
!373 = !DILocation(line: 24, column: 24, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !18, line: 23, column: 5)
!375 = !DILocation(line: 24, column: 9, scope: !374)
!376 = !DILocation(line: 25, column: 5, scope: !374)
!377 = !DILocation(line: 26, column: 1, scope: !366)
!378 = distinct !DISubprogram(name: "printWLine", scope: !18, file: !18, line: 27, type: !379, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !78, line: 74, baseType: !7)
!383 = !DILocalVariable(name: "line", arg: 1, scope: !378, file: !18, line: 27, type: !381)
!384 = !DILocation(line: 27, column: 29, scope: !378)
!385 = !DILocation(line: 29, column: 8, scope: !386)
!386 = distinct !DILexicalBlock(scope: !378, file: !18, line: 29, column: 8)
!387 = !DILocation(line: 29, column: 13, scope: !386)
!388 = !DILocation(line: 29, column: 8, scope: !378)
!389 = !DILocation(line: 31, column: 27, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !18, line: 30, column: 5)
!391 = !DILocation(line: 31, column: 9, scope: !390)
!392 = !DILocation(line: 32, column: 5, scope: !390)
!393 = !DILocation(line: 33, column: 1, scope: !378)
!394 = distinct !DISubprogram(name: "printIntLine", scope: !18, file: !18, line: 35, type: !395, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !7}
!397 = !DILocalVariable(name: "intNumber", arg: 1, scope: !394, file: !18, line: 35, type: !7)
!398 = !DILocation(line: 35, column: 24, scope: !394)
!399 = !DILocation(line: 37, column: 20, scope: !394)
!400 = !DILocation(line: 37, column: 5, scope: !394)
!401 = !DILocation(line: 38, column: 1, scope: !394)
!402 = distinct !DISubprogram(name: "printShortLine", scope: !18, file: !18, line: 40, type: !403, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !405}
!405 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!406 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !402, file: !18, line: 40, type: !405)
!407 = !DILocation(line: 40, column: 28, scope: !402)
!408 = !DILocation(line: 42, column: 21, scope: !402)
!409 = !DILocation(line: 42, column: 5, scope: !402)
!410 = !DILocation(line: 43, column: 1, scope: !402)
!411 = distinct !DISubprogram(name: "printFloatLine", scope: !18, file: !18, line: 45, type: !412, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414}
!414 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!415 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !411, file: !18, line: 45, type: !414)
!416 = !DILocation(line: 45, column: 28, scope: !411)
!417 = !DILocation(line: 47, column: 20, scope: !411)
!418 = !DILocation(line: 47, column: 5, scope: !411)
!419 = !DILocation(line: 48, column: 1, scope: !411)
!420 = distinct !DISubprogram(name: "printLongLine", scope: !18, file: !18, line: 50, type: !421, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !112}
!423 = !DILocalVariable(name: "longNumber", arg: 1, scope: !420, file: !18, line: 50, type: !112)
!424 = !DILocation(line: 50, column: 26, scope: !420)
!425 = !DILocation(line: 52, column: 21, scope: !420)
!426 = !DILocation(line: 52, column: 5, scope: !420)
!427 = !DILocation(line: 53, column: 1, scope: !420)
!428 = distinct !DISubprogram(name: "printLongLongLine", scope: !18, file: !18, line: 55, type: !429, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !431}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !432, line: 27, baseType: !433)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 44, baseType: !112)
!434 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !428, file: !18, line: 55, type: !431)
!435 = !DILocation(line: 55, column: 33, scope: !428)
!436 = !DILocation(line: 57, column: 29, scope: !428)
!437 = !DILocation(line: 57, column: 5, scope: !428)
!438 = !DILocation(line: 58, column: 1, scope: !428)
!439 = distinct !DISubprogram(name: "printSizeTLine", scope: !18, file: !18, line: 60, type: !440, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !77}
!442 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !439, file: !18, line: 60, type: !77)
!443 = !DILocation(line: 60, column: 29, scope: !439)
!444 = !DILocation(line: 62, column: 21, scope: !439)
!445 = !DILocation(line: 62, column: 5, scope: !439)
!446 = !DILocation(line: 63, column: 1, scope: !439)
!447 = distinct !DISubprogram(name: "printHexCharLine", scope: !18, file: !18, line: 65, type: !448, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !56}
!450 = !DILocalVariable(name: "charHex", arg: 1, scope: !447, file: !18, line: 65, type: !56)
!451 = !DILocation(line: 65, column: 29, scope: !447)
!452 = !DILocation(line: 67, column: 22, scope: !447)
!453 = !DILocation(line: 67, column: 5, scope: !447)
!454 = !DILocation(line: 68, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printWcharLine", scope: !18, file: !18, line: 70, type: !456, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !382}
!458 = !DILocalVariable(name: "wideChar", arg: 1, scope: !455, file: !18, line: 70, type: !382)
!459 = !DILocation(line: 70, column: 29, scope: !455)
!460 = !DILocalVariable(name: "s", scope: !455, file: !18, line: 74, type: !461)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 64, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 2)
!464 = !DILocation(line: 74, column: 13, scope: !455)
!465 = !DILocation(line: 75, column: 16, scope: !455)
!466 = !DILocation(line: 75, column: 9, scope: !455)
!467 = !DILocation(line: 75, column: 14, scope: !455)
!468 = !DILocation(line: 76, column: 9, scope: !455)
!469 = !DILocation(line: 76, column: 14, scope: !455)
!470 = !DILocation(line: 77, column: 21, scope: !455)
!471 = !DILocation(line: 77, column: 5, scope: !455)
!472 = !DILocation(line: 78, column: 1, scope: !455)
!473 = distinct !DISubprogram(name: "printUnsignedLine", scope: !18, file: !18, line: 80, type: !474, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !22}
!476 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !473, file: !18, line: 80, type: !22)
!477 = !DILocation(line: 80, column: 33, scope: !473)
!478 = !DILocation(line: 82, column: 20, scope: !473)
!479 = !DILocation(line: 82, column: 5, scope: !473)
!480 = !DILocation(line: 83, column: 1, scope: !473)
!481 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !18, file: !18, line: 85, type: !482, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !38}
!484 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !481, file: !18, line: 85, type: !38)
!485 = !DILocation(line: 85, column: 45, scope: !481)
!486 = !DILocation(line: 87, column: 22, scope: !481)
!487 = !DILocation(line: 87, column: 5, scope: !481)
!488 = !DILocation(line: 88, column: 1, scope: !481)
!489 = distinct !DISubprogram(name: "printDoubleLine", scope: !18, file: !18, line: 90, type: !490, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!493 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !489, file: !18, line: 90, type: !492)
!494 = !DILocation(line: 90, column: 29, scope: !489)
!495 = !DILocation(line: 92, column: 20, scope: !489)
!496 = !DILocation(line: 92, column: 5, scope: !489)
!497 = !DILocation(line: 93, column: 1, scope: !489)
!498 = distinct !DISubprogram(name: "printStructLine", scope: !18, file: !18, line: 95, type: !499, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !503, line: 100, baseType: !504)
!503 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_981/source_code")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !503, line: 96, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !504, file: !503, line: 98, baseType: !7, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !504, file: !503, line: 99, baseType: !7, size: 32, offset: 32)
!508 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !498, file: !18, line: 95, type: !501)
!509 = !DILocation(line: 95, column: 40, scope: !498)
!510 = !DILocation(line: 97, column: 26, scope: !498)
!511 = !DILocation(line: 97, column: 47, scope: !498)
!512 = !DILocation(line: 97, column: 55, scope: !498)
!513 = !DILocation(line: 97, column: 76, scope: !498)
!514 = !DILocation(line: 97, column: 5, scope: !498)
!515 = !DILocation(line: 98, column: 1, scope: !498)
!516 = distinct !DISubprogram(name: "printBytesLine", scope: !18, file: !18, line: 100, type: !517, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !519, !77}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!520 = !DILocalVariable(name: "bytes", arg: 1, scope: !516, file: !18, line: 100, type: !519)
!521 = !DILocation(line: 100, column: 38, scope: !516)
!522 = !DILocalVariable(name: "numBytes", arg: 2, scope: !516, file: !18, line: 100, type: !77)
!523 = !DILocation(line: 100, column: 52, scope: !516)
!524 = !DILocalVariable(name: "i", scope: !516, file: !18, line: 102, type: !77)
!525 = !DILocation(line: 102, column: 12, scope: !516)
!526 = !DILocation(line: 103, column: 12, scope: !527)
!527 = distinct !DILexicalBlock(scope: !516, file: !18, line: 103, column: 5)
!528 = !DILocation(line: 103, column: 10, scope: !527)
!529 = !DILocation(line: 103, column: 17, scope: !530)
!530 = distinct !DILexicalBlock(scope: !527, file: !18, line: 103, column: 5)
!531 = !DILocation(line: 103, column: 21, scope: !530)
!532 = !DILocation(line: 103, column: 19, scope: !530)
!533 = !DILocation(line: 103, column: 5, scope: !527)
!534 = !DILocation(line: 105, column: 24, scope: !535)
!535 = distinct !DILexicalBlock(scope: !530, file: !18, line: 104, column: 5)
!536 = !DILocation(line: 105, column: 30, scope: !535)
!537 = !DILocation(line: 105, column: 9, scope: !535)
!538 = !DILocation(line: 106, column: 5, scope: !535)
!539 = !DILocation(line: 103, column: 31, scope: !530)
!540 = !DILocation(line: 103, column: 5, scope: !530)
!541 = distinct !{!541, !533, !542, !543}
!542 = !DILocation(line: 106, column: 5, scope: !527)
!543 = !{!"llvm.loop.mustprogress"}
!544 = !DILocation(line: 107, column: 5, scope: !516)
!545 = !DILocation(line: 108, column: 1, scope: !516)
!546 = distinct !DISubprogram(name: "decodeHexChars", scope: !18, file: !18, line: 113, type: !547, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!547 = !DISubroutineType(types: !548)
!548 = !{!77, !519, !77, !55}
!549 = !DILocalVariable(name: "bytes", arg: 1, scope: !546, file: !18, line: 113, type: !519)
!550 = !DILocation(line: 113, column: 39, scope: !546)
!551 = !DILocalVariable(name: "numBytes", arg: 2, scope: !546, file: !18, line: 113, type: !77)
!552 = !DILocation(line: 113, column: 53, scope: !546)
!553 = !DILocalVariable(name: "hex", arg: 3, scope: !546, file: !18, line: 113, type: !55)
!554 = !DILocation(line: 113, column: 71, scope: !546)
!555 = !DILocalVariable(name: "numWritten", scope: !546, file: !18, line: 115, type: !77)
!556 = !DILocation(line: 115, column: 12, scope: !546)
!557 = !DILocation(line: 121, column: 5, scope: !546)
!558 = !DILocation(line: 121, column: 12, scope: !546)
!559 = !DILocation(line: 121, column: 25, scope: !546)
!560 = !DILocation(line: 121, column: 23, scope: !546)
!561 = !DILocation(line: 121, column: 34, scope: !546)
!562 = !DILocation(line: 121, column: 37, scope: !546)
!563 = !DILocation(line: 121, column: 67, scope: !546)
!564 = !DILocation(line: 121, column: 70, scope: !546)
!565 = !DILocation(line: 0, scope: !546)
!566 = !DILocalVariable(name: "byte", scope: !567, file: !18, line: 123, type: !7)
!567 = distinct !DILexicalBlock(scope: !546, file: !18, line: 122, column: 5)
