; ModuleID = 'CWE134_Uncontrolled_Format_String__char_file_fprintf_22a.c'
source_filename = "CWE134_Uncontrolled_Format_String__char_file_fprintf_22a.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_badGlobal = dso_local global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G1Global = dso_local global i32 0, align 4, !dbg !9
@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G2Global = dso_local global i32 0, align 4, !dbg !11
@CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodG2BGlobal = dso_local global i32 0, align 4, !dbg !13
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1

; Function Attrs: noinline nounwind optnone uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_badGlobal", scope: !2, file: !3, line: 34, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_981/source_code")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !11, !13}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G1Global", scope: !2, file: !3, line: 72, type: !7, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodB2G2Global", scope: !2, file: !3, line: 73, type: !7, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_goodG2BGlobal", scope: !2, file: !3, line: 74, type: !7, isLocal: false, isDefinition: true)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 12.0.0"}
!19 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_22_bad", scope: !3, file: !3, line: 37, type: !20, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!20 = !DISubroutineType(types: !21)
!21 = !{null}
!22 = !DILocalVariable(name: "data", scope: !19, file: !3, line: 39, type: !23)
!23 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !24, size: 64)
!24 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!25 = !DILocation(line: 39, column: 12, scope: !19)
!26 = !DILocalVariable(name: "dataBuffer", scope: !19, file: !3, line: 40, type: !27)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 800, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 100)
!30 = !DILocation(line: 40, column: 10, scope: !19)
!31 = !DILocation(line: 41, column: 12, scope: !19)
!32 = !DILocation(line: 41, column: 10, scope: !19)
!33 = !DILocalVariable(name: "dataLen", scope: !34, file: !3, line: 44, type: !35)
!34 = distinct !DILexicalBlock(scope: !19, file: !3, line: 42, column: 5)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !36, line: 46, baseType: !37)
!36 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!37 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!38 = !DILocation(line: 44, column: 16, scope: !34)
!39 = !DILocation(line: 44, column: 33, scope: !34)
!40 = !DILocation(line: 44, column: 26, scope: !34)
!41 = !DILocalVariable(name: "pFile", scope: !34, file: !3, line: 45, type: !42)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !44, line: 7, baseType: !45)
!44 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!45 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !46, line: 49, size: 1728, elements: !47)
!46 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!47 = !{!48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !63, !65, !66, !67, !71, !73, !75, !79, !82, !84, !87, !90, !91, !92, !93, !94}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !45, file: !46, line: 51, baseType: !7, size: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !45, file: !46, line: 54, baseType: !23, size: 64, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !45, file: !46, line: 55, baseType: !23, size: 64, offset: 128)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !45, file: !46, line: 56, baseType: !23, size: 64, offset: 192)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !45, file: !46, line: 57, baseType: !23, size: 64, offset: 256)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !45, file: !46, line: 58, baseType: !23, size: 64, offset: 320)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !45, file: !46, line: 59, baseType: !23, size: 64, offset: 384)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !45, file: !46, line: 60, baseType: !23, size: 64, offset: 448)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !45, file: !46, line: 61, baseType: !23, size: 64, offset: 512)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !45, file: !46, line: 64, baseType: !23, size: 64, offset: 576)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !45, file: !46, line: 65, baseType: !23, size: 64, offset: 640)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !45, file: !46, line: 66, baseType: !23, size: 64, offset: 704)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !45, file: !46, line: 68, baseType: !61, size: 64, offset: 768)
!61 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !62, size: 64)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !46, line: 36, flags: DIFlagFwdDecl)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !45, file: !46, line: 70, baseType: !64, size: 64, offset: 832)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !45, file: !46, line: 72, baseType: !7, size: 32, offset: 896)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !45, file: !46, line: 73, baseType: !7, size: 32, offset: 928)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !45, file: !46, line: 74, baseType: !68, size: 64, offset: 960)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !69, line: 152, baseType: !70)
!69 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!70 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !45, file: !46, line: 77, baseType: !72, size: 16, offset: 1024)
!72 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !45, file: !46, line: 78, baseType: !74, size: 8, offset: 1040)
!74 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !45, file: !46, line: 79, baseType: !76, size: 8, offset: 1048)
!76 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 8, elements: !77)
!77 = !{!78}
!78 = !DISubrange(count: 1)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !45, file: !46, line: 81, baseType: !80, size: 64, offset: 1088)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !46, line: 43, baseType: null)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !45, file: !46, line: 89, baseType: !83, size: 64, offset: 1152)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !69, line: 153, baseType: !70)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !45, file: !46, line: 91, baseType: !85, size: 64, offset: 1216)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !46, line: 37, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !45, file: !46, line: 92, baseType: !88, size: 64, offset: 1280)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !46, line: 38, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !45, file: !46, line: 93, baseType: !64, size: 64, offset: 1344)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !45, file: !46, line: 94, baseType: !6, size: 64, offset: 1408)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !45, file: !46, line: 95, baseType: !35, size: 64, offset: 1472)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !45, file: !46, line: 96, baseType: !7, size: 32, offset: 1536)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !45, file: !46, line: 98, baseType: !95, size: 160, offset: 1568)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !24, size: 160, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 20)
!98 = !DILocation(line: 45, column: 16, scope: !34)
!99 = !DILocation(line: 47, column: 17, scope: !100)
!100 = distinct !DILexicalBlock(scope: !34, file: !3, line: 47, column: 13)
!101 = !DILocation(line: 47, column: 16, scope: !100)
!102 = !DILocation(line: 47, column: 25, scope: !100)
!103 = !DILocation(line: 47, column: 13, scope: !34)
!104 = !DILocation(line: 49, column: 21, scope: !105)
!105 = distinct !DILexicalBlock(scope: !100, file: !3, line: 48, column: 9)
!106 = !DILocation(line: 49, column: 19, scope: !105)
!107 = !DILocation(line: 50, column: 17, scope: !108)
!108 = distinct !DILexicalBlock(scope: !105, file: !3, line: 50, column: 17)
!109 = !DILocation(line: 50, column: 23, scope: !108)
!110 = !DILocation(line: 50, column: 17, scope: !105)
!111 = !DILocation(line: 53, column: 27, scope: !112)
!112 = distinct !DILexicalBlock(scope: !113, file: !3, line: 53, column: 21)
!113 = distinct !DILexicalBlock(scope: !108, file: !3, line: 51, column: 13)
!114 = !DILocation(line: 53, column: 32, scope: !112)
!115 = !DILocation(line: 53, column: 31, scope: !112)
!116 = !DILocation(line: 53, column: 51, scope: !112)
!117 = !DILocation(line: 53, column: 50, scope: !112)
!118 = !DILocation(line: 53, column: 41, scope: !112)
!119 = !DILocation(line: 53, column: 61, scope: !112)
!120 = !DILocation(line: 53, column: 21, scope: !112)
!121 = !DILocation(line: 53, column: 68, scope: !112)
!122 = !DILocation(line: 53, column: 21, scope: !113)
!123 = !DILocation(line: 55, column: 21, scope: !124)
!124 = distinct !DILexicalBlock(scope: !112, file: !3, line: 54, column: 17)
!125 = !DILocation(line: 57, column: 21, scope: !124)
!126 = !DILocation(line: 57, column: 26, scope: !124)
!127 = !DILocation(line: 57, column: 35, scope: !124)
!128 = !DILocation(line: 58, column: 17, scope: !124)
!129 = !DILocation(line: 59, column: 24, scope: !113)
!130 = !DILocation(line: 59, column: 17, scope: !113)
!131 = !DILocation(line: 60, column: 13, scope: !113)
!132 = !DILocation(line: 61, column: 9, scope: !105)
!133 = !DILocation(line: 63, column: 71, scope: !19)
!134 = !DILocation(line: 64, column: 69, scope: !19)
!135 = !DILocation(line: 64, column: 5, scope: !19)
!136 = !DILocation(line: 65, column: 1, scope: !19)
!137 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 78, type: !20, scopeLine: 79, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!138 = !DILocalVariable(name: "data", scope: !137, file: !3, line: 80, type: !23)
!139 = !DILocation(line: 80, column: 12, scope: !137)
!140 = !DILocalVariable(name: "dataBuffer", scope: !137, file: !3, line: 81, type: !27)
!141 = !DILocation(line: 81, column: 10, scope: !137)
!142 = !DILocation(line: 82, column: 12, scope: !137)
!143 = !DILocation(line: 82, column: 10, scope: !137)
!144 = !DILocalVariable(name: "dataLen", scope: !145, file: !3, line: 85, type: !35)
!145 = distinct !DILexicalBlock(scope: !137, file: !3, line: 83, column: 5)
!146 = !DILocation(line: 85, column: 16, scope: !145)
!147 = !DILocation(line: 85, column: 33, scope: !145)
!148 = !DILocation(line: 85, column: 26, scope: !145)
!149 = !DILocalVariable(name: "pFile", scope: !145, file: !3, line: 86, type: !42)
!150 = !DILocation(line: 86, column: 16, scope: !145)
!151 = !DILocation(line: 88, column: 17, scope: !152)
!152 = distinct !DILexicalBlock(scope: !145, file: !3, line: 88, column: 13)
!153 = !DILocation(line: 88, column: 16, scope: !152)
!154 = !DILocation(line: 88, column: 25, scope: !152)
!155 = !DILocation(line: 88, column: 13, scope: !145)
!156 = !DILocation(line: 90, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !152, file: !3, line: 89, column: 9)
!158 = !DILocation(line: 90, column: 19, scope: !157)
