; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.CWE606_Unchecked_Loop_Condition__char_file_34_unionType = type { i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_34.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_097/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_34_bad", scope: !45, file: !45, line: 36, type: !53, scopeLine: 37, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 38, type: !42)
!56 = !DILocation(line: 38, column: 12, scope: !52)
!57 = !DILocalVariable(name: "myUnion", scope: !52, file: !45, line: 39, type: !58)
!58 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE606_Unchecked_Loop_Condition__char_file_34_unionType", file: !59, line: 9, baseType: !60)
!59 = !DIFile(filename: "./_costom_header_.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_097/source_code")
!60 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !59, line: 5, size: 64, elements: !61)
!61 = !{!62, !63}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "unionFirst", scope: !60, file: !59, line: 7, baseType: !42, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "unionSecond", scope: !60, file: !59, line: 8, baseType: !42, size: 64)
!64 = !DILocation(line: 39, column: 61, scope: !52)
!65 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 40, type: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 100)
!69 = !DILocation(line: 40, column: 10, scope: !52)
!70 = !DILocation(line: 41, column: 12, scope: !52)
!71 = !DILocation(line: 41, column: 10, scope: !52)
!72 = !DILocalVariable(name: "dataLen", scope: !73, file: !45, line: 44, type: !74)
!73 = distinct !DILexicalBlock(scope: !52, file: !45, line: 42, column: 5)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DILocation(line: 44, column: 16, scope: !73)
!78 = !DILocation(line: 44, column: 33, scope: !73)
!79 = !DILocation(line: 44, column: 26, scope: !73)
!80 = !DILocalVariable(name: "pFile", scope: !73, file: !45, line: 45, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !83, line: 7, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !102, !104, !105, !106, !110, !111, !113, !117, !120, !122, !125, !128, !129, !130, !131, !132}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !84, file: !85, line: 51, baseType: !23, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !84, file: !85, line: 54, baseType: !42, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !84, file: !85, line: 55, baseType: !42, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !84, file: !85, line: 56, baseType: !42, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !84, file: !85, line: 57, baseType: !42, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !84, file: !85, line: 58, baseType: !42, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !84, file: !85, line: 59, baseType: !42, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !84, file: !85, line: 60, baseType: !42, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !84, file: !85, line: 61, baseType: !42, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !84, file: !85, line: 64, baseType: !42, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !84, file: !85, line: 65, baseType: !42, size: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !84, file: !85, line: 66, baseType: !42, size: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !84, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !85, line: 36, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !84, file: !85, line: 70, baseType: !103, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !84, file: !85, line: 72, baseType: !23, size: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !84, file: !85, line: 73, baseType: !23, size: 32, offset: 928)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !84, file: !85, line: 74, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 152, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !84, file: !85, line: 77, baseType: !24, size: 16, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !84, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !84, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !84, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !85, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !84, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 153, baseType: !109)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !84, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !85, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !84, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !85, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !84, file: !85, line: 93, baseType: !103, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !84, file: !85, line: 94, baseType: !22, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !84, file: !85, line: 95, baseType: !74, size: 64, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !84, file: !85, line: 96, baseType: !23, size: 32, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !84, file: !85, line: 98, baseType: !133, size: 160, offset: 1568)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 20)
!136 = !DILocation(line: 45, column: 16, scope: !73)
!137 = !DILocation(line: 47, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !73, file: !45, line: 47, column: 13)
!139 = !DILocation(line: 47, column: 16, scope: !138)
!140 = !DILocation(line: 47, column: 25, scope: !138)
!141 = !DILocation(line: 47, column: 13, scope: !73)
!142 = !DILocation(line: 49, column: 21, scope: !143)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 48, column: 9)
!144 = !DILocation(line: 49, column: 19, scope: !143)
!145 = !DILocation(line: 50, column: 17, scope: !146)
!146 = distinct !DILexicalBlock(scope: !143, file: !45, line: 50, column: 17)
!147 = !DILocation(line: 50, column: 23, scope: !146)
!148 = !DILocation(line: 50, column: 17, scope: !143)
!149 = !DILocation(line: 53, column: 27, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !45, line: 53, column: 21)
!151 = distinct !DILexicalBlock(scope: !146, file: !45, line: 51, column: 13)
!152 = !DILocation(line: 53, column: 32, scope: !150)
!153 = !DILocation(line: 53, column: 31, scope: !150)
!154 = !DILocation(line: 53, column: 51, scope: !150)
!155 = !DILocation(line: 53, column: 50, scope: !150)
!156 = !DILocation(line: 53, column: 41, scope: !150)
!157 = !DILocation(line: 53, column: 61, scope: !150)
!158 = !DILocation(line: 53, column: 21, scope: !150)
!159 = !DILocation(line: 53, column: 68, scope: !150)
!160 = !DILocation(line: 53, column: 21, scope: !151)
!161 = !DILocation(line: 55, column: 21, scope: !162)
!162 = distinct !DILexicalBlock(scope: !150, file: !45, line: 54, column: 17)
!163 = !DILocation(line: 57, column: 21, scope: !162)
!164 = !DILocation(line: 57, column: 26, scope: !162)
!165 = !DILocation(line: 57, column: 35, scope: !162)
!166 = !DILocation(line: 58, column: 17, scope: !162)
!167 = !DILocation(line: 59, column: 24, scope: !151)
!168 = !DILocation(line: 59, column: 17, scope: !151)
!169 = !DILocation(line: 60, column: 13, scope: !151)
!170 = !DILocation(line: 61, column: 9, scope: !143)
!171 = !DILocation(line: 63, column: 26, scope: !52)
!172 = !DILocation(line: 63, column: 13, scope: !52)
!173 = !DILocation(line: 63, column: 24, scope: !52)
!174 = !DILocalVariable(name: "data", scope: !175, file: !45, line: 65, type: !42)
!175 = distinct !DILexicalBlock(scope: !52, file: !45, line: 64, column: 5)
!176 = !DILocation(line: 65, column: 16, scope: !175)
!177 = !DILocation(line: 65, column: 31, scope: !175)
!178 = !DILocalVariable(name: "i", scope: !179, file: !45, line: 67, type: !23)
!179 = distinct !DILexicalBlock(scope: !175, file: !45, line: 66, column: 9)
!180 = !DILocation(line: 67, column: 17, scope: !179)
!181 = !DILocalVariable(name: "n", scope: !179, file: !45, line: 67, type: !23)
!182 = !DILocation(line: 67, column: 20, scope: !179)
!183 = !DILocalVariable(name: "intVariable", scope: !179, file: !45, line: 67, type: !23)
!184 = !DILocation(line: 67, column: 23, scope: !179)
!185 = !DILocation(line: 68, column: 24, scope: !186)
!186 = distinct !DILexicalBlock(scope: !179, file: !45, line: 68, column: 17)
!187 = !DILocation(line: 68, column: 17, scope: !186)
!188 = !DILocation(line: 68, column: 40, scope: !186)
!189 = !DILocation(line: 68, column: 17, scope: !179)
!190 = !DILocation(line: 71, column: 29, scope: !191)
!191 = distinct !DILexicalBlock(scope: !186, file: !45, line: 69, column: 13)
!192 = !DILocation(line: 72, column: 24, scope: !193)
!193 = distinct !DILexicalBlock(scope: !191, file: !45, line: 72, column: 17)
!194 = !DILocation(line: 72, column: 22, scope: !193)
!195 = !DILocation(line: 72, column: 29, scope: !196)
!196 = distinct !DILexicalBlock(scope: !193, file: !45, line: 72, column: 17)
!197 = !DILocation(line: 72, column: 33, scope: !196)
!198 = !DILocation(line: 72, column: 31, scope: !196)
!199 = !DILocation(line: 72, column: 17, scope: !193)
!200 = !DILocation(line: 75, column: 32, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !45, line: 73, column: 17)
!202 = !DILocation(line: 76, column: 17, scope: !201)
!203 = !DILocation(line: 72, column: 37, scope: !196)
!204 = !DILocation(line: 72, column: 17, scope: !196)
!205 = distinct !{!205, !199, !206, !207}
!206 = !DILocation(line: 76, column: 17, scope: !193)
!207 = !{!"llvm.loop.mustprogress"}
!208 = !DILocation(line: 77, column: 30, scope: !191)
!209 = !DILocation(line: 77, column: 17, scope: !191)
!210 = !DILocation(line: 78, column: 13, scope: !191)
!211 = !DILocation(line: 81, column: 1, scope: !52)
!212 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 88, type: !53, scopeLine: 89, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!213 = !DILocalVariable(name: "data", scope: !212, file: !45, line: 90, type: !42)
!214 = !DILocation(line: 90, column: 12, scope: !212)
!215 = !DILocalVariable(name: "myUnion", scope: !212, file: !45, line: 91, type: !58)
!216 = !DILocation(line: 91, column: 61, scope: !212)
!217 = !DILocalVariable(name: "dataBuffer", scope: !212, file: !45, line: 92, type: !66)
!218 = !DILocation(line: 92, column: 10, scope: !212)
!219 = !DILocation(line: 93, column: 12, scope: !212)
!220 = !DILocation(line: 93, column: 10, scope: !212)
!221 = !DILocation(line: 95, column: 12, scope: !212)
!222 = !DILocation(line: 95, column: 5, scope: !212)
!223 = !DILocation(line: 96, column: 26, scope: !212)
!224 = !DILocation(line: 96, column: 13, scope: !212)
!225 = !DILocation(line: 96, column: 24, scope: !212)
!226 = !DILocalVariable(name: "data", scope: !227, file: !45, line: 98, type: !42)
!227 = distinct !DILexicalBlock(scope: !212, file: !45, line: 97, column: 5)
!228 = !DILocation(line: 98, column: 16, scope: !227)
!229 = !DILocation(line: 98, column: 31, scope: !227)
!230 = !DILocalVariable(name: "i", scope: !231, file: !45, line: 100, type: !23)
!231 = distinct !DILexicalBlock(scope: !227, file: !45, line: 99, column: 9)
!232 = !DILocation(line: 100, column: 17, scope: !231)
!233 = !DILocalVariable(name: "n", scope: !231, file: !45, line: 100, type: !23)
!234 = !DILocation(line: 100, column: 20, scope: !231)
!235 = !DILocalVariable(name: "intVariable", scope: !231, file: !45, line: 100, type: !23)
!236 = !DILocation(line: 100, column: 23, scope: !231)
!237 = !DILocation(line: 101, column: 24, scope: !238)
!238 = distinct !DILexicalBlock(scope: !231, file: !45, line: 101, column: 17)
!239 = !DILocation(line: 101, column: 17, scope: !238)
!240 = !DILocation(line: 101, column: 40, scope: !238)
!241 = !DILocation(line: 101, column: 17, scope: !231)
!242 = !DILocation(line: 104, column: 29, scope: !243)
!243 = distinct !DILexicalBlock(scope: !238, file: !45, line: 102, column: 13)
!244 = !DILocation(line: 105, column: 24, scope: !245)
!245 = distinct !DILexicalBlock(scope: !243, file: !45, line: 105, column: 17)
!246 = !DILocation(line: 105, column: 22, scope: !245)
!247 = !DILocation(line: 105, column: 29, scope: !248)
!248 = distinct !DILexicalBlock(scope: !245, file: !45, line: 105, column: 17)
!249 = !DILocation(line: 105, column: 33, scope: !248)
!250 = !DILocation(line: 105, column: 31, scope: !248)
!251 = !DILocation(line: 105, column: 17, scope: !245)
!252 = !DILocation(line: 108, column: 32, scope: !253)
!253 = distinct !DILexicalBlock(scope: !248, file: !45, line: 106, column: 17)
!254 = !DILocation(line: 109, column: 17, scope: !253)
!255 = !DILocation(line: 105, column: 37, scope: !248)
!256 = !DILocation(line: 105, column: 17, scope: !248)
!257 = distinct !{!257, !251, !258, !207}
!258 = !DILocation(line: 109, column: 17, scope: !245)
!259 = !DILocation(line: 110, column: 30, scope: !243)
!260 = !DILocation(line: 110, column: 17, scope: !243)
!261 = !DILocation(line: 111, column: 13, scope: !243)
!262 = !DILocation(line: 114, column: 1, scope: !212)
!263 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 117, type: !53, scopeLine: 118, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!264 = !DILocalVariable(name: "data", scope: !263, file: !45, line: 119, type: !42)
!265 = !DILocation(line: 119, column: 12, scope: !263)
!266 = !DILocalVariable(name: "myUnion", scope: !263, file: !45, line: 120, type: !58)
!267 = !DILocation(line: 120, column: 61, scope: !263)
!268 = !DILocalVariable(name: "dataBuffer", scope: !263, file: !45, line: 121, type: !66)
!269 = !DILocation(line: 121, column: 10, scope: !263)
!270 = !DILocation(line: 122, column: 12, scope: !263)
!271 = !DILocation(line: 122, column: 10, scope: !263)
!272 = !DILocalVariable(name: "dataLen", scope: !273, file: !45, line: 125, type: !74)
!273 = distinct !DILexicalBlock(scope: !263, file: !45, line: 123, column: 5)
!274 = !DILocation(line: 125, column: 16, scope: !273)
!275 = !DILocation(line: 125, column: 33, scope: !273)
!276 = !DILocation(line: 125, column: 26, scope: !273)
!277 = !DILocalVariable(name: "pFile", scope: !273, file: !45, line: 126, type: !81)
!278 = !DILocation(line: 126, column: 16, scope: !273)
!279 = !DILocation(line: 128, column: 17, scope: !280)
!280 = distinct !DILexicalBlock(scope: !273, file: !45, line: 128, column: 13)
!281 = !DILocation(line: 128, column: 16, scope: !280)
!282 = !DILocation(line: 128, column: 25, scope: !280)
!283 = !DILocation(line: 128, column: 13, scope: !273)
!284 = !DILocation(line: 130, column: 21, scope: !285)
!285 = distinct !DILexicalBlock(scope: !280, file: !45, line: 129, column: 9)
!286 = !DILocation(line: 130, column: 19, scope: !285)
!287 = !DILocation(line: 131, column: 17, scope: !288)
!288 = distinct !DILexicalBlock(scope: !285, file: !45, line: 131, column: 17)
!289 = !DILocation(line: 131, column: 23, scope: !288)
!290 = !DILocation(line: 131, column: 17, scope: !285)
!291 = !DILocation(line: 134, column: 27, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !45, line: 134, column: 21)
!293 = distinct !DILexicalBlock(scope: !288, file: !45, line: 132, column: 13)
!294 = !DILocation(line: 134, column: 32, scope: !292)
!295 = !DILocation(line: 134, column: 31, scope: !292)
!296 = !DILocation(line: 134, column: 51, scope: !292)
!297 = !DILocation(line: 134, column: 50, scope: !292)
!298 = !DILocation(line: 134, column: 41, scope: !292)
!299 = !DILocation(line: 134, column: 61, scope: !292)
!300 = !DILocation(line: 134, column: 21, scope: !292)
!301 = !DILocation(line: 134, column: 68, scope: !292)
!302 = !DILocation(line: 134, column: 21, scope: !293)
!303 = !DILocation(line: 136, column: 21, scope: !304)
!304 = distinct !DILexicalBlock(scope: !292, file: !45, line: 135, column: 17)
!305 = !DILocation(line: 138, column: 21, scope: !304)
!306 = !DILocation(line: 138, column: 26, scope: !304)
!307 = !DILocation(line: 138, column: 35, scope: !304)
!308 = !DILocation(line: 139, column: 17, scope: !304)
!309 = !DILocation(line: 140, column: 24, scope: !293)
!310 = !DILocation(line: 140, column: 17, scope: !293)
!311 = !DILocation(line: 141, column: 13, scope: !293)
!312 = !DILocation(line: 142, column: 9, scope: !285)
!313 = !DILocation(line: 144, column: 26, scope: !263)
!314 = !DILocation(line: 144, column: 13, scope: !263)
!315 = !DILocation(line: 144, column: 24, scope: !263)
!316 = !DILocalVariable(name: "data", scope: !317, file: !45, line: 146, type: !42)
!317 = distinct !DILexicalBlock(scope: !263, file: !45, line: 145, column: 5)
!318 = !DILocation(line: 146, column: 16, scope: !317)
!319 = !DILocation(line: 146, column: 31, scope: !317)
!320 = !DILocalVariable(name: "i", scope: !321, file: !45, line: 148, type: !23)
!321 = distinct !DILexicalBlock(scope: !317, file: !45, line: 147, column: 9)
!322 = !DILocation(line: 148, column: 17, scope: !321)
!323 = !DILocalVariable(name: "n", scope: !321, file: !45, line: 148, type: !23)
!324 = !DILocation(line: 148, column: 20, scope: !321)
!325 = !DILocalVariable(name: "intVariable", scope: !321, file: !45, line: 148, type: !23)
!326 = !DILocation(line: 148, column: 23, scope: !321)
!327 = !DILocation(line: 149, column: 24, scope: !328)
!328 = distinct !DILexicalBlock(scope: !321, file: !45, line: 149, column: 17)
!329 = !DILocation(line: 149, column: 17, scope: !328)
!330 = !DILocation(line: 149, column: 40, scope: !328)
!331 = !DILocation(line: 149, column: 17, scope: !321)
!332 = !DILocation(line: 152, column: 21, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !45, line: 152, column: 21)
!334 = distinct !DILexicalBlock(scope: !328, file: !45, line: 150, column: 13)
!335 = !DILocation(line: 152, column: 23, scope: !333)
!336 = !DILocation(line: 152, column: 21, scope: !334)
!337 = !DILocation(line: 154, column: 33, scope: !338)
!338 = distinct !DILexicalBlock(scope: !333, file: !45, line: 153, column: 17)
!339 = !DILocation(line: 155, column: 28, scope: !340)
!340 = distinct !DILexicalBlock(scope: !338, file: !45, line: 155, column: 21)
!341 = !DILocation(line: 155, column: 26, scope: !340)
!342 = !DILocation(line: 155, column: 33, scope: !343)
!343 = distinct !DILexicalBlock(scope: !340, file: !45, line: 155, column: 21)
!344 = !DILocation(line: 155, column: 37, scope: !343)
!345 = !DILocation(line: 155, column: 35, scope: !343)
!346 = !DILocation(line: 155, column: 21, scope: !340)
!347 = !DILocation(line: 158, column: 36, scope: !348)
!348 = distinct !DILexicalBlock(scope: !343, file: !45, line: 156, column: 21)
!349 = !DILocation(line: 159, column: 21, scope: !348)
!350 = !DILocation(line: 155, column: 41, scope: !343)
!351 = !DILocation(line: 155, column: 21, scope: !343)
!352 = distinct !{!352, !346, !353, !207}
!353 = !DILocation(line: 159, column: 21, scope: !340)
!354 = !DILocation(line: 160, column: 34, scope: !338)
!355 = !DILocation(line: 160, column: 21, scope: !338)
!356 = !DILocation(line: 161, column: 17, scope: !338)
!357 = !DILocation(line: 162, column: 13, scope: !334)
!358 = !DILocation(line: 165, column: 1, scope: !263)
!359 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_34_good", scope: !45, file: !45, line: 167, type: !53, scopeLine: 168, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!360 = !DILocation(line: 169, column: 5, scope: !359)
!361 = !DILocation(line: 170, column: 5, scope: !359)
!362 = !DILocation(line: 171, column: 1, scope: !359)
!363 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !364, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !42}
!366 = !DILocalVariable(name: "line", arg: 1, scope: !363, file: !3, line: 11, type: !42)
!367 = !DILocation(line: 11, column: 25, scope: !363)
!368 = !DILocation(line: 13, column: 1, scope: !363)
!369 = !DILocation(line: 14, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !363, file: !3, line: 14, column: 8)
!371 = !DILocation(line: 14, column: 13, scope: !370)
!372 = !DILocation(line: 14, column: 8, scope: !363)
!373 = !DILocation(line: 16, column: 24, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !3, line: 15, column: 5)
!375 = !DILocation(line: 16, column: 9, scope: !374)
!376 = !DILocation(line: 17, column: 5, scope: !374)
!377 = !DILocation(line: 18, column: 5, scope: !363)
!378 = !DILocation(line: 19, column: 1, scope: !363)
!379 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !364, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!380 = !DILocalVariable(name: "line", arg: 1, scope: !379, file: !3, line: 20, type: !42)
!381 = !DILocation(line: 20, column: 29, scope: !379)
!382 = !DILocation(line: 22, column: 8, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !3, line: 22, column: 8)
!384 = !DILocation(line: 22, column: 13, scope: !383)
!385 = !DILocation(line: 22, column: 8, scope: !379)
!386 = !DILocation(line: 24, column: 24, scope: !387)
!387 = distinct !DILexicalBlock(scope: !383, file: !3, line: 23, column: 5)
!388 = !DILocation(line: 24, column: 9, scope: !387)
!389 = !DILocation(line: 25, column: 5, scope: !387)
!390 = !DILocation(line: 26, column: 1, scope: !379)
!391 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !392, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !75, line: 74, baseType: !23)
!396 = !DILocalVariable(name: "line", arg: 1, scope: !391, file: !3, line: 27, type: !394)
!397 = !DILocation(line: 27, column: 29, scope: !391)
!398 = !DILocation(line: 29, column: 8, scope: !399)
!399 = distinct !DILexicalBlock(scope: !391, file: !3, line: 29, column: 8)
!400 = !DILocation(line: 29, column: 13, scope: !399)
!401 = !DILocation(line: 29, column: 8, scope: !391)
!402 = !DILocation(line: 31, column: 27, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !3, line: 30, column: 5)
!404 = !DILocation(line: 31, column: 9, scope: !403)
!405 = !DILocation(line: 32, column: 5, scope: !403)
!406 = !DILocation(line: 33, column: 1, scope: !391)
!407 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !408, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !23}
!410 = !DILocalVariable(name: "intNumber", arg: 1, scope: !407, file: !3, line: 35, type: !23)
!411 = !DILocation(line: 35, column: 24, scope: !407)
!412 = !DILocation(line: 37, column: 20, scope: !407)
!413 = !DILocation(line: 37, column: 5, scope: !407)
!414 = !DILocation(line: 38, column: 1, scope: !407)
!415 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !416, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!419 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !415, file: !3, line: 40, type: !418)
!420 = !DILocation(line: 40, column: 28, scope: !415)
!421 = !DILocation(line: 42, column: 21, scope: !415)
!422 = !DILocation(line: 42, column: 5, scope: !415)
!423 = !DILocation(line: 43, column: 1, scope: !415)
!424 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !425, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427}
!427 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!428 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !424, file: !3, line: 45, type: !427)
!429 = !DILocation(line: 45, column: 28, scope: !424)
!430 = !DILocation(line: 47, column: 20, scope: !424)
!431 = !DILocation(line: 47, column: 5, scope: !424)
!432 = !DILocation(line: 48, column: 1, scope: !424)
!433 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !434, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !109}
!436 = !DILocalVariable(name: "longNumber", arg: 1, scope: !433, file: !3, line: 50, type: !109)
!437 = !DILocation(line: 50, column: 26, scope: !433)
!438 = !DILocation(line: 52, column: 21, scope: !433)
!439 = !DILocation(line: 52, column: 5, scope: !433)
!440 = !DILocation(line: 53, column: 1, scope: !433)
!441 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !442, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !445, line: 27, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !108, line: 44, baseType: !109)
!447 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !441, file: !3, line: 55, type: !444)
!448 = !DILocation(line: 55, column: 33, scope: !441)
!449 = !DILocation(line: 57, column: 29, scope: !441)
!450 = !DILocation(line: 57, column: 5, scope: !441)
!451 = !DILocation(line: 58, column: 1, scope: !441)
!452 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !453, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !74}
!455 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !452, file: !3, line: 60, type: !74)
!456 = !DILocation(line: 60, column: 29, scope: !452)
!457 = !DILocation(line: 62, column: 21, scope: !452)
!458 = !DILocation(line: 62, column: 5, scope: !452)
!459 = !DILocation(line: 63, column: 1, scope: !452)
!460 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !461, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !43}
!463 = !DILocalVariable(name: "charHex", arg: 1, scope: !460, file: !3, line: 65, type: !43)
!464 = !DILocation(line: 65, column: 29, scope: !460)
!465 = !DILocation(line: 67, column: 22, scope: !460)
!466 = !DILocation(line: 67, column: 5, scope: !460)
!467 = !DILocation(line: 68, column: 1, scope: !460)
!468 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !469, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !395}
!471 = !DILocalVariable(name: "wideChar", arg: 1, scope: !468, file: !3, line: 70, type: !395)
!472 = !DILocation(line: 70, column: 29, scope: !468)
!473 = !DILocalVariable(name: "s", scope: !468, file: !3, line: 74, type: !474)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 64, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DILocation(line: 74, column: 13, scope: !468)
!478 = !DILocation(line: 75, column: 16, scope: !468)
!479 = !DILocation(line: 75, column: 9, scope: !468)
!480 = !DILocation(line: 75, column: 14, scope: !468)
!481 = !DILocation(line: 76, column: 9, scope: !468)
!482 = !DILocation(line: 76, column: 14, scope: !468)
!483 = !DILocation(line: 77, column: 21, scope: !468)
!484 = !DILocation(line: 77, column: 5, scope: !468)
!485 = !DILocation(line: 78, column: 1, scope: !468)
!486 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !487, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !7}
!489 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !486, file: !3, line: 80, type: !7)
!490 = !DILocation(line: 80, column: 33, scope: !486)
!491 = !DILocation(line: 82, column: 20, scope: !486)
!492 = !DILocation(line: 82, column: 5, scope: !486)
!493 = !DILocation(line: 83, column: 1, scope: !486)
!494 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !495, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !25}
!497 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !494, file: !3, line: 85, type: !25)
!498 = !DILocation(line: 85, column: 45, scope: !494)
!499 = !DILocation(line: 87, column: 22, scope: !494)
!500 = !DILocation(line: 87, column: 5, scope: !494)
!501 = !DILocation(line: 88, column: 1, scope: !494)
!502 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !503, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505}
!505 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!506 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !502, file: !3, line: 90, type: !505)
!507 = !DILocation(line: 90, column: 29, scope: !502)
!508 = !DILocation(line: 92, column: 20, scope: !502)
!509 = !DILocation(line: 92, column: 5, scope: !502)
!510 = !DILocation(line: 93, column: 1, scope: !502)
!511 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !512, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !516, line: 100, baseType: !517)
!516 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_097/source_code")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !516, line: 96, size: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !517, file: !516, line: 98, baseType: !23, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !517, file: !516, line: 99, baseType: !23, size: 32, offset: 32)
!521 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !511, file: !3, line: 95, type: !514)
!522 = !DILocation(line: 95, column: 40, scope: !511)
!523 = !DILocation(line: 97, column: 26, scope: !511)
!524 = !DILocation(line: 97, column: 47, scope: !511)
!525 = !DILocation(line: 97, column: 55, scope: !511)
!526 = !DILocation(line: 97, column: 76, scope: !511)
!527 = !DILocation(line: 97, column: 5, scope: !511)
!528 = !DILocation(line: 98, column: 1, scope: !511)
!529 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !530, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532, !74}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!533 = !DILocalVariable(name: "bytes", arg: 1, scope: !529, file: !3, line: 100, type: !532)
!534 = !DILocation(line: 100, column: 38, scope: !529)
!535 = !DILocalVariable(name: "numBytes", arg: 2, scope: !529, file: !3, line: 100, type: !74)
!536 = !DILocation(line: 100, column: 52, scope: !529)
!537 = !DILocalVariable(name: "i", scope: !529, file: !3, line: 102, type: !74)
!538 = !DILocation(line: 102, column: 12, scope: !529)
!539 = !DILocation(line: 103, column: 12, scope: !540)
!540 = distinct !DILexicalBlock(scope: !529, file: !3, line: 103, column: 5)
!541 = !DILocation(line: 103, column: 10, scope: !540)
!542 = !DILocation(line: 103, column: 17, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !3, line: 103, column: 5)
!544 = !DILocation(line: 103, column: 21, scope: !543)
!545 = !DILocation(line: 103, column: 19, scope: !543)
!546 = !DILocation(line: 103, column: 5, scope: !540)
!547 = !DILocation(line: 105, column: 24, scope: !548)
!548 = distinct !DILexicalBlock(scope: !543, file: !3, line: 104, column: 5)
!549 = !DILocation(line: 105, column: 30, scope: !548)
!550 = !DILocation(line: 105, column: 9, scope: !548)
!551 = !DILocation(line: 106, column: 5, scope: !548)
!552 = !DILocation(line: 103, column: 31, scope: !543)
!553 = !DILocation(line: 103, column: 5, scope: !543)
!554 = distinct !{!554, !546, !555, !207}
!555 = !DILocation(line: 106, column: 5, scope: !540)
!556 = !DILocation(line: 107, column: 5, scope: !529)
!557 = !DILocation(line: 108, column: 1, scope: !529)
!558 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !559, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!559 = !DISubroutineType(types: !560)
!560 = !{!74, !532, !74, !42}
!561 = !DILocalVariable(name: "bytes", arg: 1, scope: !558, file: !3, line: 113, type: !532)
!562 = !DILocation(line: 113, column: 39, scope: !558)
!563 = !DILocalVariable(name: "numBytes", arg: 2, scope: !558, file: !3, line: 113, type: !74)
!564 = !DILocation(line: 113, column: 53, scope: !558)
!565 = !DILocalVariable(name: "hex", arg: 3, scope: !558, file: !3, line: 113, type: !42)
!566 = !DILocation(line: 113, column: 71, scope: !558)
!567 = !DILocalVariable(name: "numWritten", scope: !558, file: !3, line: 115, type: !74)
!568 = !DILocation(line: 115, column: 12, scope: !558)
!569 = !DILocation(line: 121, column: 5, scope: !558)
!570 = !DILocation(line: 121, column: 12, scope: !558)
!571 = !DILocation(line: 121, column: 25, scope: !558)
!572 = !DILocation(line: 121, column: 23, scope: !558)
!573 = !DILocation(line: 121, column: 34, scope: !558)
!574 = !DILocation(line: 121, column: 37, scope: !558)
!575 = !DILocation(line: 121, column: 67, scope: !558)
!576 = !DILocation(line: 121, column: 70, scope: !558)
!577 = !DILocation(line: 0, scope: !558)
!578 = !DILocalVariable(name: "byte", scope: !579, file: !3, line: 123, type: !23)
!579 = distinct !DILexicalBlock(scope: !558, file: !3, line: 122, column: 5)
!580 = !DILocation(line: 123, column: 13, scope: !579)
