; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_34.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_34.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%union.CWE606_Unchecked_Loop_Condition__char_file_34_unionType = type { i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_34_bad() #0 !dbg !10 {
entry:
  %data = alloca i8*, align 8
  %myUnion = alloca %union.CWE606_Unchecked_Loop_Condition__char_file_34_unionType, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %data12 = alloca i8*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_34.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_097/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_34_bad", scope: !1, file: !1, line: 36, type: !11, scopeLine: 37, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 38, type: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocation(line: 38, column: 12, scope: !10)
!17 = !DILocalVariable(name: "myUnion", scope: !10, file: !1, line: 39, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE606_Unchecked_Loop_Condition__char_file_34_unionType", file: !19, line: 9, baseType: !20)
!19 = !DIFile(filename: "./_costom_header_.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_097/source_code")
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !19, line: 5, size: 64, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "unionFirst", scope: !20, file: !19, line: 7, baseType: !14, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "unionSecond", scope: !20, file: !19, line: 8, baseType: !14, size: 64)
!24 = !DILocation(line: 39, column: 61, scope: !10)
!25 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 40, type: !26)
!26 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !27)
!27 = !{!28}
!28 = !DISubrange(count: 100)
!29 = !DILocation(line: 40, column: 10, scope: !10)
!30 = !DILocation(line: 41, column: 12, scope: !10)
!31 = !DILocation(line: 41, column: 10, scope: !10)
!32 = !DILocalVariable(name: "dataLen", scope: !33, file: !1, line: 44, type: !34)
!33 = distinct !DILexicalBlock(scope: !10, file: !1, line: 42, column: 5)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !35, line: 46, baseType: !36)
!35 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!36 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!37 = !DILocation(line: 44, column: 16, scope: !33)
!38 = !DILocation(line: 44, column: 33, scope: !33)
!39 = !DILocation(line: 44, column: 26, scope: !33)
!40 = !DILocalVariable(name: "pFile", scope: !33, file: !1, line: 45, type: !41)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !43, line: 7, baseType: !44)
!43 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!44 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !45, line: 49, size: 1728, elements: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !62, !64, !65, !66, !70, !72, !74, !78, !81, !83, !86, !89, !90, !91, !92, !93}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !44, file: !45, line: 51, baseType: !5, size: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !44, file: !45, line: 54, baseType: !14, size: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !44, file: !45, line: 55, baseType: !14, size: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !44, file: !45, line: 56, baseType: !14, size: 64, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !44, file: !45, line: 57, baseType: !14, size: 64, offset: 256)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !44, file: !45, line: 58, baseType: !14, size: 64, offset: 320)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !44, file: !45, line: 59, baseType: !14, size: 64, offset: 384)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !44, file: !45, line: 60, baseType: !14, size: 64, offset: 448)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !44, file: !45, line: 61, baseType: !14, size: 64, offset: 512)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !44, file: !45, line: 64, baseType: !14, size: 64, offset: 576)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !44, file: !45, line: 65, baseType: !14, size: 64, offset: 640)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !44, file: !45, line: 66, baseType: !14, size: 64, offset: 704)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !44, file: !45, line: 68, baseType: !60, size: 64, offset: 768)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !45, line: 36, flags: DIFlagFwdDecl)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !44, file: !45, line: 70, baseType: !63, size: 64, offset: 832)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !44, file: !45, line: 72, baseType: !5, size: 32, offset: 896)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !44, file: !45, line: 73, baseType: !5, size: 32, offset: 928)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !44, file: !45, line: 74, baseType: !67, size: 64, offset: 960)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !68, line: 152, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!69 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !44, file: !45, line: 77, baseType: !71, size: 16, offset: 1024)
!71 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !44, file: !45, line: 78, baseType: !73, size: 8, offset: 1040)
!73 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !44, file: !45, line: 79, baseType: !75, size: 8, offset: 1048)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 1)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !44, file: !45, line: 81, baseType: !79, size: 64, offset: 1088)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !45, line: 43, baseType: null)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !44, file: !45, line: 89, baseType: !82, size: 64, offset: 1152)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !68, line: 153, baseType: !69)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !44, file: !45, line: 91, baseType: !84, size: 64, offset: 1216)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !45, line: 37, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !44, file: !45, line: 92, baseType: !87, size: 64, offset: 1280)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !45, line: 38, flags: DIFlagFwdDecl)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !44, file: !45, line: 93, baseType: !63, size: 64, offset: 1344)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !44, file: !45, line: 94, baseType: !4, size: 64, offset: 1408)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !44, file: !45, line: 95, baseType: !34, size: 64, offset: 1472)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !44, file: !45, line: 96, baseType: !5, size: 32, offset: 1536)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !44, file: !45, line: 98, baseType: !94, size: 160, offset: 1568)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !95)
!95 = !{!96}
!96 = !DISubrange(count: 20)
!97 = !DILocation(line: 45, column: 16, scope: !33)
!98 = !DILocation(line: 47, column: 17, scope: !99)
!99 = distinct !DILexicalBlock(scope: !33, file: !1, line: 47, column: 13)
!100 = !DILocation(line: 47, column: 16, scope: !99)
!101 = !DILocation(line: 47, column: 25, scope: !99)
!102 = !DILocation(line: 47, column: 13, scope: !33)
!103 = !DILocation(line: 49, column: 21, scope: !104)
!104 = distinct !DILexicalBlock(scope: !99, file: !1, line: 48, column: 9)
!105 = !DILocation(line: 49, column: 19, scope: !104)
!106 = !DILocation(line: 50, column: 17, scope: !107)
!107 = distinct !DILexicalBlock(scope: !104, file: !1, line: 50, column: 17)
!108 = !DILocation(line: 50, column: 23, scope: !107)
!109 = !DILocation(line: 50, column: 17, scope: !104)
!110 = !DILocation(line: 53, column: 27, scope: !111)
!111 = distinct !DILexicalBlock(scope: !112, file: !1, line: 53, column: 21)
!112 = distinct !DILexicalBlock(scope: !107, file: !1, line: 51, column: 13)
!113 = !DILocation(line: 53, column: 32, scope: !111)
!114 = !DILocation(line: 53, column: 31, scope: !111)
!115 = !DILocation(line: 53, column: 51, scope: !111)
!116 = !DILocation(line: 53, column: 50, scope: !111)
!117 = !DILocation(line: 53, column: 41, scope: !111)
!118 = !DILocation(line: 53, column: 61, scope: !111)
!119 = !DILocation(line: 53, column: 21, scope: !111)
!120 = !DILocation(line: 53, column: 68, scope: !111)
!121 = !DILocation(line: 53, column: 21, scope: !112)
!122 = !DILocation(line: 55, column: 21, scope: !123)
!123 = distinct !DILexicalBlock(scope: !111, file: !1, line: 54, column: 17)
!124 = !DILocation(line: 57, column: 21, scope: !123)
!125 = !DILocation(line: 57, column: 26, scope: !123)
!126 = !DILocation(line: 57, column: 35, scope: !123)
!127 = !DILocation(line: 58, column: 17, scope: !123)
!128 = !DILocation(line: 59, column: 24, scope: !112)
!129 = !DILocation(line: 59, column: 17, scope: !112)
!130 = !DILocation(line: 60, column: 13, scope: !112)
!131 = !DILocation(line: 61, column: 9, scope: !104)
!132 = !DILocation(line: 63, column: 26, scope: !10)
!133 = !DILocation(line: 63, column: 13, scope: !10)
!134 = !DILocation(line: 63, column: 24, scope: !10)
!135 = !DILocalVariable(name: "data", scope: !136, file: !1, line: 65, type: !14)
!136 = distinct !DILexicalBlock(scope: !10, file: !1, line: 64, column: 5)
!137 = !DILocation(line: 65, column: 16, scope: !136)
!138 = !DILocation(line: 65, column: 31, scope: !136)
!139 = !DILocalVariable(name: "i", scope: !140, file: !1, line: 67, type: !5)
!140 = distinct !DILexicalBlock(scope: !136, file: !1, line: 66, column: 9)
!141 = !DILocation(line: 67, column: 17, scope: !140)
!142 = !DILocalVariable(name: "n", scope: !140, file: !1, line: 67, type: !5)
!143 = !DILocation(line: 67, column: 20, scope: !140)
!144 = !DILocalVariable(name: "intVariable", scope: !140, file: !1, line: 67, type: !5)
!145 = !DILocation(line: 67, column: 23, scope: !140)
!146 = !DILocation(line: 68, column: 24, scope: !147)
!147 = distinct !DILexicalBlock(scope: !140, file: !1, line: 68, column: 17)
!148 = !DILocation(line: 68, column: 17, scope: !147)
!149 = !DILocation(line: 68, column: 40, scope: !147)
!150 = !DILocation(line: 68, column: 17, scope: !140)
!151 = !DILocation(line: 71, column: 29, scope: !152)
!152 = distinct !DILexicalBlock(scope: !147, file: !1, line: 69, column: 13)
!153 = !DILocation(line: 72, column: 24, scope: !154)
!154 = distinct !DILexicalBlock(scope: !152, file: !1, line: 72, column: 17)
!155 = !DILocation(line: 72, column: 22, scope: !154)
!156 = !DILocation(line: 72, column: 29, scope: !157)
!157 = distinct !DILexicalBlock(scope: !154, file: !1, line: 72, column: 17)
!158 = !DILocation(line: 72, column: 33, scope: !157)
