; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.15 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_53a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_105/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_53b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_105/source_code")
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !51, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!51 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_53c.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_105/source_code")
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!53 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_53d.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_105/source_code")
!54 = !{!"clang version 12.0.0"}
!55 = !{i32 7, !"Dwarf Version", i32 4}
!56 = !{i32 2, !"Debug Info Version", i32 3}
!57 = !{i32 1, !"wchar_size", i32 4}
!58 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53_bad", scope: !45, file: !45, line: 37, type: !59, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !DILocalVariable(name: "data", scope: !58, file: !45, line: 39, type: !42)
!62 = !DILocation(line: 39, column: 12, scope: !58)
!63 = !DILocalVariable(name: "dataBuffer", scope: !58, file: !45, line: 40, type: !64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 100)
!67 = !DILocation(line: 40, column: 10, scope: !58)
!68 = !DILocation(line: 41, column: 12, scope: !58)
!69 = !DILocation(line: 41, column: 10, scope: !58)
!70 = !DILocalVariable(name: "dataLen", scope: !71, file: !45, line: 44, type: !72)
!71 = distinct !DILexicalBlock(scope: !58, file: !45, line: 42, column: 5)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !73, line: 46, baseType: !74)
!73 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!74 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!75 = !DILocation(line: 44, column: 16, scope: !71)
!76 = !DILocation(line: 44, column: 33, scope: !71)
!77 = !DILocation(line: 44, column: 26, scope: !71)
!78 = !DILocalVariable(name: "pFile", scope: !71, file: !45, line: 45, type: !79)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !81, line: 7, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!82 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !83, line: 49, size: 1728, elements: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !100, !102, !103, !104, !108, !109, !111, !115, !118, !120, !123, !126, !127, !128, !129, !130}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !82, file: !83, line: 51, baseType: !23, size: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !82, file: !83, line: 54, baseType: !42, size: 64, offset: 64)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !82, file: !83, line: 55, baseType: !42, size: 64, offset: 128)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !82, file: !83, line: 56, baseType: !42, size: 64, offset: 192)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !82, file: !83, line: 57, baseType: !42, size: 64, offset: 256)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !82, file: !83, line: 58, baseType: !42, size: 64, offset: 320)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !82, file: !83, line: 59, baseType: !42, size: 64, offset: 384)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !82, file: !83, line: 60, baseType: !42, size: 64, offset: 448)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !82, file: !83, line: 61, baseType: !42, size: 64, offset: 512)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !82, file: !83, line: 64, baseType: !42, size: 64, offset: 576)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !82, file: !83, line: 65, baseType: !42, size: 64, offset: 640)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !82, file: !83, line: 66, baseType: !42, size: 64, offset: 704)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !82, file: !83, line: 68, baseType: !98, size: 64, offset: 768)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !83, line: 36, flags: DIFlagFwdDecl)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !82, file: !83, line: 70, baseType: !101, size: 64, offset: 832)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !82, file: !83, line: 72, baseType: !23, size: 32, offset: 896)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !82, file: !83, line: 73, baseType: !23, size: 32, offset: 928)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !82, file: !83, line: 74, baseType: !105, size: 64, offset: 960)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !106, line: 152, baseType: !107)
!106 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!107 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !82, file: !83, line: 77, baseType: !24, size: 16, offset: 1024)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !82, file: !83, line: 78, baseType: !110, size: 8, offset: 1040)
!110 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !82, file: !83, line: 79, baseType: !112, size: 8, offset: 1048)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !113)
!113 = !{!114}
!114 = !DISubrange(count: 1)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !82, file: !83, line: 81, baseType: !116, size: 64, offset: 1088)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !83, line: 43, baseType: null)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !82, file: !83, line: 89, baseType: !119, size: 64, offset: 1152)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !106, line: 153, baseType: !107)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !82, file: !83, line: 91, baseType: !121, size: 64, offset: 1216)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !83, line: 37, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !82, file: !83, line: 92, baseType: !124, size: 64, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !83, line: 38, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !82, file: !83, line: 93, baseType: !101, size: 64, offset: 1344)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !82, file: !83, line: 94, baseType: !22, size: 64, offset: 1408)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !82, file: !83, line: 95, baseType: !72, size: 64, offset: 1472)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !82, file: !83, line: 96, baseType: !23, size: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !82, file: !83, line: 98, baseType: !131, size: 160, offset: 1568)
!131 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !132)
!132 = !{!133}
!133 = !DISubrange(count: 20)
!134 = !DILocation(line: 45, column: 16, scope: !71)
!135 = !DILocation(line: 47, column: 17, scope: !136)
!136 = distinct !DILexicalBlock(scope: !71, file: !45, line: 47, column: 13)
!137 = !DILocation(line: 47, column: 16, scope: !136)
!138 = !DILocation(line: 47, column: 25, scope: !136)
!139 = !DILocation(line: 47, column: 13, scope: !71)
!140 = !DILocation(line: 49, column: 21, scope: !141)
!141 = distinct !DILexicalBlock(scope: !136, file: !45, line: 48, column: 9)
!142 = !DILocation(line: 49, column: 19, scope: !141)
!143 = !DILocation(line: 50, column: 17, scope: !144)
!144 = distinct !DILexicalBlock(scope: !141, file: !45, line: 50, column: 17)
!145 = !DILocation(line: 50, column: 23, scope: !144)
!146 = !DILocation(line: 50, column: 17, scope: !141)
!147 = !DILocation(line: 53, column: 27, scope: !148)
!148 = distinct !DILexicalBlock(scope: !149, file: !45, line: 53, column: 21)
!149 = distinct !DILexicalBlock(scope: !144, file: !45, line: 51, column: 13)
!150 = !DILocation(line: 53, column: 32, scope: !148)
!151 = !DILocation(line: 53, column: 31, scope: !148)
!152 = !DILocation(line: 53, column: 51, scope: !148)
!153 = !DILocation(line: 53, column: 50, scope: !148)
!154 = !DILocation(line: 53, column: 41, scope: !148)
!155 = !DILocation(line: 53, column: 61, scope: !148)
!156 = !DILocation(line: 53, column: 21, scope: !148)
!157 = !DILocation(line: 53, column: 68, scope: !148)
!158 = !DILocation(line: 53, column: 21, scope: !149)
!159 = !DILocation(line: 55, column: 21, scope: !160)
!160 = distinct !DILexicalBlock(scope: !148, file: !45, line: 54, column: 17)
!161 = !DILocation(line: 57, column: 21, scope: !160)
!162 = !DILocation(line: 57, column: 26, scope: !160)
!163 = !DILocation(line: 57, column: 35, scope: !160)
!164 = !DILocation(line: 58, column: 17, scope: !160)
!165 = !DILocation(line: 59, column: 24, scope: !149)
!166 = !DILocation(line: 59, column: 17, scope: !149)
!167 = !DILocation(line: 60, column: 13, scope: !149)
!168 = !DILocation(line: 61, column: 9, scope: !141)
!169 = !DILocation(line: 63, column: 60, scope: !58)
!170 = !DILocation(line: 63, column: 5, scope: !58)
!171 = !DILocation(line: 64, column: 1, scope: !58)
!172 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 72, type: !59, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!173 = !DILocalVariable(name: "data", scope: !172, file: !45, line: 74, type: !42)
!174 = !DILocation(line: 74, column: 12, scope: !172)
!175 = !DILocalVariable(name: "dataBuffer", scope: !172, file: !45, line: 75, type: !64)
!176 = !DILocation(line: 75, column: 10, scope: !172)
!177 = !DILocation(line: 76, column: 12, scope: !172)
!178 = !DILocation(line: 76, column: 10, scope: !172)
!179 = !DILocation(line: 78, column: 12, scope: !172)
!180 = !DILocation(line: 78, column: 5, scope: !172)
!181 = !DILocation(line: 79, column: 64, scope: !172)
!182 = !DILocation(line: 79, column: 5, scope: !172)
!183 = !DILocation(line: 80, column: 1, scope: !172)
!184 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 84, type: !59, scopeLine: 85, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!185 = !DILocalVariable(name: "data", scope: !184, file: !45, line: 86, type: !42)
!186 = !DILocation(line: 86, column: 12, scope: !184)
!187 = !DILocalVariable(name: "dataBuffer", scope: !184, file: !45, line: 87, type: !64)
!188 = !DILocation(line: 87, column: 10, scope: !184)
!189 = !DILocation(line: 88, column: 12, scope: !184)
!190 = !DILocation(line: 88, column: 10, scope: !184)
!191 = !DILocalVariable(name: "dataLen", scope: !192, file: !45, line: 91, type: !72)
!192 = distinct !DILexicalBlock(scope: !184, file: !45, line: 89, column: 5)
!193 = !DILocation(line: 91, column: 16, scope: !192)
!194 = !DILocation(line: 91, column: 33, scope: !192)
!195 = !DILocation(line: 91, column: 26, scope: !192)
!196 = !DILocalVariable(name: "pFile", scope: !192, file: !45, line: 92, type: !79)
!197 = !DILocation(line: 92, column: 16, scope: !192)
!198 = !DILocation(line: 94, column: 17, scope: !199)
!199 = distinct !DILexicalBlock(scope: !192, file: !45, line: 94, column: 13)
!200 = !DILocation(line: 94, column: 16, scope: !199)
!201 = !DILocation(line: 94, column: 25, scope: !199)
!202 = !DILocation(line: 94, column: 13, scope: !192)
!203 = !DILocation(line: 96, column: 21, scope: !204)
!204 = distinct !DILexicalBlock(scope: !199, file: !45, line: 95, column: 9)
!205 = !DILocation(line: 96, column: 19, scope: !204)
!206 = !DILocation(line: 97, column: 17, scope: !207)
!207 = distinct !DILexicalBlock(scope: !204, file: !45, line: 97, column: 17)
!208 = !DILocation(line: 97, column: 23, scope: !207)
!209 = !DILocation(line: 97, column: 17, scope: !204)
!210 = !DILocation(line: 100, column: 27, scope: !211)
!211 = distinct !DILexicalBlock(scope: !212, file: !45, line: 100, column: 21)
!212 = distinct !DILexicalBlock(scope: !207, file: !45, line: 98, column: 13)
!213 = !DILocation(line: 100, column: 32, scope: !211)
!214 = !DILocation(line: 100, column: 31, scope: !211)
!215 = !DILocation(line: 100, column: 51, scope: !211)
!216 = !DILocation(line: 100, column: 50, scope: !211)
!217 = !DILocation(line: 100, column: 41, scope: !211)
!218 = !DILocation(line: 100, column: 61, scope: !211)
!219 = !DILocation(line: 100, column: 21, scope: !211)
!220 = !DILocation(line: 100, column: 68, scope: !211)
!221 = !DILocation(line: 100, column: 21, scope: !212)
!222 = !DILocation(line: 102, column: 21, scope: !223)
!223 = distinct !DILexicalBlock(scope: !211, file: !45, line: 101, column: 17)
!224 = !DILocation(line: 104, column: 21, scope: !223)
!225 = !DILocation(line: 104, column: 26, scope: !223)
!226 = !DILocation(line: 104, column: 35, scope: !223)
!227 = !DILocation(line: 105, column: 17, scope: !223)
!228 = !DILocation(line: 106, column: 24, scope: !212)
!229 = !DILocation(line: 106, column: 17, scope: !212)
!230 = !DILocation(line: 107, column: 13, scope: !212)
!231 = !DILocation(line: 108, column: 9, scope: !204)
!232 = !DILocation(line: 110, column: 64, scope: !184)
!233 = !DILocation(line: 110, column: 5, scope: !184)
!234 = !DILocation(line: 111, column: 1, scope: !184)
!235 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53_good", scope: !45, file: !45, line: 113, type: !59, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!236 = !DILocation(line: 115, column: 5, scope: !235)
!237 = !DILocation(line: 116, column: 5, scope: !235)
!238 = !DILocation(line: 117, column: 1, scope: !235)
!239 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53b_badSink", scope: !49, file: !49, line: 37, type: !240, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!240 = !DISubroutineType(types: !241)
!241 = !{null, !42}
!242 = !DILocalVariable(name: "data", arg: 1, scope: !239, file: !49, line: 37, type: !42)
!243 = !DILocation(line: 37, column: 68, scope: !239)
!244 = !DILocation(line: 39, column: 60, scope: !239)
!245 = !DILocation(line: 39, column: 5, scope: !239)
!246 = !DILocation(line: 40, column: 1, scope: !239)
!247 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53b_goodG2BSink", scope: !49, file: !49, line: 49, type: !240, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!248 = !DILocalVariable(name: "data", arg: 1, scope: !247, file: !49, line: 49, type: !42)
!249 = !DILocation(line: 49, column: 72, scope: !247)
!250 = !DILocation(line: 51, column: 64, scope: !247)
!251 = !DILocation(line: 51, column: 5, scope: !247)
!252 = !DILocation(line: 52, column: 1, scope: !247)
!253 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53b_goodB2GSink", scope: !49, file: !49, line: 57, type: !240, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!254 = !DILocalVariable(name: "data", arg: 1, scope: !253, file: !49, line: 57, type: !42)
!255 = !DILocation(line: 57, column: 72, scope: !253)
!256 = !DILocation(line: 59, column: 64, scope: !253)
!257 = !DILocation(line: 59, column: 5, scope: !253)
!258 = !DILocation(line: 60, column: 1, scope: !253)
!259 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53c_badSink", scope: !51, file: !51, line: 37, type: !240, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!260 = !DILocalVariable(name: "data", arg: 1, scope: !259, file: !51, line: 37, type: !42)
!261 = !DILocation(line: 37, column: 68, scope: !259)
!262 = !DILocation(line: 39, column: 60, scope: !259)
!263 = !DILocation(line: 39, column: 5, scope: !259)
!264 = !DILocation(line: 40, column: 1, scope: !259)
!265 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53c_goodG2BSink", scope: !51, file: !51, line: 49, type: !240, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!266 = !DILocalVariable(name: "data", arg: 1, scope: !265, file: !51, line: 49, type: !42)
!267 = !DILocation(line: 49, column: 72, scope: !265)
!268 = !DILocation(line: 51, column: 64, scope: !265)
!269 = !DILocation(line: 51, column: 5, scope: !265)
!270 = !DILocation(line: 52, column: 1, scope: !265)
!271 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53c_goodB2GSink", scope: !51, file: !51, line: 57, type: !240, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!272 = !DILocalVariable(name: "data", arg: 1, scope: !271, file: !51, line: 57, type: !42)
!273 = !DILocation(line: 57, column: 72, scope: !271)
!274 = !DILocation(line: 59, column: 64, scope: !271)
!275 = !DILocation(line: 59, column: 5, scope: !271)
!276 = !DILocation(line: 60, column: 1, scope: !271)
!277 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53d_badSink", scope: !53, file: !53, line: 34, type: !240, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!278 = !DILocalVariable(name: "data", arg: 1, scope: !277, file: !53, line: 34, type: !42)
!279 = !DILocation(line: 34, column: 68, scope: !277)
!280 = !DILocalVariable(name: "i", scope: !281, file: !53, line: 37, type: !23)
!281 = distinct !DILexicalBlock(scope: !277, file: !53, line: 36, column: 5)
!282 = !DILocation(line: 37, column: 13, scope: !281)
!283 = !DILocalVariable(name: "n", scope: !281, file: !53, line: 37, type: !23)
!284 = !DILocation(line: 37, column: 16, scope: !281)
!285 = !DILocalVariable(name: "intVariable", scope: !281, file: !53, line: 37, type: !23)
!286 = !DILocation(line: 37, column: 19, scope: !281)
!287 = !DILocation(line: 38, column: 20, scope: !288)
!288 = distinct !DILexicalBlock(scope: !281, file: !53, line: 38, column: 13)
!289 = !DILocation(line: 38, column: 13, scope: !288)
!290 = !DILocation(line: 38, column: 36, scope: !288)
!291 = !DILocation(line: 38, column: 13, scope: !281)
!292 = !DILocation(line: 41, column: 25, scope: !293)
!293 = distinct !DILexicalBlock(scope: !288, file: !53, line: 39, column: 9)
!294 = !DILocation(line: 42, column: 20, scope: !295)
!295 = distinct !DILexicalBlock(scope: !293, file: !53, line: 42, column: 13)
!296 = !DILocation(line: 42, column: 18, scope: !295)
!297 = !DILocation(line: 42, column: 25, scope: !298)
!298 = distinct !DILexicalBlock(scope: !295, file: !53, line: 42, column: 13)
!299 = !DILocation(line: 42, column: 29, scope: !298)
!300 = !DILocation(line: 42, column: 27, scope: !298)
!301 = !DILocation(line: 42, column: 13, scope: !295)
!302 = !DILocation(line: 45, column: 28, scope: !303)
!303 = distinct !DILexicalBlock(scope: !298, file: !53, line: 43, column: 13)
!304 = !DILocation(line: 46, column: 13, scope: !303)
!305 = !DILocation(line: 42, column: 33, scope: !298)
!306 = !DILocation(line: 42, column: 13, scope: !298)
!307 = distinct !{!307, !301, !308, !309}
!308 = !DILocation(line: 46, column: 13, scope: !295)
!309 = !{!"llvm.loop.mustprogress"}
!310 = !DILocation(line: 47, column: 26, scope: !293)
!311 = !DILocation(line: 47, column: 13, scope: !293)
!312 = !DILocation(line: 48, column: 9, scope: !293)
!313 = !DILocation(line: 50, column: 1, scope: !277)
!314 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53d_goodG2BSink", scope: !53, file: !53, line: 57, type: !240, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!315 = !DILocalVariable(name: "data", arg: 1, scope: !314, file: !53, line: 57, type: !42)
!316 = !DILocation(line: 57, column: 72, scope: !314)
!317 = !DILocalVariable(name: "i", scope: !318, file: !53, line: 60, type: !23)
!318 = distinct !DILexicalBlock(scope: !314, file: !53, line: 59, column: 5)
!319 = !DILocation(line: 60, column: 13, scope: !318)
!320 = !DILocalVariable(name: "n", scope: !318, file: !53, line: 60, type: !23)
!321 = !DILocation(line: 60, column: 16, scope: !318)
!322 = !DILocalVariable(name: "intVariable", scope: !318, file: !53, line: 60, type: !23)
!323 = !DILocation(line: 60, column: 19, scope: !318)
!324 = !DILocation(line: 61, column: 20, scope: !325)
!325 = distinct !DILexicalBlock(scope: !318, file: !53, line: 61, column: 13)
!326 = !DILocation(line: 61, column: 13, scope: !325)
!327 = !DILocation(line: 61, column: 36, scope: !325)
!328 = !DILocation(line: 61, column: 13, scope: !318)
!329 = !DILocation(line: 64, column: 25, scope: !330)
!330 = distinct !DILexicalBlock(scope: !325, file: !53, line: 62, column: 9)
!331 = !DILocation(line: 65, column: 20, scope: !332)
!332 = distinct !DILexicalBlock(scope: !330, file: !53, line: 65, column: 13)
!333 = !DILocation(line: 65, column: 18, scope: !332)
!334 = !DILocation(line: 65, column: 25, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !53, line: 65, column: 13)
!336 = !DILocation(line: 65, column: 29, scope: !335)
!337 = !DILocation(line: 65, column: 27, scope: !335)
!338 = !DILocation(line: 65, column: 13, scope: !332)
!339 = !DILocation(line: 68, column: 28, scope: !340)
!340 = distinct !DILexicalBlock(scope: !335, file: !53, line: 66, column: 13)
!341 = !DILocation(line: 69, column: 13, scope: !340)
!342 = !DILocation(line: 65, column: 33, scope: !335)
!343 = !DILocation(line: 65, column: 13, scope: !335)
!344 = distinct !{!344, !338, !345, !309}
!345 = !DILocation(line: 69, column: 13, scope: !332)
!346 = !DILocation(line: 70, column: 26, scope: !330)
!347 = !DILocation(line: 70, column: 13, scope: !330)
!348 = !DILocation(line: 71, column: 9, scope: !330)
!349 = !DILocation(line: 73, column: 1, scope: !314)
!350 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_53d_goodB2GSink", scope: !53, file: !53, line: 76, type: !240, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!351 = !DILocalVariable(name: "data", arg: 1, scope: !350, file: !53, line: 76, type: !42)
!352 = !DILocation(line: 76, column: 72, scope: !350)
!353 = !DILocalVariable(name: "i", scope: !354, file: !53, line: 79, type: !23)
!354 = distinct !DILexicalBlock(scope: !350, file: !53, line: 78, column: 5)
!355 = !DILocation(line: 79, column: 13, scope: !354)
!356 = !DILocalVariable(name: "n", scope: !354, file: !53, line: 79, type: !23)
!357 = !DILocation(line: 79, column: 16, scope: !354)
!358 = !DILocalVariable(name: "intVariable", scope: !354, file: !53, line: 79, type: !23)
!359 = !DILocation(line: 79, column: 19, scope: !354)
!360 = !DILocation(line: 80, column: 20, scope: !361)
!361 = distinct !DILexicalBlock(scope: !354, file: !53, line: 80, column: 13)
!362 = !DILocation(line: 80, column: 13, scope: !361)
!363 = !DILocation(line: 80, column: 36, scope: !361)
!364 = !DILocation(line: 80, column: 13, scope: !354)
!365 = !DILocation(line: 83, column: 17, scope: !366)
!366 = distinct !DILexicalBlock(scope: !367, file: !53, line: 83, column: 17)
!367 = distinct !DILexicalBlock(scope: !361, file: !53, line: 81, column: 9)
!368 = !DILocation(line: 83, column: 19, scope: !366)
!369 = !DILocation(line: 83, column: 17, scope: !367)
!370 = !DILocation(line: 85, column: 29, scope: !371)
!371 = distinct !DILexicalBlock(scope: !366, file: !53, line: 84, column: 13)
!372 = !DILocation(line: 86, column: 24, scope: !373)
!373 = distinct !DILexicalBlock(scope: !371, file: !53, line: 86, column: 17)
!374 = !DILocation(line: 86, column: 22, scope: !373)
!375 = !DILocation(line: 86, column: 29, scope: !376)
!376 = distinct !DILexicalBlock(scope: !373, file: !53, line: 86, column: 17)
!377 = !DILocation(line: 86, column: 33, scope: !376)
!378 = !DILocation(line: 86, column: 31, scope: !376)
!379 = !DILocation(line: 86, column: 17, scope: !373)
!380 = !DILocation(line: 89, column: 32, scope: !381)
!381 = distinct !DILexicalBlock(scope: !376, file: !53, line: 87, column: 17)
!382 = !DILocation(line: 90, column: 17, scope: !381)
!383 = !DILocation(line: 86, column: 37, scope: !376)
!384 = !DILocation(line: 86, column: 17, scope: !376)
!385 = distinct !{!385, !379, !386, !309}
!386 = !DILocation(line: 90, column: 17, scope: !373)
!387 = !DILocation(line: 91, column: 30, scope: !371)
!388 = !DILocation(line: 91, column: 17, scope: !371)
!389 = !DILocation(line: 92, column: 13, scope: !371)
!390 = !DILocation(line: 93, column: 9, scope: !367)
!391 = !DILocation(line: 95, column: 1, scope: !350)
!392 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !240, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!393 = !DILocalVariable(name: "line", arg: 1, scope: !392, file: !3, line: 11, type: !42)
!394 = !DILocation(line: 11, column: 25, scope: !392)
!395 = !DILocation(line: 13, column: 1, scope: !392)
!396 = !DILocation(line: 14, column: 8, scope: !397)
!397 = distinct !DILexicalBlock(scope: !392, file: !3, line: 14, column: 8)
!398 = !DILocation(line: 14, column: 13, scope: !397)
!399 = !DILocation(line: 14, column: 8, scope: !392)
!400 = !DILocation(line: 16, column: 24, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 15, column: 5)
!402 = !DILocation(line: 16, column: 9, scope: !401)
!403 = !DILocation(line: 17, column: 5, scope: !401)
!404 = !DILocation(line: 18, column: 5, scope: !392)
!405 = !DILocation(line: 19, column: 1, scope: !392)
!406 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !240, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!407 = !DILocalVariable(name: "line", arg: 1, scope: !406, file: !3, line: 20, type: !42)
!408 = !DILocation(line: 20, column: 29, scope: !406)
!409 = !DILocation(line: 22, column: 8, scope: !410)
!410 = distinct !DILexicalBlock(scope: !406, file: !3, line: 22, column: 8)
!411 = !DILocation(line: 22, column: 13, scope: !410)
!412 = !DILocation(line: 22, column: 8, scope: !406)
!413 = !DILocation(line: 24, column: 24, scope: !414)
!414 = distinct !DILexicalBlock(scope: !410, file: !3, line: 23, column: 5)
!415 = !DILocation(line: 24, column: 9, scope: !414)
!416 = !DILocation(line: 25, column: 5, scope: !414)
!417 = !DILocation(line: 26, column: 1, scope: !406)
!418 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !419, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !421}
!421 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !422, size: 64)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !73, line: 74, baseType: !23)
!423 = !DILocalVariable(name: "line", arg: 1, scope: !418, file: !3, line: 27, type: !421)
!424 = !DILocation(line: 27, column: 29, scope: !418)
!425 = !DILocation(line: 29, column: 8, scope: !426)
!426 = distinct !DILexicalBlock(scope: !418, file: !3, line: 29, column: 8)
!427 = !DILocation(line: 29, column: 13, scope: !426)
!428 = !DILocation(line: 29, column: 8, scope: !418)
!429 = !DILocation(line: 31, column: 27, scope: !430)
!430 = distinct !DILexicalBlock(scope: !426, file: !3, line: 30, column: 5)
!431 = !DILocation(line: 31, column: 9, scope: !430)
!432 = !DILocation(line: 32, column: 5, scope: !430)
!433 = !DILocation(line: 33, column: 1, scope: !418)
!434 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !435, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !23}
!437 = !DILocalVariable(name: "intNumber", arg: 1, scope: !434, file: !3, line: 35, type: !23)
!438 = !DILocation(line: 35, column: 24, scope: !434)
!439 = !DILocation(line: 37, column: 20, scope: !434)
!440 = !DILocation(line: 37, column: 5, scope: !434)
!441 = !DILocation(line: 38, column: 1, scope: !434)
!442 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !443, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445}
!445 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!446 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !442, file: !3, line: 40, type: !445)
!447 = !DILocation(line: 40, column: 28, scope: !442)
!448 = !DILocation(line: 42, column: 21, scope: !442)
!449 = !DILocation(line: 42, column: 5, scope: !442)
!450 = !DILocation(line: 43, column: 1, scope: !442)
!451 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !452, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !454}
!454 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!455 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !451, file: !3, line: 45, type: !454)
!456 = !DILocation(line: 45, column: 28, scope: !451)
!457 = !DILocation(line: 47, column: 20, scope: !451)
!458 = !DILocation(line: 47, column: 5, scope: !451)
!459 = !DILocation(line: 48, column: 1, scope: !451)
!460 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !461, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !107}
!463 = !DILocalVariable(name: "longNumber", arg: 1, scope: !460, file: !3, line: 50, type: !107)
!464 = !DILocation(line: 50, column: 26, scope: !460)
!465 = !DILocation(line: 52, column: 21, scope: !460)
!466 = !DILocation(line: 52, column: 5, scope: !460)
!467 = !DILocation(line: 53, column: 1, scope: !460)
!468 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !469, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !471}
!471 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !472, line: 27, baseType: !473)
!472 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!473 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !106, line: 44, baseType: !107)
!474 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !468, file: !3, line: 55, type: !471)
!475 = !DILocation(line: 55, column: 33, scope: !468)
!476 = !DILocation(line: 57, column: 29, scope: !468)
!477 = !DILocation(line: 57, column: 5, scope: !468)
!478 = !DILocation(line: 58, column: 1, scope: !468)
!479 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !480, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !72}
!482 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !479, file: !3, line: 60, type: !72)
!483 = !DILocation(line: 60, column: 29, scope: !479)
!484 = !DILocation(line: 62, column: 21, scope: !479)
!485 = !DILocation(line: 62, column: 5, scope: !479)
!486 = !DILocation(line: 63, column: 1, scope: !479)
!487 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !488, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !43}
!490 = !DILocalVariable(name: "charHex", arg: 1, scope: !487, file: !3, line: 65, type: !43)
!491 = !DILocation(line: 65, column: 29, scope: !487)
!492 = !DILocation(line: 67, column: 22, scope: !487)
!493 = !DILocation(line: 67, column: 5, scope: !487)
!494 = !DILocation(line: 68, column: 1, scope: !487)
!495 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !496, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !422}
!498 = !DILocalVariable(name: "wideChar", arg: 1, scope: !495, file: !3, line: 70, type: !422)
!499 = !DILocation(line: 70, column: 29, scope: !495)
!500 = !DILocalVariable(name: "s", scope: !495, file: !3, line: 74, type: !501)
!501 = !DICompositeType(tag: DW_TAG_array_type, baseType: !422, size: 64, elements: !502)
!502 = !{!503}
!503 = !DISubrange(count: 2)
!504 = !DILocation(line: 74, column: 13, scope: !495)
!505 = !DILocation(line: 75, column: 16, scope: !495)
!506 = !DILocation(line: 75, column: 9, scope: !495)
!507 = !DILocation(line: 75, column: 14, scope: !495)
!508 = !DILocation(line: 76, column: 9, scope: !495)
!509 = !DILocation(line: 76, column: 14, scope: !495)
!510 = !DILocation(line: 77, column: 21, scope: !495)
!511 = !DILocation(line: 77, column: 5, scope: !495)
!512 = !DILocation(line: 78, column: 1, scope: !495)
!513 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !514, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !7}
!516 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !513, file: !3, line: 80, type: !7)
!517 = !DILocation(line: 80, column: 33, scope: !513)
!518 = !DILocation(line: 82, column: 20, scope: !513)
!519 = !DILocation(line: 82, column: 5, scope: !513)
!520 = !DILocation(line: 83, column: 1, scope: !513)
!521 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !522, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !25}
!524 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !521, file: !3, line: 85, type: !25)
!525 = !DILocation(line: 85, column: 45, scope: !521)
!526 = !DILocation(line: 87, column: 22, scope: !521)
!527 = !DILocation(line: 87, column: 5, scope: !521)
!528 = !DILocation(line: 88, column: 1, scope: !521)
!529 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !530, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532}
!532 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!533 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !529, file: !3, line: 90, type: !532)
!534 = !DILocation(line: 90, column: 29, scope: !529)
!535 = !DILocation(line: 92, column: 20, scope: !529)
!536 = !DILocation(line: 92, column: 5, scope: !529)
!537 = !DILocation(line: 93, column: 1, scope: !529)
!538 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !539, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !541}
!541 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !542, size: 64)
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !543, line: 100, baseType: !544)
!543 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_105/source_code")
!544 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !543, line: 96, size: 64, elements: !545)
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !544, file: !543, line: 98, baseType: !23, size: 32)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !544, file: !543, line: 99, baseType: !23, size: 32, offset: 32)
!548 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !538, file: !3, line: 95, type: !541)
!549 = !DILocation(line: 95, column: 40, scope: !538)
!550 = !DILocation(line: 97, column: 26, scope: !538)
!551 = !DILocation(line: 97, column: 47, scope: !538)
!552 = !DILocation(line: 97, column: 55, scope: !538)
!553 = !DILocation(line: 97, column: 76, scope: !538)
!554 = !DILocation(line: 97, column: 5, scope: !538)
!555 = !DILocation(line: 98, column: 1, scope: !538)
!556 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !557, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!557 = !DISubroutineType(types: !558)
!558 = !{null, !559, !72}
!559 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!560 = !DILocalVariable(name: "bytes", arg: 1, scope: !556, file: !3, line: 100, type: !559)
!561 = !DILocation(line: 100, column: 38, scope: !556)
!562 = !DILocalVariable(name: "numBytes", arg: 2, scope: !556, file: !3, line: 100, type: !72)
!563 = !DILocation(line: 100, column: 52, scope: !556)
!564 = !DILocalVariable(name: "i", scope: !556, file: !3, line: 102, type: !72)
!565 = !DILocation(line: 102, column: 12, scope: !556)
!566 = !DILocation(line: 103, column: 12, scope: !567)
!567 = distinct !DILexicalBlock(scope: !556, file: !3, line: 103, column: 5)
!568 = !DILocation(line: 103, column: 10, scope: !567)
!569 = !DILocation(line: 103, column: 17, scope: !570)
!570 = distinct !DILexicalBlock(scope: !567, file: !3, line: 103, column: 5)
!571 = !DILocation(line: 103, column: 21, scope: !570)
!572 = !DILocation(line: 103, column: 19, scope: !570)
!573 = !DILocation(line: 103, column: 5, scope: !567)
!574 = !DILocation(line: 105, column: 24, scope: !575)
!575 = distinct !DILexicalBlock(scope: !570, file: !3, line: 104, column: 5)
!576 = !DILocation(line: 105, column: 30, scope: !575)
!577 = !DILocation(line: 105, column: 9, scope: !575)
!578 = !DILocation(line: 106, column: 5, scope: !575)
!579 = !DILocation(line: 103, column: 31, scope: !570)
!580 = !DILocation(line: 103, column: 5, scope: !570)
!581 = distinct !{!581, !573, !582, !309}
!582 = !DILocation(line: 106, column: 5, scope: !567)
!583 = !DILocation(line: 107, column: 5, scope: !556)
!584 = !DILocation(line: 108, column: 1, scope: !556)
!585 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !586, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!586 = !DISubroutineType(types: !587)
!587 = !{!72, !559, !72, !42}
!588 = !DILocalVariable(name: "bytes", arg: 1, scope: !585, file: !3, line: 113, type: !559)
!589 = !DILocation(line: 113, column: 39, scope: !585)
!590 = !DILocalVariable(name: "numBytes", arg: 2, scope: !585, file: !3, line: 113, type: !72)
!591 = !DILocation(line: 113, column: 53, scope: !585)
!592 = !DILocalVariable(name: "hex", arg: 3, scope: !585, file: !3, line: 113, type: !42)
!593 = !DILocation(line: 113, column: 71, scope: !585)
!594 = !DILocalVariable(name: "numWritten", scope: !585, file: !3, line: 115, type: !72)
!595 = !DILocation(line: 115, column: 12, scope: !585)
!596 = !DILocation(line: 121, column: 5, scope: !585)
!597 = !DILocation(line: 121, column: 12, scope: !585)
!598 = !DILocation(line: 121, column: 25, scope: !585)
!599 = !DILocation(line: 121, column: 23, scope: !585)
!600 = !DILocation(line: 121, column: 34, scope: !585)
!601 = !DILocation(line: 121, column: 37, scope: !585)
!602 = !DILocation(line: 121, column: 67, scope: !585)
!603 = !DILocation(line: 121, column: 70, scope: !585)
!604 = !DILocation(line: 0, scope: !585)
!605 = !DILocalVariable(name: "byte", scope: !606, file: !3, line: 123, type: !23)
!606 = distinct !DILexicalBlock(scope: !585, file: !3, line: 122, column: 5)
!607 = !DILocation(line: 123, column: 13, scope: !606)
