; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_14.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_023/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_14_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocation(line: 38, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 38, column: 8)
!66 = !DILocation(line: 38, column: 18, scope: !65)
!67 = !DILocation(line: 38, column: 8, scope: !52)
!68 = !DILocalVariable(name: "dataLen", scope: !69, file: !45, line: 42, type: !71)
!69 = distinct !DILexicalBlock(scope: !70, file: !45, line: 40, column: 9)
!70 = distinct !DILexicalBlock(scope: !65, file: !45, line: 39, column: 5)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !72, line: 46, baseType: !73)
!72 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DILocation(line: 42, column: 20, scope: !69)
!75 = !DILocation(line: 42, column: 37, scope: !69)
!76 = !DILocation(line: 42, column: 30, scope: !69)
!77 = !DILocalVariable(name: "pFile", scope: !69, file: !45, line: 43, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 7, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 49, size: 1728, elements: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !99, !101, !102, !103, !107, !108, !110, !114, !117, !119, !122, !125, !126, !127, !128, !129}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 51, baseType: !23, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 54, baseType: !42, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 55, baseType: !42, size: 64, offset: 128)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 56, baseType: !42, size: 64, offset: 192)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 57, baseType: !42, size: 64, offset: 256)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 58, baseType: !42, size: 64, offset: 320)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 59, baseType: !42, size: 64, offset: 384)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 60, baseType: !42, size: 64, offset: 448)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 61, baseType: !42, size: 64, offset: 512)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 64, baseType: !42, size: 64, offset: 576)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 65, baseType: !42, size: 64, offset: 640)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 66, baseType: !42, size: 64, offset: 704)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 68, baseType: !97, size: 64, offset: 768)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64)
!98 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 36, flags: DIFlagFwdDecl)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 70, baseType: !100, size: 64, offset: 832)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 72, baseType: !23, size: 32, offset: 896)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 73, baseType: !23, size: 32, offset: 928)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 74, baseType: !104, size: 64, offset: 960)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !105, line: 152, baseType: !106)
!105 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!106 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 77, baseType: !24, size: 16, offset: 1024)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 78, baseType: !109, size: 8, offset: 1040)
!109 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 79, baseType: !111, size: 8, offset: 1048)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 1)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 81, baseType: !115, size: 64, offset: 1088)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 43, baseType: null)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 89, baseType: !118, size: 64, offset: 1152)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !105, line: 153, baseType: !106)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !81, file: !82, line: 91, baseType: !120, size: 64, offset: 1216)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !82, line: 37, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !81, file: !82, line: 92, baseType: !123, size: 64, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !82, line: 38, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !81, file: !82, line: 93, baseType: !100, size: 64, offset: 1344)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !81, file: !82, line: 94, baseType: !22, size: 64, offset: 1408)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 95, baseType: !71, size: 64, offset: 1472)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 96, baseType: !23, size: 32, offset: 1536)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 98, baseType: !130, size: 160, offset: 1568)
!130 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !131)
!131 = !{!132}
!132 = !DISubrange(count: 20)
!133 = !DILocation(line: 43, column: 20, scope: !69)
!134 = !DILocation(line: 45, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !69, file: !45, line: 45, column: 17)
!136 = !DILocation(line: 45, column: 20, scope: !135)
!137 = !DILocation(line: 45, column: 29, scope: !135)
!138 = !DILocation(line: 45, column: 17, scope: !69)
!139 = !DILocation(line: 47, column: 25, scope: !140)
!140 = distinct !DILexicalBlock(scope: !135, file: !45, line: 46, column: 13)
!141 = !DILocation(line: 47, column: 23, scope: !140)
!142 = !DILocation(line: 48, column: 21, scope: !143)
!143 = distinct !DILexicalBlock(scope: !140, file: !45, line: 48, column: 21)
!144 = !DILocation(line: 48, column: 27, scope: !143)
!145 = !DILocation(line: 48, column: 21, scope: !140)
!146 = !DILocation(line: 51, column: 31, scope: !147)
!147 = distinct !DILexicalBlock(scope: !148, file: !45, line: 51, column: 25)
!148 = distinct !DILexicalBlock(scope: !143, file: !45, line: 49, column: 17)
!149 = !DILocation(line: 51, column: 36, scope: !147)
!150 = !DILocation(line: 51, column: 35, scope: !147)
!151 = !DILocation(line: 51, column: 55, scope: !147)
!152 = !DILocation(line: 51, column: 54, scope: !147)
!153 = !DILocation(line: 51, column: 45, scope: !147)
!154 = !DILocation(line: 51, column: 65, scope: !147)
!155 = !DILocation(line: 51, column: 25, scope: !147)
!156 = !DILocation(line: 51, column: 72, scope: !147)
!157 = !DILocation(line: 51, column: 25, scope: !148)
!158 = !DILocation(line: 53, column: 25, scope: !159)
!159 = distinct !DILexicalBlock(scope: !147, file: !45, line: 52, column: 21)
!160 = !DILocation(line: 55, column: 25, scope: !159)
!161 = !DILocation(line: 55, column: 30, scope: !159)
!162 = !DILocation(line: 55, column: 39, scope: !159)
!163 = !DILocation(line: 56, column: 21, scope: !159)
!164 = !DILocation(line: 57, column: 28, scope: !148)
!165 = !DILocation(line: 57, column: 21, scope: !148)
!166 = !DILocation(line: 58, column: 17, scope: !148)
!167 = !DILocation(line: 59, column: 13, scope: !140)
!168 = !DILocation(line: 61, column: 5, scope: !70)
!169 = !DILocation(line: 62, column: 8, scope: !170)
!170 = distinct !DILexicalBlock(scope: !52, file: !45, line: 62, column: 8)
!171 = !DILocation(line: 62, column: 18, scope: !170)
!172 = !DILocation(line: 62, column: 8, scope: !52)
!173 = !DILocation(line: 65, column: 16, scope: !174)
!174 = distinct !DILexicalBlock(scope: !170, file: !45, line: 63, column: 5)
!175 = !DILocation(line: 65, column: 9, scope: !174)
!176 = !DILocation(line: 66, column: 5, scope: !174)
!177 = !DILocation(line: 67, column: 1, scope: !52)
!178 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 74, type: !53, scopeLine: 75, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!179 = !DILocalVariable(name: "data", scope: !178, file: !45, line: 76, type: !42)
!180 = !DILocation(line: 76, column: 12, scope: !178)
!181 = !DILocalVariable(name: "dataBuffer", scope: !178, file: !45, line: 77, type: !58)
!182 = !DILocation(line: 77, column: 10, scope: !178)
!183 = !DILocation(line: 78, column: 12, scope: !178)
!184 = !DILocation(line: 78, column: 10, scope: !178)
!185 = !DILocation(line: 79, column: 8, scope: !186)
!186 = distinct !DILexicalBlock(scope: !178, file: !45, line: 79, column: 8)
!187 = !DILocation(line: 79, column: 18, scope: !186)
!188 = !DILocation(line: 79, column: 8, scope: !178)
!189 = !DILocalVariable(name: "dataLen", scope: !190, file: !45, line: 83, type: !71)
!190 = distinct !DILexicalBlock(scope: !191, file: !45, line: 81, column: 9)
!191 = distinct !DILexicalBlock(scope: !186, file: !45, line: 80, column: 5)
!192 = !DILocation(line: 83, column: 20, scope: !190)
!193 = !DILocation(line: 83, column: 37, scope: !190)
!194 = !DILocation(line: 83, column: 30, scope: !190)
!195 = !DILocalVariable(name: "pFile", scope: !190, file: !45, line: 84, type: !78)
!196 = !DILocation(line: 84, column: 20, scope: !190)
!197 = !DILocation(line: 86, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !190, file: !45, line: 86, column: 17)
!199 = !DILocation(line: 86, column: 20, scope: !198)
!200 = !DILocation(line: 86, column: 29, scope: !198)
!201 = !DILocation(line: 86, column: 17, scope: !190)
!202 = !DILocation(line: 88, column: 25, scope: !203)
!203 = distinct !DILexicalBlock(scope: !198, file: !45, line: 87, column: 13)
!204 = !DILocation(line: 88, column: 23, scope: !203)
!205 = !DILocation(line: 89, column: 21, scope: !206)
!206 = distinct !DILexicalBlock(scope: !203, file: !45, line: 89, column: 21)
!207 = !DILocation(line: 89, column: 27, scope: !206)
!208 = !DILocation(line: 89, column: 21, scope: !203)
!209 = !DILocation(line: 92, column: 31, scope: !210)
!210 = distinct !DILexicalBlock(scope: !211, file: !45, line: 92, column: 25)
!211 = distinct !DILexicalBlock(scope: !206, file: !45, line: 90, column: 17)
!212 = !DILocation(line: 92, column: 36, scope: !210)
!213 = !DILocation(line: 92, column: 35, scope: !210)
!214 = !DILocation(line: 92, column: 55, scope: !210)
!215 = !DILocation(line: 92, column: 54, scope: !210)
!216 = !DILocation(line: 92, column: 45, scope: !210)
!217 = !DILocation(line: 92, column: 65, scope: !210)
!218 = !DILocation(line: 92, column: 25, scope: !210)
!219 = !DILocation(line: 92, column: 72, scope: !210)
!220 = !DILocation(line: 92, column: 25, scope: !211)
!221 = !DILocation(line: 94, column: 25, scope: !222)
!222 = distinct !DILexicalBlock(scope: !210, file: !45, line: 93, column: 21)
!223 = !DILocation(line: 96, column: 25, scope: !222)
!224 = !DILocation(line: 96, column: 30, scope: !222)
!225 = !DILocation(line: 96, column: 39, scope: !222)
!226 = !DILocation(line: 97, column: 21, scope: !222)
!227 = !DILocation(line: 98, column: 28, scope: !211)
!228 = !DILocation(line: 98, column: 21, scope: !211)
!229 = !DILocation(line: 99, column: 17, scope: !211)
!230 = !DILocation(line: 100, column: 13, scope: !203)
!231 = !DILocation(line: 102, column: 5, scope: !191)
!232 = !DILocation(line: 103, column: 8, scope: !233)
!233 = distinct !DILexicalBlock(scope: !178, file: !45, line: 103, column: 8)
!234 = !DILocation(line: 103, column: 18, scope: !233)
!235 = !DILocation(line: 103, column: 8, scope: !178)
!236 = !DILocation(line: 106, column: 9, scope: !237)
!237 = distinct !DILexicalBlock(scope: !233, file: !45, line: 104, column: 5)
!238 = !DILocation(line: 107, column: 5, scope: !237)
!239 = !DILocation(line: 111, column: 24, scope: !240)
!240 = distinct !DILexicalBlock(scope: !233, file: !45, line: 109, column: 5)
!241 = !DILocation(line: 111, column: 9, scope: !240)
!242 = !DILocation(line: 113, column: 1, scope: !178)
!243 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 116, type: !53, scopeLine: 117, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!244 = !DILocalVariable(name: "data", scope: !243, file: !45, line: 118, type: !42)
!245 = !DILocation(line: 118, column: 12, scope: !243)
!246 = !DILocalVariable(name: "dataBuffer", scope: !243, file: !45, line: 119, type: !58)
!247 = !DILocation(line: 119, column: 10, scope: !243)
!248 = !DILocation(line: 120, column: 12, scope: !243)
!249 = !DILocation(line: 120, column: 10, scope: !243)
!250 = !DILocation(line: 121, column: 8, scope: !251)
!251 = distinct !DILexicalBlock(scope: !243, file: !45, line: 121, column: 8)
!252 = !DILocation(line: 121, column: 18, scope: !251)
!253 = !DILocation(line: 121, column: 8, scope: !243)
!254 = !DILocalVariable(name: "dataLen", scope: !255, file: !45, line: 125, type: !71)
!255 = distinct !DILexicalBlock(scope: !256, file: !45, line: 123, column: 9)
!256 = distinct !DILexicalBlock(scope: !251, file: !45, line: 122, column: 5)
!257 = !DILocation(line: 125, column: 20, scope: !255)
!258 = !DILocation(line: 125, column: 37, scope: !255)
!259 = !DILocation(line: 125, column: 30, scope: !255)
!260 = !DILocalVariable(name: "pFile", scope: !255, file: !45, line: 126, type: !78)
!261 = !DILocation(line: 126, column: 20, scope: !255)
!262 = !DILocation(line: 128, column: 21, scope: !263)
!263 = distinct !DILexicalBlock(scope: !255, file: !45, line: 128, column: 17)
!264 = !DILocation(line: 128, column: 20, scope: !263)
!265 = !DILocation(line: 128, column: 29, scope: !263)
!266 = !DILocation(line: 128, column: 17, scope: !255)
!267 = !DILocation(line: 130, column: 25, scope: !268)
!268 = distinct !DILexicalBlock(scope: !263, file: !45, line: 129, column: 13)
!269 = !DILocation(line: 130, column: 23, scope: !268)
!270 = !DILocation(line: 131, column: 21, scope: !271)
!271 = distinct !DILexicalBlock(scope: !268, file: !45, line: 131, column: 21)
!272 = !DILocation(line: 131, column: 27, scope: !271)
!273 = !DILocation(line: 131, column: 21, scope: !268)
!274 = !DILocation(line: 134, column: 31, scope: !275)
!275 = distinct !DILexicalBlock(scope: !276, file: !45, line: 134, column: 25)
!276 = distinct !DILexicalBlock(scope: !271, file: !45, line: 132, column: 17)
!277 = !DILocation(line: 134, column: 36, scope: !275)
!278 = !DILocation(line: 134, column: 35, scope: !275)
!279 = !DILocation(line: 134, column: 55, scope: !275)
!280 = !DILocation(line: 134, column: 54, scope: !275)
!281 = !DILocation(line: 134, column: 45, scope: !275)
!282 = !DILocation(line: 134, column: 65, scope: !275)
!283 = !DILocation(line: 134, column: 25, scope: !275)
!284 = !DILocation(line: 134, column: 72, scope: !275)
!285 = !DILocation(line: 134, column: 25, scope: !276)
!286 = !DILocation(line: 136, column: 25, scope: !287)
!287 = distinct !DILexicalBlock(scope: !275, file: !45, line: 135, column: 21)
!288 = !DILocation(line: 138, column: 25, scope: !287)
!289 = !DILocation(line: 138, column: 30, scope: !287)
!290 = !DILocation(line: 138, column: 39, scope: !287)
!291 = !DILocation(line: 139, column: 21, scope: !287)
!292 = !DILocation(line: 140, column: 28, scope: !276)
!293 = !DILocation(line: 140, column: 21, scope: !276)
!294 = !DILocation(line: 141, column: 17, scope: !276)
!295 = !DILocation(line: 142, column: 13, scope: !268)
!296 = !DILocation(line: 144, column: 5, scope: !256)
!297 = !DILocation(line: 145, column: 8, scope: !298)
!298 = distinct !DILexicalBlock(scope: !243, file: !45, line: 145, column: 8)
!299 = !DILocation(line: 145, column: 18, scope: !298)
!300 = !DILocation(line: 145, column: 8, scope: !243)
!301 = !DILocation(line: 148, column: 24, scope: !302)
!302 = distinct !DILexicalBlock(scope: !298, file: !45, line: 146, column: 5)
!303 = !DILocation(line: 148, column: 9, scope: !302)
!304 = !DILocation(line: 149, column: 5, scope: !302)
!305 = !DILocation(line: 150, column: 1, scope: !243)
!306 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 153, type: !53, scopeLine: 154, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!307 = !DILocalVariable(name: "data", scope: !306, file: !45, line: 155, type: !42)
!308 = !DILocation(line: 155, column: 12, scope: !306)
!309 = !DILocalVariable(name: "dataBuffer", scope: !306, file: !45, line: 156, type: !58)
!310 = !DILocation(line: 156, column: 10, scope: !306)
!311 = !DILocation(line: 157, column: 12, scope: !306)
!312 = !DILocation(line: 157, column: 10, scope: !306)
!313 = !DILocation(line: 158, column: 8, scope: !314)
!314 = distinct !DILexicalBlock(scope: !306, file: !45, line: 158, column: 8)
!315 = !DILocation(line: 158, column: 18, scope: !314)
!316 = !DILocation(line: 158, column: 8, scope: !306)
!317 = !DILocation(line: 161, column: 9, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !45, line: 159, column: 5)
!319 = !DILocation(line: 162, column: 5, scope: !318)
!320 = !DILocation(line: 166, column: 16, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !45, line: 164, column: 5)
!322 = !DILocation(line: 166, column: 9, scope: !321)
!323 = !DILocation(line: 168, column: 8, scope: !324)
!324 = distinct !DILexicalBlock(scope: !306, file: !45, line: 168, column: 8)
!325 = !DILocation(line: 168, column: 18, scope: !324)
!326 = !DILocation(line: 168, column: 8, scope: !306)
!327 = !DILocation(line: 171, column: 16, scope: !328)
!328 = distinct !DILexicalBlock(scope: !324, file: !45, line: 169, column: 5)
!329 = !DILocation(line: 171, column: 9, scope: !328)
!330 = !DILocation(line: 172, column: 5, scope: !328)
!331 = !DILocation(line: 173, column: 1, scope: !306)
!332 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 176, type: !53, scopeLine: 177, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!333 = !DILocalVariable(name: "data", scope: !332, file: !45, line: 178, type: !42)
!334 = !DILocation(line: 178, column: 12, scope: !332)
!335 = !DILocalVariable(name: "dataBuffer", scope: !332, file: !45, line: 179, type: !58)
!336 = !DILocation(line: 179, column: 10, scope: !332)
!337 = !DILocation(line: 180, column: 12, scope: !332)
!338 = !DILocation(line: 180, column: 10, scope: !332)
!339 = !DILocation(line: 181, column: 8, scope: !340)
!340 = distinct !DILexicalBlock(scope: !332, file: !45, line: 181, column: 8)
!341 = !DILocation(line: 181, column: 18, scope: !340)
!342 = !DILocation(line: 181, column: 8, scope: !332)
!343 = !DILocation(line: 184, column: 16, scope: !344)
!344 = distinct !DILexicalBlock(scope: !340, file: !45, line: 182, column: 5)
!345 = !DILocation(line: 184, column: 9, scope: !344)
!346 = !DILocation(line: 185, column: 5, scope: !344)
!347 = !DILocation(line: 186, column: 8, scope: !348)
!348 = distinct !DILexicalBlock(scope: !332, file: !45, line: 186, column: 8)
!349 = !DILocation(line: 186, column: 18, scope: !348)
!350 = !DILocation(line: 186, column: 8, scope: !332)
!351 = !DILocation(line: 189, column: 16, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !45, line: 187, column: 5)
!353 = !DILocation(line: 189, column: 9, scope: !352)
!354 = !DILocation(line: 190, column: 5, scope: !352)
!355 = !DILocation(line: 191, column: 1, scope: !332)
!356 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_14_good", scope: !45, file: !45, line: 193, type: !53, scopeLine: 194, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!357 = !DILocation(line: 195, column: 5, scope: !356)
!358 = !DILocation(line: 196, column: 5, scope: !356)
!359 = !DILocation(line: 197, column: 5, scope: !356)
!360 = !DILocation(line: 198, column: 5, scope: !356)
!361 = !DILocation(line: 199, column: 1, scope: !356)
!362 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !363, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !42}
!365 = !DILocalVariable(name: "line", arg: 1, scope: !362, file: !3, line: 11, type: !42)
!366 = !DILocation(line: 11, column: 25, scope: !362)
!367 = !DILocation(line: 13, column: 1, scope: !362)
!368 = !DILocation(line: 14, column: 8, scope: !369)
!369 = distinct !DILexicalBlock(scope: !362, file: !3, line: 14, column: 8)
!370 = !DILocation(line: 14, column: 13, scope: !369)
!371 = !DILocation(line: 14, column: 8, scope: !362)
!372 = !DILocation(line: 16, column: 24, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !3, line: 15, column: 5)
!374 = !DILocation(line: 16, column: 9, scope: !373)
!375 = !DILocation(line: 17, column: 5, scope: !373)
!376 = !DILocation(line: 18, column: 5, scope: !362)
!377 = !DILocation(line: 19, column: 1, scope: !362)
!378 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !363, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!379 = !DILocalVariable(name: "line", arg: 1, scope: !378, file: !3, line: 20, type: !42)
!380 = !DILocation(line: 20, column: 29, scope: !378)
!381 = !DILocation(line: 22, column: 8, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !3, line: 22, column: 8)
!383 = !DILocation(line: 22, column: 13, scope: !382)
!384 = !DILocation(line: 22, column: 8, scope: !378)
!385 = !DILocation(line: 24, column: 24, scope: !386)
!386 = distinct !DILexicalBlock(scope: !382, file: !3, line: 23, column: 5)
!387 = !DILocation(line: 24, column: 9, scope: !386)
!388 = !DILocation(line: 25, column: 5, scope: !386)
!389 = !DILocation(line: 26, column: 1, scope: !378)
!390 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !391, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !393}
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64)
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !72, line: 74, baseType: !23)
!395 = !DILocalVariable(name: "line", arg: 1, scope: !390, file: !3, line: 27, type: !393)
!396 = !DILocation(line: 27, column: 29, scope: !390)
!397 = !DILocation(line: 29, column: 8, scope: !398)
!398 = distinct !DILexicalBlock(scope: !390, file: !3, line: 29, column: 8)
!399 = !DILocation(line: 29, column: 13, scope: !398)
!400 = !DILocation(line: 29, column: 8, scope: !390)
!401 = !DILocation(line: 31, column: 27, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !3, line: 30, column: 5)
!403 = !DILocation(line: 31, column: 9, scope: !402)
!404 = !DILocation(line: 32, column: 5, scope: !402)
!405 = !DILocation(line: 33, column: 1, scope: !390)
!406 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !407, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !23}
!409 = !DILocalVariable(name: "intNumber", arg: 1, scope: !406, file: !3, line: 35, type: !23)
!410 = !DILocation(line: 35, column: 24, scope: !406)
!411 = !DILocation(line: 37, column: 20, scope: !406)
!412 = !DILocation(line: 37, column: 5, scope: !406)
!413 = !DILocation(line: 38, column: 1, scope: !406)
!414 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !415, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417}
!417 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!418 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !414, file: !3, line: 40, type: !417)
!419 = !DILocation(line: 40, column: 28, scope: !414)
!420 = !DILocation(line: 42, column: 21, scope: !414)
!421 = !DILocation(line: 42, column: 5, scope: !414)
!422 = !DILocation(line: 43, column: 1, scope: !414)
!423 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !424, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !426}
!426 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!427 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !423, file: !3, line: 45, type: !426)
!428 = !DILocation(line: 45, column: 28, scope: !423)
!429 = !DILocation(line: 47, column: 20, scope: !423)
!430 = !DILocation(line: 47, column: 5, scope: !423)
!431 = !DILocation(line: 48, column: 1, scope: !423)
!432 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !433, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!433 = !DISubroutineType(types: !434)
!434 = !{null, !106}
!435 = !DILocalVariable(name: "longNumber", arg: 1, scope: !432, file: !3, line: 50, type: !106)
!436 = !DILocation(line: 50, column: 26, scope: !432)
!437 = !DILocation(line: 52, column: 21, scope: !432)
!438 = !DILocation(line: 52, column: 5, scope: !432)
!439 = !DILocation(line: 53, column: 1, scope: !432)
!440 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !441, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443}
!443 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !444, line: 27, baseType: !445)
!444 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!445 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !105, line: 44, baseType: !106)
!446 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !440, file: !3, line: 55, type: !443)
!447 = !DILocation(line: 55, column: 33, scope: !440)
!448 = !DILocation(line: 57, column: 29, scope: !440)
!449 = !DILocation(line: 57, column: 5, scope: !440)
!450 = !DILocation(line: 58, column: 1, scope: !440)
!451 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !452, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !71}
!454 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !451, file: !3, line: 60, type: !71)
!455 = !DILocation(line: 60, column: 29, scope: !451)
!456 = !DILocation(line: 62, column: 21, scope: !451)
!457 = !DILocation(line: 62, column: 5, scope: !451)
!458 = !DILocation(line: 63, column: 1, scope: !451)
!459 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !460, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !43}
!462 = !DILocalVariable(name: "charHex", arg: 1, scope: !459, file: !3, line: 65, type: !43)
!463 = !DILocation(line: 65, column: 29, scope: !459)
!464 = !DILocation(line: 67, column: 22, scope: !459)
!465 = !DILocation(line: 67, column: 5, scope: !459)
!466 = !DILocation(line: 68, column: 1, scope: !459)
!467 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !468, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !394}
!470 = !DILocalVariable(name: "wideChar", arg: 1, scope: !467, file: !3, line: 70, type: !394)
!471 = !DILocation(line: 70, column: 29, scope: !467)
!472 = !DILocalVariable(name: "s", scope: !467, file: !3, line: 74, type: !473)
!473 = !DICompositeType(tag: DW_TAG_array_type, baseType: !394, size: 64, elements: !474)
!474 = !{!475}
!475 = !DISubrange(count: 2)
!476 = !DILocation(line: 74, column: 13, scope: !467)
!477 = !DILocation(line: 75, column: 16, scope: !467)
!478 = !DILocation(line: 75, column: 9, scope: !467)
!479 = !DILocation(line: 75, column: 14, scope: !467)
!480 = !DILocation(line: 76, column: 9, scope: !467)
!481 = !DILocation(line: 76, column: 14, scope: !467)
!482 = !DILocation(line: 77, column: 21, scope: !467)
!483 = !DILocation(line: 77, column: 5, scope: !467)
!484 = !DILocation(line: 78, column: 1, scope: !467)
!485 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !486, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!486 = !DISubroutineType(types: !487)
!487 = !{null, !7}
!488 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !485, file: !3, line: 80, type: !7)
!489 = !DILocation(line: 80, column: 33, scope: !485)
!490 = !DILocation(line: 82, column: 20, scope: !485)
!491 = !DILocation(line: 82, column: 5, scope: !485)
!492 = !DILocation(line: 83, column: 1, scope: !485)
!493 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !494, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !25}
!496 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !493, file: !3, line: 85, type: !25)
!497 = !DILocation(line: 85, column: 45, scope: !493)
!498 = !DILocation(line: 87, column: 22, scope: !493)
!499 = !DILocation(line: 87, column: 5, scope: !493)
!500 = !DILocation(line: 88, column: 1, scope: !493)
!501 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !502, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !504}
!504 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!505 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !501, file: !3, line: 90, type: !504)
!506 = !DILocation(line: 90, column: 29, scope: !501)
!507 = !DILocation(line: 92, column: 20, scope: !501)
!508 = !DILocation(line: 92, column: 5, scope: !501)
!509 = !DILocation(line: 93, column: 1, scope: !501)
!510 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !511, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !513}
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !515, line: 100, baseType: !516)
!515 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_023/source_code")
!516 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !515, line: 96, size: 64, elements: !517)
!517 = !{!518, !519}
!518 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !516, file: !515, line: 98, baseType: !23, size: 32)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !516, file: !515, line: 99, baseType: !23, size: 32, offset: 32)
!520 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !510, file: !3, line: 95, type: !513)
!521 = !DILocation(line: 95, column: 40, scope: !510)
!522 = !DILocation(line: 97, column: 26, scope: !510)
!523 = !DILocation(line: 97, column: 47, scope: !510)
!524 = !DILocation(line: 97, column: 55, scope: !510)
!525 = !DILocation(line: 97, column: 76, scope: !510)
!526 = !DILocation(line: 97, column: 5, scope: !510)
!527 = !DILocation(line: 98, column: 1, scope: !510)
!528 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !529, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!529 = !DISubroutineType(types: !530)
!530 = !{null, !531, !71}
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!532 = !DILocalVariable(name: "bytes", arg: 1, scope: !528, file: !3, line: 100, type: !531)
!533 = !DILocation(line: 100, column: 38, scope: !528)
!534 = !DILocalVariable(name: "numBytes", arg: 2, scope: !528, file: !3, line: 100, type: !71)
!535 = !DILocation(line: 100, column: 52, scope: !528)
!536 = !DILocalVariable(name: "i", scope: !528, file: !3, line: 102, type: !71)
!537 = !DILocation(line: 102, column: 12, scope: !528)
!538 = !DILocation(line: 103, column: 12, scope: !539)
!539 = distinct !DILexicalBlock(scope: !528, file: !3, line: 103, column: 5)
!540 = !DILocation(line: 103, column: 10, scope: !539)
!541 = !DILocation(line: 103, column: 17, scope: !542)
!542 = distinct !DILexicalBlock(scope: !539, file: !3, line: 103, column: 5)
!543 = !DILocation(line: 103, column: 21, scope: !542)
!544 = !DILocation(line: 103, column: 19, scope: !542)
!545 = !DILocation(line: 103, column: 5, scope: !539)
!546 = !DILocation(line: 105, column: 24, scope: !547)
!547 = distinct !DILexicalBlock(scope: !542, file: !3, line: 104, column: 5)
!548 = !DILocation(line: 105, column: 30, scope: !547)
!549 = !DILocation(line: 105, column: 9, scope: !547)
!550 = !DILocation(line: 106, column: 5, scope: !547)
!551 = !DILocation(line: 103, column: 31, scope: !542)
!552 = !DILocation(line: 103, column: 5, scope: !542)
!553 = distinct !{!553, !545, !554, !555}
!554 = !DILocation(line: 106, column: 5, scope: !539)
!555 = !{!"llvm.loop.mustprogress"}
!556 = !DILocation(line: 107, column: 5, scope: !528)
!557 = !DILocation(line: 108, column: 1, scope: !528)
!558 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !559, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!559 = !DISubroutineType(types: !560)
!560 = !{!71, !531, !71, !42}
!561 = !DILocalVariable(name: "bytes", arg: 1, scope: !558, file: !3, line: 113, type: !531)
!562 = !DILocation(line: 113, column: 39, scope: !558)
!563 = !DILocalVariable(name: "numBytes", arg: 2, scope: !558, file: !3, line: 113, type: !71)
!564 = !DILocation(line: 113, column: 53, scope: !558)
!565 = !DILocalVariable(name: "hex", arg: 3, scope: !558, file: !3, line: 113, type: !42)
!566 = !DILocation(line: 113, column: 71, scope: !558)
!567 = !DILocalVariable(name: "numWritten", scope: !558, file: !3, line: 115, type: !71)
!568 = !DILocation(line: 115, column: 12, scope: !558)
!569 = !DILocation(line: 121, column: 5, scope: !558)
!570 = !DILocation(line: 121, column: 12, scope: !558)
!571 = !DILocation(line: 121, column: 25, scope: !558)
!572 = !DILocation(line: 121, column: 23, scope: !558)
!573 = !DILocation(line: 121, column: 34, scope: !558)
!574 = !DILocation(line: 121, column: 37, scope: !558)
!575 = !DILocation(line: 121, column: 67, scope: !558)
!576 = !DILocation(line: 121, column: 70, scope: !558)
!577 = !DILocation(line: 0, scope: !558)
!578 = !DILocalVariable(name: "byte", scope: !579, file: !3, line: 123, type: !23)
!579 = distinct !DILexicalBlock(scope: !558, file: !3, line: 122, column: 5)
