; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_010/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_01.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_010/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_01_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 40, type: !66)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 38, column: 5)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DILocation(line: 40, column: 16, scope: !65)
!70 = !DILocation(line: 40, column: 33, scope: !65)
!71 = !DILocation(line: 40, column: 26, scope: !65)
!72 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 41, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !102, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 51, baseType: !23, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 54, baseType: !42, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 55, baseType: !42, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 56, baseType: !42, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 57, baseType: !42, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 58, baseType: !42, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 59, baseType: !42, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 60, baseType: !42, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 61, baseType: !42, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 64, baseType: !42, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 65, baseType: !42, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 66, baseType: !42, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 72, baseType: !23, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 73, baseType: !23, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 77, baseType: !24, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 153, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !76, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !77, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !76, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !77, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !76, file: !77, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !76, file: !77, line: 94, baseType: !22, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 95, baseType: !66, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 96, baseType: !23, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocation(line: 41, column: 16, scope: !65)
!129 = !DILocation(line: 43, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !65, file: !45, line: 43, column: 13)
!131 = !DILocation(line: 43, column: 16, scope: !130)
!132 = !DILocation(line: 43, column: 25, scope: !130)
!133 = !DILocation(line: 43, column: 13, scope: !65)
!134 = !DILocation(line: 45, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !45, line: 44, column: 9)
!136 = !DILocation(line: 45, column: 19, scope: !135)
!137 = !DILocation(line: 46, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !45, line: 46, column: 17)
!139 = !DILocation(line: 46, column: 23, scope: !138)
!140 = !DILocation(line: 46, column: 17, scope: !135)
!141 = !DILocation(line: 49, column: 27, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !45, line: 49, column: 21)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 47, column: 13)
!144 = !DILocation(line: 49, column: 32, scope: !142)
!145 = !DILocation(line: 49, column: 31, scope: !142)
!146 = !DILocation(line: 49, column: 51, scope: !142)
!147 = !DILocation(line: 49, column: 50, scope: !142)
!148 = !DILocation(line: 49, column: 41, scope: !142)
!149 = !DILocation(line: 49, column: 61, scope: !142)
!150 = !DILocation(line: 49, column: 21, scope: !142)
!151 = !DILocation(line: 49, column: 68, scope: !142)
!152 = !DILocation(line: 49, column: 21, scope: !143)
!153 = !DILocation(line: 51, column: 21, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !45, line: 50, column: 17)
!155 = !DILocation(line: 53, column: 21, scope: !154)
!156 = !DILocation(line: 53, column: 26, scope: !154)
!157 = !DILocation(line: 53, column: 35, scope: !154)
!158 = !DILocation(line: 54, column: 17, scope: !154)
!159 = !DILocation(line: 55, column: 24, scope: !143)
!160 = !DILocation(line: 55, column: 17, scope: !143)
!161 = !DILocation(line: 56, column: 13, scope: !143)
!162 = !DILocation(line: 57, column: 9, scope: !135)
!163 = !DILocation(line: 60, column: 12, scope: !52)
!164 = !DILocation(line: 60, column: 5, scope: !52)
!165 = !DILocation(line: 61, column: 1, scope: !52)
!166 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 68, type: !53, scopeLine: 69, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!167 = !DILocalVariable(name: "data", scope: !166, file: !45, line: 70, type: !42)
!168 = !DILocation(line: 70, column: 12, scope: !166)
!169 = !DILocalVariable(name: "dataBuffer", scope: !166, file: !45, line: 71, type: !58)
!170 = !DILocation(line: 71, column: 10, scope: !166)
!171 = !DILocation(line: 72, column: 12, scope: !166)
!172 = !DILocation(line: 72, column: 10, scope: !166)
!173 = !DILocation(line: 74, column: 12, scope: !166)
!174 = !DILocation(line: 74, column: 5, scope: !166)
!175 = !DILocation(line: 76, column: 12, scope: !166)
!176 = !DILocation(line: 76, column: 5, scope: !166)
!177 = !DILocation(line: 77, column: 1, scope: !166)
!178 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 80, type: !53, scopeLine: 81, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!179 = !DILocalVariable(name: "data", scope: !178, file: !45, line: 82, type: !42)
!180 = !DILocation(line: 82, column: 12, scope: !178)
!181 = !DILocalVariable(name: "dataBuffer", scope: !178, file: !45, line: 83, type: !58)
!182 = !DILocation(line: 83, column: 10, scope: !178)
!183 = !DILocation(line: 84, column: 12, scope: !178)
!184 = !DILocation(line: 84, column: 10, scope: !178)
!185 = !DILocalVariable(name: "dataLen", scope: !186, file: !45, line: 87, type: !66)
!186 = distinct !DILexicalBlock(scope: !178, file: !45, line: 85, column: 5)
!187 = !DILocation(line: 87, column: 16, scope: !186)
!188 = !DILocation(line: 87, column: 33, scope: !186)
!189 = !DILocation(line: 87, column: 26, scope: !186)
!190 = !DILocalVariable(name: "pFile", scope: !186, file: !45, line: 88, type: !73)
!191 = !DILocation(line: 88, column: 16, scope: !186)
!192 = !DILocation(line: 90, column: 17, scope: !193)
!193 = distinct !DILexicalBlock(scope: !186, file: !45, line: 90, column: 13)
!194 = !DILocation(line: 90, column: 16, scope: !193)
!195 = !DILocation(line: 90, column: 25, scope: !193)
!196 = !DILocation(line: 90, column: 13, scope: !186)
!197 = !DILocation(line: 92, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !45, line: 91, column: 9)
!199 = !DILocation(line: 92, column: 19, scope: !198)
!200 = !DILocation(line: 93, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !45, line: 93, column: 17)
!202 = !DILocation(line: 93, column: 23, scope: !201)
!203 = !DILocation(line: 93, column: 17, scope: !198)
!204 = !DILocation(line: 96, column: 27, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !45, line: 96, column: 21)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 94, column: 13)
!207 = !DILocation(line: 96, column: 32, scope: !205)
!208 = !DILocation(line: 96, column: 31, scope: !205)
!209 = !DILocation(line: 96, column: 51, scope: !205)
!210 = !DILocation(line: 96, column: 50, scope: !205)
!211 = !DILocation(line: 96, column: 41, scope: !205)
!212 = !DILocation(line: 96, column: 61, scope: !205)
!213 = !DILocation(line: 96, column: 21, scope: !205)
!214 = !DILocation(line: 96, column: 68, scope: !205)
!215 = !DILocation(line: 96, column: 21, scope: !206)
!216 = !DILocation(line: 98, column: 21, scope: !217)
!217 = distinct !DILexicalBlock(scope: !205, file: !45, line: 97, column: 17)
!218 = !DILocation(line: 100, column: 21, scope: !217)
!219 = !DILocation(line: 100, column: 26, scope: !217)
!220 = !DILocation(line: 100, column: 35, scope: !217)
!221 = !DILocation(line: 101, column: 17, scope: !217)
!222 = !DILocation(line: 102, column: 24, scope: !206)
!223 = !DILocation(line: 102, column: 17, scope: !206)
!224 = !DILocation(line: 103, column: 13, scope: !206)
!225 = !DILocation(line: 104, column: 9, scope: !198)
!226 = !DILocation(line: 107, column: 20, scope: !178)
!227 = !DILocation(line: 107, column: 5, scope: !178)
!228 = !DILocation(line: 108, column: 1, scope: !178)
!229 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_01_good", scope: !45, file: !45, line: 110, type: !53, scopeLine: 111, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!230 = !DILocation(line: 112, column: 5, scope: !229)
!231 = !DILocation(line: 113, column: 5, scope: !229)
!232 = !DILocation(line: 114, column: 1, scope: !229)
!233 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !234, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!234 = !DISubroutineType(types: !235)
!235 = !{null, !42}
!236 = !DILocalVariable(name: "line", arg: 1, scope: !233, file: !3, line: 11, type: !42)
!237 = !DILocation(line: 11, column: 25, scope: !233)
!238 = !DILocation(line: 13, column: 1, scope: !233)
!239 = !DILocation(line: 14, column: 8, scope: !240)
!240 = distinct !DILexicalBlock(scope: !233, file: !3, line: 14, column: 8)
!241 = !DILocation(line: 14, column: 13, scope: !240)
!242 = !DILocation(line: 14, column: 8, scope: !233)
!243 = !DILocation(line: 16, column: 24, scope: !244)
!244 = distinct !DILexicalBlock(scope: !240, file: !3, line: 15, column: 5)
!245 = !DILocation(line: 16, column: 9, scope: !244)
!246 = !DILocation(line: 17, column: 5, scope: !244)
!247 = !DILocation(line: 18, column: 5, scope: !233)
!248 = !DILocation(line: 19, column: 1, scope: !233)
!249 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !234, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!250 = !DILocalVariable(name: "line", arg: 1, scope: !249, file: !3, line: 20, type: !42)
!251 = !DILocation(line: 20, column: 29, scope: !249)
!252 = !DILocation(line: 22, column: 8, scope: !253)
!253 = distinct !DILexicalBlock(scope: !249, file: !3, line: 22, column: 8)
!254 = !DILocation(line: 22, column: 13, scope: !253)
!255 = !DILocation(line: 22, column: 8, scope: !249)
!256 = !DILocation(line: 24, column: 24, scope: !257)
!257 = distinct !DILexicalBlock(scope: !253, file: !3, line: 23, column: 5)
!258 = !DILocation(line: 24, column: 9, scope: !257)
!259 = !DILocation(line: 25, column: 5, scope: !257)
!260 = !DILocation(line: 26, column: 1, scope: !249)
!261 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !262, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!262 = !DISubroutineType(types: !263)
!263 = !{null, !264}
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !67, line: 74, baseType: !23)
!266 = !DILocalVariable(name: "line", arg: 1, scope: !261, file: !3, line: 27, type: !264)
!267 = !DILocation(line: 27, column: 29, scope: !261)
!268 = !DILocation(line: 29, column: 8, scope: !269)
!269 = distinct !DILexicalBlock(scope: !261, file: !3, line: 29, column: 8)
!270 = !DILocation(line: 29, column: 13, scope: !269)
!271 = !DILocation(line: 29, column: 8, scope: !261)
!272 = !DILocation(line: 31, column: 27, scope: !273)
!273 = distinct !DILexicalBlock(scope: !269, file: !3, line: 30, column: 5)
!274 = !DILocation(line: 31, column: 9, scope: !273)
!275 = !DILocation(line: 32, column: 5, scope: !273)
!276 = !DILocation(line: 33, column: 1, scope: !261)
!277 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !278, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!278 = !DISubroutineType(types: !279)
!279 = !{null, !23}
!280 = !DILocalVariable(name: "intNumber", arg: 1, scope: !277, file: !3, line: 35, type: !23)
!281 = !DILocation(line: 35, column: 24, scope: !277)
!282 = !DILocation(line: 37, column: 20, scope: !277)
!283 = !DILocation(line: 37, column: 5, scope: !277)
!284 = !DILocation(line: 38, column: 1, scope: !277)
!285 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !286, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !288}
!288 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!289 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !285, file: !3, line: 40, type: !288)
!290 = !DILocation(line: 40, column: 28, scope: !285)
!291 = !DILocation(line: 42, column: 21, scope: !285)
!292 = !DILocation(line: 42, column: 5, scope: !285)
!293 = !DILocation(line: 43, column: 1, scope: !285)
!294 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !295, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!295 = !DISubroutineType(types: !296)
!296 = !{null, !297}
!297 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!298 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !294, file: !3, line: 45, type: !297)
!299 = !DILocation(line: 45, column: 28, scope: !294)
!300 = !DILocation(line: 47, column: 20, scope: !294)
!301 = !DILocation(line: 47, column: 5, scope: !294)
!302 = !DILocation(line: 48, column: 1, scope: !294)
!303 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !304, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !101}
!306 = !DILocalVariable(name: "longNumber", arg: 1, scope: !303, file: !3, line: 50, type: !101)
!307 = !DILocation(line: 50, column: 26, scope: !303)
!308 = !DILocation(line: 52, column: 21, scope: !303)
!309 = !DILocation(line: 52, column: 5, scope: !303)
!310 = !DILocation(line: 53, column: 1, scope: !303)
!311 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !312, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !314}
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !315, line: 27, baseType: !316)
!315 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !100, line: 44, baseType: !101)
!317 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !311, file: !3, line: 55, type: !314)
!318 = !DILocation(line: 55, column: 33, scope: !311)
!319 = !DILocation(line: 57, column: 29, scope: !311)
!320 = !DILocation(line: 57, column: 5, scope: !311)
!321 = !DILocation(line: 58, column: 1, scope: !311)
!322 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !323, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!323 = !DISubroutineType(types: !324)
!324 = !{null, !66}
!325 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !322, file: !3, line: 60, type: !66)
!326 = !DILocation(line: 60, column: 29, scope: !322)
!327 = !DILocation(line: 62, column: 21, scope: !322)
!328 = !DILocation(line: 62, column: 5, scope: !322)
!329 = !DILocation(line: 63, column: 1, scope: !322)
!330 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !331, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !43}
!333 = !DILocalVariable(name: "charHex", arg: 1, scope: !330, file: !3, line: 65, type: !43)
!334 = !DILocation(line: 65, column: 29, scope: !330)
!335 = !DILocation(line: 67, column: 22, scope: !330)
!336 = !DILocation(line: 67, column: 5, scope: !330)
!337 = !DILocation(line: 68, column: 1, scope: !330)
!338 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !339, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!339 = !DISubroutineType(types: !340)
!340 = !{null, !265}
!341 = !DILocalVariable(name: "wideChar", arg: 1, scope: !338, file: !3, line: 70, type: !265)
!342 = !DILocation(line: 70, column: 29, scope: !338)
!343 = !DILocalVariable(name: "s", scope: !338, file: !3, line: 74, type: !344)
!344 = !DICompositeType(tag: DW_TAG_array_type, baseType: !265, size: 64, elements: !345)
!345 = !{!346}
!346 = !DISubrange(count: 2)
!347 = !DILocation(line: 74, column: 13, scope: !338)
!348 = !DILocation(line: 75, column: 16, scope: !338)
!349 = !DILocation(line: 75, column: 9, scope: !338)
!350 = !DILocation(line: 75, column: 14, scope: !338)
!351 = !DILocation(line: 76, column: 9, scope: !338)
!352 = !DILocation(line: 76, column: 14, scope: !338)
!353 = !DILocation(line: 77, column: 21, scope: !338)
!354 = !DILocation(line: 77, column: 5, scope: !338)
!355 = !DILocation(line: 78, column: 1, scope: !338)
!356 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !357, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !7}
!359 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !356, file: !3, line: 80, type: !7)
!360 = !DILocation(line: 80, column: 33, scope: !356)
!361 = !DILocation(line: 82, column: 20, scope: !356)
!362 = !DILocation(line: 82, column: 5, scope: !356)
!363 = !DILocation(line: 83, column: 1, scope: !356)
!364 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !365, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !25}
!367 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !364, file: !3, line: 85, type: !25)
!368 = !DILocation(line: 85, column: 45, scope: !364)
!369 = !DILocation(line: 87, column: 22, scope: !364)
!370 = !DILocation(line: 87, column: 5, scope: !364)
!371 = !DILocation(line: 88, column: 1, scope: !364)
!372 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !373, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375}
!375 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!376 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !372, file: !3, line: 90, type: !375)
!377 = !DILocation(line: 90, column: 29, scope: !372)
!378 = !DILocation(line: 92, column: 20, scope: !372)
!379 = !DILocation(line: 92, column: 5, scope: !372)
!380 = !DILocation(line: 93, column: 1, scope: !372)
!381 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !382, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !384}
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !386, line: 100, baseType: !387)
!386 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_010/source_code")
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !386, line: 96, size: 64, elements: !388)
!388 = !{!389, !390}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !387, file: !386, line: 98, baseType: !23, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !387, file: !386, line: 99, baseType: !23, size: 32, offset: 32)
!391 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !381, file: !3, line: 95, type: !384)
!392 = !DILocation(line: 95, column: 40, scope: !381)
!393 = !DILocation(line: 97, column: 26, scope: !381)
!394 = !DILocation(line: 97, column: 47, scope: !381)
!395 = !DILocation(line: 97, column: 55, scope: !381)
!396 = !DILocation(line: 97, column: 76, scope: !381)
!397 = !DILocation(line: 97, column: 5, scope: !381)
!398 = !DILocation(line: 98, column: 1, scope: !381)
!399 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !400, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !402, !66}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!403 = !DILocalVariable(name: "bytes", arg: 1, scope: !399, file: !3, line: 100, type: !402)
!404 = !DILocation(line: 100, column: 38, scope: !399)
!405 = !DILocalVariable(name: "numBytes", arg: 2, scope: !399, file: !3, line: 100, type: !66)
!406 = !DILocation(line: 100, column: 52, scope: !399)
!407 = !DILocalVariable(name: "i", scope: !399, file: !3, line: 102, type: !66)
!408 = !DILocation(line: 102, column: 12, scope: !399)
!409 = !DILocation(line: 103, column: 12, scope: !410)
!410 = distinct !DILexicalBlock(scope: !399, file: !3, line: 103, column: 5)
!411 = !DILocation(line: 103, column: 10, scope: !410)
!412 = !DILocation(line: 103, column: 17, scope: !413)
!413 = distinct !DILexicalBlock(scope: !410, file: !3, line: 103, column: 5)
!414 = !DILocation(line: 103, column: 21, scope: !413)
!415 = !DILocation(line: 103, column: 19, scope: !413)
!416 = !DILocation(line: 103, column: 5, scope: !410)
!417 = !DILocation(line: 105, column: 24, scope: !418)
!418 = distinct !DILexicalBlock(scope: !413, file: !3, line: 104, column: 5)
!419 = !DILocation(line: 105, column: 30, scope: !418)
!420 = !DILocation(line: 105, column: 9, scope: !418)
!421 = !DILocation(line: 106, column: 5, scope: !418)
!422 = !DILocation(line: 103, column: 31, scope: !413)
!423 = !DILocation(line: 103, column: 5, scope: !413)
!424 = distinct !{!424, !416, !425, !426}
!425 = !DILocation(line: 106, column: 5, scope: !410)
!426 = !{!"llvm.loop.mustprogress"}
!427 = !DILocation(line: 107, column: 5, scope: !399)
!428 = !DILocation(line: 108, column: 1, scope: !399)
!429 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !430, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!430 = !DISubroutineType(types: !431)
!431 = !{!66, !402, !66, !42}
!432 = !DILocalVariable(name: "bytes", arg: 1, scope: !429, file: !3, line: 113, type: !402)
!433 = !DILocation(line: 113, column: 39, scope: !429)
!434 = !DILocalVariable(name: "numBytes", arg: 2, scope: !429, file: !3, line: 113, type: !66)
!435 = !DILocation(line: 113, column: 53, scope: !429)
!436 = !DILocalVariable(name: "hex", arg: 3, scope: !429, file: !3, line: 113, type: !42)
!437 = !DILocation(line: 113, column: 71, scope: !429)
!438 = !DILocalVariable(name: "numWritten", scope: !429, file: !3, line: 115, type: !66)
!439 = !DILocation(line: 115, column: 12, scope: !429)
!440 = !DILocation(line: 121, column: 5, scope: !429)
!441 = !DILocation(line: 121, column: 12, scope: !429)
!442 = !DILocation(line: 121, column: 25, scope: !429)
!443 = !DILocation(line: 121, column: 23, scope: !429)
!444 = !DILocation(line: 121, column: 34, scope: !429)
!445 = !DILocation(line: 121, column: 37, scope: !429)
!446 = !DILocation(line: 121, column: 67, scope: !429)
!447 = !DILocation(line: 121, column: 70, scope: !429)
!448 = !DILocation(line: 0, scope: !429)
!449 = !DILocalVariable(name: "byte", scope: !450, file: !3, line: 123, type: !23)
!450 = distinct !DILexicalBlock(scope: !429, file: !3, line: 122, column: 5)
