; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_32.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_095/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_32_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataPtr1", scope: !52, file: !45, line: 38, type: !41)
!58 = !DILocation(line: 38, column: 13, scope: !52)
!59 = !DILocalVariable(name: "dataPtr2", scope: !52, file: !45, line: 39, type: !41)
!60 = !DILocation(line: 39, column: 13, scope: !52)
!61 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 40, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DILocation(line: 40, column: 10, scope: !52)
!66 = !DILocation(line: 41, column: 12, scope: !52)
!67 = !DILocation(line: 41, column: 10, scope: !52)
!68 = !DILocalVariable(name: "data", scope: !69, file: !45, line: 43, type: !42)
!69 = distinct !DILexicalBlock(scope: !52, file: !45, line: 42, column: 5)
!70 = !DILocation(line: 43, column: 16, scope: !69)
!71 = !DILocation(line: 43, column: 24, scope: !69)
!72 = !DILocation(line: 43, column: 23, scope: !69)
!73 = !DILocalVariable(name: "dataLen", scope: !74, file: !45, line: 46, type: !75)
!74 = distinct !DILexicalBlock(scope: !69, file: !45, line: 44, column: 9)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DILocation(line: 46, column: 20, scope: !74)
!79 = !DILocation(line: 46, column: 37, scope: !74)
!80 = !DILocation(line: 46, column: 30, scope: !74)
!81 = !DILocalVariable(name: "pFile", scope: !74, file: !45, line: 47, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 7, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !105, !106, !107, !111, !112, !114, !118, !121, !123, !126, !129, !130, !131, !132, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !23, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !42, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !42, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !42, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !42, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !42, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !42, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !42, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !42, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !42, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !42, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !42, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !23, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !23, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !24, size: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !113, size: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !115, size: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !119, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !122, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 153, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !104, size: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !22, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !75, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !23, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 47, column: 20, scope: !74)
!138 = !DILocation(line: 49, column: 21, scope: !139)
!139 = distinct !DILexicalBlock(scope: !74, file: !45, line: 49, column: 17)
!140 = !DILocation(line: 49, column: 20, scope: !139)
!141 = !DILocation(line: 49, column: 29, scope: !139)
!142 = !DILocation(line: 49, column: 17, scope: !74)
!143 = !DILocation(line: 51, column: 25, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !45, line: 50, column: 13)
!145 = !DILocation(line: 51, column: 23, scope: !144)
!146 = !DILocation(line: 52, column: 21, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !45, line: 52, column: 21)
!148 = !DILocation(line: 52, column: 27, scope: !147)
!149 = !DILocation(line: 52, column: 21, scope: !144)
!150 = !DILocation(line: 55, column: 31, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !45, line: 55, column: 25)
!152 = distinct !DILexicalBlock(scope: !147, file: !45, line: 53, column: 17)
!153 = !DILocation(line: 55, column: 36, scope: !151)
!154 = !DILocation(line: 55, column: 35, scope: !151)
!155 = !DILocation(line: 55, column: 55, scope: !151)
!156 = !DILocation(line: 55, column: 54, scope: !151)
!157 = !DILocation(line: 55, column: 45, scope: !151)
!158 = !DILocation(line: 55, column: 65, scope: !151)
!159 = !DILocation(line: 55, column: 25, scope: !151)
!160 = !DILocation(line: 55, column: 72, scope: !151)
!161 = !DILocation(line: 55, column: 25, scope: !152)
!162 = !DILocation(line: 57, column: 25, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !45, line: 56, column: 21)
!164 = !DILocation(line: 59, column: 25, scope: !163)
!165 = !DILocation(line: 59, column: 30, scope: !163)
!166 = !DILocation(line: 59, column: 39, scope: !163)
!167 = !DILocation(line: 60, column: 21, scope: !163)
!168 = !DILocation(line: 61, column: 28, scope: !152)
!169 = !DILocation(line: 61, column: 21, scope: !152)
!170 = !DILocation(line: 62, column: 17, scope: !152)
!171 = !DILocation(line: 63, column: 13, scope: !144)
!172 = !DILocation(line: 65, column: 21, scope: !69)
!173 = !DILocation(line: 65, column: 10, scope: !69)
!174 = !DILocation(line: 65, column: 19, scope: !69)
!175 = !DILocalVariable(name: "data", scope: !176, file: !45, line: 68, type: !42)
!176 = distinct !DILexicalBlock(scope: !52, file: !45, line: 67, column: 5)
!177 = !DILocation(line: 68, column: 16, scope: !176)
!178 = !DILocation(line: 68, column: 24, scope: !176)
!179 = !DILocation(line: 68, column: 23, scope: !176)
!180 = !DILocalVariable(name: "i", scope: !181, file: !45, line: 70, type: !23)
!181 = distinct !DILexicalBlock(scope: !176, file: !45, line: 69, column: 9)
!182 = !DILocation(line: 70, column: 17, scope: !181)
!183 = !DILocalVariable(name: "n", scope: !181, file: !45, line: 70, type: !23)
!184 = !DILocation(line: 70, column: 20, scope: !181)
!185 = !DILocalVariable(name: "intVariable", scope: !181, file: !45, line: 70, type: !23)
!186 = !DILocation(line: 70, column: 23, scope: !181)
!187 = !DILocation(line: 71, column: 24, scope: !188)
!188 = distinct !DILexicalBlock(scope: !181, file: !45, line: 71, column: 17)
!189 = !DILocation(line: 71, column: 17, scope: !188)
!190 = !DILocation(line: 71, column: 40, scope: !188)
!191 = !DILocation(line: 71, column: 17, scope: !181)
!192 = !DILocation(line: 74, column: 29, scope: !193)
!193 = distinct !DILexicalBlock(scope: !188, file: !45, line: 72, column: 13)
!194 = !DILocation(line: 75, column: 24, scope: !195)
!195 = distinct !DILexicalBlock(scope: !193, file: !45, line: 75, column: 17)
!196 = !DILocation(line: 75, column: 22, scope: !195)
!197 = !DILocation(line: 75, column: 29, scope: !198)
!198 = distinct !DILexicalBlock(scope: !195, file: !45, line: 75, column: 17)
!199 = !DILocation(line: 75, column: 33, scope: !198)
!200 = !DILocation(line: 75, column: 31, scope: !198)
!201 = !DILocation(line: 75, column: 17, scope: !195)
!202 = !DILocation(line: 78, column: 32, scope: !203)
!203 = distinct !DILexicalBlock(scope: !198, file: !45, line: 76, column: 17)
!204 = !DILocation(line: 79, column: 17, scope: !203)
!205 = !DILocation(line: 75, column: 37, scope: !198)
!206 = !DILocation(line: 75, column: 17, scope: !198)
!207 = distinct !{!207, !201, !208, !209}
!208 = !DILocation(line: 79, column: 17, scope: !195)
!209 = !{!"llvm.loop.mustprogress"}
!210 = !DILocation(line: 80, column: 30, scope: !193)
!211 = !DILocation(line: 80, column: 17, scope: !193)
!212 = !DILocation(line: 81, column: 13, scope: !193)
!213 = !DILocation(line: 84, column: 1, scope: !52)
!214 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 91, type: !53, scopeLine: 92, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!215 = !DILocalVariable(name: "data", scope: !214, file: !45, line: 93, type: !42)
!216 = !DILocation(line: 93, column: 12, scope: !214)
!217 = !DILocalVariable(name: "dataPtr1", scope: !214, file: !45, line: 94, type: !41)
!218 = !DILocation(line: 94, column: 13, scope: !214)
!219 = !DILocalVariable(name: "dataPtr2", scope: !214, file: !45, line: 95, type: !41)
!220 = !DILocation(line: 95, column: 13, scope: !214)
!221 = !DILocalVariable(name: "dataBuffer", scope: !214, file: !45, line: 96, type: !62)
!222 = !DILocation(line: 96, column: 10, scope: !214)
!223 = !DILocation(line: 97, column: 12, scope: !214)
!224 = !DILocation(line: 97, column: 10, scope: !214)
!225 = !DILocalVariable(name: "data", scope: !226, file: !45, line: 99, type: !42)
!226 = distinct !DILexicalBlock(scope: !214, file: !45, line: 98, column: 5)
!227 = !DILocation(line: 99, column: 16, scope: !226)
!228 = !DILocation(line: 99, column: 24, scope: !226)
!229 = !DILocation(line: 99, column: 23, scope: !226)
!230 = !DILocation(line: 101, column: 16, scope: !226)
!231 = !DILocation(line: 101, column: 9, scope: !226)
!232 = !DILocation(line: 102, column: 21, scope: !226)
!233 = !DILocation(line: 102, column: 10, scope: !226)
!234 = !DILocation(line: 102, column: 19, scope: !226)
!235 = !DILocalVariable(name: "data", scope: !236, file: !45, line: 105, type: !42)
!236 = distinct !DILexicalBlock(scope: !214, file: !45, line: 104, column: 5)
!237 = !DILocation(line: 105, column: 16, scope: !236)
!238 = !DILocation(line: 105, column: 24, scope: !236)
!239 = !DILocation(line: 105, column: 23, scope: !236)
!240 = !DILocalVariable(name: "i", scope: !241, file: !45, line: 107, type: !23)
!241 = distinct !DILexicalBlock(scope: !236, file: !45, line: 106, column: 9)
!242 = !DILocation(line: 107, column: 17, scope: !241)
!243 = !DILocalVariable(name: "n", scope: !241, file: !45, line: 107, type: !23)
!244 = !DILocation(line: 107, column: 20, scope: !241)
!245 = !DILocalVariable(name: "intVariable", scope: !241, file: !45, line: 107, type: !23)
!246 = !DILocation(line: 107, column: 23, scope: !241)
!247 = !DILocation(line: 108, column: 24, scope: !248)
!248 = distinct !DILexicalBlock(scope: !241, file: !45, line: 108, column: 17)
!249 = !DILocation(line: 108, column: 17, scope: !248)
!250 = !DILocation(line: 108, column: 40, scope: !248)
!251 = !DILocation(line: 108, column: 17, scope: !241)
!252 = !DILocation(line: 111, column: 29, scope: !253)
!253 = distinct !DILexicalBlock(scope: !248, file: !45, line: 109, column: 13)
!254 = !DILocation(line: 112, column: 24, scope: !255)
!255 = distinct !DILexicalBlock(scope: !253, file: !45, line: 112, column: 17)
!256 = !DILocation(line: 112, column: 22, scope: !255)
!257 = !DILocation(line: 112, column: 29, scope: !258)
!258 = distinct !DILexicalBlock(scope: !255, file: !45, line: 112, column: 17)
!259 = !DILocation(line: 112, column: 33, scope: !258)
!260 = !DILocation(line: 112, column: 31, scope: !258)
!261 = !DILocation(line: 112, column: 17, scope: !255)
!262 = !DILocation(line: 115, column: 32, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !45, line: 113, column: 17)
!264 = !DILocation(line: 116, column: 17, scope: !263)
!265 = !DILocation(line: 112, column: 37, scope: !258)
!266 = !DILocation(line: 112, column: 17, scope: !258)
!267 = distinct !{!267, !261, !268, !209}
!268 = !DILocation(line: 116, column: 17, scope: !255)
!269 = !DILocation(line: 117, column: 30, scope: !253)
!270 = !DILocation(line: 117, column: 17, scope: !253)
!271 = !DILocation(line: 118, column: 13, scope: !253)
!272 = !DILocation(line: 121, column: 1, scope: !214)
!273 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 124, type: !53, scopeLine: 125, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!274 = !DILocalVariable(name: "data", scope: !273, file: !45, line: 126, type: !42)
!275 = !DILocation(line: 126, column: 12, scope: !273)
!276 = !DILocalVariable(name: "dataPtr1", scope: !273, file: !45, line: 127, type: !41)
!277 = !DILocation(line: 127, column: 13, scope: !273)
!278 = !DILocalVariable(name: "dataPtr2", scope: !273, file: !45, line: 128, type: !41)
!279 = !DILocation(line: 128, column: 13, scope: !273)
!280 = !DILocalVariable(name: "dataBuffer", scope: !273, file: !45, line: 129, type: !62)
!281 = !DILocation(line: 129, column: 10, scope: !273)
!282 = !DILocation(line: 130, column: 12, scope: !273)
!283 = !DILocation(line: 130, column: 10, scope: !273)
!284 = !DILocalVariable(name: "data", scope: !285, file: !45, line: 132, type: !42)
!285 = distinct !DILexicalBlock(scope: !273, file: !45, line: 131, column: 5)
!286 = !DILocation(line: 132, column: 16, scope: !285)
!287 = !DILocation(line: 132, column: 24, scope: !285)
!288 = !DILocation(line: 132, column: 23, scope: !285)
!289 = !DILocalVariable(name: "dataLen", scope: !290, file: !45, line: 135, type: !75)
!290 = distinct !DILexicalBlock(scope: !285, file: !45, line: 133, column: 9)
!291 = !DILocation(line: 135, column: 20, scope: !290)
!292 = !DILocation(line: 135, column: 37, scope: !290)
!293 = !DILocation(line: 135, column: 30, scope: !290)
!294 = !DILocalVariable(name: "pFile", scope: !290, file: !45, line: 136, type: !82)
!295 = !DILocation(line: 136, column: 20, scope: !290)
!296 = !DILocation(line: 138, column: 21, scope: !297)
!297 = distinct !DILexicalBlock(scope: !290, file: !45, line: 138, column: 17)
!298 = !DILocation(line: 138, column: 20, scope: !297)
!299 = !DILocation(line: 138, column: 29, scope: !297)
!300 = !DILocation(line: 138, column: 17, scope: !290)
!301 = !DILocation(line: 140, column: 25, scope: !302)
!302 = distinct !DILexicalBlock(scope: !297, file: !45, line: 139, column: 13)
!303 = !DILocation(line: 140, column: 23, scope: !302)
!304 = !DILocation(line: 141, column: 21, scope: !305)
!305 = distinct !DILexicalBlock(scope: !302, file: !45, line: 141, column: 21)
!306 = !DILocation(line: 141, column: 27, scope: !305)
!307 = !DILocation(line: 141, column: 21, scope: !302)
!308 = !DILocation(line: 144, column: 31, scope: !309)
!309 = distinct !DILexicalBlock(scope: !310, file: !45, line: 144, column: 25)
!310 = distinct !DILexicalBlock(scope: !305, file: !45, line: 142, column: 17)
!311 = !DILocation(line: 144, column: 36, scope: !309)
!312 = !DILocation(line: 144, column: 35, scope: !309)
!313 = !DILocation(line: 144, column: 55, scope: !309)
!314 = !DILocation(line: 144, column: 54, scope: !309)
!315 = !DILocation(line: 144, column: 45, scope: !309)
!316 = !DILocation(line: 144, column: 65, scope: !309)
!317 = !DILocation(line: 144, column: 25, scope: !309)
!318 = !DILocation(line: 144, column: 72, scope: !309)
!319 = !DILocation(line: 144, column: 25, scope: !310)
!320 = !DILocation(line: 146, column: 25, scope: !321)
!321 = distinct !DILexicalBlock(scope: !309, file: !45, line: 145, column: 21)
!322 = !DILocation(line: 148, column: 25, scope: !321)
!323 = !DILocation(line: 148, column: 30, scope: !321)
!324 = !DILocation(line: 148, column: 39, scope: !321)
!325 = !DILocation(line: 149, column: 21, scope: !321)
!326 = !DILocation(line: 150, column: 28, scope: !310)
!327 = !DILocation(line: 150, column: 21, scope: !310)
!328 = !DILocation(line: 151, column: 17, scope: !310)
!329 = !DILocation(line: 152, column: 13, scope: !302)
!330 = !DILocation(line: 154, column: 21, scope: !285)
!331 = !DILocation(line: 154, column: 10, scope: !285)
!332 = !DILocation(line: 154, column: 19, scope: !285)
!333 = !DILocalVariable(name: "data", scope: !334, file: !45, line: 157, type: !42)
!334 = distinct !DILexicalBlock(scope: !273, file: !45, line: 156, column: 5)
!335 = !DILocation(line: 157, column: 16, scope: !334)
!336 = !DILocation(line: 157, column: 24, scope: !334)
!337 = !DILocation(line: 157, column: 23, scope: !334)
!338 = !DILocalVariable(name: "i", scope: !339, file: !45, line: 159, type: !23)
!339 = distinct !DILexicalBlock(scope: !334, file: !45, line: 158, column: 9)
!340 = !DILocation(line: 159, column: 17, scope: !339)
!341 = !DILocalVariable(name: "n", scope: !339, file: !45, line: 159, type: !23)
!342 = !DILocation(line: 159, column: 20, scope: !339)
!343 = !DILocalVariable(name: "intVariable", scope: !339, file: !45, line: 159, type: !23)
!344 = !DILocation(line: 159, column: 23, scope: !339)
!345 = !DILocation(line: 160, column: 24, scope: !346)
!346 = distinct !DILexicalBlock(scope: !339, file: !45, line: 160, column: 17)
!347 = !DILocation(line: 160, column: 17, scope: !346)
!348 = !DILocation(line: 160, column: 40, scope: !346)
!349 = !DILocation(line: 160, column: 17, scope: !339)
!350 = !DILocation(line: 163, column: 21, scope: !351)
!351 = distinct !DILexicalBlock(scope: !352, file: !45, line: 163, column: 21)
!352 = distinct !DILexicalBlock(scope: !346, file: !45, line: 161, column: 13)
!353 = !DILocation(line: 163, column: 23, scope: !351)
!354 = !DILocation(line: 163, column: 21, scope: !352)
!355 = !DILocation(line: 165, column: 33, scope: !356)
!356 = distinct !DILexicalBlock(scope: !351, file: !45, line: 164, column: 17)
!357 = !DILocation(line: 166, column: 28, scope: !358)
!358 = distinct !DILexicalBlock(scope: !356, file: !45, line: 166, column: 21)
!359 = !DILocation(line: 166, column: 26, scope: !358)
!360 = !DILocation(line: 166, column: 33, scope: !361)
!361 = distinct !DILexicalBlock(scope: !358, file: !45, line: 166, column: 21)
!362 = !DILocation(line: 166, column: 37, scope: !361)
!363 = !DILocation(line: 166, column: 35, scope: !361)
!364 = !DILocation(line: 166, column: 21, scope: !358)
!365 = !DILocation(line: 169, column: 36, scope: !366)
!366 = distinct !DILexicalBlock(scope: !361, file: !45, line: 167, column: 21)
!367 = !DILocation(line: 170, column: 21, scope: !366)
!368 = !DILocation(line: 166, column: 41, scope: !361)
!369 = !DILocation(line: 166, column: 21, scope: !361)
!370 = distinct !{!370, !364, !371, !209}
!371 = !DILocation(line: 170, column: 21, scope: !358)
!372 = !DILocation(line: 171, column: 34, scope: !356)
!373 = !DILocation(line: 171, column: 21, scope: !356)
!374 = !DILocation(line: 172, column: 17, scope: !356)
!375 = !DILocation(line: 173, column: 13, scope: !352)
!376 = !DILocation(line: 176, column: 1, scope: !273)
!377 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_32_good", scope: !45, file: !45, line: 178, type: !53, scopeLine: 179, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!378 = !DILocation(line: 180, column: 5, scope: !377)
!379 = !DILocation(line: 181, column: 5, scope: !377)
!380 = !DILocation(line: 182, column: 1, scope: !377)
!381 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !382, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !42}
!384 = !DILocalVariable(name: "line", arg: 1, scope: !381, file: !3, line: 11, type: !42)
!385 = !DILocation(line: 11, column: 25, scope: !381)
!386 = !DILocation(line: 13, column: 1, scope: !381)
!387 = !DILocation(line: 14, column: 8, scope: !388)
!388 = distinct !DILexicalBlock(scope: !381, file: !3, line: 14, column: 8)
!389 = !DILocation(line: 14, column: 13, scope: !388)
!390 = !DILocation(line: 14, column: 8, scope: !381)
!391 = !DILocation(line: 16, column: 24, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !3, line: 15, column: 5)
!393 = !DILocation(line: 16, column: 9, scope: !392)
!394 = !DILocation(line: 17, column: 5, scope: !392)
!395 = !DILocation(line: 18, column: 5, scope: !381)
!396 = !DILocation(line: 19, column: 1, scope: !381)
!397 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !382, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!398 = !DILocalVariable(name: "line", arg: 1, scope: !397, file: !3, line: 20, type: !42)
!399 = !DILocation(line: 20, column: 29, scope: !397)
!400 = !DILocation(line: 22, column: 8, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 22, column: 8)
!402 = !DILocation(line: 22, column: 13, scope: !401)
!403 = !DILocation(line: 22, column: 8, scope: !397)
!404 = !DILocation(line: 24, column: 24, scope: !405)
!405 = distinct !DILexicalBlock(scope: !401, file: !3, line: 23, column: 5)
!406 = !DILocation(line: 24, column: 9, scope: !405)
!407 = !DILocation(line: 25, column: 5, scope: !405)
!408 = !DILocation(line: 26, column: 1, scope: !397)
!409 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !410, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !413, size: 64)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !76, line: 74, baseType: !23)
!414 = !DILocalVariable(name: "line", arg: 1, scope: !409, file: !3, line: 27, type: !412)
!415 = !DILocation(line: 27, column: 29, scope: !409)
!416 = !DILocation(line: 29, column: 8, scope: !417)
!417 = distinct !DILexicalBlock(scope: !409, file: !3, line: 29, column: 8)
!418 = !DILocation(line: 29, column: 13, scope: !417)
!419 = !DILocation(line: 29, column: 8, scope: !409)
!420 = !DILocation(line: 31, column: 27, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !3, line: 30, column: 5)
!422 = !DILocation(line: 31, column: 9, scope: !421)
!423 = !DILocation(line: 32, column: 5, scope: !421)
!424 = !DILocation(line: 33, column: 1, scope: !409)
!425 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !426, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !23}
!428 = !DILocalVariable(name: "intNumber", arg: 1, scope: !425, file: !3, line: 35, type: !23)
!429 = !DILocation(line: 35, column: 24, scope: !425)
!430 = !DILocation(line: 37, column: 20, scope: !425)
!431 = !DILocation(line: 37, column: 5, scope: !425)
!432 = !DILocation(line: 38, column: 1, scope: !425)
!433 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !434, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !436}
!436 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!437 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !433, file: !3, line: 40, type: !436)
!438 = !DILocation(line: 40, column: 28, scope: !433)
!439 = !DILocation(line: 42, column: 21, scope: !433)
!440 = !DILocation(line: 42, column: 5, scope: !433)
!441 = !DILocation(line: 43, column: 1, scope: !433)
!442 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !443, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445}
!445 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!446 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !442, file: !3, line: 45, type: !445)
!447 = !DILocation(line: 45, column: 28, scope: !442)
!448 = !DILocation(line: 47, column: 20, scope: !442)
!449 = !DILocation(line: 47, column: 5, scope: !442)
!450 = !DILocation(line: 48, column: 1, scope: !442)
!451 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !452, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !110}
!454 = !DILocalVariable(name: "longNumber", arg: 1, scope: !451, file: !3, line: 50, type: !110)
!455 = !DILocation(line: 50, column: 26, scope: !451)
!456 = !DILocation(line: 52, column: 21, scope: !451)
!457 = !DILocation(line: 52, column: 5, scope: !451)
!458 = !DILocation(line: 53, column: 1, scope: !451)
!459 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !460, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !462}
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !463, line: 27, baseType: !464)
!463 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 44, baseType: !110)
!465 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !459, file: !3, line: 55, type: !462)
!466 = !DILocation(line: 55, column: 33, scope: !459)
!467 = !DILocation(line: 57, column: 29, scope: !459)
!468 = !DILocation(line: 57, column: 5, scope: !459)
!469 = !DILocation(line: 58, column: 1, scope: !459)
!470 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !471, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !75}
!473 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !470, file: !3, line: 60, type: !75)
!474 = !DILocation(line: 60, column: 29, scope: !470)
!475 = !DILocation(line: 62, column: 21, scope: !470)
!476 = !DILocation(line: 62, column: 5, scope: !470)
!477 = !DILocation(line: 63, column: 1, scope: !470)
!478 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !479, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !43}
!481 = !DILocalVariable(name: "charHex", arg: 1, scope: !478, file: !3, line: 65, type: !43)
!482 = !DILocation(line: 65, column: 29, scope: !478)
!483 = !DILocation(line: 67, column: 22, scope: !478)
!484 = !DILocation(line: 67, column: 5, scope: !478)
!485 = !DILocation(line: 68, column: 1, scope: !478)
!486 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !487, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !413}
!489 = !DILocalVariable(name: "wideChar", arg: 1, scope: !486, file: !3, line: 70, type: !413)
!490 = !DILocation(line: 70, column: 29, scope: !486)
!491 = !DILocalVariable(name: "s", scope: !486, file: !3, line: 74, type: !492)
!492 = !DICompositeType(tag: DW_TAG_array_type, baseType: !413, size: 64, elements: !493)
!493 = !{!494}
!494 = !DISubrange(count: 2)
!495 = !DILocation(line: 74, column: 13, scope: !486)
!496 = !DILocation(line: 75, column: 16, scope: !486)
!497 = !DILocation(line: 75, column: 9, scope: !486)
!498 = !DILocation(line: 75, column: 14, scope: !486)
!499 = !DILocation(line: 76, column: 9, scope: !486)
!500 = !DILocation(line: 76, column: 14, scope: !486)
!501 = !DILocation(line: 77, column: 21, scope: !486)
!502 = !DILocation(line: 77, column: 5, scope: !486)
!503 = !DILocation(line: 78, column: 1, scope: !486)
!504 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !505, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !7}
!507 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !504, file: !3, line: 80, type: !7)
!508 = !DILocation(line: 80, column: 33, scope: !504)
!509 = !DILocation(line: 82, column: 20, scope: !504)
!510 = !DILocation(line: 82, column: 5, scope: !504)
!511 = !DILocation(line: 83, column: 1, scope: !504)
!512 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !513, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!513 = !DISubroutineType(types: !514)
!514 = !{null, !25}
!515 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !512, file: !3, line: 85, type: !25)
!516 = !DILocation(line: 85, column: 45, scope: !512)
!517 = !DILocation(line: 87, column: 22, scope: !512)
!518 = !DILocation(line: 87, column: 5, scope: !512)
!519 = !DILocation(line: 88, column: 1, scope: !512)
!520 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !521, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!521 = !DISubroutineType(types: !522)
!522 = !{null, !523}
!523 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!524 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !520, file: !3, line: 90, type: !523)
!525 = !DILocation(line: 90, column: 29, scope: !520)
!526 = !DILocation(line: 92, column: 20, scope: !520)
!527 = !DILocation(line: 92, column: 5, scope: !520)
!528 = !DILocation(line: 93, column: 1, scope: !520)
!529 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !530, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !533, size: 64)
!533 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !534, line: 100, baseType: !535)
!534 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_095/source_code")
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !534, line: 96, size: 64, elements: !536)
!536 = !{!537, !538}
!537 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !535, file: !534, line: 98, baseType: !23, size: 32)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !535, file: !534, line: 99, baseType: !23, size: 32, offset: 32)
!539 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !529, file: !3, line: 95, type: !532)
!540 = !DILocation(line: 95, column: 40, scope: !529)
!541 = !DILocation(line: 97, column: 26, scope: !529)
!542 = !DILocation(line: 97, column: 47, scope: !529)
!543 = !DILocation(line: 97, column: 55, scope: !529)
!544 = !DILocation(line: 97, column: 76, scope: !529)
!545 = !DILocation(line: 97, column: 5, scope: !529)
!546 = !DILocation(line: 98, column: 1, scope: !529)
!547 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !548, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !550, !75}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!551 = !DILocalVariable(name: "bytes", arg: 1, scope: !547, file: !3, line: 100, type: !550)
!552 = !DILocation(line: 100, column: 38, scope: !547)
!553 = !DILocalVariable(name: "numBytes", arg: 2, scope: !547, file: !3, line: 100, type: !75)
!554 = !DILocation(line: 100, column: 52, scope: !547)
!555 = !DILocalVariable(name: "i", scope: !547, file: !3, line: 102, type: !75)
!556 = !DILocation(line: 102, column: 12, scope: !547)
!557 = !DILocation(line: 103, column: 12, scope: !558)
!558 = distinct !DILexicalBlock(scope: !547, file: !3, line: 103, column: 5)
!559 = !DILocation(line: 103, column: 10, scope: !558)
!560 = !DILocation(line: 103, column: 17, scope: !561)
!561 = distinct !DILexicalBlock(scope: !558, file: !3, line: 103, column: 5)
!562 = !DILocation(line: 103, column: 21, scope: !561)
!563 = !DILocation(line: 103, column: 19, scope: !561)
!564 = !DILocation(line: 103, column: 5, scope: !558)
!565 = !DILocation(line: 105, column: 24, scope: !566)
!566 = distinct !DILexicalBlock(scope: !561, file: !3, line: 104, column: 5)
!567 = !DILocation(line: 105, column: 30, scope: !566)
!568 = !DILocation(line: 105, column: 9, scope: !566)
!569 = !DILocation(line: 106, column: 5, scope: !566)
!570 = !DILocation(line: 103, column: 31, scope: !561)
!571 = !DILocation(line: 103, column: 5, scope: !561)
!572 = distinct !{!572, !564, !573, !209}
!573 = !DILocation(line: 106, column: 5, scope: !558)
!574 = !DILocation(line: 107, column: 5, scope: !547)
!575 = !DILocation(line: 108, column: 1, scope: !547)
!576 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !577, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!577 = !DISubroutineType(types: !578)
!578 = !{!75, !550, !75, !42}
!579 = !DILocalVariable(name: "bytes", arg: 1, scope: !576, file: !3, line: 113, type: !550)
!580 = !DILocation(line: 113, column: 39, scope: !576)
!581 = !DILocalVariable(name: "numBytes", arg: 2, scope: !576, file: !3, line: 113, type: !75)
!582 = !DILocation(line: 113, column: 53, scope: !576)
!583 = !DILocalVariable(name: "hex", arg: 3, scope: !576, file: !3, line: 113, type: !42)
!584 = !DILocation(line: 113, column: 71, scope: !576)
!585 = !DILocalVariable(name: "numWritten", scope: !576, file: !3, line: 115, type: !75)
!586 = !DILocation(line: 115, column: 12, scope: !576)
!587 = !DILocation(line: 121, column: 5, scope: !576)
!588 = !DILocation(line: 121, column: 12, scope: !576)
!589 = !DILocation(line: 121, column: 25, scope: !576)
!590 = !DILocation(line: 121, column: 23, scope: !576)
!591 = !DILocation(line: 121, column: 34, scope: !576)
!592 = !DILocation(line: 121, column: 37, scope: !576)
!593 = !DILocation(line: 121, column: 67, scope: !576)
!594 = !DILocation(line: 121, column: 70, scope: !576)
!595 = !DILocation(line: 0, scope: !576)
!596 = !DILocalVariable(name: "byte", scope: !597, file: !3, line: 123, type: !23)
!597 = distinct !DILexicalBlock(scope: !576, file: !3, line: 122, column: 5)
!598 = !DILocation(line: 123, column: 13, scope: !597)
