; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_32.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_32.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_32_bad() #0 !dbg !10 {
entry:
  %data = alloca i8*, align 8
  %dataPtr1 = alloca i8**, align 8
  %dataPtr2 = alloca i8**, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %data1 = alloca i8*, align 8
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %data13 = alloca i8*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_32.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_095/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_32_bad", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 37, type: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocation(line: 37, column: 12, scope: !10)
!17 = !DILocalVariable(name: "dataPtr1", scope: !10, file: !1, line: 38, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!19 = !DILocation(line: 38, column: 13, scope: !10)
!20 = !DILocalVariable(name: "dataPtr2", scope: !10, file: !1, line: 39, type: !18)
!21 = !DILocation(line: 39, column: 13, scope: !10)
!22 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 40, type: !23)
!23 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !24)
!24 = !{!25}
!25 = !DISubrange(count: 100)
!26 = !DILocation(line: 40, column: 10, scope: !10)
!27 = !DILocation(line: 41, column: 12, scope: !10)
!28 = !DILocation(line: 41, column: 10, scope: !10)
!29 = !DILocalVariable(name: "data", scope: !30, file: !1, line: 43, type: !14)
!30 = distinct !DILexicalBlock(scope: !10, file: !1, line: 42, column: 5)
!31 = !DILocation(line: 43, column: 16, scope: !30)
!32 = !DILocation(line: 43, column: 24, scope: !30)
!33 = !DILocation(line: 43, column: 23, scope: !30)
!34 = !DILocalVariable(name: "dataLen", scope: !35, file: !1, line: 46, type: !36)
!35 = distinct !DILexicalBlock(scope: !30, file: !1, line: 44, column: 9)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !37, line: 46, baseType: !38)
!37 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!38 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!39 = !DILocation(line: 46, column: 20, scope: !35)
!40 = !DILocation(line: 46, column: 37, scope: !35)
!41 = !DILocation(line: 46, column: 30, scope: !35)
!42 = !DILocalVariable(name: "pFile", scope: !35, file: !1, line: 47, type: !43)
!43 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !44, size: 64)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !45, line: 7, baseType: !46)
!45 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!46 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !47, line: 49, size: 1728, elements: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !64, !66, !67, !68, !72, !74, !76, !80, !83, !85, !88, !91, !92, !93, !94, !95}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !46, file: !47, line: 51, baseType: !5, size: 32)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !46, file: !47, line: 54, baseType: !14, size: 64, offset: 64)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !46, file: !47, line: 55, baseType: !14, size: 64, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !46, file: !47, line: 56, baseType: !14, size: 64, offset: 192)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !46, file: !47, line: 57, baseType: !14, size: 64, offset: 256)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !46, file: !47, line: 58, baseType: !14, size: 64, offset: 320)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !46, file: !47, line: 59, baseType: !14, size: 64, offset: 384)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !46, file: !47, line: 60, baseType: !14, size: 64, offset: 448)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !46, file: !47, line: 61, baseType: !14, size: 64, offset: 512)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !46, file: !47, line: 64, baseType: !14, size: 64, offset: 576)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !46, file: !47, line: 65, baseType: !14, size: 64, offset: 640)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !46, file: !47, line: 66, baseType: !14, size: 64, offset: 704)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !46, file: !47, line: 68, baseType: !62, size: 64, offset: 768)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !47, line: 36, flags: DIFlagFwdDecl)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !46, file: !47, line: 70, baseType: !65, size: 64, offset: 832)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !46, file: !47, line: 72, baseType: !5, size: 32, offset: 896)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !46, file: !47, line: 73, baseType: !5, size: 32, offset: 928)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !46, file: !47, line: 74, baseType: !69, size: 64, offset: 960)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !70, line: 152, baseType: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!71 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !46, file: !47, line: 77, baseType: !73, size: 16, offset: 1024)
!73 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !46, file: !47, line: 78, baseType: !75, size: 8, offset: 1040)
!75 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !46, file: !47, line: 79, baseType: !77, size: 8, offset: 1048)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !78)
!78 = !{!79}
!79 = !DISubrange(count: 1)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !46, file: !47, line: 81, baseType: !81, size: 64, offset: 1088)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !47, line: 43, baseType: null)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !46, file: !47, line: 89, baseType: !84, size: 64, offset: 1152)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !70, line: 153, baseType: !71)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !46, file: !47, line: 91, baseType: !86, size: 64, offset: 1216)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !47, line: 37, flags: DIFlagFwdDecl)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !46, file: !47, line: 92, baseType: !89, size: 64, offset: 1280)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !47, line: 38, flags: DIFlagFwdDecl)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !46, file: !47, line: 93, baseType: !65, size: 64, offset: 1344)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !46, file: !47, line: 94, baseType: !4, size: 64, offset: 1408)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !46, file: !47, line: 95, baseType: !36, size: 64, offset: 1472)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !46, file: !47, line: 96, baseType: !5, size: 32, offset: 1536)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !46, file: !47, line: 98, baseType: !96, size: 160, offset: 1568)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !97)
!97 = !{!98}
!98 = !DISubrange(count: 20)
!99 = !DILocation(line: 47, column: 20, scope: !35)
!100 = !DILocation(line: 49, column: 21, scope: !101)
!101 = distinct !DILexicalBlock(scope: !35, file: !1, line: 49, column: 17)
!102 = !DILocation(line: 49, column: 20, scope: !101)
!103 = !DILocation(line: 49, column: 29, scope: !101)
!104 = !DILocation(line: 49, column: 17, scope: !35)
!105 = !DILocation(line: 51, column: 25, scope: !106)
!106 = distinct !DILexicalBlock(scope: !101, file: !1, line: 50, column: 13)
!107 = !DILocation(line: 51, column: 23, scope: !106)
!108 = !DILocation(line: 52, column: 21, scope: !109)
!109 = distinct !DILexicalBlock(scope: !106, file: !1, line: 52, column: 21)
!110 = !DILocation(line: 52, column: 27, scope: !109)
!111 = !DILocation(line: 52, column: 21, scope: !106)
!112 = !DILocation(line: 55, column: 31, scope: !113)
!113 = distinct !DILexicalBlock(scope: !114, file: !1, line: 55, column: 25)
!114 = distinct !DILexicalBlock(scope: !109, file: !1, line: 53, column: 17)
!115 = !DILocation(line: 55, column: 36, scope: !113)
!116 = !DILocation(line: 55, column: 35, scope: !113)
!117 = !DILocation(line: 55, column: 55, scope: !113)
!118 = !DILocation(line: 55, column: 54, scope: !113)
!119 = !DILocation(line: 55, column: 45, scope: !113)
!120 = !DILocation(line: 55, column: 65, scope: !113)
!121 = !DILocation(line: 55, column: 25, scope: !113)
!122 = !DILocation(line: 55, column: 72, scope: !113)
!123 = !DILocation(line: 55, column: 25, scope: !114)
!124 = !DILocation(line: 57, column: 25, scope: !125)
!125 = distinct !DILexicalBlock(scope: !113, file: !1, line: 56, column: 21)
!126 = !DILocation(line: 59, column: 25, scope: !125)
!127 = !DILocation(line: 59, column: 30, scope: !125)
!128 = !DILocation(line: 59, column: 39, scope: !125)
!129 = !DILocation(line: 60, column: 21, scope: !125)
!130 = !DILocation(line: 61, column: 28, scope: !114)
!131 = !DILocation(line: 61, column: 21, scope: !114)
!132 = !DILocation(line: 62, column: 17, scope: !114)
!133 = !DILocation(line: 63, column: 13, scope: !106)
!134 = !DILocation(line: 65, column: 21, scope: !30)
!135 = !DILocation(line: 65, column: 10, scope: !30)
!136 = !DILocation(line: 65, column: 19, scope: !30)
!137 = !DILocalVariable(name: "data", scope: !138, file: !1, line: 68, type: !14)
!138 = distinct !DILexicalBlock(scope: !10, file: !1, line: 67, column: 5)
!139 = !DILocation(line: 68, column: 16, scope: !138)
!140 = !DILocation(line: 68, column: 24, scope: !138)
!141 = !DILocation(line: 68, column: 23, scope: !138)
!142 = !DILocalVariable(name: "i", scope: !143, file: !1, line: 70, type: !5)
!143 = distinct !DILexicalBlock(scope: !138, file: !1, line: 69, column: 9)
!144 = !DILocation(line: 70, column: 17, scope: !143)
!145 = !DILocalVariable(name: "n", scope: !143, file: !1, line: 70, type: !5)
!146 = !DILocation(line: 70, column: 20, scope: !143)
!147 = !DILocalVariable(name: "intVariable", scope: !143, file: !1, line: 70, type: !5)
!148 = !DILocation(line: 70, column: 23, scope: !143)
!149 = !DILocation(line: 71, column: 24, scope: !150)
!150 = distinct !DILexicalBlock(scope: !143, file: !1, line: 71, column: 17)
!151 = !DILocation(line: 71, column: 17, scope: !150)
!152 = !DILocation(line: 71, column: 40, scope: !150)
!153 = !DILocation(line: 71, column: 17, scope: !143)
!154 = !DILocation(line: 74, column: 29, scope: !155)
!155 = distinct !DILexicalBlock(scope: !150, file: !1, line: 72, column: 13)
!156 = !DILocation(line: 75, column: 24, scope: !157)
!157 = distinct !DILexicalBlock(scope: !155, file: !1, line: 75, column: 17)
!158 = !DILocation(line: 75, column: 22, scope: !157)
!159 = !DILocation(line: 75, column: 29, scope: !160)
!160 = distinct !DILexicalBlock(scope: !157, file: !1, line: 75, column: 17)
