; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.13 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_992/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_992/source_code")
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !51, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!51 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52c.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_992/source_code")
!52 = !{!"clang version 12.0.0"}
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52_bad", scope: !45, file: !45, line: 35, type: !57, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!57 = !DISubroutineType(types: !58)
!58 = !{null}
!59 = !DILocalVariable(name: "data", scope: !56, file: !45, line: 37, type: !42)
!60 = !DILocation(line: 37, column: 12, scope: !56)
!61 = !DILocalVariable(name: "dataBuffer", scope: !56, file: !45, line: 38, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DILocation(line: 38, column: 10, scope: !56)
!66 = !DILocation(line: 39, column: 12, scope: !56)
!67 = !DILocation(line: 39, column: 10, scope: !56)
!68 = !DILocalVariable(name: "dataLen", scope: !69, file: !45, line: 42, type: !70)
!69 = distinct !DILexicalBlock(scope: !56, file: !45, line: 40, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 42, column: 16, scope: !69)
!74 = !DILocation(line: 42, column: 33, scope: !69)
!75 = !DILocation(line: 42, column: 26, scope: !69)
!76 = !DILocalVariable(name: "pFile", scope: !69, file: !45, line: 43, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !23, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !42, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !42, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !42, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !42, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !42, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !42, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !42, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !42, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !42, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !42, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !42, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !23, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !23, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !24, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !22, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !23, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 43, column: 16, scope: !69)
!133 = !DILocation(line: 45, column: 17, scope: !134)
!134 = distinct !DILexicalBlock(scope: !69, file: !45, line: 45, column: 13)
!135 = !DILocation(line: 45, column: 16, scope: !134)
!136 = !DILocation(line: 45, column: 25, scope: !134)
!137 = !DILocation(line: 45, column: 13, scope: !69)
!138 = !DILocation(line: 47, column: 21, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !45, line: 46, column: 9)
!140 = !DILocation(line: 47, column: 19, scope: !139)
!141 = !DILocation(line: 48, column: 17, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !45, line: 48, column: 17)
!143 = !DILocation(line: 48, column: 23, scope: !142)
!144 = !DILocation(line: 48, column: 17, scope: !139)
!145 = !DILocation(line: 51, column: 27, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !45, line: 51, column: 21)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 49, column: 13)
!148 = !DILocation(line: 51, column: 32, scope: !146)
!149 = !DILocation(line: 51, column: 31, scope: !146)
!150 = !DILocation(line: 51, column: 51, scope: !146)
!151 = !DILocation(line: 51, column: 50, scope: !146)
!152 = !DILocation(line: 51, column: 41, scope: !146)
!153 = !DILocation(line: 51, column: 61, scope: !146)
!154 = !DILocation(line: 51, column: 21, scope: !146)
!155 = !DILocation(line: 51, column: 68, scope: !146)
!156 = !DILocation(line: 51, column: 21, scope: !147)
!157 = !DILocation(line: 53, column: 21, scope: !158)
!158 = distinct !DILexicalBlock(scope: !146, file: !45, line: 52, column: 17)
!159 = !DILocation(line: 55, column: 21, scope: !158)
!160 = !DILocation(line: 55, column: 26, scope: !158)
!161 = !DILocation(line: 55, column: 35, scope: !158)
!162 = !DILocation(line: 56, column: 17, scope: !158)
!163 = !DILocation(line: 57, column: 24, scope: !147)
!164 = !DILocation(line: 57, column: 17, scope: !147)
!165 = !DILocation(line: 58, column: 13, scope: !147)
!166 = !DILocation(line: 59, column: 9, scope: !139)
!167 = !DILocation(line: 61, column: 70, scope: !56)
!168 = !DILocation(line: 61, column: 5, scope: !56)
!169 = !DILocation(line: 62, column: 1, scope: !56)
!170 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 70, type: !57, scopeLine: 71, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!171 = !DILocalVariable(name: "data", scope: !170, file: !45, line: 72, type: !42)
!172 = !DILocation(line: 72, column: 12, scope: !170)
!173 = !DILocalVariable(name: "dataBuffer", scope: !170, file: !45, line: 73, type: !62)
!174 = !DILocation(line: 73, column: 10, scope: !170)
!175 = !DILocation(line: 74, column: 12, scope: !170)
!176 = !DILocation(line: 74, column: 10, scope: !170)
!177 = !DILocation(line: 76, column: 12, scope: !170)
!178 = !DILocation(line: 76, column: 5, scope: !170)
!179 = !DILocation(line: 77, column: 74, scope: !170)
!180 = !DILocation(line: 77, column: 5, scope: !170)
!181 = !DILocation(line: 78, column: 1, scope: !170)
!182 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 82, type: !57, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!183 = !DILocalVariable(name: "data", scope: !182, file: !45, line: 84, type: !42)
!184 = !DILocation(line: 84, column: 12, scope: !182)
!185 = !DILocalVariable(name: "dataBuffer", scope: !182, file: !45, line: 85, type: !62)
!186 = !DILocation(line: 85, column: 10, scope: !182)
!187 = !DILocation(line: 86, column: 12, scope: !182)
!188 = !DILocation(line: 86, column: 10, scope: !182)
!189 = !DILocalVariable(name: "dataLen", scope: !190, file: !45, line: 89, type: !70)
!190 = distinct !DILexicalBlock(scope: !182, file: !45, line: 87, column: 5)
!191 = !DILocation(line: 89, column: 16, scope: !190)
!192 = !DILocation(line: 89, column: 33, scope: !190)
!193 = !DILocation(line: 89, column: 26, scope: !190)
!194 = !DILocalVariable(name: "pFile", scope: !190, file: !45, line: 90, type: !77)
!195 = !DILocation(line: 90, column: 16, scope: !190)
!196 = !DILocation(line: 92, column: 17, scope: !197)
!197 = distinct !DILexicalBlock(scope: !190, file: !45, line: 92, column: 13)
!198 = !DILocation(line: 92, column: 16, scope: !197)
!199 = !DILocation(line: 92, column: 25, scope: !197)
!200 = !DILocation(line: 92, column: 13, scope: !190)
!201 = !DILocation(line: 94, column: 21, scope: !202)
!202 = distinct !DILexicalBlock(scope: !197, file: !45, line: 93, column: 9)
!203 = !DILocation(line: 94, column: 19, scope: !202)
!204 = !DILocation(line: 95, column: 17, scope: !205)
!205 = distinct !DILexicalBlock(scope: !202, file: !45, line: 95, column: 17)
!206 = !DILocation(line: 95, column: 23, scope: !205)
!207 = !DILocation(line: 95, column: 17, scope: !202)
!208 = !DILocation(line: 98, column: 27, scope: !209)
!209 = distinct !DILexicalBlock(scope: !210, file: !45, line: 98, column: 21)
!210 = distinct !DILexicalBlock(scope: !205, file: !45, line: 96, column: 13)
!211 = !DILocation(line: 98, column: 32, scope: !209)
!212 = !DILocation(line: 98, column: 31, scope: !209)
!213 = !DILocation(line: 98, column: 51, scope: !209)
!214 = !DILocation(line: 98, column: 50, scope: !209)
!215 = !DILocation(line: 98, column: 41, scope: !209)
!216 = !DILocation(line: 98, column: 61, scope: !209)
!217 = !DILocation(line: 98, column: 21, scope: !209)
!218 = !DILocation(line: 98, column: 68, scope: !209)
!219 = !DILocation(line: 98, column: 21, scope: !210)
!220 = !DILocation(line: 100, column: 21, scope: !221)
!221 = distinct !DILexicalBlock(scope: !209, file: !45, line: 99, column: 17)
!222 = !DILocation(line: 102, column: 21, scope: !221)
!223 = !DILocation(line: 102, column: 26, scope: !221)
!224 = !DILocation(line: 102, column: 35, scope: !221)
!225 = !DILocation(line: 103, column: 17, scope: !221)
!226 = !DILocation(line: 104, column: 24, scope: !210)
!227 = !DILocation(line: 104, column: 17, scope: !210)
!228 = !DILocation(line: 105, column: 13, scope: !210)
!229 = !DILocation(line: 106, column: 9, scope: !202)
!230 = !DILocation(line: 108, column: 74, scope: !182)
!231 = !DILocation(line: 108, column: 5, scope: !182)
!232 = !DILocation(line: 109, column: 1, scope: !182)
!233 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52_good", scope: !45, file: !45, line: 111, type: !57, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!234 = !DILocation(line: 113, column: 5, scope: !233)
!235 = !DILocation(line: 114, column: 5, scope: !233)
!236 = !DILocation(line: 115, column: 1, scope: !233)
!237 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52b_badSink", scope: !49, file: !49, line: 35, type: !238, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !42}
!240 = !DILocalVariable(name: "data", arg: 1, scope: !237, file: !49, line: 35, type: !42)
!241 = !DILocation(line: 35, column: 78, scope: !237)
!242 = !DILocation(line: 37, column: 70, scope: !237)
!243 = !DILocation(line: 37, column: 5, scope: !237)
!244 = !DILocation(line: 38, column: 1, scope: !237)
!245 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52b_goodG2BSink", scope: !49, file: !49, line: 47, type: !238, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!246 = !DILocalVariable(name: "data", arg: 1, scope: !245, file: !49, line: 47, type: !42)
!247 = !DILocation(line: 47, column: 82, scope: !245)
!248 = !DILocation(line: 49, column: 74, scope: !245)
!249 = !DILocation(line: 49, column: 5, scope: !245)
!250 = !DILocation(line: 50, column: 1, scope: !245)
!251 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52b_goodB2GSink", scope: !49, file: !49, line: 55, type: !238, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!252 = !DILocalVariable(name: "data", arg: 1, scope: !251, file: !49, line: 55, type: !42)
!253 = !DILocation(line: 55, column: 82, scope: !251)
!254 = !DILocation(line: 57, column: 74, scope: !251)
!255 = !DILocation(line: 57, column: 5, scope: !251)
!256 = !DILocation(line: 58, column: 1, scope: !251)
!257 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52c_badSink", scope: !51, file: !51, line: 32, type: !238, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!258 = !DILocalVariable(name: "data", arg: 1, scope: !257, file: !51, line: 32, type: !42)
!259 = !DILocation(line: 32, column: 78, scope: !257)
!260 = !DILocation(line: 35, column: 13, scope: !257)
!261 = !DILocation(line: 35, column: 21, scope: !257)
!262 = !DILocation(line: 35, column: 5, scope: !257)
!263 = !DILocation(line: 36, column: 1, scope: !257)
!264 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52c_goodG2BSink", scope: !51, file: !51, line: 43, type: !238, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!265 = !DILocalVariable(name: "data", arg: 1, scope: !264, file: !51, line: 43, type: !42)
!266 = !DILocation(line: 43, column: 82, scope: !264)
!267 = !DILocation(line: 46, column: 13, scope: !264)
!268 = !DILocation(line: 46, column: 21, scope: !264)
!269 = !DILocation(line: 46, column: 5, scope: !264)
!270 = !DILocation(line: 47, column: 1, scope: !264)
!271 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_52c_goodB2GSink", scope: !51, file: !51, line: 50, type: !238, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!272 = !DILocalVariable(name: "data", arg: 1, scope: !271, file: !51, line: 50, type: !42)
!273 = !DILocation(line: 50, column: 82, scope: !271)
!274 = !DILocation(line: 53, column: 13, scope: !271)
!275 = !DILocation(line: 53, column: 29, scope: !271)
!276 = !DILocation(line: 53, column: 5, scope: !271)
!277 = !DILocation(line: 54, column: 1, scope: !271)
!278 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !238, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!279 = !DILocalVariable(name: "line", arg: 1, scope: !278, file: !3, line: 11, type: !42)
!280 = !DILocation(line: 11, column: 25, scope: !278)
!281 = !DILocation(line: 13, column: 1, scope: !278)
!282 = !DILocation(line: 14, column: 8, scope: !283)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 14, column: 8)
!284 = !DILocation(line: 14, column: 13, scope: !283)
!285 = !DILocation(line: 14, column: 8, scope: !278)
!286 = !DILocation(line: 16, column: 24, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !3, line: 15, column: 5)
!288 = !DILocation(line: 16, column: 9, scope: !287)
!289 = !DILocation(line: 17, column: 5, scope: !287)
!290 = !DILocation(line: 18, column: 5, scope: !278)
!291 = !DILocation(line: 19, column: 1, scope: !278)
!292 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !238, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!293 = !DILocalVariable(name: "line", arg: 1, scope: !292, file: !3, line: 20, type: !42)
!294 = !DILocation(line: 20, column: 29, scope: !292)
!295 = !DILocation(line: 22, column: 8, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 22, column: 8)
!297 = !DILocation(line: 22, column: 13, scope: !296)
!298 = !DILocation(line: 22, column: 8, scope: !292)
!299 = !DILocation(line: 24, column: 24, scope: !300)
!300 = distinct !DILexicalBlock(scope: !296, file: !3, line: 23, column: 5)
!301 = !DILocation(line: 24, column: 9, scope: !300)
!302 = !DILocation(line: 25, column: 5, scope: !300)
!303 = !DILocation(line: 26, column: 1, scope: !292)
!304 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !305, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!305 = !DISubroutineType(types: !306)
!306 = !{null, !307}
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !71, line: 74, baseType: !23)
!309 = !DILocalVariable(name: "line", arg: 1, scope: !304, file: !3, line: 27, type: !307)
!310 = !DILocation(line: 27, column: 29, scope: !304)
!311 = !DILocation(line: 29, column: 8, scope: !312)
!312 = distinct !DILexicalBlock(scope: !304, file: !3, line: 29, column: 8)
!313 = !DILocation(line: 29, column: 13, scope: !312)
!314 = !DILocation(line: 29, column: 8, scope: !304)
!315 = !DILocation(line: 31, column: 27, scope: !316)
!316 = distinct !DILexicalBlock(scope: !312, file: !3, line: 30, column: 5)
!317 = !DILocation(line: 31, column: 9, scope: !316)
!318 = !DILocation(line: 32, column: 5, scope: !316)
!319 = !DILocation(line: 33, column: 1, scope: !304)
!320 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !321, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !23}
!323 = !DILocalVariable(name: "intNumber", arg: 1, scope: !320, file: !3, line: 35, type: !23)
!324 = !DILocation(line: 35, column: 24, scope: !320)
!325 = !DILocation(line: 37, column: 20, scope: !320)
!326 = !DILocation(line: 37, column: 5, scope: !320)
!327 = !DILocation(line: 38, column: 1, scope: !320)
!328 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !329, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!329 = !DISubroutineType(types: !330)
!330 = !{null, !331}
!331 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!332 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !328, file: !3, line: 40, type: !331)
!333 = !DILocation(line: 40, column: 28, scope: !328)
!334 = !DILocation(line: 42, column: 21, scope: !328)
!335 = !DILocation(line: 42, column: 5, scope: !328)
!336 = !DILocation(line: 43, column: 1, scope: !328)
!337 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !338, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340}
!340 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!341 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !337, file: !3, line: 45, type: !340)
!342 = !DILocation(line: 45, column: 28, scope: !337)
!343 = !DILocation(line: 47, column: 20, scope: !337)
!344 = !DILocation(line: 47, column: 5, scope: !337)
!345 = !DILocation(line: 48, column: 1, scope: !337)
!346 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !347, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !105}
!349 = !DILocalVariable(name: "longNumber", arg: 1, scope: !346, file: !3, line: 50, type: !105)
!350 = !DILocation(line: 50, column: 26, scope: !346)
!351 = !DILocation(line: 52, column: 21, scope: !346)
!352 = !DILocation(line: 52, column: 5, scope: !346)
!353 = !DILocation(line: 53, column: 1, scope: !346)
!354 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !355, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!355 = !DISubroutineType(types: !356)
!356 = !{null, !357}
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !358, line: 27, baseType: !359)
!358 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!359 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 44, baseType: !105)
!360 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !354, file: !3, line: 55, type: !357)
!361 = !DILocation(line: 55, column: 33, scope: !354)
!362 = !DILocation(line: 57, column: 29, scope: !354)
!363 = !DILocation(line: 57, column: 5, scope: !354)
!364 = !DILocation(line: 58, column: 1, scope: !354)
!365 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !366, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!366 = !DISubroutineType(types: !367)
!367 = !{null, !70}
!368 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !365, file: !3, line: 60, type: !70)
!369 = !DILocation(line: 60, column: 29, scope: !365)
!370 = !DILocation(line: 62, column: 21, scope: !365)
!371 = !DILocation(line: 62, column: 5, scope: !365)
!372 = !DILocation(line: 63, column: 1, scope: !365)
!373 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !374, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !43}
!376 = !DILocalVariable(name: "charHex", arg: 1, scope: !373, file: !3, line: 65, type: !43)
!377 = !DILocation(line: 65, column: 29, scope: !373)
!378 = !DILocation(line: 67, column: 22, scope: !373)
!379 = !DILocation(line: 67, column: 5, scope: !373)
!380 = !DILocation(line: 68, column: 1, scope: !373)
!381 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !382, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !308}
!384 = !DILocalVariable(name: "wideChar", arg: 1, scope: !381, file: !3, line: 70, type: !308)
!385 = !DILocation(line: 70, column: 29, scope: !381)
!386 = !DILocalVariable(name: "s", scope: !381, file: !3, line: 74, type: !387)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !308, size: 64, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 2)
!390 = !DILocation(line: 74, column: 13, scope: !381)
!391 = !DILocation(line: 75, column: 16, scope: !381)
!392 = !DILocation(line: 75, column: 9, scope: !381)
!393 = !DILocation(line: 75, column: 14, scope: !381)
!394 = !DILocation(line: 76, column: 9, scope: !381)
!395 = !DILocation(line: 76, column: 14, scope: !381)
!396 = !DILocation(line: 77, column: 21, scope: !381)
!397 = !DILocation(line: 77, column: 5, scope: !381)
!398 = !DILocation(line: 78, column: 1, scope: !381)
!399 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !400, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !7}
!402 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !399, file: !3, line: 80, type: !7)
!403 = !DILocation(line: 80, column: 33, scope: !399)
!404 = !DILocation(line: 82, column: 20, scope: !399)
!405 = !DILocation(line: 82, column: 5, scope: !399)
!406 = !DILocation(line: 83, column: 1, scope: !399)
!407 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !408, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !25}
!410 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !407, file: !3, line: 85, type: !25)
!411 = !DILocation(line: 85, column: 45, scope: !407)
!412 = !DILocation(line: 87, column: 22, scope: !407)
!413 = !DILocation(line: 87, column: 5, scope: !407)
!414 = !DILocation(line: 88, column: 1, scope: !407)
!415 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !416, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!419 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !415, file: !3, line: 90, type: !418)
!420 = !DILocation(line: 90, column: 29, scope: !415)
!421 = !DILocation(line: 92, column: 20, scope: !415)
!422 = !DILocation(line: 92, column: 5, scope: !415)
!423 = !DILocation(line: 93, column: 1, scope: !415)
!424 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !425, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427}
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64)
!428 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !429, line: 100, baseType: !430)
!429 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_992/source_code")
!430 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !429, line: 96, size: 64, elements: !431)
!431 = !{!432, !433}
!432 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !430, file: !429, line: 98, baseType: !23, size: 32)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !430, file: !429, line: 99, baseType: !23, size: 32, offset: 32)
!434 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !424, file: !3, line: 95, type: !427)
!435 = !DILocation(line: 95, column: 40, scope: !424)
!436 = !DILocation(line: 97, column: 26, scope: !424)
!437 = !DILocation(line: 97, column: 47, scope: !424)
!438 = !DILocation(line: 97, column: 55, scope: !424)
!439 = !DILocation(line: 97, column: 76, scope: !424)
!440 = !DILocation(line: 97, column: 5, scope: !424)
!441 = !DILocation(line: 98, column: 1, scope: !424)
!442 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !443, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445, !70}
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!446 = !DILocalVariable(name: "bytes", arg: 1, scope: !442, file: !3, line: 100, type: !445)
!447 = !DILocation(line: 100, column: 38, scope: !442)
!448 = !DILocalVariable(name: "numBytes", arg: 2, scope: !442, file: !3, line: 100, type: !70)
!449 = !DILocation(line: 100, column: 52, scope: !442)
!450 = !DILocalVariable(name: "i", scope: !442, file: !3, line: 102, type: !70)
!451 = !DILocation(line: 102, column: 12, scope: !442)
!452 = !DILocation(line: 103, column: 12, scope: !453)
!453 = distinct !DILexicalBlock(scope: !442, file: !3, line: 103, column: 5)
!454 = !DILocation(line: 103, column: 10, scope: !453)
!455 = !DILocation(line: 103, column: 17, scope: !456)
!456 = distinct !DILexicalBlock(scope: !453, file: !3, line: 103, column: 5)
!457 = !DILocation(line: 103, column: 21, scope: !456)
!458 = !DILocation(line: 103, column: 19, scope: !456)
!459 = !DILocation(line: 103, column: 5, scope: !453)
!460 = !DILocation(line: 105, column: 24, scope: !461)
!461 = distinct !DILexicalBlock(scope: !456, file: !3, line: 104, column: 5)
!462 = !DILocation(line: 105, column: 30, scope: !461)
!463 = !DILocation(line: 105, column: 9, scope: !461)
!464 = !DILocation(line: 106, column: 5, scope: !461)
!465 = !DILocation(line: 103, column: 31, scope: !456)
!466 = !DILocation(line: 103, column: 5, scope: !456)
!467 = distinct !{!467, !459, !468, !469}
!468 = !DILocation(line: 106, column: 5, scope: !453)
!469 = !{!"llvm.loop.mustprogress"}
!470 = !DILocation(line: 107, column: 5, scope: !442)
!471 = !DILocation(line: 108, column: 1, scope: !442)
!472 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !473, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!473 = !DISubroutineType(types: !474)
!474 = !{!70, !445, !70, !42}
!475 = !DILocalVariable(name: "bytes", arg: 1, scope: !472, file: !3, line: 113, type: !445)
!476 = !DILocation(line: 113, column: 39, scope: !472)
!477 = !DILocalVariable(name: "numBytes", arg: 2, scope: !472, file: !3, line: 113, type: !70)
!478 = !DILocation(line: 113, column: 53, scope: !472)
!479 = !DILocalVariable(name: "hex", arg: 3, scope: !472, file: !3, line: 113, type: !42)
!480 = !DILocation(line: 113, column: 71, scope: !472)
!481 = !DILocalVariable(name: "numWritten", scope: !472, file: !3, line: 115, type: !70)
!482 = !DILocation(line: 115, column: 12, scope: !472)
!483 = !DILocation(line: 121, column: 5, scope: !472)
!484 = !DILocation(line: 121, column: 12, scope: !472)
!485 = !DILocation(line: 121, column: 25, scope: !472)
!486 = !DILocation(line: 121, column: 23, scope: !472)
!487 = !DILocation(line: 121, column: 34, scope: !472)
!488 = !DILocation(line: 121, column: 37, scope: !472)
!489 = !DILocation(line: 121, column: 67, scope: !472)
!490 = !DILocation(line: 121, column: 70, scope: !472)
!491 = !DILocation(line: 0, scope: !472)
!492 = !DILocalVariable(name: "byte", scope: !493, file: !3, line: 123, type: !23)
!493 = distinct !DILexicalBlock(scope: !472, file: !3, line: 122, column: 5)
