; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_16.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_16.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_16_bad() #0 !dbg !10 {
entry:
  %data = alloca i8*, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4
  %intVariable = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i8** %data, metadata !13, metadata !DIExpression()), !dbg !16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_16.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_089/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_16_bad", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 37, type: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocation(line: 37, column: 12, scope: !10)
!17 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 38, type: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 100)
!21 = !DILocation(line: 38, column: 10, scope: !10)
!22 = !DILocation(line: 39, column: 12, scope: !10)
!23 = !DILocation(line: 39, column: 10, scope: !10)
!24 = !DILocation(line: 40, column: 5, scope: !10)
!25 = !DILocalVariable(name: "dataLen", scope: !26, file: !1, line: 44, type: !28)
!26 = distinct !DILexicalBlock(scope: !27, file: !1, line: 42, column: 9)
!27 = distinct !DILexicalBlock(scope: !10, file: !1, line: 41, column: 5)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !29, line: 46, baseType: !30)
!29 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!30 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!31 = !DILocation(line: 44, column: 20, scope: !26)
!32 = !DILocation(line: 44, column: 37, scope: !26)
!33 = !DILocation(line: 44, column: 30, scope: !26)
!34 = !DILocalVariable(name: "pFile", scope: !26, file: !1, line: 45, type: !35)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !37, line: 7, baseType: !38)
!37 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !39, line: 49, size: 1728, elements: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!40 = !{!41, !42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !56, !58, !59, !60, !64, !66, !68, !72, !75, !77, !80, !83, !84, !85, !86, !87}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !38, file: !39, line: 51, baseType: !5, size: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !38, file: !39, line: 54, baseType: !14, size: 64, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !38, file: !39, line: 55, baseType: !14, size: 64, offset: 128)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !38, file: !39, line: 56, baseType: !14, size: 64, offset: 192)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !38, file: !39, line: 57, baseType: !14, size: 64, offset: 256)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !38, file: !39, line: 58, baseType: !14, size: 64, offset: 320)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !38, file: !39, line: 59, baseType: !14, size: 64, offset: 384)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !38, file: !39, line: 60, baseType: !14, size: 64, offset: 448)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !38, file: !39, line: 61, baseType: !14, size: 64, offset: 512)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !38, file: !39, line: 64, baseType: !14, size: 64, offset: 576)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !38, file: !39, line: 65, baseType: !14, size: 64, offset: 640)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !38, file: !39, line: 66, baseType: !14, size: 64, offset: 704)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !38, file: !39, line: 68, baseType: !54, size: 64, offset: 768)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !39, line: 36, flags: DIFlagFwdDecl)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !38, file: !39, line: 70, baseType: !57, size: 64, offset: 832)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !38, file: !39, line: 72, baseType: !5, size: 32, offset: 896)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !38, file: !39, line: 73, baseType: !5, size: 32, offset: 928)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !38, file: !39, line: 74, baseType: !61, size: 64, offset: 960)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !62, line: 152, baseType: !63)
!62 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!63 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !38, file: !39, line: 77, baseType: !65, size: 16, offset: 1024)
!65 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !38, file: !39, line: 78, baseType: !67, size: 8, offset: 1040)
!67 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !38, file: !39, line: 79, baseType: !69, size: 8, offset: 1048)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 1)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !38, file: !39, line: 81, baseType: !73, size: 64, offset: 1088)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !39, line: 43, baseType: null)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !38, file: !39, line: 89, baseType: !76, size: 64, offset: 1152)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !62, line: 153, baseType: !63)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !38, file: !39, line: 91, baseType: !78, size: 64, offset: 1216)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !39, line: 37, flags: DIFlagFwdDecl)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !38, file: !39, line: 92, baseType: !81, size: 64, offset: 1280)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !39, line: 38, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !38, file: !39, line: 93, baseType: !57, size: 64, offset: 1344)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !38, file: !39, line: 94, baseType: !4, size: 64, offset: 1408)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !38, file: !39, line: 95, baseType: !28, size: 64, offset: 1472)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !38, file: !39, line: 96, baseType: !5, size: 32, offset: 1536)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !38, file: !39, line: 98, baseType: !88, size: 160, offset: 1568)
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 20)
!91 = !DILocation(line: 45, column: 20, scope: !26)
!92 = !DILocation(line: 47, column: 21, scope: !93)
!93 = distinct !DILexicalBlock(scope: !26, file: !1, line: 47, column: 17)
!94 = !DILocation(line: 47, column: 20, scope: !93)
!95 = !DILocation(line: 47, column: 29, scope: !93)
!96 = !DILocation(line: 47, column: 17, scope: !26)
!97 = !DILocation(line: 49, column: 25, scope: !98)
!98 = distinct !DILexicalBlock(scope: !93, file: !1, line: 48, column: 13)
!99 = !DILocation(line: 49, column: 23, scope: !98)
!100 = !DILocation(line: 50, column: 21, scope: !101)
!101 = distinct !DILexicalBlock(scope: !98, file: !1, line: 50, column: 21)
!102 = !DILocation(line: 50, column: 27, scope: !101)
!103 = !DILocation(line: 50, column: 21, scope: !98)
!104 = !DILocation(line: 53, column: 31, scope: !105)
!105 = distinct !DILexicalBlock(scope: !106, file: !1, line: 53, column: 25)
!106 = distinct !DILexicalBlock(scope: !101, file: !1, line: 51, column: 17)
!107 = !DILocation(line: 53, column: 36, scope: !105)
!108 = !DILocation(line: 53, column: 35, scope: !105)
!109 = !DILocation(line: 53, column: 55, scope: !105)
!110 = !DILocation(line: 53, column: 54, scope: !105)
!111 = !DILocation(line: 53, column: 45, scope: !105)
!112 = !DILocation(line: 53, column: 65, scope: !105)
!113 = !DILocation(line: 53, column: 25, scope: !105)
!114 = !DILocation(line: 53, column: 72, scope: !105)
!115 = !DILocation(line: 53, column: 25, scope: !106)
!116 = !DILocation(line: 55, column: 25, scope: !117)
!117 = distinct !DILexicalBlock(scope: !105, file: !1, line: 54, column: 21)
!118 = !DILocation(line: 57, column: 25, scope: !117)
!119 = !DILocation(line: 57, column: 30, scope: !117)
!120 = !DILocation(line: 57, column: 39, scope: !117)
!121 = !DILocation(line: 58, column: 21, scope: !117)
!122 = !DILocation(line: 59, column: 28, scope: !106)
!123 = !DILocation(line: 59, column: 21, scope: !106)
!124 = !DILocation(line: 60, column: 17, scope: !106)
!125 = !DILocation(line: 61, column: 13, scope: !98)
!126 = !DILocation(line: 63, column: 9, scope: !27)
!127 = !DILocation(line: 65, column: 5, scope: !10)
!128 = !DILocalVariable(name: "i", scope: !129, file: !1, line: 68, type: !5)
!129 = distinct !DILexicalBlock(scope: !130, file: !1, line: 67, column: 9)
!130 = distinct !DILexicalBlock(scope: !10, file: !1, line: 66, column: 5)
!131 = !DILocation(line: 68, column: 17, scope: !129)
!132 = !DILocalVariable(name: "n", scope: !129, file: !1, line: 68, type: !5)
!133 = !DILocation(line: 68, column: 20, scope: !129)
!134 = !DILocalVariable(name: "intVariable", scope: !129, file: !1, line: 68, type: !5)
!135 = !DILocation(line: 68, column: 23, scope: !129)
!136 = !DILocation(line: 69, column: 24, scope: !137)
!137 = distinct !DILexicalBlock(scope: !129, file: !1, line: 69, column: 17)
!138 = !DILocation(line: 69, column: 17, scope: !137)
!139 = !DILocation(line: 69, column: 40, scope: !137)
!140 = !DILocation(line: 69, column: 17, scope: !129)
!141 = !DILocation(line: 72, column: 29, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !1, line: 70, column: 13)
!143 = !DILocation(line: 73, column: 24, scope: !144)
!144 = distinct !DILexicalBlock(scope: !142, file: !1, line: 73, column: 17)
!145 = !DILocation(line: 73, column: 22, scope: !144)
!146 = !DILocation(line: 73, column: 29, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !1, line: 73, column: 17)
!148 = !DILocation(line: 73, column: 33, scope: !147)
!149 = !DILocation(line: 73, column: 31, scope: !147)
!150 = !DILocation(line: 73, column: 17, scope: !144)
!151 = !DILocation(line: 76, column: 32, scope: !152)
!152 = distinct !DILexicalBlock(scope: !147, file: !1, line: 74, column: 17)
!153 = !DILocation(line: 77, column: 17, scope: !152)
