; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_12.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_021/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_12_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocation(line: 38, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 38, column: 8)
!66 = !DILocation(line: 38, column: 8, scope: !52)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 42, type: !70)
!68 = distinct !DILexicalBlock(scope: !69, file: !45, line: 40, column: 9)
!69 = distinct !DILexicalBlock(scope: !65, file: !45, line: 39, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 42, column: 20, scope: !68)
!74 = !DILocation(line: 42, column: 37, scope: !68)
!75 = !DILocation(line: 42, column: 30, scope: !68)
!76 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 43, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !23, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !42, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !42, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !42, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !42, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !42, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !42, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !42, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !42, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !42, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !42, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !42, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !23, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !23, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !24, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !22, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !23, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 43, column: 20, scope: !68)
!133 = !DILocation(line: 45, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !68, file: !45, line: 45, column: 17)
!135 = !DILocation(line: 45, column: 20, scope: !134)
!136 = !DILocation(line: 45, column: 29, scope: !134)
!137 = !DILocation(line: 45, column: 17, scope: !68)
!138 = !DILocation(line: 47, column: 25, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !45, line: 46, column: 13)
!140 = !DILocation(line: 47, column: 23, scope: !139)
!141 = !DILocation(line: 48, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !45, line: 48, column: 21)
!143 = !DILocation(line: 48, column: 27, scope: !142)
!144 = !DILocation(line: 48, column: 21, scope: !139)
!145 = !DILocation(line: 51, column: 31, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !45, line: 51, column: 25)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 49, column: 17)
!148 = !DILocation(line: 51, column: 36, scope: !146)
!149 = !DILocation(line: 51, column: 35, scope: !146)
!150 = !DILocation(line: 51, column: 55, scope: !146)
!151 = !DILocation(line: 51, column: 54, scope: !146)
!152 = !DILocation(line: 51, column: 45, scope: !146)
!153 = !DILocation(line: 51, column: 65, scope: !146)
!154 = !DILocation(line: 51, column: 25, scope: !146)
!155 = !DILocation(line: 51, column: 72, scope: !146)
!156 = !DILocation(line: 51, column: 25, scope: !147)
!157 = !DILocation(line: 53, column: 25, scope: !158)
!158 = distinct !DILexicalBlock(scope: !146, file: !45, line: 52, column: 21)
!159 = !DILocation(line: 55, column: 25, scope: !158)
!160 = !DILocation(line: 55, column: 30, scope: !158)
!161 = !DILocation(line: 55, column: 39, scope: !158)
!162 = !DILocation(line: 56, column: 21, scope: !158)
!163 = !DILocation(line: 57, column: 28, scope: !147)
!164 = !DILocation(line: 57, column: 21, scope: !147)
!165 = !DILocation(line: 58, column: 17, scope: !147)
!166 = !DILocation(line: 59, column: 13, scope: !139)
!167 = !DILocation(line: 61, column: 5, scope: !69)
!168 = !DILocation(line: 65, column: 16, scope: !169)
!169 = distinct !DILexicalBlock(scope: !65, file: !45, line: 63, column: 5)
!170 = !DILocation(line: 65, column: 9, scope: !169)
!171 = !DILocation(line: 67, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !52, file: !45, line: 67, column: 8)
!173 = !DILocation(line: 67, column: 8, scope: !52)
!174 = !DILocation(line: 70, column: 16, scope: !175)
!175 = distinct !DILexicalBlock(scope: !172, file: !45, line: 68, column: 5)
!176 = !DILocation(line: 70, column: 9, scope: !175)
!177 = !DILocation(line: 71, column: 5, scope: !175)
!178 = !DILocation(line: 75, column: 24, scope: !179)
!179 = distinct !DILexicalBlock(scope: !172, file: !45, line: 73, column: 5)
!180 = !DILocation(line: 75, column: 9, scope: !179)
!181 = !DILocation(line: 77, column: 1, scope: !52)
!182 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 86, type: !53, scopeLine: 87, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!183 = !DILocalVariable(name: "data", scope: !182, file: !45, line: 88, type: !42)
!184 = !DILocation(line: 88, column: 12, scope: !182)
!185 = !DILocalVariable(name: "dataBuffer", scope: !182, file: !45, line: 89, type: !58)
!186 = !DILocation(line: 89, column: 10, scope: !182)
!187 = !DILocation(line: 90, column: 12, scope: !182)
!188 = !DILocation(line: 90, column: 10, scope: !182)
!189 = !DILocation(line: 91, column: 8, scope: !190)
!190 = distinct !DILexicalBlock(scope: !182, file: !45, line: 91, column: 8)
!191 = !DILocation(line: 91, column: 8, scope: !182)
!192 = !DILocalVariable(name: "dataLen", scope: !193, file: !45, line: 95, type: !70)
!193 = distinct !DILexicalBlock(scope: !194, file: !45, line: 93, column: 9)
!194 = distinct !DILexicalBlock(scope: !190, file: !45, line: 92, column: 5)
!195 = !DILocation(line: 95, column: 20, scope: !193)
!196 = !DILocation(line: 95, column: 37, scope: !193)
!197 = !DILocation(line: 95, column: 30, scope: !193)
!198 = !DILocalVariable(name: "pFile", scope: !193, file: !45, line: 96, type: !77)
!199 = !DILocation(line: 96, column: 20, scope: !193)
!200 = !DILocation(line: 98, column: 21, scope: !201)
!201 = distinct !DILexicalBlock(scope: !193, file: !45, line: 98, column: 17)
!202 = !DILocation(line: 98, column: 20, scope: !201)
!203 = !DILocation(line: 98, column: 29, scope: !201)
!204 = !DILocation(line: 98, column: 17, scope: !193)
!205 = !DILocation(line: 100, column: 25, scope: !206)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 99, column: 13)
!207 = !DILocation(line: 100, column: 23, scope: !206)
!208 = !DILocation(line: 101, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !45, line: 101, column: 21)
!210 = !DILocation(line: 101, column: 27, scope: !209)
!211 = !DILocation(line: 101, column: 21, scope: !206)
!212 = !DILocation(line: 104, column: 31, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !45, line: 104, column: 25)
!214 = distinct !DILexicalBlock(scope: !209, file: !45, line: 102, column: 17)
!215 = !DILocation(line: 104, column: 36, scope: !213)
!216 = !DILocation(line: 104, column: 35, scope: !213)
!217 = !DILocation(line: 104, column: 55, scope: !213)
!218 = !DILocation(line: 104, column: 54, scope: !213)
!219 = !DILocation(line: 104, column: 45, scope: !213)
!220 = !DILocation(line: 104, column: 65, scope: !213)
!221 = !DILocation(line: 104, column: 25, scope: !213)
!222 = !DILocation(line: 104, column: 72, scope: !213)
!223 = !DILocation(line: 104, column: 25, scope: !214)
!224 = !DILocation(line: 106, column: 25, scope: !225)
!225 = distinct !DILexicalBlock(scope: !213, file: !45, line: 105, column: 21)
!226 = !DILocation(line: 108, column: 25, scope: !225)
!227 = !DILocation(line: 108, column: 30, scope: !225)
!228 = !DILocation(line: 108, column: 39, scope: !225)
!229 = !DILocation(line: 109, column: 21, scope: !225)
!230 = !DILocation(line: 110, column: 28, scope: !214)
!231 = !DILocation(line: 110, column: 21, scope: !214)
!232 = !DILocation(line: 111, column: 17, scope: !214)
!233 = !DILocation(line: 112, column: 13, scope: !206)
!234 = !DILocation(line: 114, column: 5, scope: !194)
!235 = !DILocalVariable(name: "dataLen", scope: !236, file: !45, line: 119, type: !70)
!236 = distinct !DILexicalBlock(scope: !237, file: !45, line: 117, column: 9)
!237 = distinct !DILexicalBlock(scope: !190, file: !45, line: 116, column: 5)
!238 = !DILocation(line: 119, column: 20, scope: !236)
!239 = !DILocation(line: 119, column: 37, scope: !236)
!240 = !DILocation(line: 119, column: 30, scope: !236)
!241 = !DILocalVariable(name: "pFile", scope: !236, file: !45, line: 120, type: !77)
!242 = !DILocation(line: 120, column: 20, scope: !236)
!243 = !DILocation(line: 122, column: 21, scope: !244)
!244 = distinct !DILexicalBlock(scope: !236, file: !45, line: 122, column: 17)
!245 = !DILocation(line: 122, column: 20, scope: !244)
!246 = !DILocation(line: 122, column: 29, scope: !244)
!247 = !DILocation(line: 122, column: 17, scope: !236)
!248 = !DILocation(line: 124, column: 25, scope: !249)
!249 = distinct !DILexicalBlock(scope: !244, file: !45, line: 123, column: 13)
!250 = !DILocation(line: 124, column: 23, scope: !249)
!251 = !DILocation(line: 125, column: 21, scope: !252)
!252 = distinct !DILexicalBlock(scope: !249, file: !45, line: 125, column: 21)
!253 = !DILocation(line: 125, column: 27, scope: !252)
!254 = !DILocation(line: 125, column: 21, scope: !249)
!255 = !DILocation(line: 128, column: 31, scope: !256)
!256 = distinct !DILexicalBlock(scope: !257, file: !45, line: 128, column: 25)
!257 = distinct !DILexicalBlock(scope: !252, file: !45, line: 126, column: 17)
!258 = !DILocation(line: 128, column: 36, scope: !256)
!259 = !DILocation(line: 128, column: 35, scope: !256)
!260 = !DILocation(line: 128, column: 55, scope: !256)
!261 = !DILocation(line: 128, column: 54, scope: !256)
!262 = !DILocation(line: 128, column: 45, scope: !256)
!263 = !DILocation(line: 128, column: 65, scope: !256)
!264 = !DILocation(line: 128, column: 25, scope: !256)
!265 = !DILocation(line: 128, column: 72, scope: !256)
!266 = !DILocation(line: 128, column: 25, scope: !257)
!267 = !DILocation(line: 130, column: 25, scope: !268)
!268 = distinct !DILexicalBlock(scope: !256, file: !45, line: 129, column: 21)
!269 = !DILocation(line: 132, column: 25, scope: !268)
!270 = !DILocation(line: 132, column: 30, scope: !268)
!271 = !DILocation(line: 132, column: 39, scope: !268)
!272 = !DILocation(line: 133, column: 21, scope: !268)
!273 = !DILocation(line: 134, column: 28, scope: !257)
!274 = !DILocation(line: 134, column: 21, scope: !257)
!275 = !DILocation(line: 135, column: 17, scope: !257)
!276 = !DILocation(line: 136, column: 13, scope: !249)
!277 = !DILocation(line: 139, column: 8, scope: !278)
!278 = distinct !DILexicalBlock(scope: !182, file: !45, line: 139, column: 8)
!279 = !DILocation(line: 139, column: 8, scope: !182)
!280 = !DILocation(line: 142, column: 24, scope: !281)
!281 = distinct !DILexicalBlock(scope: !278, file: !45, line: 140, column: 5)
!282 = !DILocation(line: 142, column: 9, scope: !281)
!283 = !DILocation(line: 143, column: 5, scope: !281)
!284 = !DILocation(line: 147, column: 24, scope: !285)
!285 = distinct !DILexicalBlock(scope: !278, file: !45, line: 145, column: 5)
!286 = !DILocation(line: 147, column: 9, scope: !285)
!287 = !DILocation(line: 149, column: 1, scope: !182)
!288 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 154, type: !53, scopeLine: 155, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!289 = !DILocalVariable(name: "data", scope: !288, file: !45, line: 156, type: !42)
!290 = !DILocation(line: 156, column: 12, scope: !288)
!291 = !DILocalVariable(name: "dataBuffer", scope: !288, file: !45, line: 157, type: !58)
!292 = !DILocation(line: 157, column: 10, scope: !288)
!293 = !DILocation(line: 158, column: 12, scope: !288)
!294 = !DILocation(line: 158, column: 10, scope: !288)
!295 = !DILocation(line: 159, column: 8, scope: !296)
!296 = distinct !DILexicalBlock(scope: !288, file: !45, line: 159, column: 8)
!297 = !DILocation(line: 159, column: 8, scope: !288)
!298 = !DILocation(line: 162, column: 16, scope: !299)
!299 = distinct !DILexicalBlock(scope: !296, file: !45, line: 160, column: 5)
!300 = !DILocation(line: 162, column: 9, scope: !299)
!301 = !DILocation(line: 163, column: 5, scope: !299)
!302 = !DILocation(line: 167, column: 16, scope: !303)
!303 = distinct !DILexicalBlock(scope: !296, file: !45, line: 165, column: 5)
!304 = !DILocation(line: 167, column: 9, scope: !303)
!305 = !DILocation(line: 169, column: 8, scope: !306)
!306 = distinct !DILexicalBlock(scope: !288, file: !45, line: 169, column: 8)
!307 = !DILocation(line: 169, column: 8, scope: !288)
!308 = !DILocation(line: 172, column: 16, scope: !309)
!309 = distinct !DILexicalBlock(scope: !306, file: !45, line: 170, column: 5)
!310 = !DILocation(line: 172, column: 9, scope: !309)
!311 = !DILocation(line: 173, column: 5, scope: !309)
!312 = !DILocation(line: 177, column: 16, scope: !313)
!313 = distinct !DILexicalBlock(scope: !306, file: !45, line: 175, column: 5)
!314 = !DILocation(line: 177, column: 9, scope: !313)
!315 = !DILocation(line: 179, column: 1, scope: !288)
!316 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_12_good", scope: !45, file: !45, line: 181, type: !53, scopeLine: 182, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!317 = !DILocation(line: 183, column: 5, scope: !316)
!318 = !DILocation(line: 184, column: 5, scope: !316)
!319 = !DILocation(line: 185, column: 1, scope: !316)
!320 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !321, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!321 = !DISubroutineType(types: !322)
!322 = !{null, !42}
!323 = !DILocalVariable(name: "line", arg: 1, scope: !320, file: !3, line: 11, type: !42)
!324 = !DILocation(line: 11, column: 25, scope: !320)
!325 = !DILocation(line: 13, column: 1, scope: !320)
!326 = !DILocation(line: 14, column: 8, scope: !327)
!327 = distinct !DILexicalBlock(scope: !320, file: !3, line: 14, column: 8)
!328 = !DILocation(line: 14, column: 13, scope: !327)
!329 = !DILocation(line: 14, column: 8, scope: !320)
!330 = !DILocation(line: 16, column: 24, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !3, line: 15, column: 5)
!332 = !DILocation(line: 16, column: 9, scope: !331)
!333 = !DILocation(line: 17, column: 5, scope: !331)
!334 = !DILocation(line: 18, column: 5, scope: !320)
!335 = !DILocation(line: 19, column: 1, scope: !320)
!336 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !321, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!337 = !DILocalVariable(name: "line", arg: 1, scope: !336, file: !3, line: 20, type: !42)
!338 = !DILocation(line: 20, column: 29, scope: !336)
!339 = !DILocation(line: 22, column: 8, scope: !340)
!340 = distinct !DILexicalBlock(scope: !336, file: !3, line: 22, column: 8)
!341 = !DILocation(line: 22, column: 13, scope: !340)
!342 = !DILocation(line: 22, column: 8, scope: !336)
!343 = !DILocation(line: 24, column: 24, scope: !344)
!344 = distinct !DILexicalBlock(scope: !340, file: !3, line: 23, column: 5)
!345 = !DILocation(line: 24, column: 9, scope: !344)
!346 = !DILocation(line: 25, column: 5, scope: !344)
!347 = !DILocation(line: 26, column: 1, scope: !336)
!348 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !349, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !351}
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !352, size: 64)
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !71, line: 74, baseType: !23)
!353 = !DILocalVariable(name: "line", arg: 1, scope: !348, file: !3, line: 27, type: !351)
!354 = !DILocation(line: 27, column: 29, scope: !348)
!355 = !DILocation(line: 29, column: 8, scope: !356)
!356 = distinct !DILexicalBlock(scope: !348, file: !3, line: 29, column: 8)
!357 = !DILocation(line: 29, column: 13, scope: !356)
!358 = !DILocation(line: 29, column: 8, scope: !348)
!359 = !DILocation(line: 31, column: 27, scope: !360)
!360 = distinct !DILexicalBlock(scope: !356, file: !3, line: 30, column: 5)
!361 = !DILocation(line: 31, column: 9, scope: !360)
!362 = !DILocation(line: 32, column: 5, scope: !360)
!363 = !DILocation(line: 33, column: 1, scope: !348)
!364 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !365, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !23}
!367 = !DILocalVariable(name: "intNumber", arg: 1, scope: !364, file: !3, line: 35, type: !23)
!368 = !DILocation(line: 35, column: 24, scope: !364)
!369 = !DILocation(line: 37, column: 20, scope: !364)
!370 = !DILocation(line: 37, column: 5, scope: !364)
!371 = !DILocation(line: 38, column: 1, scope: !364)
!372 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !373, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375}
!375 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!376 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !372, file: !3, line: 40, type: !375)
!377 = !DILocation(line: 40, column: 28, scope: !372)
!378 = !DILocation(line: 42, column: 21, scope: !372)
!379 = !DILocation(line: 42, column: 5, scope: !372)
!380 = !DILocation(line: 43, column: 1, scope: !372)
!381 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !382, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !384}
!384 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!385 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !381, file: !3, line: 45, type: !384)
!386 = !DILocation(line: 45, column: 28, scope: !381)
!387 = !DILocation(line: 47, column: 20, scope: !381)
!388 = !DILocation(line: 47, column: 5, scope: !381)
!389 = !DILocation(line: 48, column: 1, scope: !381)
!390 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !391, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !105}
!393 = !DILocalVariable(name: "longNumber", arg: 1, scope: !390, file: !3, line: 50, type: !105)
!394 = !DILocation(line: 50, column: 26, scope: !390)
!395 = !DILocation(line: 52, column: 21, scope: !390)
!396 = !DILocation(line: 52, column: 5, scope: !390)
!397 = !DILocation(line: 53, column: 1, scope: !390)
!398 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !399, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !402, line: 27, baseType: !403)
!402 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 44, baseType: !105)
!404 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !398, file: !3, line: 55, type: !401)
!405 = !DILocation(line: 55, column: 33, scope: !398)
!406 = !DILocation(line: 57, column: 29, scope: !398)
!407 = !DILocation(line: 57, column: 5, scope: !398)
!408 = !DILocation(line: 58, column: 1, scope: !398)
!409 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !410, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !70}
!412 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !409, file: !3, line: 60, type: !70)
!413 = !DILocation(line: 60, column: 29, scope: !409)
!414 = !DILocation(line: 62, column: 21, scope: !409)
!415 = !DILocation(line: 62, column: 5, scope: !409)
!416 = !DILocation(line: 63, column: 1, scope: !409)
!417 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !418, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !43}
!420 = !DILocalVariable(name: "charHex", arg: 1, scope: !417, file: !3, line: 65, type: !43)
!421 = !DILocation(line: 65, column: 29, scope: !417)
!422 = !DILocation(line: 67, column: 22, scope: !417)
!423 = !DILocation(line: 67, column: 5, scope: !417)
!424 = !DILocation(line: 68, column: 1, scope: !417)
!425 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !426, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !352}
!428 = !DILocalVariable(name: "wideChar", arg: 1, scope: !425, file: !3, line: 70, type: !352)
!429 = !DILocation(line: 70, column: 29, scope: !425)
!430 = !DILocalVariable(name: "s", scope: !425, file: !3, line: 74, type: !431)
!431 = !DICompositeType(tag: DW_TAG_array_type, baseType: !352, size: 64, elements: !432)
!432 = !{!433}
!433 = !DISubrange(count: 2)
!434 = !DILocation(line: 74, column: 13, scope: !425)
!435 = !DILocation(line: 75, column: 16, scope: !425)
!436 = !DILocation(line: 75, column: 9, scope: !425)
!437 = !DILocation(line: 75, column: 14, scope: !425)
!438 = !DILocation(line: 76, column: 9, scope: !425)
!439 = !DILocation(line: 76, column: 14, scope: !425)
!440 = !DILocation(line: 77, column: 21, scope: !425)
!441 = !DILocation(line: 77, column: 5, scope: !425)
!442 = !DILocation(line: 78, column: 1, scope: !425)
!443 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !444, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !7}
!446 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !443, file: !3, line: 80, type: !7)
!447 = !DILocation(line: 80, column: 33, scope: !443)
!448 = !DILocation(line: 82, column: 20, scope: !443)
!449 = !DILocation(line: 82, column: 5, scope: !443)
!450 = !DILocation(line: 83, column: 1, scope: !443)
!451 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !452, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !25}
!454 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !451, file: !3, line: 85, type: !25)
!455 = !DILocation(line: 85, column: 45, scope: !451)
!456 = !DILocation(line: 87, column: 22, scope: !451)
!457 = !DILocation(line: 87, column: 5, scope: !451)
!458 = !DILocation(line: 88, column: 1, scope: !451)
!459 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !460, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !462}
!462 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!463 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !459, file: !3, line: 90, type: !462)
!464 = !DILocation(line: 90, column: 29, scope: !459)
!465 = !DILocation(line: 92, column: 20, scope: !459)
!466 = !DILocation(line: 92, column: 5, scope: !459)
!467 = !DILocation(line: 93, column: 1, scope: !459)
!468 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !469, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !471}
!471 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !472, size: 64)
!472 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !473, line: 100, baseType: !474)
!473 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_021/source_code")
!474 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !473, line: 96, size: 64, elements: !475)
!475 = !{!476, !477}
!476 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !474, file: !473, line: 98, baseType: !23, size: 32)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !474, file: !473, line: 99, baseType: !23, size: 32, offset: 32)
!478 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !468, file: !3, line: 95, type: !471)
!479 = !DILocation(line: 95, column: 40, scope: !468)
!480 = !DILocation(line: 97, column: 26, scope: !468)
!481 = !DILocation(line: 97, column: 47, scope: !468)
!482 = !DILocation(line: 97, column: 55, scope: !468)
!483 = !DILocation(line: 97, column: 76, scope: !468)
!484 = !DILocation(line: 97, column: 5, scope: !468)
!485 = !DILocation(line: 98, column: 1, scope: !468)
!486 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !487, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !489, !70}
!489 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!490 = !DILocalVariable(name: "bytes", arg: 1, scope: !486, file: !3, line: 100, type: !489)
!491 = !DILocation(line: 100, column: 38, scope: !486)
!492 = !DILocalVariable(name: "numBytes", arg: 2, scope: !486, file: !3, line: 100, type: !70)
!493 = !DILocation(line: 100, column: 52, scope: !486)
!494 = !DILocalVariable(name: "i", scope: !486, file: !3, line: 102, type: !70)
!495 = !DILocation(line: 102, column: 12, scope: !486)
!496 = !DILocation(line: 103, column: 12, scope: !497)
!497 = distinct !DILexicalBlock(scope: !486, file: !3, line: 103, column: 5)
!498 = !DILocation(line: 103, column: 10, scope: !497)
!499 = !DILocation(line: 103, column: 17, scope: !500)
!500 = distinct !DILexicalBlock(scope: !497, file: !3, line: 103, column: 5)
!501 = !DILocation(line: 103, column: 21, scope: !500)
!502 = !DILocation(line: 103, column: 19, scope: !500)
!503 = !DILocation(line: 103, column: 5, scope: !497)
!504 = !DILocation(line: 105, column: 24, scope: !505)
!505 = distinct !DILexicalBlock(scope: !500, file: !3, line: 104, column: 5)
!506 = !DILocation(line: 105, column: 30, scope: !505)
!507 = !DILocation(line: 105, column: 9, scope: !505)
!508 = !DILocation(line: 106, column: 5, scope: !505)
!509 = !DILocation(line: 103, column: 31, scope: !500)
!510 = !DILocation(line: 103, column: 5, scope: !500)
!511 = distinct !{!511, !503, !512, !513}
!512 = !DILocation(line: 106, column: 5, scope: !497)
!513 = !{!"llvm.loop.mustprogress"}
!514 = !DILocation(line: 107, column: 5, scope: !486)
!515 = !DILocation(line: 108, column: 1, scope: !486)
!516 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !517, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!517 = !DISubroutineType(types: !518)
!518 = !{!70, !489, !70, !42}
!519 = !DILocalVariable(name: "bytes", arg: 1, scope: !516, file: !3, line: 113, type: !489)
!520 = !DILocation(line: 113, column: 39, scope: !516)
!521 = !DILocalVariable(name: "numBytes", arg: 2, scope: !516, file: !3, line: 113, type: !70)
!522 = !DILocation(line: 113, column: 53, scope: !516)
!523 = !DILocalVariable(name: "hex", arg: 3, scope: !516, file: !3, line: 113, type: !42)
!524 = !DILocation(line: 113, column: 71, scope: !516)
!525 = !DILocalVariable(name: "numWritten", scope: !516, file: !3, line: 115, type: !70)
!526 = !DILocation(line: 115, column: 12, scope: !516)
!527 = !DILocation(line: 121, column: 5, scope: !516)
!528 = !DILocation(line: 121, column: 12, scope: !516)
!529 = !DILocation(line: 121, column: 25, scope: !516)
!530 = !DILocation(line: 121, column: 23, scope: !516)
!531 = !DILocation(line: 121, column: 34, scope: !516)
!532 = !DILocation(line: 121, column: 37, scope: !516)
!533 = !DILocation(line: 121, column: 67, scope: !516)
!534 = !DILocation(line: 121, column: 70, scope: !516)
!535 = !DILocation(line: 0, scope: !516)
!536 = !DILocalVariable(name: "byte", scope: !537, file: !3, line: 123, type: !23)
!537 = distinct !DILexicalBlock(scope: !516, file: !3, line: 122, column: 5)
