; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._CWE606_Unchecked_Loop_Condition__char_file_67_structType = type { i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_67a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_113/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_67b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_113/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_67_bad", scope: !45, file: !45, line: 38, type: !55, scopeLine: 39, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 40, type: !42)
!58 = !DILocation(line: 40, column: 12, scope: !54)
!59 = !DILocalVariable(name: "myStruct", scope: !54, file: !45, line: 41, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE606_Unchecked_Loop_Condition__char_file_67_structType", file: !61, line: 8, baseType: !62)
!61 = !DIFile(filename: "./_costom_header_.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_113/source_code")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CWE606_Unchecked_Loop_Condition__char_file_67_structType", file: !61, line: 5, size: 64, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "structFirst", scope: !62, file: !61, line: 7, baseType: !42, size: 64)
!65 = !DILocation(line: 41, column: 62, scope: !54)
!66 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 42, type: !67)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 100)
!70 = !DILocation(line: 42, column: 10, scope: !54)
!71 = !DILocation(line: 43, column: 12, scope: !54)
!72 = !DILocation(line: 43, column: 10, scope: !54)
!73 = !DILocalVariable(name: "dataLen", scope: !74, file: !45, line: 46, type: !75)
!74 = distinct !DILexicalBlock(scope: !54, file: !45, line: 44, column: 5)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DILocation(line: 46, column: 16, scope: !74)
!79 = !DILocation(line: 46, column: 33, scope: !74)
!80 = !DILocation(line: 46, column: 26, scope: !74)
!81 = !DILocalVariable(name: "pFile", scope: !74, file: !45, line: 47, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 7, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !105, !106, !107, !111, !112, !114, !118, !121, !123, !126, !129, !130, !131, !132, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !23, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !42, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !42, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !42, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !42, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !42, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !42, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !42, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !42, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !42, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !42, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !42, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !23, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !23, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !24, size: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !113, size: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !115, size: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !119, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !122, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 153, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !104, size: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !22, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !75, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !23, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 47, column: 16, scope: !74)
!138 = !DILocation(line: 49, column: 17, scope: !139)
!139 = distinct !DILexicalBlock(scope: !74, file: !45, line: 49, column: 13)
!140 = !DILocation(line: 49, column: 16, scope: !139)
!141 = !DILocation(line: 49, column: 25, scope: !139)
!142 = !DILocation(line: 49, column: 13, scope: !74)
!143 = !DILocation(line: 51, column: 21, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !45, line: 50, column: 9)
!145 = !DILocation(line: 51, column: 19, scope: !144)
!146 = !DILocation(line: 52, column: 17, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !45, line: 52, column: 17)
!148 = !DILocation(line: 52, column: 23, scope: !147)
!149 = !DILocation(line: 52, column: 17, scope: !144)
!150 = !DILocation(line: 55, column: 27, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !45, line: 55, column: 21)
!152 = distinct !DILexicalBlock(scope: !147, file: !45, line: 53, column: 13)
!153 = !DILocation(line: 55, column: 32, scope: !151)
!154 = !DILocation(line: 55, column: 31, scope: !151)
!155 = !DILocation(line: 55, column: 51, scope: !151)
!156 = !DILocation(line: 55, column: 50, scope: !151)
!157 = !DILocation(line: 55, column: 41, scope: !151)
!158 = !DILocation(line: 55, column: 61, scope: !151)
!159 = !DILocation(line: 55, column: 21, scope: !151)
!160 = !DILocation(line: 55, column: 68, scope: !151)
!161 = !DILocation(line: 55, column: 21, scope: !152)
!162 = !DILocation(line: 57, column: 21, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !45, line: 56, column: 17)
!164 = !DILocation(line: 59, column: 21, scope: !163)
!165 = !DILocation(line: 59, column: 26, scope: !163)
!166 = !DILocation(line: 59, column: 35, scope: !163)
!167 = !DILocation(line: 60, column: 17, scope: !163)
!168 = !DILocation(line: 61, column: 24, scope: !152)
!169 = !DILocation(line: 61, column: 17, scope: !152)
!170 = !DILocation(line: 62, column: 13, scope: !152)
!171 = !DILocation(line: 63, column: 9, scope: !144)
!172 = !DILocation(line: 65, column: 28, scope: !54)
!173 = !DILocation(line: 65, column: 14, scope: !54)
!174 = !DILocation(line: 65, column: 26, scope: !54)
!175 = !DILocation(line: 66, column: 5, scope: !54)
!176 = !DILocation(line: 67, column: 1, scope: !54)
!177 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 75, type: !55, scopeLine: 76, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!178 = !DILocalVariable(name: "data", scope: !177, file: !45, line: 77, type: !42)
!179 = !DILocation(line: 77, column: 12, scope: !177)
!180 = !DILocalVariable(name: "myStruct", scope: !177, file: !45, line: 78, type: !60)
!181 = !DILocation(line: 78, column: 62, scope: !177)
!182 = !DILocalVariable(name: "dataBuffer", scope: !177, file: !45, line: 79, type: !67)
!183 = !DILocation(line: 79, column: 10, scope: !177)
!184 = !DILocation(line: 80, column: 12, scope: !177)
!185 = !DILocation(line: 80, column: 10, scope: !177)
!186 = !DILocation(line: 82, column: 12, scope: !177)
!187 = !DILocation(line: 82, column: 5, scope: !177)
!188 = !DILocation(line: 83, column: 28, scope: !177)
!189 = !DILocation(line: 83, column: 14, scope: !177)
!190 = !DILocation(line: 83, column: 26, scope: !177)
!191 = !DILocation(line: 84, column: 5, scope: !177)
!192 = !DILocation(line: 85, column: 1, scope: !177)
!193 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 89, type: !55, scopeLine: 90, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!194 = !DILocalVariable(name: "data", scope: !193, file: !45, line: 91, type: !42)
!195 = !DILocation(line: 91, column: 12, scope: !193)
!196 = !DILocalVariable(name: "myStruct", scope: !193, file: !45, line: 92, type: !60)
!197 = !DILocation(line: 92, column: 62, scope: !193)
!198 = !DILocalVariable(name: "dataBuffer", scope: !193, file: !45, line: 93, type: !67)
!199 = !DILocation(line: 93, column: 10, scope: !193)
!200 = !DILocation(line: 94, column: 12, scope: !193)
!201 = !DILocation(line: 94, column: 10, scope: !193)
!202 = !DILocalVariable(name: "dataLen", scope: !203, file: !45, line: 97, type: !75)
!203 = distinct !DILexicalBlock(scope: !193, file: !45, line: 95, column: 5)
!204 = !DILocation(line: 97, column: 16, scope: !203)
!205 = !DILocation(line: 97, column: 33, scope: !203)
!206 = !DILocation(line: 97, column: 26, scope: !203)
!207 = !DILocalVariable(name: "pFile", scope: !203, file: !45, line: 98, type: !82)
!208 = !DILocation(line: 98, column: 16, scope: !203)
!209 = !DILocation(line: 100, column: 17, scope: !210)
!210 = distinct !DILexicalBlock(scope: !203, file: !45, line: 100, column: 13)
!211 = !DILocation(line: 100, column: 16, scope: !210)
!212 = !DILocation(line: 100, column: 25, scope: !210)
!213 = !DILocation(line: 100, column: 13, scope: !203)
!214 = !DILocation(line: 102, column: 21, scope: !215)
!215 = distinct !DILexicalBlock(scope: !210, file: !45, line: 101, column: 9)
!216 = !DILocation(line: 102, column: 19, scope: !215)
!217 = !DILocation(line: 103, column: 17, scope: !218)
!218 = distinct !DILexicalBlock(scope: !215, file: !45, line: 103, column: 17)
!219 = !DILocation(line: 103, column: 23, scope: !218)
!220 = !DILocation(line: 103, column: 17, scope: !215)
!221 = !DILocation(line: 106, column: 27, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !45, line: 106, column: 21)
!223 = distinct !DILexicalBlock(scope: !218, file: !45, line: 104, column: 13)
!224 = !DILocation(line: 106, column: 32, scope: !222)
!225 = !DILocation(line: 106, column: 31, scope: !222)
!226 = !DILocation(line: 106, column: 51, scope: !222)
!227 = !DILocation(line: 106, column: 50, scope: !222)
!228 = !DILocation(line: 106, column: 41, scope: !222)
!229 = !DILocation(line: 106, column: 61, scope: !222)
!230 = !DILocation(line: 106, column: 21, scope: !222)
!231 = !DILocation(line: 106, column: 68, scope: !222)
!232 = !DILocation(line: 106, column: 21, scope: !223)
!233 = !DILocation(line: 108, column: 21, scope: !234)
!234 = distinct !DILexicalBlock(scope: !222, file: !45, line: 107, column: 17)
!235 = !DILocation(line: 110, column: 21, scope: !234)
!236 = !DILocation(line: 110, column: 26, scope: !234)
!237 = !DILocation(line: 110, column: 35, scope: !234)
!238 = !DILocation(line: 111, column: 17, scope: !234)
!239 = !DILocation(line: 112, column: 24, scope: !223)
!240 = !DILocation(line: 112, column: 17, scope: !223)
!241 = !DILocation(line: 113, column: 13, scope: !223)
!242 = !DILocation(line: 114, column: 9, scope: !215)
!243 = !DILocation(line: 116, column: 28, scope: !193)
!244 = !DILocation(line: 116, column: 14, scope: !193)
!245 = !DILocation(line: 116, column: 26, scope: !193)
!246 = !DILocation(line: 117, column: 5, scope: !193)
!247 = !DILocation(line: 118, column: 1, scope: !193)
!248 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_67_good", scope: !45, file: !45, line: 120, type: !55, scopeLine: 121, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!249 = !DILocation(line: 122, column: 5, scope: !248)
!250 = !DILocation(line: 123, column: 5, scope: !248)
!251 = !DILocation(line: 124, column: 1, scope: !248)
!252 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_67b_badSink", scope: !49, file: !49, line: 39, type: !253, scopeLine: 40, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !255}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE606_Unchecked_Loop_Condition__char_file_67_structType", file: !49, line: 35, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CWE606_Unchecked_Loop_Condition__char_file_67_structType", file: !49, line: 32, size: 64, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "structFirst", scope: !256, file: !49, line: 34, baseType: !42, size: 64)
!259 = !DILocalVariable(name: "myStruct", arg: 1, scope: !252, file: !49, line: 39, type: !255)
!260 = !DILocation(line: 39, column: 118, scope: !252)
!261 = !DILocalVariable(name: "data", scope: !252, file: !49, line: 41, type: !42)
!262 = !DILocation(line: 41, column: 12, scope: !252)
!263 = !DILocation(line: 41, column: 28, scope: !252)
!264 = !DILocalVariable(name: "i", scope: !265, file: !49, line: 43, type: !23)
!265 = distinct !DILexicalBlock(scope: !252, file: !49, line: 42, column: 5)
!266 = !DILocation(line: 43, column: 13, scope: !265)
!267 = !DILocalVariable(name: "n", scope: !265, file: !49, line: 43, type: !23)
!268 = !DILocation(line: 43, column: 16, scope: !265)
!269 = !DILocalVariable(name: "intVariable", scope: !265, file: !49, line: 43, type: !23)
!270 = !DILocation(line: 43, column: 19, scope: !265)
!271 = !DILocation(line: 44, column: 20, scope: !272)
!272 = distinct !DILexicalBlock(scope: !265, file: !49, line: 44, column: 13)
!273 = !DILocation(line: 44, column: 13, scope: !272)
!274 = !DILocation(line: 44, column: 36, scope: !272)
!275 = !DILocation(line: 44, column: 13, scope: !265)
!276 = !DILocation(line: 47, column: 25, scope: !277)
!277 = distinct !DILexicalBlock(scope: !272, file: !49, line: 45, column: 9)
!278 = !DILocation(line: 48, column: 20, scope: !279)
!279 = distinct !DILexicalBlock(scope: !277, file: !49, line: 48, column: 13)
!280 = !DILocation(line: 48, column: 18, scope: !279)
!281 = !DILocation(line: 48, column: 25, scope: !282)
!282 = distinct !DILexicalBlock(scope: !279, file: !49, line: 48, column: 13)
!283 = !DILocation(line: 48, column: 29, scope: !282)
!284 = !DILocation(line: 48, column: 27, scope: !282)
!285 = !DILocation(line: 48, column: 13, scope: !279)
!286 = !DILocation(line: 51, column: 28, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !49, line: 49, column: 13)
!288 = !DILocation(line: 52, column: 13, scope: !287)
!289 = !DILocation(line: 48, column: 33, scope: !282)
!290 = !DILocation(line: 48, column: 13, scope: !282)
!291 = distinct !{!291, !285, !292, !293}
!292 = !DILocation(line: 52, column: 13, scope: !279)
!293 = !{!"llvm.loop.mustprogress"}
!294 = !DILocation(line: 53, column: 26, scope: !277)
!295 = !DILocation(line: 53, column: 13, scope: !277)
!296 = !DILocation(line: 54, column: 9, scope: !277)
!297 = !DILocation(line: 56, column: 1, scope: !252)
!298 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_67b_goodG2BSink", scope: !49, file: !49, line: 63, type: !253, scopeLine: 64, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!299 = !DILocalVariable(name: "myStruct", arg: 1, scope: !298, file: !49, line: 63, type: !255)
!300 = !DILocation(line: 63, column: 122, scope: !298)
!301 = !DILocalVariable(name: "data", scope: !298, file: !49, line: 65, type: !42)
!302 = !DILocation(line: 65, column: 12, scope: !298)
!303 = !DILocation(line: 65, column: 28, scope: !298)
!304 = !DILocalVariable(name: "i", scope: !305, file: !49, line: 67, type: !23)
!305 = distinct !DILexicalBlock(scope: !298, file: !49, line: 66, column: 5)
!306 = !DILocation(line: 67, column: 13, scope: !305)
!307 = !DILocalVariable(name: "n", scope: !305, file: !49, line: 67, type: !23)
!308 = !DILocation(line: 67, column: 16, scope: !305)
!309 = !DILocalVariable(name: "intVariable", scope: !305, file: !49, line: 67, type: !23)
!310 = !DILocation(line: 67, column: 19, scope: !305)
!311 = !DILocation(line: 68, column: 20, scope: !312)
!312 = distinct !DILexicalBlock(scope: !305, file: !49, line: 68, column: 13)
!313 = !DILocation(line: 68, column: 13, scope: !312)
!314 = !DILocation(line: 68, column: 36, scope: !312)
!315 = !DILocation(line: 68, column: 13, scope: !305)
!316 = !DILocation(line: 71, column: 25, scope: !317)
!317 = distinct !DILexicalBlock(scope: !312, file: !49, line: 69, column: 9)
!318 = !DILocation(line: 72, column: 20, scope: !319)
!319 = distinct !DILexicalBlock(scope: !317, file: !49, line: 72, column: 13)
!320 = !DILocation(line: 72, column: 18, scope: !319)
!321 = !DILocation(line: 72, column: 25, scope: !322)
!322 = distinct !DILexicalBlock(scope: !319, file: !49, line: 72, column: 13)
!323 = !DILocation(line: 72, column: 29, scope: !322)
!324 = !DILocation(line: 72, column: 27, scope: !322)
!325 = !DILocation(line: 72, column: 13, scope: !319)
!326 = !DILocation(line: 75, column: 28, scope: !327)
!327 = distinct !DILexicalBlock(scope: !322, file: !49, line: 73, column: 13)
!328 = !DILocation(line: 76, column: 13, scope: !327)
!329 = !DILocation(line: 72, column: 33, scope: !322)
!330 = !DILocation(line: 72, column: 13, scope: !322)
!331 = distinct !{!331, !325, !332, !293}
!332 = !DILocation(line: 76, column: 13, scope: !319)
!333 = !DILocation(line: 77, column: 26, scope: !317)
!334 = !DILocation(line: 77, column: 13, scope: !317)
!335 = !DILocation(line: 78, column: 9, scope: !317)
!336 = !DILocation(line: 80, column: 1, scope: !298)
!337 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_67b_goodB2GSink", scope: !49, file: !49, line: 83, type: !253, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!338 = !DILocalVariable(name: "myStruct", arg: 1, scope: !337, file: !49, line: 83, type: !255)
!339 = !DILocation(line: 83, column: 122, scope: !337)
!340 = !DILocalVariable(name: "data", scope: !337, file: !49, line: 85, type: !42)
!341 = !DILocation(line: 85, column: 12, scope: !337)
!342 = !DILocation(line: 85, column: 28, scope: !337)
!343 = !DILocalVariable(name: "i", scope: !344, file: !49, line: 87, type: !23)
!344 = distinct !DILexicalBlock(scope: !337, file: !49, line: 86, column: 5)
!345 = !DILocation(line: 87, column: 13, scope: !344)
!346 = !DILocalVariable(name: "n", scope: !344, file: !49, line: 87, type: !23)
!347 = !DILocation(line: 87, column: 16, scope: !344)
!348 = !DILocalVariable(name: "intVariable", scope: !344, file: !49, line: 87, type: !23)
!349 = !DILocation(line: 87, column: 19, scope: !344)
!350 = !DILocation(line: 88, column: 20, scope: !351)
!351 = distinct !DILexicalBlock(scope: !344, file: !49, line: 88, column: 13)
!352 = !DILocation(line: 88, column: 13, scope: !351)
!353 = !DILocation(line: 88, column: 36, scope: !351)
!354 = !DILocation(line: 88, column: 13, scope: !344)
!355 = !DILocation(line: 91, column: 17, scope: !356)
!356 = distinct !DILexicalBlock(scope: !357, file: !49, line: 91, column: 17)
!357 = distinct !DILexicalBlock(scope: !351, file: !49, line: 89, column: 9)
!358 = !DILocation(line: 91, column: 19, scope: !356)
!359 = !DILocation(line: 91, column: 17, scope: !357)
!360 = !DILocation(line: 93, column: 29, scope: !361)
!361 = distinct !DILexicalBlock(scope: !356, file: !49, line: 92, column: 13)
!362 = !DILocation(line: 94, column: 24, scope: !363)
!363 = distinct !DILexicalBlock(scope: !361, file: !49, line: 94, column: 17)
!364 = !DILocation(line: 94, column: 22, scope: !363)
!365 = !DILocation(line: 94, column: 29, scope: !366)
!366 = distinct !DILexicalBlock(scope: !363, file: !49, line: 94, column: 17)
!367 = !DILocation(line: 94, column: 33, scope: !366)
!368 = !DILocation(line: 94, column: 31, scope: !366)
!369 = !DILocation(line: 94, column: 17, scope: !363)
!370 = !DILocation(line: 97, column: 32, scope: !371)
!371 = distinct !DILexicalBlock(scope: !366, file: !49, line: 95, column: 17)
!372 = !DILocation(line: 98, column: 17, scope: !371)
!373 = !DILocation(line: 94, column: 37, scope: !366)
!374 = !DILocation(line: 94, column: 17, scope: !366)
!375 = distinct !{!375, !369, !376, !293}
!376 = !DILocation(line: 98, column: 17, scope: !363)
!377 = !DILocation(line: 99, column: 30, scope: !361)
!378 = !DILocation(line: 99, column: 17, scope: !361)
!379 = !DILocation(line: 100, column: 13, scope: !361)
!380 = !DILocation(line: 101, column: 9, scope: !357)
!381 = !DILocation(line: 103, column: 1, scope: !337)
!382 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !383, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !42}
!385 = !DILocalVariable(name: "line", arg: 1, scope: !382, file: !3, line: 11, type: !42)
!386 = !DILocation(line: 11, column: 25, scope: !382)
!387 = !DILocation(line: 13, column: 1, scope: !382)
!388 = !DILocation(line: 14, column: 8, scope: !389)
!389 = distinct !DILexicalBlock(scope: !382, file: !3, line: 14, column: 8)
!390 = !DILocation(line: 14, column: 13, scope: !389)
!391 = !DILocation(line: 14, column: 8, scope: !382)
!392 = !DILocation(line: 16, column: 24, scope: !393)
!393 = distinct !DILexicalBlock(scope: !389, file: !3, line: 15, column: 5)
!394 = !DILocation(line: 16, column: 9, scope: !393)
!395 = !DILocation(line: 17, column: 5, scope: !393)
!396 = !DILocation(line: 18, column: 5, scope: !382)
!397 = !DILocation(line: 19, column: 1, scope: !382)
!398 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !383, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!399 = !DILocalVariable(name: "line", arg: 1, scope: !398, file: !3, line: 20, type: !42)
!400 = !DILocation(line: 20, column: 29, scope: !398)
!401 = !DILocation(line: 22, column: 8, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !3, line: 22, column: 8)
!403 = !DILocation(line: 22, column: 13, scope: !402)
!404 = !DILocation(line: 22, column: 8, scope: !398)
!405 = !DILocation(line: 24, column: 24, scope: !406)
!406 = distinct !DILexicalBlock(scope: !402, file: !3, line: 23, column: 5)
!407 = !DILocation(line: 24, column: 9, scope: !406)
!408 = !DILocation(line: 25, column: 5, scope: !406)
!409 = !DILocation(line: 26, column: 1, scope: !398)
!410 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !411, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !413}
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !414, size: 64)
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !76, line: 74, baseType: !23)
!415 = !DILocalVariable(name: "line", arg: 1, scope: !410, file: !3, line: 27, type: !413)
!416 = !DILocation(line: 27, column: 29, scope: !410)
!417 = !DILocation(line: 29, column: 8, scope: !418)
!418 = distinct !DILexicalBlock(scope: !410, file: !3, line: 29, column: 8)
!419 = !DILocation(line: 29, column: 13, scope: !418)
!420 = !DILocation(line: 29, column: 8, scope: !410)
!421 = !DILocation(line: 31, column: 27, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !3, line: 30, column: 5)
!423 = !DILocation(line: 31, column: 9, scope: !422)
!424 = !DILocation(line: 32, column: 5, scope: !422)
!425 = !DILocation(line: 33, column: 1, scope: !410)
!426 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !427, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !23}
!429 = !DILocalVariable(name: "intNumber", arg: 1, scope: !426, file: !3, line: 35, type: !23)
!430 = !DILocation(line: 35, column: 24, scope: !426)
!431 = !DILocation(line: 37, column: 20, scope: !426)
!432 = !DILocation(line: 37, column: 5, scope: !426)
!433 = !DILocation(line: 38, column: 1, scope: !426)
!434 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !435, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437}
!437 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!438 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !434, file: !3, line: 40, type: !437)
!439 = !DILocation(line: 40, column: 28, scope: !434)
!440 = !DILocation(line: 42, column: 21, scope: !434)
!441 = !DILocation(line: 42, column: 5, scope: !434)
!442 = !DILocation(line: 43, column: 1, scope: !434)
!443 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !444, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!444 = !DISubroutineType(types: !445)
!445 = !{null, !446}
!446 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!447 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !443, file: !3, line: 45, type: !446)
!448 = !DILocation(line: 45, column: 28, scope: !443)
!449 = !DILocation(line: 47, column: 20, scope: !443)
!450 = !DILocation(line: 47, column: 5, scope: !443)
!451 = !DILocation(line: 48, column: 1, scope: !443)
!452 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !453, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !110}
!455 = !DILocalVariable(name: "longNumber", arg: 1, scope: !452, file: !3, line: 50, type: !110)
!456 = !DILocation(line: 50, column: 26, scope: !452)
!457 = !DILocation(line: 52, column: 21, scope: !452)
!458 = !DILocation(line: 52, column: 5, scope: !452)
!459 = !DILocation(line: 53, column: 1, scope: !452)
!460 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !461, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !463}
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !464, line: 27, baseType: !465)
!464 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 44, baseType: !110)
!466 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !460, file: !3, line: 55, type: !463)
!467 = !DILocation(line: 55, column: 33, scope: !460)
!468 = !DILocation(line: 57, column: 29, scope: !460)
!469 = !DILocation(line: 57, column: 5, scope: !460)
!470 = !DILocation(line: 58, column: 1, scope: !460)
!471 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !472, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !75}
!474 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !471, file: !3, line: 60, type: !75)
!475 = !DILocation(line: 60, column: 29, scope: !471)
!476 = !DILocation(line: 62, column: 21, scope: !471)
!477 = !DILocation(line: 62, column: 5, scope: !471)
!478 = !DILocation(line: 63, column: 1, scope: !471)
!479 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !480, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !43}
!482 = !DILocalVariable(name: "charHex", arg: 1, scope: !479, file: !3, line: 65, type: !43)
!483 = !DILocation(line: 65, column: 29, scope: !479)
!484 = !DILocation(line: 67, column: 22, scope: !479)
!485 = !DILocation(line: 67, column: 5, scope: !479)
!486 = !DILocation(line: 68, column: 1, scope: !479)
!487 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !488, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !414}
!490 = !DILocalVariable(name: "wideChar", arg: 1, scope: !487, file: !3, line: 70, type: !414)
!491 = !DILocation(line: 70, column: 29, scope: !487)
!492 = !DILocalVariable(name: "s", scope: !487, file: !3, line: 74, type: !493)
!493 = !DICompositeType(tag: DW_TAG_array_type, baseType: !414, size: 64, elements: !494)
!494 = !{!495}
!495 = !DISubrange(count: 2)
!496 = !DILocation(line: 74, column: 13, scope: !487)
!497 = !DILocation(line: 75, column: 16, scope: !487)
!498 = !DILocation(line: 75, column: 9, scope: !487)
!499 = !DILocation(line: 75, column: 14, scope: !487)
!500 = !DILocation(line: 76, column: 9, scope: !487)
!501 = !DILocation(line: 76, column: 14, scope: !487)
!502 = !DILocation(line: 77, column: 21, scope: !487)
!503 = !DILocation(line: 77, column: 5, scope: !487)
!504 = !DILocation(line: 78, column: 1, scope: !487)
!505 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !506, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !7}
!508 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !505, file: !3, line: 80, type: !7)
!509 = !DILocation(line: 80, column: 33, scope: !505)
!510 = !DILocation(line: 82, column: 20, scope: !505)
!511 = !DILocation(line: 82, column: 5, scope: !505)
!512 = !DILocation(line: 83, column: 1, scope: !505)
!513 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !514, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !25}
!516 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !513, file: !3, line: 85, type: !25)
!517 = !DILocation(line: 85, column: 45, scope: !513)
!518 = !DILocation(line: 87, column: 22, scope: !513)
!519 = !DILocation(line: 87, column: 5, scope: !513)
!520 = !DILocation(line: 88, column: 1, scope: !513)
!521 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !522, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !524}
!524 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!525 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !521, file: !3, line: 90, type: !524)
!526 = !DILocation(line: 90, column: 29, scope: !521)
!527 = !DILocation(line: 92, column: 20, scope: !521)
!528 = !DILocation(line: 92, column: 5, scope: !521)
!529 = !DILocation(line: 93, column: 1, scope: !521)
!530 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !531, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!531 = !DISubroutineType(types: !532)
!532 = !{null, !533}
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !535, line: 100, baseType: !536)
!535 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_113/source_code")
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !535, line: 96, size: 64, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !536, file: !535, line: 98, baseType: !23, size: 32)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !536, file: !535, line: 99, baseType: !23, size: 32, offset: 32)
!540 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !530, file: !3, line: 95, type: !533)
!541 = !DILocation(line: 95, column: 40, scope: !530)
!542 = !DILocation(line: 97, column: 26, scope: !530)
!543 = !DILocation(line: 97, column: 47, scope: !530)
!544 = !DILocation(line: 97, column: 55, scope: !530)
!545 = !DILocation(line: 97, column: 76, scope: !530)
!546 = !DILocation(line: 97, column: 5, scope: !530)
!547 = !DILocation(line: 98, column: 1, scope: !530)
!548 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !549, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!549 = !DISubroutineType(types: !550)
!550 = !{null, !551, !75}
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!552 = !DILocalVariable(name: "bytes", arg: 1, scope: !548, file: !3, line: 100, type: !551)
!553 = !DILocation(line: 100, column: 38, scope: !548)
!554 = !DILocalVariable(name: "numBytes", arg: 2, scope: !548, file: !3, line: 100, type: !75)
!555 = !DILocation(line: 100, column: 52, scope: !548)
!556 = !DILocalVariable(name: "i", scope: !548, file: !3, line: 102, type: !75)
!557 = !DILocation(line: 102, column: 12, scope: !548)
!558 = !DILocation(line: 103, column: 12, scope: !559)
!559 = distinct !DILexicalBlock(scope: !548, file: !3, line: 103, column: 5)
!560 = !DILocation(line: 103, column: 10, scope: !559)
!561 = !DILocation(line: 103, column: 17, scope: !562)
!562 = distinct !DILexicalBlock(scope: !559, file: !3, line: 103, column: 5)
!563 = !DILocation(line: 103, column: 21, scope: !562)
!564 = !DILocation(line: 103, column: 19, scope: !562)
!565 = !DILocation(line: 103, column: 5, scope: !559)
!566 = !DILocation(line: 105, column: 24, scope: !567)
!567 = distinct !DILexicalBlock(scope: !562, file: !3, line: 104, column: 5)
!568 = !DILocation(line: 105, column: 30, scope: !567)
!569 = !DILocation(line: 105, column: 9, scope: !567)
!570 = !DILocation(line: 106, column: 5, scope: !567)
!571 = !DILocation(line: 103, column: 31, scope: !562)
!572 = !DILocation(line: 103, column: 5, scope: !562)
!573 = distinct !{!573, !565, !574, !293}
!574 = !DILocation(line: 106, column: 5, scope: !559)
!575 = !DILocation(line: 107, column: 5, scope: !548)
!576 = !DILocation(line: 108, column: 1, scope: !548)
!577 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !578, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!578 = !DISubroutineType(types: !579)
!579 = !{!75, !551, !75, !42}
!580 = !DILocalVariable(name: "bytes", arg: 1, scope: !577, file: !3, line: 113, type: !551)
!581 = !DILocation(line: 113, column: 39, scope: !577)
!582 = !DILocalVariable(name: "numBytes", arg: 2, scope: !577, file: !3, line: 113, type: !75)
!583 = !DILocation(line: 113, column: 53, scope: !577)
!584 = !DILocalVariable(name: "hex", arg: 3, scope: !577, file: !3, line: 113, type: !42)
!585 = !DILocation(line: 113, column: 71, scope: !577)
!586 = !DILocalVariable(name: "numWritten", scope: !577, file: !3, line: 115, type: !75)
!587 = !DILocation(line: 115, column: 12, scope: !577)
!588 = !DILocation(line: 121, column: 5, scope: !577)
!589 = !DILocation(line: 121, column: 12, scope: !577)
!590 = !DILocation(line: 121, column: 25, scope: !577)
!591 = !DILocation(line: 121, column: 23, scope: !577)
!592 = !DILocation(line: 121, column: 34, scope: !577)
!593 = !DILocation(line: 121, column: 37, scope: !577)
!594 = !DILocation(line: 121, column: 67, scope: !577)
!595 = !DILocation(line: 121, column: 70, scope: !577)
!596 = !DILocation(line: 0, scope: !577)
!597 = !DILocalVariable(name: "byte", scope: !598, file: !3, line: 123, type: !23)
!598 = distinct !DILexicalBlock(scope: !577, file: !3, line: 122, column: 5)
!599 = !DILocation(line: 123, column: 13, scope: !598)
