; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_66a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_112/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_66b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_112/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_66_bad", scope: !45, file: !45, line: 37, type: !55, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 39, type: !42)
!58 = !DILocation(line: 39, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataArray", scope: !54, file: !45, line: 40, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 320, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 5)
!63 = !DILocation(line: 40, column: 12, scope: !54)
!64 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 41, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 100)
!68 = !DILocation(line: 41, column: 10, scope: !54)
!69 = !DILocation(line: 42, column: 12, scope: !54)
!70 = !DILocation(line: 42, column: 10, scope: !54)
!71 = !DILocalVariable(name: "dataLen", scope: !72, file: !45, line: 45, type: !73)
!72 = distinct !DILexicalBlock(scope: !54, file: !45, line: 43, column: 5)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DILocation(line: 45, column: 16, scope: !72)
!77 = !DILocation(line: 45, column: 33, scope: !72)
!78 = !DILocation(line: 45, column: 26, scope: !72)
!79 = !DILocalVariable(name: "pFile", scope: !72, file: !45, line: 46, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !23, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !42, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !42, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !42, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !42, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !42, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !42, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !42, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !42, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !42, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !42, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !42, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !23, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !23, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !24, size: 16, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !102, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !22, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !73, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !23, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DILocation(line: 46, column: 16, scope: !72)
!136 = !DILocation(line: 48, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !72, file: !45, line: 48, column: 13)
!138 = !DILocation(line: 48, column: 16, scope: !137)
!139 = !DILocation(line: 48, column: 25, scope: !137)
!140 = !DILocation(line: 48, column: 13, scope: !72)
!141 = !DILocation(line: 50, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !45, line: 49, column: 9)
!143 = !DILocation(line: 50, column: 19, scope: !142)
!144 = !DILocation(line: 51, column: 17, scope: !145)
!145 = distinct !DILexicalBlock(scope: !142, file: !45, line: 51, column: 17)
!146 = !DILocation(line: 51, column: 23, scope: !145)
!147 = !DILocation(line: 51, column: 17, scope: !142)
!148 = !DILocation(line: 54, column: 27, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !45, line: 54, column: 21)
!150 = distinct !DILexicalBlock(scope: !145, file: !45, line: 52, column: 13)
!151 = !DILocation(line: 54, column: 32, scope: !149)
!152 = !DILocation(line: 54, column: 31, scope: !149)
!153 = !DILocation(line: 54, column: 51, scope: !149)
!154 = !DILocation(line: 54, column: 50, scope: !149)
!155 = !DILocation(line: 54, column: 41, scope: !149)
!156 = !DILocation(line: 54, column: 61, scope: !149)
!157 = !DILocation(line: 54, column: 21, scope: !149)
!158 = !DILocation(line: 54, column: 68, scope: !149)
!159 = !DILocation(line: 54, column: 21, scope: !150)
!160 = !DILocation(line: 56, column: 21, scope: !161)
!161 = distinct !DILexicalBlock(scope: !149, file: !45, line: 55, column: 17)
!162 = !DILocation(line: 58, column: 21, scope: !161)
!163 = !DILocation(line: 58, column: 26, scope: !161)
!164 = !DILocation(line: 58, column: 35, scope: !161)
!165 = !DILocation(line: 59, column: 17, scope: !161)
!166 = !DILocation(line: 60, column: 24, scope: !150)
!167 = !DILocation(line: 60, column: 17, scope: !150)
!168 = !DILocation(line: 61, column: 13, scope: !150)
!169 = !DILocation(line: 62, column: 9, scope: !142)
!170 = !DILocation(line: 65, column: 20, scope: !54)
!171 = !DILocation(line: 65, column: 5, scope: !54)
!172 = !DILocation(line: 65, column: 18, scope: !54)
!173 = !DILocation(line: 66, column: 60, scope: !54)
!174 = !DILocation(line: 66, column: 5, scope: !54)
!175 = !DILocation(line: 67, column: 1, scope: !54)
!176 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 75, type: !55, scopeLine: 76, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!177 = !DILocalVariable(name: "data", scope: !176, file: !45, line: 77, type: !42)
!178 = !DILocation(line: 77, column: 12, scope: !176)
!179 = !DILocalVariable(name: "dataArray", scope: !176, file: !45, line: 78, type: !60)
!180 = !DILocation(line: 78, column: 12, scope: !176)
!181 = !DILocalVariable(name: "dataBuffer", scope: !176, file: !45, line: 79, type: !65)
!182 = !DILocation(line: 79, column: 10, scope: !176)
!183 = !DILocation(line: 80, column: 12, scope: !176)
!184 = !DILocation(line: 80, column: 10, scope: !176)
!185 = !DILocation(line: 82, column: 12, scope: !176)
!186 = !DILocation(line: 82, column: 5, scope: !176)
!187 = !DILocation(line: 83, column: 20, scope: !176)
!188 = !DILocation(line: 83, column: 5, scope: !176)
!189 = !DILocation(line: 83, column: 18, scope: !176)
!190 = !DILocation(line: 84, column: 64, scope: !176)
!191 = !DILocation(line: 84, column: 5, scope: !176)
!192 = !DILocation(line: 85, column: 1, scope: !176)
!193 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 89, type: !55, scopeLine: 90, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!194 = !DILocalVariable(name: "data", scope: !193, file: !45, line: 91, type: !42)
!195 = !DILocation(line: 91, column: 12, scope: !193)
!196 = !DILocalVariable(name: "dataArray", scope: !193, file: !45, line: 92, type: !60)
!197 = !DILocation(line: 92, column: 12, scope: !193)
!198 = !DILocalVariable(name: "dataBuffer", scope: !193, file: !45, line: 93, type: !65)
!199 = !DILocation(line: 93, column: 10, scope: !193)
!200 = !DILocation(line: 94, column: 12, scope: !193)
!201 = !DILocation(line: 94, column: 10, scope: !193)
!202 = !DILocalVariable(name: "dataLen", scope: !203, file: !45, line: 97, type: !73)
!203 = distinct !DILexicalBlock(scope: !193, file: !45, line: 95, column: 5)
!204 = !DILocation(line: 97, column: 16, scope: !203)
!205 = !DILocation(line: 97, column: 33, scope: !203)
!206 = !DILocation(line: 97, column: 26, scope: !203)
!207 = !DILocalVariable(name: "pFile", scope: !203, file: !45, line: 98, type: !80)
!208 = !DILocation(line: 98, column: 16, scope: !203)
!209 = !DILocation(line: 100, column: 17, scope: !210)
!210 = distinct !DILexicalBlock(scope: !203, file: !45, line: 100, column: 13)
!211 = !DILocation(line: 100, column: 16, scope: !210)
!212 = !DILocation(line: 100, column: 25, scope: !210)
!213 = !DILocation(line: 100, column: 13, scope: !203)
!214 = !DILocation(line: 102, column: 21, scope: !215)
!215 = distinct !DILexicalBlock(scope: !210, file: !45, line: 101, column: 9)
!216 = !DILocation(line: 102, column: 19, scope: !215)
!217 = !DILocation(line: 103, column: 17, scope: !218)
!218 = distinct !DILexicalBlock(scope: !215, file: !45, line: 103, column: 17)
!219 = !DILocation(line: 103, column: 23, scope: !218)
!220 = !DILocation(line: 103, column: 17, scope: !215)
!221 = !DILocation(line: 106, column: 27, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !45, line: 106, column: 21)
!223 = distinct !DILexicalBlock(scope: !218, file: !45, line: 104, column: 13)
!224 = !DILocation(line: 106, column: 32, scope: !222)
!225 = !DILocation(line: 106, column: 31, scope: !222)
!226 = !DILocation(line: 106, column: 51, scope: !222)
!227 = !DILocation(line: 106, column: 50, scope: !222)
!228 = !DILocation(line: 106, column: 41, scope: !222)
!229 = !DILocation(line: 106, column: 61, scope: !222)
!230 = !DILocation(line: 106, column: 21, scope: !222)
!231 = !DILocation(line: 106, column: 68, scope: !222)
!232 = !DILocation(line: 106, column: 21, scope: !223)
!233 = !DILocation(line: 108, column: 21, scope: !234)
!234 = distinct !DILexicalBlock(scope: !222, file: !45, line: 107, column: 17)
!235 = !DILocation(line: 110, column: 21, scope: !234)
!236 = !DILocation(line: 110, column: 26, scope: !234)
!237 = !DILocation(line: 110, column: 35, scope: !234)
!238 = !DILocation(line: 111, column: 17, scope: !234)
!239 = !DILocation(line: 112, column: 24, scope: !223)
!240 = !DILocation(line: 112, column: 17, scope: !223)
!241 = !DILocation(line: 113, column: 13, scope: !223)
!242 = !DILocation(line: 114, column: 9, scope: !215)
!243 = !DILocation(line: 116, column: 20, scope: !193)
!244 = !DILocation(line: 116, column: 5, scope: !193)
!245 = !DILocation(line: 116, column: 18, scope: !193)
!246 = !DILocation(line: 117, column: 64, scope: !193)
!247 = !DILocation(line: 117, column: 5, scope: !193)
!248 = !DILocation(line: 118, column: 1, scope: !193)
!249 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_66_good", scope: !45, file: !45, line: 120, type: !55, scopeLine: 121, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!250 = !DILocation(line: 122, column: 5, scope: !249)
!251 = !DILocation(line: 123, column: 5, scope: !249)
!252 = !DILocation(line: 124, column: 1, scope: !249)
!253 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_66b_badSink", scope: !49, file: !49, line: 34, type: !254, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !41}
!256 = !DILocalVariable(name: "dataArray", arg: 1, scope: !253, file: !49, line: 34, type: !41)
!257 = !DILocation(line: 34, column: 68, scope: !253)
!258 = !DILocalVariable(name: "data", scope: !253, file: !49, line: 37, type: !42)
!259 = !DILocation(line: 37, column: 12, scope: !253)
!260 = !DILocation(line: 37, column: 19, scope: !253)
!261 = !DILocalVariable(name: "i", scope: !262, file: !49, line: 39, type: !23)
!262 = distinct !DILexicalBlock(scope: !253, file: !49, line: 38, column: 5)
!263 = !DILocation(line: 39, column: 13, scope: !262)
!264 = !DILocalVariable(name: "n", scope: !262, file: !49, line: 39, type: !23)
!265 = !DILocation(line: 39, column: 16, scope: !262)
!266 = !DILocalVariable(name: "intVariable", scope: !262, file: !49, line: 39, type: !23)
!267 = !DILocation(line: 39, column: 19, scope: !262)
!268 = !DILocation(line: 40, column: 20, scope: !269)
!269 = distinct !DILexicalBlock(scope: !262, file: !49, line: 40, column: 13)
!270 = !DILocation(line: 40, column: 13, scope: !269)
!271 = !DILocation(line: 40, column: 36, scope: !269)
!272 = !DILocation(line: 40, column: 13, scope: !262)
!273 = !DILocation(line: 43, column: 25, scope: !274)
!274 = distinct !DILexicalBlock(scope: !269, file: !49, line: 41, column: 9)
!275 = !DILocation(line: 44, column: 20, scope: !276)
!276 = distinct !DILexicalBlock(scope: !274, file: !49, line: 44, column: 13)
!277 = !DILocation(line: 44, column: 18, scope: !276)
!278 = !DILocation(line: 44, column: 25, scope: !279)
!279 = distinct !DILexicalBlock(scope: !276, file: !49, line: 44, column: 13)
!280 = !DILocation(line: 44, column: 29, scope: !279)
!281 = !DILocation(line: 44, column: 27, scope: !279)
!282 = !DILocation(line: 44, column: 13, scope: !276)
!283 = !DILocation(line: 47, column: 28, scope: !284)
!284 = distinct !DILexicalBlock(scope: !279, file: !49, line: 45, column: 13)
!285 = !DILocation(line: 48, column: 13, scope: !284)
!286 = !DILocation(line: 44, column: 33, scope: !279)
!287 = !DILocation(line: 44, column: 13, scope: !279)
!288 = distinct !{!288, !282, !289, !290}
!289 = !DILocation(line: 48, column: 13, scope: !276)
!290 = !{!"llvm.loop.mustprogress"}
!291 = !DILocation(line: 49, column: 26, scope: !274)
!292 = !DILocation(line: 49, column: 13, scope: !274)
!293 = !DILocation(line: 50, column: 9, scope: !274)
!294 = !DILocation(line: 52, column: 1, scope: !253)
!295 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_66b_goodG2BSink", scope: !49, file: !49, line: 59, type: !254, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!296 = !DILocalVariable(name: "dataArray", arg: 1, scope: !295, file: !49, line: 59, type: !41)
!297 = !DILocation(line: 59, column: 72, scope: !295)
!298 = !DILocalVariable(name: "data", scope: !295, file: !49, line: 61, type: !42)
!299 = !DILocation(line: 61, column: 12, scope: !295)
!300 = !DILocation(line: 61, column: 19, scope: !295)
!301 = !DILocalVariable(name: "i", scope: !302, file: !49, line: 63, type: !23)
!302 = distinct !DILexicalBlock(scope: !295, file: !49, line: 62, column: 5)
!303 = !DILocation(line: 63, column: 13, scope: !302)
!304 = !DILocalVariable(name: "n", scope: !302, file: !49, line: 63, type: !23)
!305 = !DILocation(line: 63, column: 16, scope: !302)
!306 = !DILocalVariable(name: "intVariable", scope: !302, file: !49, line: 63, type: !23)
!307 = !DILocation(line: 63, column: 19, scope: !302)
!308 = !DILocation(line: 64, column: 20, scope: !309)
!309 = distinct !DILexicalBlock(scope: !302, file: !49, line: 64, column: 13)
!310 = !DILocation(line: 64, column: 13, scope: !309)
!311 = !DILocation(line: 64, column: 36, scope: !309)
!312 = !DILocation(line: 64, column: 13, scope: !302)
!313 = !DILocation(line: 67, column: 25, scope: !314)
!314 = distinct !DILexicalBlock(scope: !309, file: !49, line: 65, column: 9)
!315 = !DILocation(line: 68, column: 20, scope: !316)
!316 = distinct !DILexicalBlock(scope: !314, file: !49, line: 68, column: 13)
!317 = !DILocation(line: 68, column: 18, scope: !316)
!318 = !DILocation(line: 68, column: 25, scope: !319)
!319 = distinct !DILexicalBlock(scope: !316, file: !49, line: 68, column: 13)
!320 = !DILocation(line: 68, column: 29, scope: !319)
!321 = !DILocation(line: 68, column: 27, scope: !319)
!322 = !DILocation(line: 68, column: 13, scope: !316)
!323 = !DILocation(line: 71, column: 28, scope: !324)
!324 = distinct !DILexicalBlock(scope: !319, file: !49, line: 69, column: 13)
!325 = !DILocation(line: 72, column: 13, scope: !324)
!326 = !DILocation(line: 68, column: 33, scope: !319)
!327 = !DILocation(line: 68, column: 13, scope: !319)
!328 = distinct !{!328, !322, !329, !290}
!329 = !DILocation(line: 72, column: 13, scope: !316)
!330 = !DILocation(line: 73, column: 26, scope: !314)
!331 = !DILocation(line: 73, column: 13, scope: !314)
!332 = !DILocation(line: 74, column: 9, scope: !314)
!333 = !DILocation(line: 76, column: 1, scope: !295)
!334 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_66b_goodB2GSink", scope: !49, file: !49, line: 79, type: !254, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!335 = !DILocalVariable(name: "dataArray", arg: 1, scope: !334, file: !49, line: 79, type: !41)
!336 = !DILocation(line: 79, column: 72, scope: !334)
!337 = !DILocalVariable(name: "data", scope: !334, file: !49, line: 81, type: !42)
!338 = !DILocation(line: 81, column: 12, scope: !334)
!339 = !DILocation(line: 81, column: 19, scope: !334)
!340 = !DILocalVariable(name: "i", scope: !341, file: !49, line: 83, type: !23)
!341 = distinct !DILexicalBlock(scope: !334, file: !49, line: 82, column: 5)
!342 = !DILocation(line: 83, column: 13, scope: !341)
!343 = !DILocalVariable(name: "n", scope: !341, file: !49, line: 83, type: !23)
!344 = !DILocation(line: 83, column: 16, scope: !341)
!345 = !DILocalVariable(name: "intVariable", scope: !341, file: !49, line: 83, type: !23)
!346 = !DILocation(line: 83, column: 19, scope: !341)
!347 = !DILocation(line: 84, column: 20, scope: !348)
!348 = distinct !DILexicalBlock(scope: !341, file: !49, line: 84, column: 13)
!349 = !DILocation(line: 84, column: 13, scope: !348)
!350 = !DILocation(line: 84, column: 36, scope: !348)
!351 = !DILocation(line: 84, column: 13, scope: !341)
!352 = !DILocation(line: 87, column: 17, scope: !353)
!353 = distinct !DILexicalBlock(scope: !354, file: !49, line: 87, column: 17)
!354 = distinct !DILexicalBlock(scope: !348, file: !49, line: 85, column: 9)
!355 = !DILocation(line: 87, column: 19, scope: !353)
!356 = !DILocation(line: 87, column: 17, scope: !354)
!357 = !DILocation(line: 89, column: 29, scope: !358)
!358 = distinct !DILexicalBlock(scope: !353, file: !49, line: 88, column: 13)
!359 = !DILocation(line: 90, column: 24, scope: !360)
!360 = distinct !DILexicalBlock(scope: !358, file: !49, line: 90, column: 17)
!361 = !DILocation(line: 90, column: 22, scope: !360)
!362 = !DILocation(line: 90, column: 29, scope: !363)
!363 = distinct !DILexicalBlock(scope: !360, file: !49, line: 90, column: 17)
!364 = !DILocation(line: 90, column: 33, scope: !363)
!365 = !DILocation(line: 90, column: 31, scope: !363)
!366 = !DILocation(line: 90, column: 17, scope: !360)
!367 = !DILocation(line: 93, column: 32, scope: !368)
!368 = distinct !DILexicalBlock(scope: !363, file: !49, line: 91, column: 17)
!369 = !DILocation(line: 94, column: 17, scope: !368)
!370 = !DILocation(line: 90, column: 37, scope: !363)
!371 = !DILocation(line: 90, column: 17, scope: !363)
!372 = distinct !{!372, !366, !373, !290}
!373 = !DILocation(line: 94, column: 17, scope: !360)
!374 = !DILocation(line: 95, column: 30, scope: !358)
!375 = !DILocation(line: 95, column: 17, scope: !358)
!376 = !DILocation(line: 96, column: 13, scope: !358)
!377 = !DILocation(line: 97, column: 9, scope: !354)
!378 = !DILocation(line: 99, column: 1, scope: !334)
!379 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !380, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !42}
!382 = !DILocalVariable(name: "line", arg: 1, scope: !379, file: !3, line: 11, type: !42)
!383 = !DILocation(line: 11, column: 25, scope: !379)
!384 = !DILocation(line: 13, column: 1, scope: !379)
!385 = !DILocation(line: 14, column: 8, scope: !386)
!386 = distinct !DILexicalBlock(scope: !379, file: !3, line: 14, column: 8)
!387 = !DILocation(line: 14, column: 13, scope: !386)
!388 = !DILocation(line: 14, column: 8, scope: !379)
!389 = !DILocation(line: 16, column: 24, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !3, line: 15, column: 5)
!391 = !DILocation(line: 16, column: 9, scope: !390)
!392 = !DILocation(line: 17, column: 5, scope: !390)
!393 = !DILocation(line: 18, column: 5, scope: !379)
!394 = !DILocation(line: 19, column: 1, scope: !379)
!395 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !380, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!396 = !DILocalVariable(name: "line", arg: 1, scope: !395, file: !3, line: 20, type: !42)
!397 = !DILocation(line: 20, column: 29, scope: !395)
!398 = !DILocation(line: 22, column: 8, scope: !399)
!399 = distinct !DILexicalBlock(scope: !395, file: !3, line: 22, column: 8)
!400 = !DILocation(line: 22, column: 13, scope: !399)
!401 = !DILocation(line: 22, column: 8, scope: !395)
!402 = !DILocation(line: 24, column: 24, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !3, line: 23, column: 5)
!404 = !DILocation(line: 24, column: 9, scope: !403)
!405 = !DILocation(line: 25, column: 5, scope: !403)
!406 = !DILocation(line: 26, column: 1, scope: !395)
!407 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !408, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !410}
!410 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !411, size: 64)
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !74, line: 74, baseType: !23)
!412 = !DILocalVariable(name: "line", arg: 1, scope: !407, file: !3, line: 27, type: !410)
!413 = !DILocation(line: 27, column: 29, scope: !407)
!414 = !DILocation(line: 29, column: 8, scope: !415)
!415 = distinct !DILexicalBlock(scope: !407, file: !3, line: 29, column: 8)
!416 = !DILocation(line: 29, column: 13, scope: !415)
!417 = !DILocation(line: 29, column: 8, scope: !407)
!418 = !DILocation(line: 31, column: 27, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !3, line: 30, column: 5)
!420 = !DILocation(line: 31, column: 9, scope: !419)
!421 = !DILocation(line: 32, column: 5, scope: !419)
!422 = !DILocation(line: 33, column: 1, scope: !407)
!423 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !424, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !23}
!426 = !DILocalVariable(name: "intNumber", arg: 1, scope: !423, file: !3, line: 35, type: !23)
!427 = !DILocation(line: 35, column: 24, scope: !423)
!428 = !DILocation(line: 37, column: 20, scope: !423)
!429 = !DILocation(line: 37, column: 5, scope: !423)
!430 = !DILocation(line: 38, column: 1, scope: !423)
!431 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !432, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !434}
!434 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!435 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !431, file: !3, line: 40, type: !434)
!436 = !DILocation(line: 40, column: 28, scope: !431)
!437 = !DILocation(line: 42, column: 21, scope: !431)
!438 = !DILocation(line: 42, column: 5, scope: !431)
!439 = !DILocation(line: 43, column: 1, scope: !431)
!440 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !441, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !443}
!443 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!444 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !440, file: !3, line: 45, type: !443)
!445 = !DILocation(line: 45, column: 28, scope: !440)
!446 = !DILocation(line: 47, column: 20, scope: !440)
!447 = !DILocation(line: 47, column: 5, scope: !440)
!448 = !DILocation(line: 48, column: 1, scope: !440)
!449 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !450, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !108}
!452 = !DILocalVariable(name: "longNumber", arg: 1, scope: !449, file: !3, line: 50, type: !108)
!453 = !DILocation(line: 50, column: 26, scope: !449)
!454 = !DILocation(line: 52, column: 21, scope: !449)
!455 = !DILocation(line: 52, column: 5, scope: !449)
!456 = !DILocation(line: 53, column: 1, scope: !449)
!457 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !458, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !460}
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !461, line: 27, baseType: !462)
!461 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!462 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 44, baseType: !108)
!463 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !457, file: !3, line: 55, type: !460)
!464 = !DILocation(line: 55, column: 33, scope: !457)
!465 = !DILocation(line: 57, column: 29, scope: !457)
!466 = !DILocation(line: 57, column: 5, scope: !457)
!467 = !DILocation(line: 58, column: 1, scope: !457)
!468 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !469, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !73}
!471 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !468, file: !3, line: 60, type: !73)
!472 = !DILocation(line: 60, column: 29, scope: !468)
!473 = !DILocation(line: 62, column: 21, scope: !468)
!474 = !DILocation(line: 62, column: 5, scope: !468)
!475 = !DILocation(line: 63, column: 1, scope: !468)
!476 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !477, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!477 = !DISubroutineType(types: !478)
!478 = !{null, !43}
!479 = !DILocalVariable(name: "charHex", arg: 1, scope: !476, file: !3, line: 65, type: !43)
!480 = !DILocation(line: 65, column: 29, scope: !476)
!481 = !DILocation(line: 67, column: 22, scope: !476)
!482 = !DILocation(line: 67, column: 5, scope: !476)
!483 = !DILocation(line: 68, column: 1, scope: !476)
!484 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !485, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !411}
!487 = !DILocalVariable(name: "wideChar", arg: 1, scope: !484, file: !3, line: 70, type: !411)
!488 = !DILocation(line: 70, column: 29, scope: !484)
!489 = !DILocalVariable(name: "s", scope: !484, file: !3, line: 74, type: !490)
!490 = !DICompositeType(tag: DW_TAG_array_type, baseType: !411, size: 64, elements: !491)
!491 = !{!492}
!492 = !DISubrange(count: 2)
!493 = !DILocation(line: 74, column: 13, scope: !484)
!494 = !DILocation(line: 75, column: 16, scope: !484)
!495 = !DILocation(line: 75, column: 9, scope: !484)
!496 = !DILocation(line: 75, column: 14, scope: !484)
!497 = !DILocation(line: 76, column: 9, scope: !484)
!498 = !DILocation(line: 76, column: 14, scope: !484)
!499 = !DILocation(line: 77, column: 21, scope: !484)
!500 = !DILocation(line: 77, column: 5, scope: !484)
!501 = !DILocation(line: 78, column: 1, scope: !484)
!502 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !503, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !7}
!505 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !502, file: !3, line: 80, type: !7)
!506 = !DILocation(line: 80, column: 33, scope: !502)
!507 = !DILocation(line: 82, column: 20, scope: !502)
!508 = !DILocation(line: 82, column: 5, scope: !502)
!509 = !DILocation(line: 83, column: 1, scope: !502)
!510 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !511, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!511 = !DISubroutineType(types: !512)
!512 = !{null, !25}
!513 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !510, file: !3, line: 85, type: !25)
!514 = !DILocation(line: 85, column: 45, scope: !510)
!515 = !DILocation(line: 87, column: 22, scope: !510)
!516 = !DILocation(line: 87, column: 5, scope: !510)
!517 = !DILocation(line: 88, column: 1, scope: !510)
!518 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !519, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521}
!521 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!522 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !518, file: !3, line: 90, type: !521)
!523 = !DILocation(line: 90, column: 29, scope: !518)
!524 = !DILocation(line: 92, column: 20, scope: !518)
!525 = !DILocation(line: 92, column: 5, scope: !518)
!526 = !DILocation(line: 93, column: 1, scope: !518)
!527 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !528, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64)
!531 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !532, line: 100, baseType: !533)
!532 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_112/source_code")
!533 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !532, line: 96, size: 64, elements: !534)
!534 = !{!535, !536}
!535 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !533, file: !532, line: 98, baseType: !23, size: 32)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !533, file: !532, line: 99, baseType: !23, size: 32, offset: 32)
!537 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !527, file: !3, line: 95, type: !530)
!538 = !DILocation(line: 95, column: 40, scope: !527)
!539 = !DILocation(line: 97, column: 26, scope: !527)
!540 = !DILocation(line: 97, column: 47, scope: !527)
!541 = !DILocation(line: 97, column: 55, scope: !527)
!542 = !DILocation(line: 97, column: 76, scope: !527)
!543 = !DILocation(line: 97, column: 5, scope: !527)
!544 = !DILocation(line: 98, column: 1, scope: !527)
!545 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !546, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!546 = !DISubroutineType(types: !547)
!547 = !{null, !548, !73}
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!549 = !DILocalVariable(name: "bytes", arg: 1, scope: !545, file: !3, line: 100, type: !548)
!550 = !DILocation(line: 100, column: 38, scope: !545)
!551 = !DILocalVariable(name: "numBytes", arg: 2, scope: !545, file: !3, line: 100, type: !73)
!552 = !DILocation(line: 100, column: 52, scope: !545)
!553 = !DILocalVariable(name: "i", scope: !545, file: !3, line: 102, type: !73)
!554 = !DILocation(line: 102, column: 12, scope: !545)
!555 = !DILocation(line: 103, column: 12, scope: !556)
!556 = distinct !DILexicalBlock(scope: !545, file: !3, line: 103, column: 5)
!557 = !DILocation(line: 103, column: 10, scope: !556)
!558 = !DILocation(line: 103, column: 17, scope: !559)
!559 = distinct !DILexicalBlock(scope: !556, file: !3, line: 103, column: 5)
!560 = !DILocation(line: 103, column: 21, scope: !559)
!561 = !DILocation(line: 103, column: 19, scope: !559)
!562 = !DILocation(line: 103, column: 5, scope: !556)
!563 = !DILocation(line: 105, column: 24, scope: !564)
!564 = distinct !DILexicalBlock(scope: !559, file: !3, line: 104, column: 5)
!565 = !DILocation(line: 105, column: 30, scope: !564)
!566 = !DILocation(line: 105, column: 9, scope: !564)
!567 = !DILocation(line: 106, column: 5, scope: !564)
!568 = !DILocation(line: 103, column: 31, scope: !559)
!569 = !DILocation(line: 103, column: 5, scope: !559)
!570 = distinct !{!570, !562, !571, !290}
!571 = !DILocation(line: 106, column: 5, scope: !556)
!572 = !DILocation(line: 107, column: 5, scope: !545)
!573 = !DILocation(line: 108, column: 1, scope: !545)
!574 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !575, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!575 = !DISubroutineType(types: !576)
!576 = !{!73, !548, !73, !42}
!577 = !DILocalVariable(name: "bytes", arg: 1, scope: !574, file: !3, line: 113, type: !548)
!578 = !DILocation(line: 113, column: 39, scope: !574)
!579 = !DILocalVariable(name: "numBytes", arg: 2, scope: !574, file: !3, line: 113, type: !73)
!580 = !DILocation(line: 113, column: 53, scope: !574)
!581 = !DILocalVariable(name: "hex", arg: 3, scope: !574, file: !3, line: 113, type: !42)
!582 = !DILocation(line: 113, column: 71, scope: !574)
!583 = !DILocalVariable(name: "numWritten", scope: !574, file: !3, line: 115, type: !73)
!584 = !DILocation(line: 115, column: 12, scope: !574)
!585 = !DILocation(line: 121, column: 5, scope: !574)
!586 = !DILocation(line: 121, column: 12, scope: !574)
!587 = !DILocation(line: 121, column: 25, scope: !574)
!588 = !DILocation(line: 121, column: 23, scope: !574)
!589 = !DILocation(line: 121, column: 34, scope: !574)
!590 = !DILocation(line: 121, column: 37, scope: !574)
!591 = !DILocation(line: 121, column: 67, scope: !574)
!592 = !DILocation(line: 121, column: 70, scope: !574)
!593 = !DILocation(line: 0, scope: !574)
!594 = !DILocalVariable(name: "byte", scope: !595, file: !3, line: 123, type: !23)
!595 = distinct !DILexicalBlock(scope: !574, file: !3, line: 122, column: 5)
!596 = !DILocation(line: 123, column: 13, scope: !595)
