; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_18.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_091/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_18_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocation(line: 40, column: 5, scope: !52)
!65 = !DILabel(scope: !52, name: "source", file: !45, line: 41)
!66 = !DILocation(line: 41, column: 1, scope: !52)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 44, type: !69)
!68 = distinct !DILexicalBlock(scope: !52, file: !45, line: 42, column: 5)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DILocation(line: 44, column: 16, scope: !68)
!73 = !DILocation(line: 44, column: 33, scope: !68)
!74 = !DILocation(line: 44, column: 26, scope: !68)
!75 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 45, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !99, !100, !101, !105, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !23, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !42, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !42, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !42, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !42, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !42, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !42, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !42, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !42, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !42, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !42, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !42, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !23, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !23, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 152, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!104 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !24, size: 16, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 153, baseType: !104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !98, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !22, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !69, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !23, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocation(line: 45, column: 16, scope: !68)
!132 = !DILocation(line: 47, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !68, file: !45, line: 47, column: 13)
!134 = !DILocation(line: 47, column: 16, scope: !133)
!135 = !DILocation(line: 47, column: 25, scope: !133)
!136 = !DILocation(line: 47, column: 13, scope: !68)
!137 = !DILocation(line: 49, column: 21, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !45, line: 48, column: 9)
!139 = !DILocation(line: 49, column: 19, scope: !138)
!140 = !DILocation(line: 50, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !138, file: !45, line: 50, column: 17)
!142 = !DILocation(line: 50, column: 23, scope: !141)
!143 = !DILocation(line: 50, column: 17, scope: !138)
!144 = !DILocation(line: 53, column: 27, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !45, line: 53, column: 21)
!146 = distinct !DILexicalBlock(scope: !141, file: !45, line: 51, column: 13)
!147 = !DILocation(line: 53, column: 32, scope: !145)
!148 = !DILocation(line: 53, column: 31, scope: !145)
!149 = !DILocation(line: 53, column: 51, scope: !145)
!150 = !DILocation(line: 53, column: 50, scope: !145)
!151 = !DILocation(line: 53, column: 41, scope: !145)
!152 = !DILocation(line: 53, column: 61, scope: !145)
!153 = !DILocation(line: 53, column: 21, scope: !145)
!154 = !DILocation(line: 53, column: 68, scope: !145)
!155 = !DILocation(line: 53, column: 21, scope: !146)
!156 = !DILocation(line: 55, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !45, line: 54, column: 17)
!158 = !DILocation(line: 57, column: 21, scope: !157)
!159 = !DILocation(line: 57, column: 26, scope: !157)
!160 = !DILocation(line: 57, column: 35, scope: !157)
!161 = !DILocation(line: 58, column: 17, scope: !157)
!162 = !DILocation(line: 59, column: 24, scope: !146)
!163 = !DILocation(line: 59, column: 17, scope: !146)
!164 = !DILocation(line: 60, column: 13, scope: !146)
!165 = !DILocation(line: 61, column: 9, scope: !138)
!166 = !DILocation(line: 63, column: 5, scope: !52)
!167 = !DILabel(scope: !52, name: "sink", file: !45, line: 64)
!168 = !DILocation(line: 64, column: 1, scope: !52)
!169 = !DILocalVariable(name: "i", scope: !170, file: !45, line: 66, type: !23)
!170 = distinct !DILexicalBlock(scope: !52, file: !45, line: 65, column: 5)
!171 = !DILocation(line: 66, column: 13, scope: !170)
!172 = !DILocalVariable(name: "n", scope: !170, file: !45, line: 66, type: !23)
!173 = !DILocation(line: 66, column: 16, scope: !170)
!174 = !DILocalVariable(name: "intVariable", scope: !170, file: !45, line: 66, type: !23)
!175 = !DILocation(line: 66, column: 19, scope: !170)
!176 = !DILocation(line: 67, column: 20, scope: !177)
!177 = distinct !DILexicalBlock(scope: !170, file: !45, line: 67, column: 13)
!178 = !DILocation(line: 67, column: 13, scope: !177)
!179 = !DILocation(line: 67, column: 36, scope: !177)
!180 = !DILocation(line: 67, column: 13, scope: !170)
!181 = !DILocation(line: 70, column: 25, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !45, line: 68, column: 9)
!183 = !DILocation(line: 71, column: 20, scope: !184)
!184 = distinct !DILexicalBlock(scope: !182, file: !45, line: 71, column: 13)
!185 = !DILocation(line: 71, column: 18, scope: !184)
!186 = !DILocation(line: 71, column: 25, scope: !187)
!187 = distinct !DILexicalBlock(scope: !184, file: !45, line: 71, column: 13)
!188 = !DILocation(line: 71, column: 29, scope: !187)
!189 = !DILocation(line: 71, column: 27, scope: !187)
!190 = !DILocation(line: 71, column: 13, scope: !184)
!191 = !DILocation(line: 74, column: 28, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !45, line: 72, column: 13)
!193 = !DILocation(line: 75, column: 13, scope: !192)
!194 = !DILocation(line: 71, column: 33, scope: !187)
!195 = !DILocation(line: 71, column: 13, scope: !187)
!196 = distinct !{!196, !190, !197, !198}
!197 = !DILocation(line: 75, column: 13, scope: !184)
!198 = !{!"llvm.loop.mustprogress"}
!199 = !DILocation(line: 76, column: 26, scope: !182)
!200 = !DILocation(line: 76, column: 13, scope: !182)
!201 = !DILocation(line: 77, column: 9, scope: !182)
!202 = !DILocation(line: 79, column: 1, scope: !52)
!203 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 86, type: !53, scopeLine: 87, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!204 = !DILocalVariable(name: "data", scope: !203, file: !45, line: 88, type: !42)
!205 = !DILocation(line: 88, column: 12, scope: !203)
!206 = !DILocalVariable(name: "dataBuffer", scope: !203, file: !45, line: 89, type: !58)
!207 = !DILocation(line: 89, column: 10, scope: !203)
!208 = !DILocation(line: 90, column: 12, scope: !203)
!209 = !DILocation(line: 90, column: 10, scope: !203)
!210 = !DILocation(line: 91, column: 5, scope: !203)
!211 = !DILabel(scope: !203, name: "source", file: !45, line: 92)
!212 = !DILocation(line: 92, column: 1, scope: !203)
!213 = !DILocalVariable(name: "dataLen", scope: !214, file: !45, line: 95, type: !69)
!214 = distinct !DILexicalBlock(scope: !203, file: !45, line: 93, column: 5)
!215 = !DILocation(line: 95, column: 16, scope: !214)
!216 = !DILocation(line: 95, column: 33, scope: !214)
!217 = !DILocation(line: 95, column: 26, scope: !214)
!218 = !DILocalVariable(name: "pFile", scope: !214, file: !45, line: 96, type: !76)
!219 = !DILocation(line: 96, column: 16, scope: !214)
!220 = !DILocation(line: 98, column: 17, scope: !221)
!221 = distinct !DILexicalBlock(scope: !214, file: !45, line: 98, column: 13)
!222 = !DILocation(line: 98, column: 16, scope: !221)
!223 = !DILocation(line: 98, column: 25, scope: !221)
!224 = !DILocation(line: 98, column: 13, scope: !214)
!225 = !DILocation(line: 100, column: 21, scope: !226)
!226 = distinct !DILexicalBlock(scope: !221, file: !45, line: 99, column: 9)
!227 = !DILocation(line: 100, column: 19, scope: !226)
!228 = !DILocation(line: 101, column: 17, scope: !229)
!229 = distinct !DILexicalBlock(scope: !226, file: !45, line: 101, column: 17)
!230 = !DILocation(line: 101, column: 23, scope: !229)
!231 = !DILocation(line: 101, column: 17, scope: !226)
!232 = !DILocation(line: 104, column: 27, scope: !233)
!233 = distinct !DILexicalBlock(scope: !234, file: !45, line: 104, column: 21)
!234 = distinct !DILexicalBlock(scope: !229, file: !45, line: 102, column: 13)
!235 = !DILocation(line: 104, column: 32, scope: !233)
!236 = !DILocation(line: 104, column: 31, scope: !233)
!237 = !DILocation(line: 104, column: 51, scope: !233)
!238 = !DILocation(line: 104, column: 50, scope: !233)
!239 = !DILocation(line: 104, column: 41, scope: !233)
!240 = !DILocation(line: 104, column: 61, scope: !233)
!241 = !DILocation(line: 104, column: 21, scope: !233)
!242 = !DILocation(line: 104, column: 68, scope: !233)
!243 = !DILocation(line: 104, column: 21, scope: !234)
!244 = !DILocation(line: 106, column: 21, scope: !245)
!245 = distinct !DILexicalBlock(scope: !233, file: !45, line: 105, column: 17)
!246 = !DILocation(line: 108, column: 21, scope: !245)
!247 = !DILocation(line: 108, column: 26, scope: !245)
!248 = !DILocation(line: 108, column: 35, scope: !245)
!249 = !DILocation(line: 109, column: 17, scope: !245)
!250 = !DILocation(line: 110, column: 24, scope: !234)
!251 = !DILocation(line: 110, column: 17, scope: !234)
!252 = !DILocation(line: 111, column: 13, scope: !234)
!253 = !DILocation(line: 112, column: 9, scope: !226)
!254 = !DILocation(line: 114, column: 5, scope: !203)
!255 = !DILabel(scope: !203, name: "sink", file: !45, line: 115)
!256 = !DILocation(line: 115, column: 1, scope: !203)
!257 = !DILocalVariable(name: "i", scope: !258, file: !45, line: 117, type: !23)
!258 = distinct !DILexicalBlock(scope: !203, file: !45, line: 116, column: 5)
!259 = !DILocation(line: 117, column: 13, scope: !258)
!260 = !DILocalVariable(name: "n", scope: !258, file: !45, line: 117, type: !23)
!261 = !DILocation(line: 117, column: 16, scope: !258)
!262 = !DILocalVariable(name: "intVariable", scope: !258, file: !45, line: 117, type: !23)
!263 = !DILocation(line: 117, column: 19, scope: !258)
!264 = !DILocation(line: 118, column: 20, scope: !265)
!265 = distinct !DILexicalBlock(scope: !258, file: !45, line: 118, column: 13)
!266 = !DILocation(line: 118, column: 13, scope: !265)
!267 = !DILocation(line: 118, column: 36, scope: !265)
!268 = !DILocation(line: 118, column: 13, scope: !258)
!269 = !DILocation(line: 121, column: 17, scope: !270)
!270 = distinct !DILexicalBlock(scope: !271, file: !45, line: 121, column: 17)
!271 = distinct !DILexicalBlock(scope: !265, file: !45, line: 119, column: 9)
!272 = !DILocation(line: 121, column: 19, scope: !270)
!273 = !DILocation(line: 121, column: 17, scope: !271)
!274 = !DILocation(line: 123, column: 29, scope: !275)
!275 = distinct !DILexicalBlock(scope: !270, file: !45, line: 122, column: 13)
!276 = !DILocation(line: 124, column: 24, scope: !277)
!277 = distinct !DILexicalBlock(scope: !275, file: !45, line: 124, column: 17)
!278 = !DILocation(line: 124, column: 22, scope: !277)
!279 = !DILocation(line: 124, column: 29, scope: !280)
!280 = distinct !DILexicalBlock(scope: !277, file: !45, line: 124, column: 17)
!281 = !DILocation(line: 124, column: 33, scope: !280)
!282 = !DILocation(line: 124, column: 31, scope: !280)
!283 = !DILocation(line: 124, column: 17, scope: !277)
!284 = !DILocation(line: 127, column: 32, scope: !285)
!285 = distinct !DILexicalBlock(scope: !280, file: !45, line: 125, column: 17)
!286 = !DILocation(line: 128, column: 17, scope: !285)
!287 = !DILocation(line: 124, column: 37, scope: !280)
!288 = !DILocation(line: 124, column: 17, scope: !280)
!289 = distinct !{!289, !283, !290, !198}
!290 = !DILocation(line: 128, column: 17, scope: !277)
!291 = !DILocation(line: 129, column: 30, scope: !275)
!292 = !DILocation(line: 129, column: 17, scope: !275)
!293 = !DILocation(line: 130, column: 13, scope: !275)
!294 = !DILocation(line: 131, column: 9, scope: !271)
!295 = !DILocation(line: 133, column: 1, scope: !203)
!296 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 136, type: !53, scopeLine: 137, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!297 = !DILocalVariable(name: "data", scope: !296, file: !45, line: 138, type: !42)
!298 = !DILocation(line: 138, column: 12, scope: !296)
!299 = !DILocalVariable(name: "dataBuffer", scope: !296, file: !45, line: 139, type: !58)
!300 = !DILocation(line: 139, column: 10, scope: !296)
!301 = !DILocation(line: 140, column: 12, scope: !296)
!302 = !DILocation(line: 140, column: 10, scope: !296)
!303 = !DILocation(line: 141, column: 5, scope: !296)
!304 = !DILabel(scope: !296, name: "source", file: !45, line: 142)
!305 = !DILocation(line: 142, column: 1, scope: !296)
!306 = !DILocation(line: 144, column: 12, scope: !296)
!307 = !DILocation(line: 144, column: 5, scope: !296)
!308 = !DILocation(line: 145, column: 5, scope: !296)
!309 = !DILabel(scope: !296, name: "sink", file: !45, line: 146)
!310 = !DILocation(line: 146, column: 1, scope: !296)
!311 = !DILocalVariable(name: "i", scope: !312, file: !45, line: 148, type: !23)
!312 = distinct !DILexicalBlock(scope: !296, file: !45, line: 147, column: 5)
!313 = !DILocation(line: 148, column: 13, scope: !312)
!314 = !DILocalVariable(name: "n", scope: !312, file: !45, line: 148, type: !23)
!315 = !DILocation(line: 148, column: 16, scope: !312)
!316 = !DILocalVariable(name: "intVariable", scope: !312, file: !45, line: 148, type: !23)
!317 = !DILocation(line: 148, column: 19, scope: !312)
!318 = !DILocation(line: 149, column: 20, scope: !319)
!319 = distinct !DILexicalBlock(scope: !312, file: !45, line: 149, column: 13)
!320 = !DILocation(line: 149, column: 13, scope: !319)
!321 = !DILocation(line: 149, column: 36, scope: !319)
!322 = !DILocation(line: 149, column: 13, scope: !312)
!323 = !DILocation(line: 152, column: 25, scope: !324)
!324 = distinct !DILexicalBlock(scope: !319, file: !45, line: 150, column: 9)
!325 = !DILocation(line: 153, column: 20, scope: !326)
!326 = distinct !DILexicalBlock(scope: !324, file: !45, line: 153, column: 13)
!327 = !DILocation(line: 153, column: 18, scope: !326)
!328 = !DILocation(line: 153, column: 25, scope: !329)
!329 = distinct !DILexicalBlock(scope: !326, file: !45, line: 153, column: 13)
!330 = !DILocation(line: 153, column: 29, scope: !329)
!331 = !DILocation(line: 153, column: 27, scope: !329)
!332 = !DILocation(line: 153, column: 13, scope: !326)
!333 = !DILocation(line: 156, column: 28, scope: !334)
!334 = distinct !DILexicalBlock(scope: !329, file: !45, line: 154, column: 13)
!335 = !DILocation(line: 157, column: 13, scope: !334)
!336 = !DILocation(line: 153, column: 33, scope: !329)
!337 = !DILocation(line: 153, column: 13, scope: !329)
!338 = distinct !{!338, !332, !339, !198}
!339 = !DILocation(line: 157, column: 13, scope: !326)
!340 = !DILocation(line: 158, column: 26, scope: !324)
!341 = !DILocation(line: 158, column: 13, scope: !324)
!342 = !DILocation(line: 159, column: 9, scope: !324)
!343 = !DILocation(line: 161, column: 1, scope: !296)
!344 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_18_good", scope: !45, file: !45, line: 163, type: !53, scopeLine: 164, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!345 = !DILocation(line: 165, column: 5, scope: !344)
!346 = !DILocation(line: 166, column: 5, scope: !344)
!347 = !DILocation(line: 167, column: 1, scope: !344)
!348 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !349, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !42}
!351 = !DILocalVariable(name: "line", arg: 1, scope: !348, file: !3, line: 11, type: !42)
!352 = !DILocation(line: 11, column: 25, scope: !348)
!353 = !DILocation(line: 13, column: 1, scope: !348)
!354 = !DILocation(line: 14, column: 8, scope: !355)
!355 = distinct !DILexicalBlock(scope: !348, file: !3, line: 14, column: 8)
!356 = !DILocation(line: 14, column: 13, scope: !355)
!357 = !DILocation(line: 14, column: 8, scope: !348)
!358 = !DILocation(line: 16, column: 24, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !3, line: 15, column: 5)
!360 = !DILocation(line: 16, column: 9, scope: !359)
!361 = !DILocation(line: 17, column: 5, scope: !359)
!362 = !DILocation(line: 18, column: 5, scope: !348)
!363 = !DILocation(line: 19, column: 1, scope: !348)
!364 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !349, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DILocalVariable(name: "line", arg: 1, scope: !364, file: !3, line: 20, type: !42)
!366 = !DILocation(line: 20, column: 29, scope: !364)
!367 = !DILocation(line: 22, column: 8, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !3, line: 22, column: 8)
!369 = !DILocation(line: 22, column: 13, scope: !368)
!370 = !DILocation(line: 22, column: 8, scope: !364)
!371 = !DILocation(line: 24, column: 24, scope: !372)
!372 = distinct !DILexicalBlock(scope: !368, file: !3, line: 23, column: 5)
!373 = !DILocation(line: 24, column: 9, scope: !372)
!374 = !DILocation(line: 25, column: 5, scope: !372)
!375 = !DILocation(line: 26, column: 1, scope: !364)
!376 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !377, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !70, line: 74, baseType: !23)
!381 = !DILocalVariable(name: "line", arg: 1, scope: !376, file: !3, line: 27, type: !379)
!382 = !DILocation(line: 27, column: 29, scope: !376)
!383 = !DILocation(line: 29, column: 8, scope: !384)
!384 = distinct !DILexicalBlock(scope: !376, file: !3, line: 29, column: 8)
!385 = !DILocation(line: 29, column: 13, scope: !384)
!386 = !DILocation(line: 29, column: 8, scope: !376)
!387 = !DILocation(line: 31, column: 27, scope: !388)
!388 = distinct !DILexicalBlock(scope: !384, file: !3, line: 30, column: 5)
!389 = !DILocation(line: 31, column: 9, scope: !388)
!390 = !DILocation(line: 32, column: 5, scope: !388)
!391 = !DILocation(line: 33, column: 1, scope: !376)
!392 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !393, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !23}
!395 = !DILocalVariable(name: "intNumber", arg: 1, scope: !392, file: !3, line: 35, type: !23)
!396 = !DILocation(line: 35, column: 24, scope: !392)
!397 = !DILocation(line: 37, column: 20, scope: !392)
!398 = !DILocation(line: 37, column: 5, scope: !392)
!399 = !DILocation(line: 38, column: 1, scope: !392)
!400 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !401, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!404 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !400, file: !3, line: 40, type: !403)
!405 = !DILocation(line: 40, column: 28, scope: !400)
!406 = !DILocation(line: 42, column: 21, scope: !400)
!407 = !DILocation(line: 42, column: 5, scope: !400)
!408 = !DILocation(line: 43, column: 1, scope: !400)
!409 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !410, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!413 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !409, file: !3, line: 45, type: !412)
!414 = !DILocation(line: 45, column: 28, scope: !409)
!415 = !DILocation(line: 47, column: 20, scope: !409)
!416 = !DILocation(line: 47, column: 5, scope: !409)
!417 = !DILocation(line: 48, column: 1, scope: !409)
!418 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !419, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !104}
!421 = !DILocalVariable(name: "longNumber", arg: 1, scope: !418, file: !3, line: 50, type: !104)
!422 = !DILocation(line: 50, column: 26, scope: !418)
!423 = !DILocation(line: 52, column: 21, scope: !418)
!424 = !DILocation(line: 52, column: 5, scope: !418)
!425 = !DILocation(line: 53, column: 1, scope: !418)
!426 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !427, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !430, line: 27, baseType: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !103, line: 44, baseType: !104)
!432 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !426, file: !3, line: 55, type: !429)
!433 = !DILocation(line: 55, column: 33, scope: !426)
!434 = !DILocation(line: 57, column: 29, scope: !426)
!435 = !DILocation(line: 57, column: 5, scope: !426)
!436 = !DILocation(line: 58, column: 1, scope: !426)
!437 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !438, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !69}
!440 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !437, file: !3, line: 60, type: !69)
!441 = !DILocation(line: 60, column: 29, scope: !437)
!442 = !DILocation(line: 62, column: 21, scope: !437)
!443 = !DILocation(line: 62, column: 5, scope: !437)
!444 = !DILocation(line: 63, column: 1, scope: !437)
!445 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !446, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !43}
!448 = !DILocalVariable(name: "charHex", arg: 1, scope: !445, file: !3, line: 65, type: !43)
!449 = !DILocation(line: 65, column: 29, scope: !445)
!450 = !DILocation(line: 67, column: 22, scope: !445)
!451 = !DILocation(line: 67, column: 5, scope: !445)
!452 = !DILocation(line: 68, column: 1, scope: !445)
!453 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !454, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !380}
!456 = !DILocalVariable(name: "wideChar", arg: 1, scope: !453, file: !3, line: 70, type: !380)
!457 = !DILocation(line: 70, column: 29, scope: !453)
!458 = !DILocalVariable(name: "s", scope: !453, file: !3, line: 74, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 64, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 2)
!462 = !DILocation(line: 74, column: 13, scope: !453)
!463 = !DILocation(line: 75, column: 16, scope: !453)
!464 = !DILocation(line: 75, column: 9, scope: !453)
!465 = !DILocation(line: 75, column: 14, scope: !453)
!466 = !DILocation(line: 76, column: 9, scope: !453)
!467 = !DILocation(line: 76, column: 14, scope: !453)
!468 = !DILocation(line: 77, column: 21, scope: !453)
!469 = !DILocation(line: 77, column: 5, scope: !453)
!470 = !DILocation(line: 78, column: 1, scope: !453)
!471 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !472, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !7}
!474 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !471, file: !3, line: 80, type: !7)
!475 = !DILocation(line: 80, column: 33, scope: !471)
!476 = !DILocation(line: 82, column: 20, scope: !471)
!477 = !DILocation(line: 82, column: 5, scope: !471)
!478 = !DILocation(line: 83, column: 1, scope: !471)
!479 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !480, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !25}
!482 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !479, file: !3, line: 85, type: !25)
!483 = !DILocation(line: 85, column: 45, scope: !479)
!484 = !DILocation(line: 87, column: 22, scope: !479)
!485 = !DILocation(line: 87, column: 5, scope: !479)
!486 = !DILocation(line: 88, column: 1, scope: !479)
!487 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !488, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !490}
!490 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!491 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !487, file: !3, line: 90, type: !490)
!492 = !DILocation(line: 90, column: 29, scope: !487)
!493 = !DILocation(line: 92, column: 20, scope: !487)
!494 = !DILocation(line: 92, column: 5, scope: !487)
!495 = !DILocation(line: 93, column: 1, scope: !487)
!496 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !497, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !501, line: 100, baseType: !502)
!501 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_091/source_code")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !501, line: 96, size: 64, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !502, file: !501, line: 98, baseType: !23, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !502, file: !501, line: 99, baseType: !23, size: 32, offset: 32)
!506 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !496, file: !3, line: 95, type: !499)
!507 = !DILocation(line: 95, column: 40, scope: !496)
!508 = !DILocation(line: 97, column: 26, scope: !496)
!509 = !DILocation(line: 97, column: 47, scope: !496)
!510 = !DILocation(line: 97, column: 55, scope: !496)
!511 = !DILocation(line: 97, column: 76, scope: !496)
!512 = !DILocation(line: 97, column: 5, scope: !496)
!513 = !DILocation(line: 98, column: 1, scope: !496)
!514 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !515, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517, !69}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!518 = !DILocalVariable(name: "bytes", arg: 1, scope: !514, file: !3, line: 100, type: !517)
!519 = !DILocation(line: 100, column: 38, scope: !514)
!520 = !DILocalVariable(name: "numBytes", arg: 2, scope: !514, file: !3, line: 100, type: !69)
!521 = !DILocation(line: 100, column: 52, scope: !514)
!522 = !DILocalVariable(name: "i", scope: !514, file: !3, line: 102, type: !69)
!523 = !DILocation(line: 102, column: 12, scope: !514)
!524 = !DILocation(line: 103, column: 12, scope: !525)
!525 = distinct !DILexicalBlock(scope: !514, file: !3, line: 103, column: 5)
!526 = !DILocation(line: 103, column: 10, scope: !525)
!527 = !DILocation(line: 103, column: 17, scope: !528)
!528 = distinct !DILexicalBlock(scope: !525, file: !3, line: 103, column: 5)
!529 = !DILocation(line: 103, column: 21, scope: !528)
!530 = !DILocation(line: 103, column: 19, scope: !528)
!531 = !DILocation(line: 103, column: 5, scope: !525)
!532 = !DILocation(line: 105, column: 24, scope: !533)
!533 = distinct !DILexicalBlock(scope: !528, file: !3, line: 104, column: 5)
!534 = !DILocation(line: 105, column: 30, scope: !533)
!535 = !DILocation(line: 105, column: 9, scope: !533)
!536 = !DILocation(line: 106, column: 5, scope: !533)
!537 = !DILocation(line: 103, column: 31, scope: !528)
!538 = !DILocation(line: 103, column: 5, scope: !528)
!539 = distinct !{!539, !531, !540, !198}
!540 = !DILocation(line: 106, column: 5, scope: !525)
!541 = !DILocation(line: 107, column: 5, scope: !514)
!542 = !DILocation(line: 108, column: 1, scope: !514)
!543 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !544, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!544 = !DISubroutineType(types: !545)
!545 = !{!69, !517, !69, !42}
!546 = !DILocalVariable(name: "bytes", arg: 1, scope: !543, file: !3, line: 113, type: !517)
!547 = !DILocation(line: 113, column: 39, scope: !543)
!548 = !DILocalVariable(name: "numBytes", arg: 2, scope: !543, file: !3, line: 113, type: !69)
!549 = !DILocation(line: 113, column: 53, scope: !543)
!550 = !DILocalVariable(name: "hex", arg: 3, scope: !543, file: !3, line: 113, type: !42)
!551 = !DILocation(line: 113, column: 71, scope: !543)
!552 = !DILocalVariable(name: "numWritten", scope: !543, file: !3, line: 115, type: !69)
!553 = !DILocation(line: 115, column: 12, scope: !543)
!554 = !DILocation(line: 121, column: 5, scope: !543)
!555 = !DILocation(line: 121, column: 12, scope: !543)
!556 = !DILocation(line: 121, column: 25, scope: !543)
!557 = !DILocation(line: 121, column: 23, scope: !543)
!558 = !DILocation(line: 121, column: 34, scope: !543)
!559 = !DILocation(line: 121, column: 37, scope: !543)
!560 = !DILocation(line: 121, column: 67, scope: !543)
!561 = !DILocation(line: 121, column: 70, scope: !543)
!562 = !DILocation(line: 0, scope: !543)
!563 = !DILocalVariable(name: "byte", scope: !564, file: !3, line: 123, type: !23)
!564 = distinct !DILexicalBlock(scope: !543, file: !3, line: 122, column: 5)
!565 = !DILocation(line: 123, column: 13, scope: !564)
