; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_18.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_18.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_18_bad() #0 !dbg !10 {
entry:
  %data = alloca i8*, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4
  %intVariable = alloca i32, align 4
  call void @llvm.dbg.declare(metadata i8** %data, metadata !13, metadata !DIExpression()), !dbg !16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_18.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_091/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_18_bad", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 37, type: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocation(line: 37, column: 12, scope: !10)
!17 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 38, type: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 100)
!21 = !DILocation(line: 38, column: 10, scope: !10)
!22 = !DILocation(line: 39, column: 12, scope: !10)
!23 = !DILocation(line: 39, column: 10, scope: !10)
!24 = !DILocation(line: 40, column: 5, scope: !10)
!25 = !DILabel(scope: !10, name: "source", file: !1, line: 41)
!26 = !DILocation(line: 41, column: 1, scope: !10)
!27 = !DILocalVariable(name: "dataLen", scope: !28, file: !1, line: 44, type: !29)
!28 = distinct !DILexicalBlock(scope: !10, file: !1, line: 42, column: 5)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !30, line: 46, baseType: !31)
!30 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!31 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!32 = !DILocation(line: 44, column: 16, scope: !28)
!33 = !DILocation(line: 44, column: 33, scope: !28)
!34 = !DILocation(line: 44, column: 26, scope: !28)
!35 = !DILocalVariable(name: "pFile", scope: !28, file: !1, line: 45, type: !36)
!36 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !37, size: 64)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !38, line: 7, baseType: !39)
!38 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!39 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !40, line: 49, size: 1728, elements: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!41 = !{!42, !43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !57, !59, !60, !61, !65, !67, !69, !73, !76, !78, !81, !84, !85, !86, !87, !88}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !39, file: !40, line: 51, baseType: !5, size: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !39, file: !40, line: 54, baseType: !14, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !39, file: !40, line: 55, baseType: !14, size: 64, offset: 128)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !39, file: !40, line: 56, baseType: !14, size: 64, offset: 192)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !39, file: !40, line: 57, baseType: !14, size: 64, offset: 256)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !39, file: !40, line: 58, baseType: !14, size: 64, offset: 320)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !39, file: !40, line: 59, baseType: !14, size: 64, offset: 384)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !39, file: !40, line: 60, baseType: !14, size: 64, offset: 448)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !39, file: !40, line: 61, baseType: !14, size: 64, offset: 512)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !39, file: !40, line: 64, baseType: !14, size: 64, offset: 576)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !39, file: !40, line: 65, baseType: !14, size: 64, offset: 640)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !39, file: !40, line: 66, baseType: !14, size: 64, offset: 704)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !39, file: !40, line: 68, baseType: !55, size: 64, offset: 768)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !40, line: 36, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !39, file: !40, line: 70, baseType: !58, size: 64, offset: 832)
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !39, file: !40, line: 72, baseType: !5, size: 32, offset: 896)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !39, file: !40, line: 73, baseType: !5, size: 32, offset: 928)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !39, file: !40, line: 74, baseType: !62, size: 64, offset: 960)
!62 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !63, line: 152, baseType: !64)
!63 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!64 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !39, file: !40, line: 77, baseType: !66, size: 16, offset: 1024)
!66 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !39, file: !40, line: 78, baseType: !68, size: 8, offset: 1040)
!68 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !39, file: !40, line: 79, baseType: !70, size: 8, offset: 1048)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !71)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !39, file: !40, line: 81, baseType: !74, size: 64, offset: 1088)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !40, line: 43, baseType: null)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !39, file: !40, line: 89, baseType: !77, size: 64, offset: 1152)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !63, line: 153, baseType: !64)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !39, file: !40, line: 91, baseType: !79, size: 64, offset: 1216)
!79 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !40, line: 37, flags: DIFlagFwdDecl)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !39, file: !40, line: 92, baseType: !82, size: 64, offset: 1280)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !40, line: 38, flags: DIFlagFwdDecl)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !39, file: !40, line: 93, baseType: !58, size: 64, offset: 1344)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !39, file: !40, line: 94, baseType: !4, size: 64, offset: 1408)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !39, file: !40, line: 95, baseType: !29, size: 64, offset: 1472)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !39, file: !40, line: 96, baseType: !5, size: 32, offset: 1536)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !39, file: !40, line: 98, baseType: !89, size: 160, offset: 1568)
!89 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !90)
!90 = !{!91}
!91 = !DISubrange(count: 20)
!92 = !DILocation(line: 45, column: 16, scope: !28)
!93 = !DILocation(line: 47, column: 17, scope: !94)
!94 = distinct !DILexicalBlock(scope: !28, file: !1, line: 47, column: 13)
!95 = !DILocation(line: 47, column: 16, scope: !94)
!96 = !DILocation(line: 47, column: 25, scope: !94)
!97 = !DILocation(line: 47, column: 13, scope: !28)
!98 = !DILocation(line: 49, column: 21, scope: !99)
!99 = distinct !DILexicalBlock(scope: !94, file: !1, line: 48, column: 9)
!100 = !DILocation(line: 49, column: 19, scope: !99)
!101 = !DILocation(line: 50, column: 17, scope: !102)
!102 = distinct !DILexicalBlock(scope: !99, file: !1, line: 50, column: 17)
!103 = !DILocation(line: 50, column: 23, scope: !102)
!104 = !DILocation(line: 50, column: 17, scope: !99)
!105 = !DILocation(line: 53, column: 27, scope: !106)
!106 = distinct !DILexicalBlock(scope: !107, file: !1, line: 53, column: 21)
!107 = distinct !DILexicalBlock(scope: !102, file: !1, line: 51, column: 13)
!108 = !DILocation(line: 53, column: 32, scope: !106)
!109 = !DILocation(line: 53, column: 31, scope: !106)
!110 = !DILocation(line: 53, column: 51, scope: !106)
!111 = !DILocation(line: 53, column: 50, scope: !106)
!112 = !DILocation(line: 53, column: 41, scope: !106)
!113 = !DILocation(line: 53, column: 61, scope: !106)
!114 = !DILocation(line: 53, column: 21, scope: !106)
!115 = !DILocation(line: 53, column: 68, scope: !106)
!116 = !DILocation(line: 53, column: 21, scope: !107)
!117 = !DILocation(line: 55, column: 21, scope: !118)
!118 = distinct !DILexicalBlock(scope: !106, file: !1, line: 54, column: 17)
!119 = !DILocation(line: 57, column: 21, scope: !118)
!120 = !DILocation(line: 57, column: 26, scope: !118)
!121 = !DILocation(line: 57, column: 35, scope: !118)
!122 = !DILocation(line: 58, column: 17, scope: !118)
!123 = !DILocation(line: 59, column: 24, scope: !107)
!124 = !DILocation(line: 59, column: 17, scope: !107)
!125 = !DILocation(line: 60, column: 13, scope: !107)
!126 = !DILocation(line: 61, column: 9, scope: !99)
!127 = !DILocation(line: 63, column: 5, scope: !10)
!128 = !DILabel(scope: !10, name: "sink", file: !1, line: 64)
!129 = !DILocation(line: 64, column: 1, scope: !10)
!130 = !DILocalVariable(name: "i", scope: !131, file: !1, line: 66, type: !5)
!131 = distinct !DILexicalBlock(scope: !10, file: !1, line: 65, column: 5)
!132 = !DILocation(line: 66, column: 13, scope: !131)
!133 = !DILocalVariable(name: "n", scope: !131, file: !1, line: 66, type: !5)
!134 = !DILocation(line: 66, column: 16, scope: !131)
!135 = !DILocalVariable(name: "intVariable", scope: !131, file: !1, line: 66, type: !5)
!136 = !DILocation(line: 66, column: 19, scope: !131)
!137 = !DILocation(line: 67, column: 20, scope: !138)
!138 = distinct !DILexicalBlock(scope: !131, file: !1, line: 67, column: 13)
!139 = !DILocation(line: 67, column: 13, scope: !138)
!140 = !DILocation(line: 67, column: 36, scope: !138)
!141 = !DILocation(line: 67, column: 13, scope: !131)
!142 = !DILocation(line: 70, column: 25, scope: !143)
!143 = distinct !DILexicalBlock(scope: !138, file: !1, line: 68, column: 9)
!144 = !DILocation(line: 71, column: 20, scope: !145)
!145 = distinct !DILexicalBlock(scope: !143, file: !1, line: 71, column: 13)
!146 = !DILocation(line: 71, column: 18, scope: !145)
!147 = !DILocation(line: 71, column: 25, scope: !148)
!148 = distinct !DILexicalBlock(scope: !145, file: !1, line: 71, column: 13)
!149 = !DILocation(line: 71, column: 29, scope: !148)
!150 = !DILocation(line: 71, column: 27, scope: !148)
!151 = !DILocation(line: 71, column: 13, scope: !145)
!152 = !DILocation(line: 74, column: 28, scope: !153)
!153 = distinct !DILexicalBlock(scope: !148, file: !1, line: 72, column: 13)
!154 = !DILocation(line: 75, column: 13, scope: !153)
