; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!1 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_TRUE", scope: !2, file: !3, line: 174, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_099/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_42.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_099/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badSource", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{!42, !42}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 25, scope: !52)
!57 = !DILocalVariable(name: "dataLen", scope: !58, file: !45, line: 39, type: !59)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 37, column: 5)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 46, baseType: !61)
!60 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!61 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DILocation(line: 39, column: 16, scope: !58)
!63 = !DILocation(line: 39, column: 33, scope: !58)
!64 = !DILocation(line: 39, column: 26, scope: !58)
!65 = !DILocalVariable(name: "pFile", scope: !58, file: !45, line: 40, type: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !68, line: 7, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !70, line: 49, size: 1728, elements: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !95, !96, !98, !102, !105, !107, !110, !113, !114, !115, !116, !117}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !69, file: !70, line: 51, baseType: !23, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !69, file: !70, line: 54, baseType: !42, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !69, file: !70, line: 55, baseType: !42, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !69, file: !70, line: 56, baseType: !42, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !69, file: !70, line: 57, baseType: !42, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !69, file: !70, line: 58, baseType: !42, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !69, file: !70, line: 59, baseType: !42, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !69, file: !70, line: 60, baseType: !42, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !69, file: !70, line: 61, baseType: !42, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !69, file: !70, line: 64, baseType: !42, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !69, file: !70, line: 65, baseType: !42, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !69, file: !70, line: 66, baseType: !42, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !69, file: !70, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !70, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !69, file: !70, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !69, file: !70, line: 72, baseType: !23, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !69, file: !70, line: 73, baseType: !23, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !69, file: !70, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 152, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!94 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !69, file: !70, line: 77, baseType: !24, size: 16, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !69, file: !70, line: 78, baseType: !97, size: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !69, file: !70, line: 79, baseType: !99, size: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !69, file: !70, line: 81, baseType: !103, size: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !70, line: 43, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !69, file: !70, line: 89, baseType: !106, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 153, baseType: !94)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !69, file: !70, line: 91, baseType: !108, size: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !70, line: 37, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !69, file: !70, line: 92, baseType: !111, size: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !70, line: 38, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !69, file: !70, line: 93, baseType: !88, size: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !69, file: !70, line: 94, baseType: !22, size: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !69, file: !70, line: 95, baseType: !59, size: 64, offset: 1472)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !69, file: !70, line: 96, baseType: !23, size: 32, offset: 1536)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !69, file: !70, line: 98, baseType: !118, size: 160, offset: 1568)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 20)
!121 = !DILocation(line: 40, column: 16, scope: !58)
!122 = !DILocation(line: 42, column: 17, scope: !123)
!123 = distinct !DILexicalBlock(scope: !58, file: !45, line: 42, column: 13)
!124 = !DILocation(line: 42, column: 16, scope: !123)
!125 = !DILocation(line: 42, column: 25, scope: !123)
!126 = !DILocation(line: 42, column: 13, scope: !58)
!127 = !DILocation(line: 44, column: 21, scope: !128)
!128 = distinct !DILexicalBlock(scope: !123, file: !45, line: 43, column: 9)
!129 = !DILocation(line: 44, column: 19, scope: !128)
!130 = !DILocation(line: 45, column: 17, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !45, line: 45, column: 17)
!132 = !DILocation(line: 45, column: 23, scope: !131)
!133 = !DILocation(line: 45, column: 17, scope: !128)
!134 = !DILocation(line: 48, column: 27, scope: !135)
!135 = distinct !DILexicalBlock(scope: !136, file: !45, line: 48, column: 21)
!136 = distinct !DILexicalBlock(scope: !131, file: !45, line: 46, column: 13)
!137 = !DILocation(line: 48, column: 32, scope: !135)
!138 = !DILocation(line: 48, column: 31, scope: !135)
!139 = !DILocation(line: 48, column: 51, scope: !135)
!140 = !DILocation(line: 48, column: 50, scope: !135)
!141 = !DILocation(line: 48, column: 41, scope: !135)
!142 = !DILocation(line: 48, column: 61, scope: !135)
!143 = !DILocation(line: 48, column: 21, scope: !135)
!144 = !DILocation(line: 48, column: 68, scope: !135)
!145 = !DILocation(line: 48, column: 21, scope: !136)
!146 = !DILocation(line: 50, column: 21, scope: !147)
!147 = distinct !DILexicalBlock(scope: !135, file: !45, line: 49, column: 17)
!148 = !DILocation(line: 52, column: 21, scope: !147)
!149 = !DILocation(line: 52, column: 26, scope: !147)
!150 = !DILocation(line: 52, column: 35, scope: !147)
!151 = !DILocation(line: 53, column: 17, scope: !147)
!152 = !DILocation(line: 54, column: 24, scope: !136)
!153 = !DILocation(line: 54, column: 17, scope: !136)
!154 = !DILocation(line: 55, column: 13, scope: !136)
!155 = !DILocation(line: 56, column: 9, scope: !128)
!156 = !DILocation(line: 58, column: 12, scope: !52)
!157 = !DILocation(line: 58, column: 5, scope: !52)
!158 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_42_bad", scope: !45, file: !45, line: 61, type: !159, scopeLine: 62, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!159 = !DISubroutineType(types: !160)
!160 = !{null}
!161 = !DILocalVariable(name: "data", scope: !158, file: !45, line: 63, type: !42)
!162 = !DILocation(line: 63, column: 12, scope: !158)
!163 = !DILocalVariable(name: "dataBuffer", scope: !158, file: !45, line: 64, type: !164)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 100)
!167 = !DILocation(line: 64, column: 10, scope: !158)
!168 = !DILocation(line: 65, column: 12, scope: !158)
!169 = !DILocation(line: 65, column: 10, scope: !158)
!170 = !DILocation(line: 66, column: 22, scope: !158)
!171 = !DILocation(line: 66, column: 12, scope: !158)
!172 = !DILocation(line: 66, column: 10, scope: !158)
!173 = !DILocalVariable(name: "i", scope: !174, file: !45, line: 68, type: !23)
!174 = distinct !DILexicalBlock(scope: !158, file: !45, line: 67, column: 5)
!175 = !DILocation(line: 68, column: 13, scope: !174)
!176 = !DILocalVariable(name: "n", scope: !174, file: !45, line: 68, type: !23)
!177 = !DILocation(line: 68, column: 16, scope: !174)
!178 = !DILocalVariable(name: "intVariable", scope: !174, file: !45, line: 68, type: !23)
!179 = !DILocation(line: 68, column: 19, scope: !174)
!180 = !DILocation(line: 69, column: 20, scope: !181)
!181 = distinct !DILexicalBlock(scope: !174, file: !45, line: 69, column: 13)
!182 = !DILocation(line: 69, column: 13, scope: !181)
!183 = !DILocation(line: 69, column: 36, scope: !181)
!184 = !DILocation(line: 69, column: 13, scope: !174)
!185 = !DILocation(line: 72, column: 25, scope: !186)
!186 = distinct !DILexicalBlock(scope: !181, file: !45, line: 70, column: 9)
!187 = !DILocation(line: 73, column: 20, scope: !188)
!188 = distinct !DILexicalBlock(scope: !186, file: !45, line: 73, column: 13)
!189 = !DILocation(line: 73, column: 18, scope: !188)
!190 = !DILocation(line: 73, column: 25, scope: !191)
!191 = distinct !DILexicalBlock(scope: !188, file: !45, line: 73, column: 13)
!192 = !DILocation(line: 73, column: 29, scope: !191)
!193 = !DILocation(line: 73, column: 27, scope: !191)
!194 = !DILocation(line: 73, column: 13, scope: !188)
!195 = !DILocation(line: 76, column: 28, scope: !196)
!196 = distinct !DILexicalBlock(scope: !191, file: !45, line: 74, column: 13)
!197 = !DILocation(line: 77, column: 13, scope: !196)
!198 = !DILocation(line: 73, column: 33, scope: !191)
!199 = !DILocation(line: 73, column: 13, scope: !191)
!200 = distinct !{!200, !194, !201, !202}
!201 = !DILocation(line: 77, column: 13, scope: !188)
!202 = !{!"llvm.loop.mustprogress"}
!203 = !DILocation(line: 78, column: 26, scope: !186)
!204 = !DILocation(line: 78, column: 13, scope: !186)
!205 = !DILocation(line: 79, column: 9, scope: !186)
!206 = !DILocation(line: 81, column: 1, scope: !158)
!207 = distinct !DISubprogram(name: "goodG2BSource", scope: !45, file: !45, line: 88, type: !53, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!208 = !DILocalVariable(name: "data", arg: 1, scope: !207, file: !45, line: 88, type: !42)
!209 = !DILocation(line: 88, column: 29, scope: !207)
!210 = !DILocation(line: 91, column: 12, scope: !207)
!211 = !DILocation(line: 91, column: 5, scope: !207)
!212 = !DILocation(line: 92, column: 12, scope: !207)
!213 = !DILocation(line: 92, column: 5, scope: !207)
!214 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 95, type: !159, scopeLine: 96, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!215 = !DILocalVariable(name: "data", scope: !214, file: !45, line: 97, type: !42)
!216 = !DILocation(line: 97, column: 12, scope: !214)
!217 = !DILocalVariable(name: "dataBuffer", scope: !214, file: !45, line: 98, type: !164)
!218 = !DILocation(line: 98, column: 10, scope: !214)
!219 = !DILocation(line: 99, column: 12, scope: !214)
!220 = !DILocation(line: 99, column: 10, scope: !214)
!221 = !DILocation(line: 100, column: 26, scope: !214)
!222 = !DILocation(line: 100, column: 12, scope: !214)
!223 = !DILocation(line: 100, column: 10, scope: !214)
!224 = !DILocalVariable(name: "i", scope: !225, file: !45, line: 102, type: !23)
!225 = distinct !DILexicalBlock(scope: !214, file: !45, line: 101, column: 5)
!226 = !DILocation(line: 102, column: 13, scope: !225)
!227 = !DILocalVariable(name: "n", scope: !225, file: !45, line: 102, type: !23)
!228 = !DILocation(line: 102, column: 16, scope: !225)
!229 = !DILocalVariable(name: "intVariable", scope: !225, file: !45, line: 102, type: !23)
!230 = !DILocation(line: 102, column: 19, scope: !225)
!231 = !DILocation(line: 103, column: 20, scope: !232)
!232 = distinct !DILexicalBlock(scope: !225, file: !45, line: 103, column: 13)
!233 = !DILocation(line: 103, column: 13, scope: !232)
!234 = !DILocation(line: 103, column: 36, scope: !232)
!235 = !DILocation(line: 103, column: 13, scope: !225)
!236 = !DILocation(line: 106, column: 25, scope: !237)
!237 = distinct !DILexicalBlock(scope: !232, file: !45, line: 104, column: 9)
!238 = !DILocation(line: 107, column: 20, scope: !239)
!239 = distinct !DILexicalBlock(scope: !237, file: !45, line: 107, column: 13)
!240 = !DILocation(line: 107, column: 18, scope: !239)
!241 = !DILocation(line: 107, column: 25, scope: !242)
!242 = distinct !DILexicalBlock(scope: !239, file: !45, line: 107, column: 13)
!243 = !DILocation(line: 107, column: 29, scope: !242)
!244 = !DILocation(line: 107, column: 27, scope: !242)
!245 = !DILocation(line: 107, column: 13, scope: !239)
!246 = !DILocation(line: 110, column: 28, scope: !247)
!247 = distinct !DILexicalBlock(scope: !242, file: !45, line: 108, column: 13)
!248 = !DILocation(line: 111, column: 13, scope: !247)
!249 = !DILocation(line: 107, column: 33, scope: !242)
!250 = !DILocation(line: 107, column: 13, scope: !242)
!251 = distinct !{!251, !245, !252, !202}
!252 = !DILocation(line: 111, column: 13, scope: !239)
!253 = !DILocation(line: 112, column: 26, scope: !237)
!254 = !DILocation(line: 112, column: 13, scope: !237)
!255 = !DILocation(line: 113, column: 9, scope: !237)
!256 = !DILocation(line: 115, column: 1, scope: !214)
!257 = distinct !DISubprogram(name: "goodB2GSource", scope: !45, file: !45, line: 118, type: !53, scopeLine: 119, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!258 = !DILocalVariable(name: "data", arg: 1, scope: !257, file: !45, line: 118, type: !42)
!259 = !DILocation(line: 118, column: 29, scope: !257)
!260 = !DILocalVariable(name: "dataLen", scope: !261, file: !45, line: 122, type: !59)
!261 = distinct !DILexicalBlock(scope: !257, file: !45, line: 120, column: 5)
!262 = !DILocation(line: 122, column: 16, scope: !261)
!263 = !DILocation(line: 122, column: 33, scope: !261)
!264 = !DILocation(line: 122, column: 26, scope: !261)
!265 = !DILocalVariable(name: "pFile", scope: !261, file: !45, line: 123, type: !66)
!266 = !DILocation(line: 123, column: 16, scope: !261)
!267 = !DILocation(line: 125, column: 17, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !45, line: 125, column: 13)
!269 = !DILocation(line: 125, column: 16, scope: !268)
!270 = !DILocation(line: 125, column: 25, scope: !268)
!271 = !DILocation(line: 125, column: 13, scope: !261)
!272 = !DILocation(line: 127, column: 21, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !45, line: 126, column: 9)
!274 = !DILocation(line: 127, column: 19, scope: !273)
!275 = !DILocation(line: 128, column: 17, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !45, line: 128, column: 17)
!277 = !DILocation(line: 128, column: 23, scope: !276)
!278 = !DILocation(line: 128, column: 17, scope: !273)
!279 = !DILocation(line: 131, column: 27, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !45, line: 131, column: 21)
!281 = distinct !DILexicalBlock(scope: !276, file: !45, line: 129, column: 13)
!282 = !DILocation(line: 131, column: 32, scope: !280)
!283 = !DILocation(line: 131, column: 31, scope: !280)
!284 = !DILocation(line: 131, column: 51, scope: !280)
!285 = !DILocation(line: 131, column: 50, scope: !280)
!286 = !DILocation(line: 131, column: 41, scope: !280)
!287 = !DILocation(line: 131, column: 61, scope: !280)
!288 = !DILocation(line: 131, column: 21, scope: !280)
!289 = !DILocation(line: 131, column: 68, scope: !280)
!290 = !DILocation(line: 131, column: 21, scope: !281)
!291 = !DILocation(line: 133, column: 21, scope: !292)
!292 = distinct !DILexicalBlock(scope: !280, file: !45, line: 132, column: 17)
!293 = !DILocation(line: 135, column: 21, scope: !292)
!294 = !DILocation(line: 135, column: 26, scope: !292)
!295 = !DILocation(line: 135, column: 35, scope: !292)
!296 = !DILocation(line: 136, column: 17, scope: !292)
!297 = !DILocation(line: 137, column: 24, scope: !281)
!298 = !DILocation(line: 137, column: 17, scope: !281)
!299 = !DILocation(line: 138, column: 13, scope: !281)
!300 = !DILocation(line: 139, column: 9, scope: !273)
!301 = !DILocation(line: 141, column: 12, scope: !257)
!302 = !DILocation(line: 141, column: 5, scope: !257)
!303 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 144, type: !159, scopeLine: 145, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!304 = !DILocalVariable(name: "data", scope: !303, file: !45, line: 146, type: !42)
!305 = !DILocation(line: 146, column: 12, scope: !303)
!306 = !DILocalVariable(name: "dataBuffer", scope: !303, file: !45, line: 147, type: !164)
!307 = !DILocation(line: 147, column: 10, scope: !303)
!308 = !DILocation(line: 148, column: 12, scope: !303)
!309 = !DILocation(line: 148, column: 10, scope: !303)
!310 = !DILocation(line: 149, column: 26, scope: !303)
!311 = !DILocation(line: 149, column: 12, scope: !303)
!312 = !DILocation(line: 149, column: 10, scope: !303)
!313 = !DILocalVariable(name: "i", scope: !314, file: !45, line: 151, type: !23)
!314 = distinct !DILexicalBlock(scope: !303, file: !45, line: 150, column: 5)
!315 = !DILocation(line: 151, column: 13, scope: !314)
!316 = !DILocalVariable(name: "n", scope: !314, file: !45, line: 151, type: !23)
!317 = !DILocation(line: 151, column: 16, scope: !314)
!318 = !DILocalVariable(name: "intVariable", scope: !314, file: !45, line: 151, type: !23)
!319 = !DILocation(line: 151, column: 19, scope: !314)
!320 = !DILocation(line: 152, column: 20, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !45, line: 152, column: 13)
!322 = !DILocation(line: 152, column: 13, scope: !321)
!323 = !DILocation(line: 152, column: 36, scope: !321)
!324 = !DILocation(line: 152, column: 13, scope: !314)
!325 = !DILocation(line: 155, column: 17, scope: !326)
!326 = distinct !DILexicalBlock(scope: !327, file: !45, line: 155, column: 17)
!327 = distinct !DILexicalBlock(scope: !321, file: !45, line: 153, column: 9)
!328 = !DILocation(line: 155, column: 19, scope: !326)
!329 = !DILocation(line: 155, column: 17, scope: !327)
!330 = !DILocation(line: 157, column: 29, scope: !331)
!331 = distinct !DILexicalBlock(scope: !326, file: !45, line: 156, column: 13)
!332 = !DILocation(line: 158, column: 24, scope: !333)
!333 = distinct !DILexicalBlock(scope: !331, file: !45, line: 158, column: 17)
!334 = !DILocation(line: 158, column: 22, scope: !333)
!335 = !DILocation(line: 158, column: 29, scope: !336)
!336 = distinct !DILexicalBlock(scope: !333, file: !45, line: 158, column: 17)
!337 = !DILocation(line: 158, column: 33, scope: !336)
!338 = !DILocation(line: 158, column: 31, scope: !336)
!339 = !DILocation(line: 158, column: 17, scope: !333)
!340 = !DILocation(line: 161, column: 32, scope: !341)
!341 = distinct !DILexicalBlock(scope: !336, file: !45, line: 159, column: 17)
!342 = !DILocation(line: 162, column: 17, scope: !341)
!343 = !DILocation(line: 158, column: 37, scope: !336)
!344 = !DILocation(line: 158, column: 17, scope: !336)
!345 = distinct !{!345, !339, !346, !202}
!346 = !DILocation(line: 162, column: 17, scope: !333)
!347 = !DILocation(line: 163, column: 30, scope: !331)
!348 = !DILocation(line: 163, column: 17, scope: !331)
!349 = !DILocation(line: 164, column: 13, scope: !331)
!350 = !DILocation(line: 165, column: 9, scope: !327)
!351 = !DILocation(line: 167, column: 1, scope: !303)
!352 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_42_good", scope: !45, file: !45, line: 169, type: !159, scopeLine: 170, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!353 = !DILocation(line: 171, column: 5, scope: !352)
!354 = !DILocation(line: 172, column: 5, scope: !352)
!355 = !DILocation(line: 173, column: 1, scope: !352)
!356 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !357, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !42}
!359 = !DILocalVariable(name: "line", arg: 1, scope: !356, file: !3, line: 11, type: !42)
!360 = !DILocation(line: 11, column: 25, scope: !356)
!361 = !DILocation(line: 13, column: 1, scope: !356)
!362 = !DILocation(line: 14, column: 8, scope: !363)
!363 = distinct !DILexicalBlock(scope: !356, file: !3, line: 14, column: 8)
!364 = !DILocation(line: 14, column: 13, scope: !363)
!365 = !DILocation(line: 14, column: 8, scope: !356)
!366 = !DILocation(line: 16, column: 24, scope: !367)
!367 = distinct !DILexicalBlock(scope: !363, file: !3, line: 15, column: 5)
!368 = !DILocation(line: 16, column: 9, scope: !367)
!369 = !DILocation(line: 17, column: 5, scope: !367)
!370 = !DILocation(line: 18, column: 5, scope: !356)
!371 = !DILocation(line: 19, column: 1, scope: !356)
!372 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !357, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DILocalVariable(name: "line", arg: 1, scope: !372, file: !3, line: 20, type: !42)
!374 = !DILocation(line: 20, column: 29, scope: !372)
!375 = !DILocation(line: 22, column: 8, scope: !376)
!376 = distinct !DILexicalBlock(scope: !372, file: !3, line: 22, column: 8)
!377 = !DILocation(line: 22, column: 13, scope: !376)
!378 = !DILocation(line: 22, column: 8, scope: !372)
!379 = !DILocation(line: 24, column: 24, scope: !380)
!380 = distinct !DILexicalBlock(scope: !376, file: !3, line: 23, column: 5)
!381 = !DILocation(line: 24, column: 9, scope: !380)
!382 = !DILocation(line: 25, column: 5, scope: !380)
!383 = !DILocation(line: 26, column: 1, scope: !372)
!384 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !385, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !387}
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64)
!388 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !60, line: 74, baseType: !23)
!389 = !DILocalVariable(name: "line", arg: 1, scope: !384, file: !3, line: 27, type: !387)
!390 = !DILocation(line: 27, column: 29, scope: !384)
!391 = !DILocation(line: 29, column: 8, scope: !392)
!392 = distinct !DILexicalBlock(scope: !384, file: !3, line: 29, column: 8)
!393 = !DILocation(line: 29, column: 13, scope: !392)
!394 = !DILocation(line: 29, column: 8, scope: !384)
!395 = !DILocation(line: 31, column: 27, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !3, line: 30, column: 5)
!397 = !DILocation(line: 31, column: 9, scope: !396)
!398 = !DILocation(line: 32, column: 5, scope: !396)
!399 = !DILocation(line: 33, column: 1, scope: !384)
!400 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !401, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !23}
!403 = !DILocalVariable(name: "intNumber", arg: 1, scope: !400, file: !3, line: 35, type: !23)
!404 = !DILocation(line: 35, column: 24, scope: !400)
!405 = !DILocation(line: 37, column: 20, scope: !400)
!406 = !DILocation(line: 37, column: 5, scope: !400)
!407 = !DILocation(line: 38, column: 1, scope: !400)
!408 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !409, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411}
!411 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!412 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !408, file: !3, line: 40, type: !411)
!413 = !DILocation(line: 40, column: 28, scope: !408)
!414 = !DILocation(line: 42, column: 21, scope: !408)
!415 = !DILocation(line: 42, column: 5, scope: !408)
!416 = !DILocation(line: 43, column: 1, scope: !408)
!417 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !418, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420}
!420 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!421 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !417, file: !3, line: 45, type: !420)
!422 = !DILocation(line: 45, column: 28, scope: !417)
!423 = !DILocation(line: 47, column: 20, scope: !417)
!424 = !DILocation(line: 47, column: 5, scope: !417)
!425 = !DILocation(line: 48, column: 1, scope: !417)
!426 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !427, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !94}
!429 = !DILocalVariable(name: "longNumber", arg: 1, scope: !426, file: !3, line: 50, type: !94)
!430 = !DILocation(line: 50, column: 26, scope: !426)
!431 = !DILocation(line: 52, column: 21, scope: !426)
!432 = !DILocation(line: 52, column: 5, scope: !426)
!433 = !DILocation(line: 53, column: 1, scope: !426)
!434 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !435, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !437}
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !438, line: 27, baseType: !439)
!438 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !93, line: 44, baseType: !94)
!440 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !434, file: !3, line: 55, type: !437)
!441 = !DILocation(line: 55, column: 33, scope: !434)
!442 = !DILocation(line: 57, column: 29, scope: !434)
!443 = !DILocation(line: 57, column: 5, scope: !434)
!444 = !DILocation(line: 58, column: 1, scope: !434)
!445 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !446, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !59}
!448 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !445, file: !3, line: 60, type: !59)
!449 = !DILocation(line: 60, column: 29, scope: !445)
!450 = !DILocation(line: 62, column: 21, scope: !445)
!451 = !DILocation(line: 62, column: 5, scope: !445)
!452 = !DILocation(line: 63, column: 1, scope: !445)
!453 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !454, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !43}
!456 = !DILocalVariable(name: "charHex", arg: 1, scope: !453, file: !3, line: 65, type: !43)
!457 = !DILocation(line: 65, column: 29, scope: !453)
!458 = !DILocation(line: 67, column: 22, scope: !453)
!459 = !DILocation(line: 67, column: 5, scope: !453)
!460 = !DILocation(line: 68, column: 1, scope: !453)
!461 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !462, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !388}
!464 = !DILocalVariable(name: "wideChar", arg: 1, scope: !461, file: !3, line: 70, type: !388)
!465 = !DILocation(line: 70, column: 29, scope: !461)
!466 = !DILocalVariable(name: "s", scope: !461, file: !3, line: 74, type: !467)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !388, size: 64, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DILocation(line: 74, column: 13, scope: !461)
!471 = !DILocation(line: 75, column: 16, scope: !461)
!472 = !DILocation(line: 75, column: 9, scope: !461)
!473 = !DILocation(line: 75, column: 14, scope: !461)
!474 = !DILocation(line: 76, column: 9, scope: !461)
!475 = !DILocation(line: 76, column: 14, scope: !461)
!476 = !DILocation(line: 77, column: 21, scope: !461)
!477 = !DILocation(line: 77, column: 5, scope: !461)
!478 = !DILocation(line: 78, column: 1, scope: !461)
!479 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !480, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !7}
!482 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !479, file: !3, line: 80, type: !7)
!483 = !DILocation(line: 80, column: 33, scope: !479)
!484 = !DILocation(line: 82, column: 20, scope: !479)
!485 = !DILocation(line: 82, column: 5, scope: !479)
!486 = !DILocation(line: 83, column: 1, scope: !479)
!487 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !488, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !25}
!490 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !487, file: !3, line: 85, type: !25)
!491 = !DILocation(line: 85, column: 45, scope: !487)
!492 = !DILocation(line: 87, column: 22, scope: !487)
!493 = !DILocation(line: 87, column: 5, scope: !487)
!494 = !DILocation(line: 88, column: 1, scope: !487)
!495 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !496, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!496 = !DISubroutineType(types: !497)
!497 = !{null, !498}
!498 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!499 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !495, file: !3, line: 90, type: !498)
!500 = !DILocation(line: 90, column: 29, scope: !495)
!501 = !DILocation(line: 92, column: 20, scope: !495)
!502 = !DILocation(line: 92, column: 5, scope: !495)
!503 = !DILocation(line: 93, column: 1, scope: !495)
!504 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !505, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!505 = !DISubroutineType(types: !506)
!506 = !{null, !507}
!507 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !509, line: 100, baseType: !510)
!509 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_099/source_code")
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !509, line: 96, size: 64, elements: !511)
!511 = !{!512, !513}
!512 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !510, file: !509, line: 98, baseType: !23, size: 32)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !510, file: !509, line: 99, baseType: !23, size: 32, offset: 32)
!514 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !504, file: !3, line: 95, type: !507)
!515 = !DILocation(line: 95, column: 40, scope: !504)
!516 = !DILocation(line: 97, column: 26, scope: !504)
!517 = !DILocation(line: 97, column: 47, scope: !504)
!518 = !DILocation(line: 97, column: 55, scope: !504)
!519 = !DILocation(line: 97, column: 76, scope: !504)
!520 = !DILocation(line: 97, column: 5, scope: !504)
!521 = !DILocation(line: 98, column: 1, scope: !504)
!522 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !523, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525, !59}
!525 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!526 = !DILocalVariable(name: "bytes", arg: 1, scope: !522, file: !3, line: 100, type: !525)
!527 = !DILocation(line: 100, column: 38, scope: !522)
!528 = !DILocalVariable(name: "numBytes", arg: 2, scope: !522, file: !3, line: 100, type: !59)
!529 = !DILocation(line: 100, column: 52, scope: !522)
!530 = !DILocalVariable(name: "i", scope: !522, file: !3, line: 102, type: !59)
!531 = !DILocation(line: 102, column: 12, scope: !522)
!532 = !DILocation(line: 103, column: 12, scope: !533)
!533 = distinct !DILexicalBlock(scope: !522, file: !3, line: 103, column: 5)
!534 = !DILocation(line: 103, column: 10, scope: !533)
!535 = !DILocation(line: 103, column: 17, scope: !536)
!536 = distinct !DILexicalBlock(scope: !533, file: !3, line: 103, column: 5)
!537 = !DILocation(line: 103, column: 21, scope: !536)
!538 = !DILocation(line: 103, column: 19, scope: !536)
!539 = !DILocation(line: 103, column: 5, scope: !533)
!540 = !DILocation(line: 105, column: 24, scope: !541)
!541 = distinct !DILexicalBlock(scope: !536, file: !3, line: 104, column: 5)
!542 = !DILocation(line: 105, column: 30, scope: !541)
!543 = !DILocation(line: 105, column: 9, scope: !541)
!544 = !DILocation(line: 106, column: 5, scope: !541)
!545 = !DILocation(line: 103, column: 31, scope: !536)
!546 = !DILocation(line: 103, column: 5, scope: !536)
!547 = distinct !{!547, !539, !548, !202}
!548 = !DILocation(line: 106, column: 5, scope: !533)
!549 = !DILocation(line: 107, column: 5, scope: !522)
!550 = !DILocation(line: 108, column: 1, scope: !522)
!551 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !552, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!552 = !DISubroutineType(types: !553)
!553 = !{!59, !525, !59, !42}
!554 = !DILocalVariable(name: "bytes", arg: 1, scope: !551, file: !3, line: 113, type: !525)
!555 = !DILocation(line: 113, column: 39, scope: !551)
!556 = !DILocalVariable(name: "numBytes", arg: 2, scope: !551, file: !3, line: 113, type: !59)
!557 = !DILocation(line: 113, column: 53, scope: !551)
!558 = !DILocalVariable(name: "hex", arg: 3, scope: !551, file: !3, line: 113, type: !42)
!559 = !DILocation(line: 113, column: 71, scope: !551)
!560 = !DILocalVariable(name: "numWritten", scope: !551, file: !3, line: 115, type: !59)
!561 = !DILocation(line: 115, column: 12, scope: !551)
!562 = !DILocation(line: 121, column: 5, scope: !551)
!563 = !DILocation(line: 121, column: 12, scope: !551)
!564 = !DILocation(line: 121, column: 25, scope: !551)
!565 = !DILocation(line: 121, column: 23, scope: !551)
!566 = !DILocation(line: 121, column: 34, scope: !551)
!567 = !DILocation(line: 121, column: 37, scope: !551)
!568 = !DILocation(line: 121, column: 67, scope: !551)
!569 = !DILocation(line: 121, column: 70, scope: !551)
!570 = !DILocation(line: 0, scope: !551)
!571 = !DILocalVariable(name: "byte", scope: !572, file: !3, line: 123, type: !23)
!572 = distinct !DILexicalBlock(scope: !551, file: !3, line: 122, column: 5)
!573 = !DILocation(line: 123, column: 13, scope: !572)
