; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_991/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_991/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51_bad", scope: !45, file: !45, line: 35, type: !55, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 37, type: !42)
!58 = !DILocation(line: 37, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 38, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 100)
!63 = !DILocation(line: 38, column: 10, scope: !54)
!64 = !DILocation(line: 39, column: 12, scope: !54)
!65 = !DILocation(line: 39, column: 10, scope: !54)
!66 = !DILocalVariable(name: "dataLen", scope: !67, file: !45, line: 42, type: !68)
!67 = distinct !DILexicalBlock(scope: !54, file: !45, line: 40, column: 5)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 42, column: 16, scope: !67)
!72 = !DILocation(line: 42, column: 33, scope: !67)
!73 = !DILocation(line: 42, column: 26, scope: !67)
!74 = !DILocalVariable(name: "pFile", scope: !67, file: !45, line: 43, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !23, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !42, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !42, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !42, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !42, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !42, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !42, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !42, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !42, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !42, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !42, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !23, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !23, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !24, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !22, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !23, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 43, column: 16, scope: !67)
!131 = !DILocation(line: 45, column: 17, scope: !132)
!132 = distinct !DILexicalBlock(scope: !67, file: !45, line: 45, column: 13)
!133 = !DILocation(line: 45, column: 16, scope: !132)
!134 = !DILocation(line: 45, column: 25, scope: !132)
!135 = !DILocation(line: 45, column: 13, scope: !67)
!136 = !DILocation(line: 47, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !45, line: 46, column: 9)
!138 = !DILocation(line: 47, column: 19, scope: !137)
!139 = !DILocation(line: 48, column: 17, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !45, line: 48, column: 17)
!141 = !DILocation(line: 48, column: 23, scope: !140)
!142 = !DILocation(line: 48, column: 17, scope: !137)
!143 = !DILocation(line: 51, column: 27, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !45, line: 51, column: 21)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 49, column: 13)
!146 = !DILocation(line: 51, column: 32, scope: !144)
!147 = !DILocation(line: 51, column: 31, scope: !144)
!148 = !DILocation(line: 51, column: 51, scope: !144)
!149 = !DILocation(line: 51, column: 50, scope: !144)
!150 = !DILocation(line: 51, column: 41, scope: !144)
!151 = !DILocation(line: 51, column: 61, scope: !144)
!152 = !DILocation(line: 51, column: 21, scope: !144)
!153 = !DILocation(line: 51, column: 68, scope: !144)
!154 = !DILocation(line: 51, column: 21, scope: !145)
!155 = !DILocation(line: 53, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !45, line: 52, column: 17)
!157 = !DILocation(line: 55, column: 21, scope: !156)
!158 = !DILocation(line: 55, column: 26, scope: !156)
!159 = !DILocation(line: 55, column: 35, scope: !156)
!160 = !DILocation(line: 56, column: 17, scope: !156)
!161 = !DILocation(line: 57, column: 24, scope: !145)
!162 = !DILocation(line: 57, column: 17, scope: !145)
!163 = !DILocation(line: 58, column: 13, scope: !145)
!164 = !DILocation(line: 59, column: 9, scope: !137)
!165 = !DILocation(line: 61, column: 70, scope: !54)
!166 = !DILocation(line: 61, column: 5, scope: !54)
!167 = !DILocation(line: 62, column: 1, scope: !54)
!168 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 70, type: !55, scopeLine: 71, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!169 = !DILocalVariable(name: "data", scope: !168, file: !45, line: 72, type: !42)
!170 = !DILocation(line: 72, column: 12, scope: !168)
!171 = !DILocalVariable(name: "dataBuffer", scope: !168, file: !45, line: 73, type: !60)
!172 = !DILocation(line: 73, column: 10, scope: !168)
!173 = !DILocation(line: 74, column: 12, scope: !168)
!174 = !DILocation(line: 74, column: 10, scope: !168)
!175 = !DILocation(line: 76, column: 12, scope: !168)
!176 = !DILocation(line: 76, column: 5, scope: !168)
!177 = !DILocation(line: 77, column: 74, scope: !168)
!178 = !DILocation(line: 77, column: 5, scope: !168)
!179 = !DILocation(line: 78, column: 1, scope: !168)
!180 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 82, type: !55, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!181 = !DILocalVariable(name: "data", scope: !180, file: !45, line: 84, type: !42)
!182 = !DILocation(line: 84, column: 12, scope: !180)
!183 = !DILocalVariable(name: "dataBuffer", scope: !180, file: !45, line: 85, type: !60)
!184 = !DILocation(line: 85, column: 10, scope: !180)
!185 = !DILocation(line: 86, column: 12, scope: !180)
!186 = !DILocation(line: 86, column: 10, scope: !180)
!187 = !DILocalVariable(name: "dataLen", scope: !188, file: !45, line: 89, type: !68)
!188 = distinct !DILexicalBlock(scope: !180, file: !45, line: 87, column: 5)
!189 = !DILocation(line: 89, column: 16, scope: !188)
!190 = !DILocation(line: 89, column: 33, scope: !188)
!191 = !DILocation(line: 89, column: 26, scope: !188)
!192 = !DILocalVariable(name: "pFile", scope: !188, file: !45, line: 90, type: !75)
!193 = !DILocation(line: 90, column: 16, scope: !188)
!194 = !DILocation(line: 92, column: 17, scope: !195)
!195 = distinct !DILexicalBlock(scope: !188, file: !45, line: 92, column: 13)
!196 = !DILocation(line: 92, column: 16, scope: !195)
!197 = !DILocation(line: 92, column: 25, scope: !195)
!198 = !DILocation(line: 92, column: 13, scope: !188)
!199 = !DILocation(line: 94, column: 21, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !45, line: 93, column: 9)
!201 = !DILocation(line: 94, column: 19, scope: !200)
!202 = !DILocation(line: 95, column: 17, scope: !203)
!203 = distinct !DILexicalBlock(scope: !200, file: !45, line: 95, column: 17)
!204 = !DILocation(line: 95, column: 23, scope: !203)
!205 = !DILocation(line: 95, column: 17, scope: !200)
!206 = !DILocation(line: 98, column: 27, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !45, line: 98, column: 21)
!208 = distinct !DILexicalBlock(scope: !203, file: !45, line: 96, column: 13)
!209 = !DILocation(line: 98, column: 32, scope: !207)
!210 = !DILocation(line: 98, column: 31, scope: !207)
!211 = !DILocation(line: 98, column: 51, scope: !207)
!212 = !DILocation(line: 98, column: 50, scope: !207)
!213 = !DILocation(line: 98, column: 41, scope: !207)
!214 = !DILocation(line: 98, column: 61, scope: !207)
!215 = !DILocation(line: 98, column: 21, scope: !207)
!216 = !DILocation(line: 98, column: 68, scope: !207)
!217 = !DILocation(line: 98, column: 21, scope: !208)
!218 = !DILocation(line: 100, column: 21, scope: !219)
!219 = distinct !DILexicalBlock(scope: !207, file: !45, line: 99, column: 17)
!220 = !DILocation(line: 102, column: 21, scope: !219)
!221 = !DILocation(line: 102, column: 26, scope: !219)
!222 = !DILocation(line: 102, column: 35, scope: !219)
!223 = !DILocation(line: 103, column: 17, scope: !219)
!224 = !DILocation(line: 104, column: 24, scope: !208)
!225 = !DILocation(line: 104, column: 17, scope: !208)
!226 = !DILocation(line: 105, column: 13, scope: !208)
!227 = !DILocation(line: 106, column: 9, scope: !200)
!228 = !DILocation(line: 108, column: 74, scope: !180)
!229 = !DILocation(line: 108, column: 5, scope: !180)
!230 = !DILocation(line: 109, column: 1, scope: !180)
!231 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51_good", scope: !45, file: !45, line: 111, type: !55, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!232 = !DILocation(line: 113, column: 5, scope: !231)
!233 = !DILocation(line: 114, column: 5, scope: !231)
!234 = !DILocation(line: 115, column: 1, scope: !231)
!235 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51b_badSink", scope: !49, file: !49, line: 32, type: !236, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !42}
!238 = !DILocalVariable(name: "data", arg: 1, scope: !235, file: !49, line: 32, type: !42)
!239 = !DILocation(line: 32, column: 78, scope: !235)
!240 = !DILocation(line: 35, column: 13, scope: !235)
!241 = !DILocation(line: 35, column: 21, scope: !235)
!242 = !DILocation(line: 35, column: 5, scope: !235)
!243 = !DILocation(line: 36, column: 1, scope: !235)
!244 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51b_goodG2BSink", scope: !49, file: !49, line: 43, type: !236, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!245 = !DILocalVariable(name: "data", arg: 1, scope: !244, file: !49, line: 43, type: !42)
!246 = !DILocation(line: 43, column: 82, scope: !244)
!247 = !DILocation(line: 46, column: 13, scope: !244)
!248 = !DILocation(line: 46, column: 21, scope: !244)
!249 = !DILocation(line: 46, column: 5, scope: !244)
!250 = !DILocation(line: 47, column: 1, scope: !244)
!251 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_51b_goodB2GSink", scope: !49, file: !49, line: 50, type: !236, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!252 = !DILocalVariable(name: "data", arg: 1, scope: !251, file: !49, line: 50, type: !42)
!253 = !DILocation(line: 50, column: 82, scope: !251)
!254 = !DILocation(line: 53, column: 13, scope: !251)
!255 = !DILocation(line: 53, column: 29, scope: !251)
!256 = !DILocation(line: 53, column: 5, scope: !251)
!257 = !DILocation(line: 54, column: 1, scope: !251)
!258 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !236, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!259 = !DILocalVariable(name: "line", arg: 1, scope: !258, file: !3, line: 11, type: !42)
!260 = !DILocation(line: 11, column: 25, scope: !258)
!261 = !DILocation(line: 13, column: 1, scope: !258)
!262 = !DILocation(line: 14, column: 8, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !3, line: 14, column: 8)
!264 = !DILocation(line: 14, column: 13, scope: !263)
!265 = !DILocation(line: 14, column: 8, scope: !258)
!266 = !DILocation(line: 16, column: 24, scope: !267)
!267 = distinct !DILexicalBlock(scope: !263, file: !3, line: 15, column: 5)
!268 = !DILocation(line: 16, column: 9, scope: !267)
!269 = !DILocation(line: 17, column: 5, scope: !267)
!270 = !DILocation(line: 18, column: 5, scope: !258)
!271 = !DILocation(line: 19, column: 1, scope: !258)
!272 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !236, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!273 = !DILocalVariable(name: "line", arg: 1, scope: !272, file: !3, line: 20, type: !42)
!274 = !DILocation(line: 20, column: 29, scope: !272)
!275 = !DILocation(line: 22, column: 8, scope: !276)
!276 = distinct !DILexicalBlock(scope: !272, file: !3, line: 22, column: 8)
!277 = !DILocation(line: 22, column: 13, scope: !276)
!278 = !DILocation(line: 22, column: 8, scope: !272)
!279 = !DILocation(line: 24, column: 24, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !3, line: 23, column: 5)
!281 = !DILocation(line: 24, column: 9, scope: !280)
!282 = !DILocation(line: 25, column: 5, scope: !280)
!283 = !DILocation(line: 26, column: 1, scope: !272)
!284 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !285, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!285 = !DISubroutineType(types: !286)
!286 = !{null, !287}
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !23)
!289 = !DILocalVariable(name: "line", arg: 1, scope: !284, file: !3, line: 27, type: !287)
!290 = !DILocation(line: 27, column: 29, scope: !284)
!291 = !DILocation(line: 29, column: 8, scope: !292)
!292 = distinct !DILexicalBlock(scope: !284, file: !3, line: 29, column: 8)
!293 = !DILocation(line: 29, column: 13, scope: !292)
!294 = !DILocation(line: 29, column: 8, scope: !284)
!295 = !DILocation(line: 31, column: 27, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 30, column: 5)
!297 = !DILocation(line: 31, column: 9, scope: !296)
!298 = !DILocation(line: 32, column: 5, scope: !296)
!299 = !DILocation(line: 33, column: 1, scope: !284)
!300 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !301, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !23}
!303 = !DILocalVariable(name: "intNumber", arg: 1, scope: !300, file: !3, line: 35, type: !23)
!304 = !DILocation(line: 35, column: 24, scope: !300)
!305 = !DILocation(line: 37, column: 20, scope: !300)
!306 = !DILocation(line: 37, column: 5, scope: !300)
!307 = !DILocation(line: 38, column: 1, scope: !300)
!308 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !309, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!309 = !DISubroutineType(types: !310)
!310 = !{null, !311}
!311 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!312 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !308, file: !3, line: 40, type: !311)
!313 = !DILocation(line: 40, column: 28, scope: !308)
!314 = !DILocation(line: 42, column: 21, scope: !308)
!315 = !DILocation(line: 42, column: 5, scope: !308)
!316 = !DILocation(line: 43, column: 1, scope: !308)
!317 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !318, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!318 = !DISubroutineType(types: !319)
!319 = !{null, !320}
!320 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!321 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !317, file: !3, line: 45, type: !320)
!322 = !DILocation(line: 45, column: 28, scope: !317)
!323 = !DILocation(line: 47, column: 20, scope: !317)
!324 = !DILocation(line: 47, column: 5, scope: !317)
!325 = !DILocation(line: 48, column: 1, scope: !317)
!326 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !327, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !103}
!329 = !DILocalVariable(name: "longNumber", arg: 1, scope: !326, file: !3, line: 50, type: !103)
!330 = !DILocation(line: 50, column: 26, scope: !326)
!331 = !DILocation(line: 52, column: 21, scope: !326)
!332 = !DILocation(line: 52, column: 5, scope: !326)
!333 = !DILocation(line: 53, column: 1, scope: !326)
!334 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !335, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!335 = !DISubroutineType(types: !336)
!336 = !{null, !337}
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !338, line: 27, baseType: !339)
!338 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!339 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 44, baseType: !103)
!340 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !334, file: !3, line: 55, type: !337)
!341 = !DILocation(line: 55, column: 33, scope: !334)
!342 = !DILocation(line: 57, column: 29, scope: !334)
!343 = !DILocation(line: 57, column: 5, scope: !334)
!344 = !DILocation(line: 58, column: 1, scope: !334)
!345 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !346, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!346 = !DISubroutineType(types: !347)
!347 = !{null, !68}
!348 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !345, file: !3, line: 60, type: !68)
!349 = !DILocation(line: 60, column: 29, scope: !345)
!350 = !DILocation(line: 62, column: 21, scope: !345)
!351 = !DILocation(line: 62, column: 5, scope: !345)
!352 = !DILocation(line: 63, column: 1, scope: !345)
!353 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !354, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!354 = !DISubroutineType(types: !355)
!355 = !{null, !43}
!356 = !DILocalVariable(name: "charHex", arg: 1, scope: !353, file: !3, line: 65, type: !43)
!357 = !DILocation(line: 65, column: 29, scope: !353)
!358 = !DILocation(line: 67, column: 22, scope: !353)
!359 = !DILocation(line: 67, column: 5, scope: !353)
!360 = !DILocation(line: 68, column: 1, scope: !353)
!361 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !362, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !288}
!364 = !DILocalVariable(name: "wideChar", arg: 1, scope: !361, file: !3, line: 70, type: !288)
!365 = !DILocation(line: 70, column: 29, scope: !361)
!366 = !DILocalVariable(name: "s", scope: !361, file: !3, line: 74, type: !367)
!367 = !DICompositeType(tag: DW_TAG_array_type, baseType: !288, size: 64, elements: !368)
!368 = !{!369}
!369 = !DISubrange(count: 2)
!370 = !DILocation(line: 74, column: 13, scope: !361)
!371 = !DILocation(line: 75, column: 16, scope: !361)
!372 = !DILocation(line: 75, column: 9, scope: !361)
!373 = !DILocation(line: 75, column: 14, scope: !361)
!374 = !DILocation(line: 76, column: 9, scope: !361)
!375 = !DILocation(line: 76, column: 14, scope: !361)
!376 = !DILocation(line: 77, column: 21, scope: !361)
!377 = !DILocation(line: 77, column: 5, scope: !361)
!378 = !DILocation(line: 78, column: 1, scope: !361)
!379 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !380, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !7}
!382 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !379, file: !3, line: 80, type: !7)
!383 = !DILocation(line: 80, column: 33, scope: !379)
!384 = !DILocation(line: 82, column: 20, scope: !379)
!385 = !DILocation(line: 82, column: 5, scope: !379)
!386 = !DILocation(line: 83, column: 1, scope: !379)
!387 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !388, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !25}
!390 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !387, file: !3, line: 85, type: !25)
!391 = !DILocation(line: 85, column: 45, scope: !387)
!392 = !DILocation(line: 87, column: 22, scope: !387)
!393 = !DILocation(line: 87, column: 5, scope: !387)
!394 = !DILocation(line: 88, column: 1, scope: !387)
!395 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !396, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !398}
!398 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!399 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !395, file: !3, line: 90, type: !398)
!400 = !DILocation(line: 90, column: 29, scope: !395)
!401 = !DILocation(line: 92, column: 20, scope: !395)
!402 = !DILocation(line: 92, column: 5, scope: !395)
!403 = !DILocation(line: 93, column: 1, scope: !395)
!404 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !405, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !407}
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !409, line: 100, baseType: !410)
!409 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_991/source_code")
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !409, line: 96, size: 64, elements: !411)
!411 = !{!412, !413}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !410, file: !409, line: 98, baseType: !23, size: 32)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !410, file: !409, line: 99, baseType: !23, size: 32, offset: 32)
!414 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !404, file: !3, line: 95, type: !407)
!415 = !DILocation(line: 95, column: 40, scope: !404)
!416 = !DILocation(line: 97, column: 26, scope: !404)
!417 = !DILocation(line: 97, column: 47, scope: !404)
!418 = !DILocation(line: 97, column: 55, scope: !404)
!419 = !DILocation(line: 97, column: 76, scope: !404)
!420 = !DILocation(line: 97, column: 5, scope: !404)
!421 = !DILocation(line: 98, column: 1, scope: !404)
!422 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !423, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425, !68}
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!426 = !DILocalVariable(name: "bytes", arg: 1, scope: !422, file: !3, line: 100, type: !425)
!427 = !DILocation(line: 100, column: 38, scope: !422)
!428 = !DILocalVariable(name: "numBytes", arg: 2, scope: !422, file: !3, line: 100, type: !68)
!429 = !DILocation(line: 100, column: 52, scope: !422)
!430 = !DILocalVariable(name: "i", scope: !422, file: !3, line: 102, type: !68)
!431 = !DILocation(line: 102, column: 12, scope: !422)
!432 = !DILocation(line: 103, column: 12, scope: !433)
!433 = distinct !DILexicalBlock(scope: !422, file: !3, line: 103, column: 5)
!434 = !DILocation(line: 103, column: 10, scope: !433)
!435 = !DILocation(line: 103, column: 17, scope: !436)
!436 = distinct !DILexicalBlock(scope: !433, file: !3, line: 103, column: 5)
!437 = !DILocation(line: 103, column: 21, scope: !436)
!438 = !DILocation(line: 103, column: 19, scope: !436)
!439 = !DILocation(line: 103, column: 5, scope: !433)
!440 = !DILocation(line: 105, column: 24, scope: !441)
!441 = distinct !DILexicalBlock(scope: !436, file: !3, line: 104, column: 5)
!442 = !DILocation(line: 105, column: 30, scope: !441)
!443 = !DILocation(line: 105, column: 9, scope: !441)
!444 = !DILocation(line: 106, column: 5, scope: !441)
!445 = !DILocation(line: 103, column: 31, scope: !436)
!446 = !DILocation(line: 103, column: 5, scope: !436)
!447 = distinct !{!447, !439, !448, !449}
!448 = !DILocation(line: 106, column: 5, scope: !433)
!449 = !{!"llvm.loop.mustprogress"}
!450 = !DILocation(line: 107, column: 5, scope: !422)
!451 = !DILocation(line: 108, column: 1, scope: !422)
!452 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !453, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!453 = !DISubroutineType(types: !454)
!454 = !{!68, !425, !68, !42}
!455 = !DILocalVariable(name: "bytes", arg: 1, scope: !452, file: !3, line: 113, type: !425)
!456 = !DILocation(line: 113, column: 39, scope: !452)
!457 = !DILocalVariable(name: "numBytes", arg: 2, scope: !452, file: !3, line: 113, type: !68)
!458 = !DILocation(line: 113, column: 53, scope: !452)
!459 = !DILocalVariable(name: "hex", arg: 3, scope: !452, file: !3, line: 113, type: !42)
!460 = !DILocation(line: 113, column: 71, scope: !452)
!461 = !DILocalVariable(name: "numWritten", scope: !452, file: !3, line: 115, type: !68)
!462 = !DILocation(line: 115, column: 12, scope: !452)
!463 = !DILocation(line: 121, column: 5, scope: !452)
!464 = !DILocation(line: 121, column: 12, scope: !452)
!465 = !DILocation(line: 121, column: 25, scope: !452)
!466 = !DILocation(line: 121, column: 23, scope: !452)
!467 = !DILocation(line: 121, column: 34, scope: !452)
!468 = !DILocation(line: 121, column: 37, scope: !452)
!469 = !DILocation(line: 121, column: 67, scope: !452)
!470 = !DILocation(line: 121, column: 70, scope: !452)
!471 = !DILocation(line: 0, scope: !452)
!472 = !DILocalVariable(name: "byte", scope: !473, file: !3, line: 123, type: !23)
!473 = distinct !DILexicalBlock(scope: !452, file: !3, line: 122, column: 5)
