; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@CWE606_Unchecked_Loop_Condition__char_file_22_badGlobal = dso_local global i32 0, align 4, !dbg !0
@CWE606_Unchecked_Loop_Condition__char_file_22_goodB2G1Global = dso_local global i32 0, align 4, !dbg !9
@CWE606_Unchecked_Loop_Condition__char_file_22_goodB2G2Global = dso_local global i32 0, align 4, !dbg !11
@CWE606_Unchecked_Loop_Condition__char_file_22_goodG2BGlobal = dso_local global i32 0, align 4, !dbg !13
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1.7 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1

!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !36, globals: !39, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_093/source_code")
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !22, size: 32, elements: !23)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!36 = !{!6, !7, !37, !38}
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!15, !40, !42, !44, !46, !48, !50, !52}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !17, file: !18, line: 175, type: !7, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !17, file: !18, line: 176, type: !7, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "globalTrue", scope: !17, file: !18, line: 181, type: !7, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "globalFalse", scope: !17, file: !18, line: 182, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalFive", scope: !17, file: !18, line: 183, type: !7, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "globalArgc", scope: !17, file: !18, line: 214, type: !7, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "globalArgv", scope: !17, file: !18, line: 215, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = distinct !DICompileUnit(language: DW_LANG_C99, file: !58, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!58 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_22b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_093/source_code")
!59 = !{!"clang version 12.0.0"}
!60 = !{i32 7, !"Dwarf Version", i32 4}
!61 = !{i32 2, !"Debug Info Version", i32 3}
!62 = !{i32 1, !"wchar_size", i32 4}
!63 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_22_bad", scope: !3, file: !3, line: 39, type: !64, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!64 = !DISubroutineType(types: !65)
!65 = !{null}
!66 = !DILocalVariable(name: "data", scope: !63, file: !3, line: 41, type: !55)
!67 = !DILocation(line: 41, column: 12, scope: !63)
!68 = !DILocalVariable(name: "dataBuffer", scope: !63, file: !3, line: 42, type: !69)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 800, elements: !70)
!70 = !{!71}
!71 = !DISubrange(count: 100)
!72 = !DILocation(line: 42, column: 10, scope: !63)
!73 = !DILocation(line: 43, column: 12, scope: !63)
!74 = !DILocation(line: 43, column: 10, scope: !63)
!75 = !DILocalVariable(name: "dataLen", scope: !76, file: !3, line: 46, type: !77)
!76 = distinct !DILexicalBlock(scope: !63, file: !3, line: 44, column: 5)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !78, line: 46, baseType: !79)
!78 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!79 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!80 = !DILocation(line: 46, column: 16, scope: !76)
!81 = !DILocation(line: 46, column: 33, scope: !76)
!82 = !DILocation(line: 46, column: 26, scope: !76)
!83 = !DILocalVariable(name: "pFile", scope: !76, file: !3, line: 47, type: !84)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !86, line: 7, baseType: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!87 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !88, line: 49, size: 1728, elements: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !105, !107, !108, !109, !113, !114, !116, !120, !123, !125, !128, !131, !132, !133, !134, !135}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !87, file: !88, line: 51, baseType: !7, size: 32)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !87, file: !88, line: 54, baseType: !55, size: 64, offset: 64)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !87, file: !88, line: 55, baseType: !55, size: 64, offset: 128)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !87, file: !88, line: 56, baseType: !55, size: 64, offset: 192)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !87, file: !88, line: 57, baseType: !55, size: 64, offset: 256)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !87, file: !88, line: 58, baseType: !55, size: 64, offset: 320)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !87, file: !88, line: 59, baseType: !55, size: 64, offset: 384)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !87, file: !88, line: 60, baseType: !55, size: 64, offset: 448)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !87, file: !88, line: 61, baseType: !55, size: 64, offset: 512)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !87, file: !88, line: 64, baseType: !55, size: 64, offset: 576)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !87, file: !88, line: 65, baseType: !55, size: 64, offset: 640)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !87, file: !88, line: 66, baseType: !55, size: 64, offset: 704)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !87, file: !88, line: 68, baseType: !103, size: 64, offset: 768)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !88, line: 36, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !87, file: !88, line: 70, baseType: !106, size: 64, offset: 832)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !87, file: !88, line: 72, baseType: !7, size: 32, offset: 896)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !87, file: !88, line: 73, baseType: !7, size: 32, offset: 928)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !87, file: !88, line: 74, baseType: !110, size: 64, offset: 960)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !111, line: 152, baseType: !112)
!111 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!112 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !87, file: !88, line: 77, baseType: !37, size: 16, offset: 1024)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !87, file: !88, line: 78, baseType: !115, size: 8, offset: 1040)
!115 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !87, file: !88, line: 79, baseType: !117, size: 8, offset: 1048)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !118)
!118 = !{!119}
!119 = !DISubrange(count: 1)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !87, file: !88, line: 81, baseType: !121, size: 64, offset: 1088)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !88, line: 43, baseType: null)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !87, file: !88, line: 89, baseType: !124, size: 64, offset: 1152)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !111, line: 153, baseType: !112)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !87, file: !88, line: 91, baseType: !126, size: 64, offset: 1216)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !88, line: 37, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !87, file: !88, line: 92, baseType: !129, size: 64, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !88, line: 38, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !87, file: !88, line: 93, baseType: !106, size: 64, offset: 1344)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !87, file: !88, line: 94, baseType: !6, size: 64, offset: 1408)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !87, file: !88, line: 95, baseType: !77, size: 64, offset: 1472)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !87, file: !88, line: 96, baseType: !7, size: 32, offset: 1536)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !87, file: !88, line: 98, baseType: !136, size: 160, offset: 1568)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 20)
!139 = !DILocation(line: 47, column: 16, scope: !76)
!140 = !DILocation(line: 49, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !76, file: !3, line: 49, column: 13)
!142 = !DILocation(line: 49, column: 16, scope: !141)
!143 = !DILocation(line: 49, column: 25, scope: !141)
!144 = !DILocation(line: 49, column: 13, scope: !76)
!145 = !DILocation(line: 51, column: 21, scope: !146)
!146 = distinct !DILexicalBlock(scope: !141, file: !3, line: 50, column: 9)
!147 = !DILocation(line: 51, column: 19, scope: !146)
!148 = !DILocation(line: 52, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !146, file: !3, line: 52, column: 17)
!150 = !DILocation(line: 52, column: 23, scope: !149)
!151 = !DILocation(line: 52, column: 17, scope: !146)
!152 = !DILocation(line: 55, column: 27, scope: !153)
!153 = distinct !DILexicalBlock(scope: !154, file: !3, line: 55, column: 21)
!154 = distinct !DILexicalBlock(scope: !149, file: !3, line: 53, column: 13)
!155 = !DILocation(line: 55, column: 32, scope: !153)
!156 = !DILocation(line: 55, column: 31, scope: !153)
!157 = !DILocation(line: 55, column: 51, scope: !153)
!158 = !DILocation(line: 55, column: 50, scope: !153)
!159 = !DILocation(line: 55, column: 41, scope: !153)
!160 = !DILocation(line: 55, column: 61, scope: !153)
!161 = !DILocation(line: 55, column: 21, scope: !153)
!162 = !DILocation(line: 55, column: 68, scope: !153)
!163 = !DILocation(line: 55, column: 21, scope: !154)
!164 = !DILocation(line: 57, column: 21, scope: !165)
!165 = distinct !DILexicalBlock(scope: !153, file: !3, line: 56, column: 17)
!166 = !DILocation(line: 59, column: 21, scope: !165)
!167 = !DILocation(line: 59, column: 26, scope: !165)
!168 = !DILocation(line: 59, column: 35, scope: !165)
!169 = !DILocation(line: 60, column: 17, scope: !165)
!170 = !DILocation(line: 61, column: 24, scope: !154)
!171 = !DILocation(line: 61, column: 17, scope: !154)
!172 = !DILocation(line: 62, column: 13, scope: !154)
!173 = !DILocation(line: 63, column: 9, scope: !146)
!174 = !DILocation(line: 65, column: 61, scope: !63)
!175 = !DILocation(line: 66, column: 59, scope: !63)
!176 = !DILocation(line: 66, column: 5, scope: !63)
!177 = !DILocation(line: 67, column: 1, scope: !63)
!178 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 80, type: !64, scopeLine: 81, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!179 = !DILocalVariable(name: "data", scope: !178, file: !3, line: 82, type: !55)
!180 = !DILocation(line: 82, column: 12, scope: !178)
!181 = !DILocalVariable(name: "dataBuffer", scope: !178, file: !3, line: 83, type: !69)
!182 = !DILocation(line: 83, column: 10, scope: !178)
!183 = !DILocation(line: 84, column: 12, scope: !178)
!184 = !DILocation(line: 84, column: 10, scope: !178)
!185 = !DILocalVariable(name: "dataLen", scope: !186, file: !3, line: 87, type: !77)
!186 = distinct !DILexicalBlock(scope: !178, file: !3, line: 85, column: 5)
!187 = !DILocation(line: 87, column: 16, scope: !186)
!188 = !DILocation(line: 87, column: 33, scope: !186)
!189 = !DILocation(line: 87, column: 26, scope: !186)
!190 = !DILocalVariable(name: "pFile", scope: !186, file: !3, line: 88, type: !84)
!191 = !DILocation(line: 88, column: 16, scope: !186)
!192 = !DILocation(line: 90, column: 17, scope: !193)
!193 = distinct !DILexicalBlock(scope: !186, file: !3, line: 90, column: 13)
!194 = !DILocation(line: 90, column: 16, scope: !193)
!195 = !DILocation(line: 90, column: 25, scope: !193)
!196 = !DILocation(line: 90, column: 13, scope: !186)
!197 = !DILocation(line: 92, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !3, line: 91, column: 9)
!199 = !DILocation(line: 92, column: 19, scope: !198)
!200 = !DILocation(line: 93, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !3, line: 93, column: 17)
!202 = !DILocation(line: 93, column: 23, scope: !201)
!203 = !DILocation(line: 93, column: 17, scope: !198)
!204 = !DILocation(line: 96, column: 27, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !3, line: 96, column: 21)
!206 = distinct !DILexicalBlock(scope: !201, file: !3, line: 94, column: 13)
!207 = !DILocation(line: 96, column: 32, scope: !205)
!208 = !DILocation(line: 96, column: 31, scope: !205)
!209 = !DILocation(line: 96, column: 51, scope: !205)
!210 = !DILocation(line: 96, column: 50, scope: !205)
!211 = !DILocation(line: 96, column: 41, scope: !205)
!212 = !DILocation(line: 96, column: 61, scope: !205)
!213 = !DILocation(line: 96, column: 21, scope: !205)
!214 = !DILocation(line: 96, column: 68, scope: !205)
!215 = !DILocation(line: 96, column: 21, scope: !206)
!216 = !DILocation(line: 98, column: 21, scope: !217)
!217 = distinct !DILexicalBlock(scope: !205, file: !3, line: 97, column: 17)
!218 = !DILocation(line: 100, column: 21, scope: !217)
!219 = !DILocation(line: 100, column: 26, scope: !217)
!220 = !DILocation(line: 100, column: 35, scope: !217)
!221 = !DILocation(line: 101, column: 17, scope: !217)
!222 = !DILocation(line: 102, column: 24, scope: !206)
!223 = !DILocation(line: 102, column: 17, scope: !206)
!224 = !DILocation(line: 103, column: 13, scope: !206)
!225 = !DILocation(line: 104, column: 9, scope: !198)
!226 = !DILocation(line: 106, column: 66, scope: !178)
!227 = !DILocation(line: 107, column: 64, scope: !178)
!228 = !DILocation(line: 107, column: 5, scope: !178)
!229 = !DILocation(line: 108, column: 1, scope: !178)
!230 = distinct !DISubprogram(name: "goodB2G2", scope: !3, file: !3, line: 112, type: !64, scopeLine: 113, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!231 = !DILocalVariable(name: "data", scope: !230, file: !3, line: 114, type: !55)
!232 = !DILocation(line: 114, column: 12, scope: !230)
!233 = !DILocalVariable(name: "dataBuffer", scope: !230, file: !3, line: 115, type: !69)
!234 = !DILocation(line: 115, column: 10, scope: !230)
!235 = !DILocation(line: 116, column: 12, scope: !230)
!236 = !DILocation(line: 116, column: 10, scope: !230)
!237 = !DILocalVariable(name: "dataLen", scope: !238, file: !3, line: 119, type: !77)
!238 = distinct !DILexicalBlock(scope: !230, file: !3, line: 117, column: 5)
!239 = !DILocation(line: 119, column: 16, scope: !238)
!240 = !DILocation(line: 119, column: 33, scope: !238)
!241 = !DILocation(line: 119, column: 26, scope: !238)
!242 = !DILocalVariable(name: "pFile", scope: !238, file: !3, line: 120, type: !84)
!243 = !DILocation(line: 120, column: 16, scope: !238)
!244 = !DILocation(line: 122, column: 17, scope: !245)
!245 = distinct !DILexicalBlock(scope: !238, file: !3, line: 122, column: 13)
!246 = !DILocation(line: 122, column: 16, scope: !245)
!247 = !DILocation(line: 122, column: 25, scope: !245)
!248 = !DILocation(line: 122, column: 13, scope: !238)
!249 = !DILocation(line: 124, column: 21, scope: !250)
!250 = distinct !DILexicalBlock(scope: !245, file: !3, line: 123, column: 9)
!251 = !DILocation(line: 124, column: 19, scope: !250)
!252 = !DILocation(line: 125, column: 17, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !3, line: 125, column: 17)
!254 = !DILocation(line: 125, column: 23, scope: !253)
!255 = !DILocation(line: 125, column: 17, scope: !250)
!256 = !DILocation(line: 128, column: 27, scope: !257)
!257 = distinct !DILexicalBlock(scope: !258, file: !3, line: 128, column: 21)
!258 = distinct !DILexicalBlock(scope: !253, file: !3, line: 126, column: 13)
!259 = !DILocation(line: 128, column: 32, scope: !257)
!260 = !DILocation(line: 128, column: 31, scope: !257)
!261 = !DILocation(line: 128, column: 51, scope: !257)
!262 = !DILocation(line: 128, column: 50, scope: !257)
!263 = !DILocation(line: 128, column: 41, scope: !257)
!264 = !DILocation(line: 128, column: 61, scope: !257)
!265 = !DILocation(line: 128, column: 21, scope: !257)
!266 = !DILocation(line: 128, column: 68, scope: !257)
!267 = !DILocation(line: 128, column: 21, scope: !258)
!268 = !DILocation(line: 130, column: 21, scope: !269)
!269 = distinct !DILexicalBlock(scope: !257, file: !3, line: 129, column: 17)
!270 = !DILocation(line: 132, column: 21, scope: !269)
!271 = !DILocation(line: 132, column: 26, scope: !269)
!272 = !DILocation(line: 132, column: 35, scope: !269)
!273 = !DILocation(line: 133, column: 17, scope: !269)
!274 = !DILocation(line: 134, column: 24, scope: !258)
!275 = !DILocation(line: 134, column: 17, scope: !258)
!276 = !DILocation(line: 135, column: 13, scope: !258)
!277 = !DILocation(line: 136, column: 9, scope: !250)
!278 = !DILocation(line: 138, column: 66, scope: !230)
!279 = !DILocation(line: 139, column: 64, scope: !230)
!280 = !DILocation(line: 139, column: 5, scope: !230)
!281 = !DILocation(line: 140, column: 1, scope: !230)
!282 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 144, type: !64, scopeLine: 145, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!283 = !DILocalVariable(name: "data", scope: !282, file: !3, line: 146, type: !55)
!284 = !DILocation(line: 146, column: 12, scope: !282)
!285 = !DILocalVariable(name: "dataBuffer", scope: !282, file: !3, line: 147, type: !69)
!286 = !DILocation(line: 147, column: 10, scope: !282)
!287 = !DILocation(line: 148, column: 12, scope: !282)
!288 = !DILocation(line: 148, column: 10, scope: !282)
!289 = !DILocation(line: 150, column: 12, scope: !282)
!290 = !DILocation(line: 150, column: 5, scope: !282)
!291 = !DILocation(line: 151, column: 65, scope: !282)
!292 = !DILocation(line: 152, column: 63, scope: !282)
!293 = !DILocation(line: 152, column: 5, scope: !282)
!294 = !DILocation(line: 153, column: 1, scope: !282)
!295 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_22_good", scope: !3, file: !3, line: 155, type: !64, scopeLine: 156, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!296 = !DILocation(line: 157, column: 5, scope: !295)
!297 = !DILocation(line: 158, column: 5, scope: !295)
!298 = !DILocation(line: 159, column: 5, scope: !295)
!299 = !DILocation(line: 160, column: 1, scope: !295)
!300 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_22_badSink", scope: !58, file: !58, line: 31, type: !301, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!301 = !DISubroutineType(types: !302)
!302 = !{null, !55}
!303 = !DILocalVariable(name: "data", arg: 1, scope: !300, file: !58, line: 31, type: !55)
!304 = !DILocation(line: 31, column: 67, scope: !300)
!305 = !DILocation(line: 33, column: 8, scope: !306)
!306 = distinct !DILexicalBlock(scope: !300, file: !58, line: 33, column: 8)
!307 = !DILocation(line: 33, column: 8, scope: !300)
!308 = !DILocalVariable(name: "i", scope: !309, file: !58, line: 36, type: !7)
!309 = distinct !DILexicalBlock(scope: !310, file: !58, line: 35, column: 9)
!310 = distinct !DILexicalBlock(scope: !306, file: !58, line: 34, column: 5)
!311 = !DILocation(line: 36, column: 17, scope: !309)
!312 = !DILocalVariable(name: "n", scope: !309, file: !58, line: 36, type: !7)
!313 = !DILocation(line: 36, column: 20, scope: !309)
!314 = !DILocalVariable(name: "intVariable", scope: !309, file: !58, line: 36, type: !7)
!315 = !DILocation(line: 36, column: 23, scope: !309)
!316 = !DILocation(line: 37, column: 24, scope: !317)
!317 = distinct !DILexicalBlock(scope: !309, file: !58, line: 37, column: 17)
!318 = !DILocation(line: 37, column: 17, scope: !317)
!319 = !DILocation(line: 37, column: 40, scope: !317)
!320 = !DILocation(line: 37, column: 17, scope: !309)
!321 = !DILocation(line: 40, column: 29, scope: !322)
!322 = distinct !DILexicalBlock(scope: !317, file: !58, line: 38, column: 13)
!323 = !DILocation(line: 41, column: 24, scope: !324)
!324 = distinct !DILexicalBlock(scope: !322, file: !58, line: 41, column: 17)
!325 = !DILocation(line: 41, column: 22, scope: !324)
!326 = !DILocation(line: 41, column: 29, scope: !327)
!327 = distinct !DILexicalBlock(scope: !324, file: !58, line: 41, column: 17)
!328 = !DILocation(line: 41, column: 33, scope: !327)
!329 = !DILocation(line: 41, column: 31, scope: !327)
!330 = !DILocation(line: 41, column: 17, scope: !324)
!331 = !DILocation(line: 44, column: 32, scope: !332)
!332 = distinct !DILexicalBlock(scope: !327, file: !58, line: 42, column: 17)
!333 = !DILocation(line: 45, column: 17, scope: !332)
!334 = !DILocation(line: 41, column: 37, scope: !327)
!335 = !DILocation(line: 41, column: 17, scope: !327)
!336 = distinct !{!336, !330, !337, !338}
!337 = !DILocation(line: 45, column: 17, scope: !324)
!338 = !{!"llvm.loop.mustprogress"}
!339 = !DILocation(line: 46, column: 30, scope: !322)
!340 = !DILocation(line: 46, column: 17, scope: !322)
!341 = !DILocation(line: 47, column: 13, scope: !322)
!342 = !DILocation(line: 49, column: 5, scope: !310)
!343 = !DILocation(line: 50, column: 1, scope: !300)
!344 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_22_goodB2G1Sink", scope: !58, file: !58, line: 62, type: !301, scopeLine: 63, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!345 = !DILocalVariable(name: "data", arg: 1, scope: !344, file: !58, line: 62, type: !55)
!346 = !DILocation(line: 62, column: 72, scope: !344)
!347 = !DILocation(line: 64, column: 8, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !58, line: 64, column: 8)
!349 = !DILocation(line: 64, column: 8, scope: !344)
!350 = !DILocation(line: 67, column: 9, scope: !351)
!351 = distinct !DILexicalBlock(scope: !348, file: !58, line: 65, column: 5)
!352 = !DILocation(line: 68, column: 5, scope: !351)
!353 = !DILocalVariable(name: "i", scope: !354, file: !58, line: 72, type: !7)
!354 = distinct !DILexicalBlock(scope: !355, file: !58, line: 71, column: 9)
!355 = distinct !DILexicalBlock(scope: !348, file: !58, line: 70, column: 5)
!356 = !DILocation(line: 72, column: 17, scope: !354)
!357 = !DILocalVariable(name: "n", scope: !354, file: !58, line: 72, type: !7)
!358 = !DILocation(line: 72, column: 20, scope: !354)
!359 = !DILocalVariable(name: "intVariable", scope: !354, file: !58, line: 72, type: !7)
!360 = !DILocation(line: 72, column: 23, scope: !354)
!361 = !DILocation(line: 73, column: 24, scope: !362)
!362 = distinct !DILexicalBlock(scope: !354, file: !58, line: 73, column: 17)
!363 = !DILocation(line: 73, column: 17, scope: !362)
!364 = !DILocation(line: 73, column: 40, scope: !362)
!365 = !DILocation(line: 73, column: 17, scope: !354)
!366 = !DILocation(line: 76, column: 21, scope: !367)
!367 = distinct !DILexicalBlock(scope: !368, file: !58, line: 76, column: 21)
!368 = distinct !DILexicalBlock(scope: !362, file: !58, line: 74, column: 13)
!369 = !DILocation(line: 76, column: 23, scope: !367)
!370 = !DILocation(line: 76, column: 21, scope: !368)
!371 = !DILocation(line: 78, column: 33, scope: !372)
!372 = distinct !DILexicalBlock(scope: !367, file: !58, line: 77, column: 17)
!373 = !DILocation(line: 79, column: 28, scope: !374)
!374 = distinct !DILexicalBlock(scope: !372, file: !58, line: 79, column: 21)
!375 = !DILocation(line: 79, column: 26, scope: !374)
!376 = !DILocation(line: 79, column: 33, scope: !377)
!377 = distinct !DILexicalBlock(scope: !374, file: !58, line: 79, column: 21)
!378 = !DILocation(line: 79, column: 37, scope: !377)
!379 = !DILocation(line: 79, column: 35, scope: !377)
!380 = !DILocation(line: 79, column: 21, scope: !374)
!381 = !DILocation(line: 82, column: 36, scope: !382)
!382 = distinct !DILexicalBlock(scope: !377, file: !58, line: 80, column: 21)
!383 = !DILocation(line: 83, column: 21, scope: !382)
!384 = !DILocation(line: 79, column: 41, scope: !377)
!385 = !DILocation(line: 79, column: 21, scope: !377)
!386 = distinct !{!386, !380, !387, !338}
!387 = !DILocation(line: 83, column: 21, scope: !374)
!388 = !DILocation(line: 84, column: 34, scope: !372)
!389 = !DILocation(line: 84, column: 21, scope: !372)
!390 = !DILocation(line: 85, column: 17, scope: !372)
!391 = !DILocation(line: 86, column: 13, scope: !368)
!392 = !DILocation(line: 89, column: 1, scope: !344)
!393 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_22_goodB2G2Sink", scope: !58, file: !58, line: 92, type: !301, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!394 = !DILocalVariable(name: "data", arg: 1, scope: !393, file: !58, line: 92, type: !55)
!395 = !DILocation(line: 92, column: 72, scope: !393)
!396 = !DILocation(line: 94, column: 8, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !58, line: 94, column: 8)
!398 = !DILocation(line: 94, column: 8, scope: !393)
!399 = !DILocalVariable(name: "i", scope: !400, file: !58, line: 97, type: !7)
!400 = distinct !DILexicalBlock(scope: !401, file: !58, line: 96, column: 9)
!401 = distinct !DILexicalBlock(scope: !397, file: !58, line: 95, column: 5)
!402 = !DILocation(line: 97, column: 17, scope: !400)
!403 = !DILocalVariable(name: "n", scope: !400, file: !58, line: 97, type: !7)
!404 = !DILocation(line: 97, column: 20, scope: !400)
!405 = !DILocalVariable(name: "intVariable", scope: !400, file: !58, line: 97, type: !7)
!406 = !DILocation(line: 97, column: 23, scope: !400)
!407 = !DILocation(line: 98, column: 24, scope: !408)
!408 = distinct !DILexicalBlock(scope: !400, file: !58, line: 98, column: 17)
!409 = !DILocation(line: 98, column: 17, scope: !408)
!410 = !DILocation(line: 98, column: 40, scope: !408)
!411 = !DILocation(line: 98, column: 17, scope: !400)
!412 = !DILocation(line: 101, column: 21, scope: !413)
!413 = distinct !DILexicalBlock(scope: !414, file: !58, line: 101, column: 21)
!414 = distinct !DILexicalBlock(scope: !408, file: !58, line: 99, column: 13)
!415 = !DILocation(line: 101, column: 23, scope: !413)
!416 = !DILocation(line: 101, column: 21, scope: !414)
!417 = !DILocation(line: 103, column: 33, scope: !418)
!418 = distinct !DILexicalBlock(scope: !413, file: !58, line: 102, column: 17)
!419 = !DILocation(line: 104, column: 28, scope: !420)
!420 = distinct !DILexicalBlock(scope: !418, file: !58, line: 104, column: 21)
!421 = !DILocation(line: 104, column: 26, scope: !420)
!422 = !DILocation(line: 104, column: 33, scope: !423)
!423 = distinct !DILexicalBlock(scope: !420, file: !58, line: 104, column: 21)
!424 = !DILocation(line: 104, column: 37, scope: !423)
!425 = !DILocation(line: 104, column: 35, scope: !423)
!426 = !DILocation(line: 104, column: 21, scope: !420)
!427 = !DILocation(line: 107, column: 36, scope: !428)
!428 = distinct !DILexicalBlock(scope: !423, file: !58, line: 105, column: 21)
!429 = !DILocation(line: 108, column: 21, scope: !428)
!430 = !DILocation(line: 104, column: 41, scope: !423)
!431 = !DILocation(line: 104, column: 21, scope: !423)
!432 = distinct !{!432, !426, !433, !338}
!433 = !DILocation(line: 108, column: 21, scope: !420)
!434 = !DILocation(line: 109, column: 34, scope: !418)
!435 = !DILocation(line: 109, column: 21, scope: !418)
!436 = !DILocation(line: 110, column: 17, scope: !418)
!437 = !DILocation(line: 111, column: 13, scope: !414)
!438 = !DILocation(line: 113, column: 5, scope: !401)
!439 = !DILocation(line: 114, column: 1, scope: !393)
!440 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_22_goodG2BSink", scope: !58, file: !58, line: 117, type: !301, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !57, retainedNodes: !4)
!441 = !DILocalVariable(name: "data", arg: 1, scope: !440, file: !58, line: 117, type: !55)
!442 = !DILocation(line: 117, column: 71, scope: !440)
!443 = !DILocation(line: 119, column: 8, scope: !444)
!444 = distinct !DILexicalBlock(scope: !440, file: !58, line: 119, column: 8)
!445 = !DILocation(line: 119, column: 8, scope: !440)
!446 = !DILocalVariable(name: "i", scope: !447, file: !58, line: 122, type: !7)
!447 = distinct !DILexicalBlock(scope: !448, file: !58, line: 121, column: 9)
!448 = distinct !DILexicalBlock(scope: !444, file: !58, line: 120, column: 5)
!449 = !DILocation(line: 122, column: 17, scope: !447)
!450 = !DILocalVariable(name: "n", scope: !447, file: !58, line: 122, type: !7)
!451 = !DILocation(line: 122, column: 20, scope: !447)
!452 = !DILocalVariable(name: "intVariable", scope: !447, file: !58, line: 122, type: !7)
!453 = !DILocation(line: 122, column: 23, scope: !447)
!454 = !DILocation(line: 123, column: 24, scope: !455)
!455 = distinct !DILexicalBlock(scope: !447, file: !58, line: 123, column: 17)
!456 = !DILocation(line: 123, column: 17, scope: !455)
!457 = !DILocation(line: 123, column: 40, scope: !455)
!458 = !DILocation(line: 123, column: 17, scope: !447)
!459 = !DILocation(line: 126, column: 29, scope: !460)
!460 = distinct !DILexicalBlock(scope: !455, file: !58, line: 124, column: 13)
!461 = !DILocation(line: 127, column: 24, scope: !462)
!462 = distinct !DILexicalBlock(scope: !460, file: !58, line: 127, column: 17)
!463 = !DILocation(line: 127, column: 22, scope: !462)
!464 = !DILocation(line: 127, column: 29, scope: !465)
!465 = distinct !DILexicalBlock(scope: !462, file: !58, line: 127, column: 17)
!466 = !DILocation(line: 127, column: 33, scope: !465)
!467 = !DILocation(line: 127, column: 31, scope: !465)
!468 = !DILocation(line: 127, column: 17, scope: !462)
!469 = !DILocation(line: 130, column: 32, scope: !470)
!470 = distinct !DILexicalBlock(scope: !465, file: !58, line: 128, column: 17)
!471 = !DILocation(line: 131, column: 17, scope: !470)
!472 = !DILocation(line: 127, column: 37, scope: !465)
!473 = !DILocation(line: 127, column: 17, scope: !465)
!474 = distinct !{!474, !468, !475, !338}
!475 = !DILocation(line: 131, column: 17, scope: !462)
!476 = !DILocation(line: 132, column: 30, scope: !460)
!477 = !DILocation(line: 132, column: 17, scope: !460)
!478 = !DILocation(line: 133, column: 13, scope: !460)
!479 = !DILocation(line: 135, column: 5, scope: !448)
!480 = !DILocation(line: 136, column: 1, scope: !440)
!481 = distinct !DISubprogram(name: "printLine", scope: !18, file: !18, line: 11, type: !301, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!482 = !DILocalVariable(name: "line", arg: 1, scope: !481, file: !18, line: 11, type: !55)
!483 = !DILocation(line: 11, column: 25, scope: !481)
!484 = !DILocation(line: 13, column: 1, scope: !481)
!485 = !DILocation(line: 14, column: 8, scope: !486)
!486 = distinct !DILexicalBlock(scope: !481, file: !18, line: 14, column: 8)
!487 = !DILocation(line: 14, column: 13, scope: !486)
!488 = !DILocation(line: 14, column: 8, scope: !481)
!489 = !DILocation(line: 16, column: 24, scope: !490)
!490 = distinct !DILexicalBlock(scope: !486, file: !18, line: 15, column: 5)
!491 = !DILocation(line: 16, column: 9, scope: !490)
!492 = !DILocation(line: 17, column: 5, scope: !490)
!493 = !DILocation(line: 18, column: 5, scope: !481)
!494 = !DILocation(line: 19, column: 1, scope: !481)
!495 = distinct !DISubprogram(name: "printSinkLine", scope: !18, file: !18, line: 20, type: !301, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!496 = !DILocalVariable(name: "line", arg: 1, scope: !495, file: !18, line: 20, type: !55)
!497 = !DILocation(line: 20, column: 29, scope: !495)
!498 = !DILocation(line: 22, column: 8, scope: !499)
!499 = distinct !DILexicalBlock(scope: !495, file: !18, line: 22, column: 8)
!500 = !DILocation(line: 22, column: 13, scope: !499)
!501 = !DILocation(line: 22, column: 8, scope: !495)
!502 = !DILocation(line: 24, column: 24, scope: !503)
!503 = distinct !DILexicalBlock(scope: !499, file: !18, line: 23, column: 5)
!504 = !DILocation(line: 24, column: 9, scope: !503)
!505 = !DILocation(line: 25, column: 5, scope: !503)
!506 = !DILocation(line: 26, column: 1, scope: !495)
!507 = distinct !DISubprogram(name: "printWLine", scope: !18, file: !18, line: 27, type: !508, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !510}
!510 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !511, size: 64)
!511 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !78, line: 74, baseType: !7)
!512 = !DILocalVariable(name: "line", arg: 1, scope: !507, file: !18, line: 27, type: !510)
!513 = !DILocation(line: 27, column: 29, scope: !507)
!514 = !DILocation(line: 29, column: 8, scope: !515)
!515 = distinct !DILexicalBlock(scope: !507, file: !18, line: 29, column: 8)
!516 = !DILocation(line: 29, column: 13, scope: !515)
!517 = !DILocation(line: 29, column: 8, scope: !507)
!518 = !DILocation(line: 31, column: 27, scope: !519)
!519 = distinct !DILexicalBlock(scope: !515, file: !18, line: 30, column: 5)
!520 = !DILocation(line: 31, column: 9, scope: !519)
!521 = !DILocation(line: 32, column: 5, scope: !519)
!522 = !DILocation(line: 33, column: 1, scope: !507)
!523 = distinct !DISubprogram(name: "printIntLine", scope: !18, file: !18, line: 35, type: !524, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !7}
!526 = !DILocalVariable(name: "intNumber", arg: 1, scope: !523, file: !18, line: 35, type: !7)
!527 = !DILocation(line: 35, column: 24, scope: !523)
!528 = !DILocation(line: 37, column: 20, scope: !523)
!529 = !DILocation(line: 37, column: 5, scope: !523)
!530 = !DILocation(line: 38, column: 1, scope: !523)
!531 = distinct !DISubprogram(name: "printShortLine", scope: !18, file: !18, line: 40, type: !532, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !534}
!534 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!535 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !531, file: !18, line: 40, type: !534)
!536 = !DILocation(line: 40, column: 28, scope: !531)
!537 = !DILocation(line: 42, column: 21, scope: !531)
!538 = !DILocation(line: 42, column: 5, scope: !531)
!539 = !DILocation(line: 43, column: 1, scope: !531)
!540 = distinct !DISubprogram(name: "printFloatLine", scope: !18, file: !18, line: 45, type: !541, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!541 = !DISubroutineType(types: !542)
!542 = !{null, !543}
!543 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!544 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !540, file: !18, line: 45, type: !543)
!545 = !DILocation(line: 45, column: 28, scope: !540)
!546 = !DILocation(line: 47, column: 20, scope: !540)
!547 = !DILocation(line: 47, column: 5, scope: !540)
!548 = !DILocation(line: 48, column: 1, scope: !540)
!549 = distinct !DISubprogram(name: "printLongLine", scope: !18, file: !18, line: 50, type: !550, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !112}
!552 = !DILocalVariable(name: "longNumber", arg: 1, scope: !549, file: !18, line: 50, type: !112)
!553 = !DILocation(line: 50, column: 26, scope: !549)
!554 = !DILocation(line: 52, column: 21, scope: !549)
!555 = !DILocation(line: 52, column: 5, scope: !549)
!556 = !DILocation(line: 53, column: 1, scope: !549)
!557 = distinct !DISubprogram(name: "printLongLongLine", scope: !18, file: !18, line: 55, type: !558, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!558 = !DISubroutineType(types: !559)
!559 = !{null, !560}
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !561, line: 27, baseType: !562)
!561 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !111, line: 44, baseType: !112)
!563 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !557, file: !18, line: 55, type: !560)
!564 = !DILocation(line: 55, column: 33, scope: !557)
!565 = !DILocation(line: 57, column: 29, scope: !557)
!566 = !DILocation(line: 57, column: 5, scope: !557)
!567 = !DILocation(line: 58, column: 1, scope: !557)
!568 = distinct !DISubprogram(name: "printSizeTLine", scope: !18, file: !18, line: 60, type: !569, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !77}
!571 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !568, file: !18, line: 60, type: !77)
!572 = !DILocation(line: 60, column: 29, scope: !568)
!573 = !DILocation(line: 62, column: 21, scope: !568)
!574 = !DILocation(line: 62, column: 5, scope: !568)
!575 = !DILocation(line: 63, column: 1, scope: !568)
!576 = distinct !DISubprogram(name: "printHexCharLine", scope: !18, file: !18, line: 65, type: !577, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !56}
!579 = !DILocalVariable(name: "charHex", arg: 1, scope: !576, file: !18, line: 65, type: !56)
!580 = !DILocation(line: 65, column: 29, scope: !576)
!581 = !DILocation(line: 67, column: 22, scope: !576)
!582 = !DILocation(line: 67, column: 5, scope: !576)
!583 = !DILocation(line: 68, column: 1, scope: !576)
!584 = distinct !DISubprogram(name: "printWcharLine", scope: !18, file: !18, line: 70, type: !585, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !511}
!587 = !DILocalVariable(name: "wideChar", arg: 1, scope: !584, file: !18, line: 70, type: !511)
!588 = !DILocation(line: 70, column: 29, scope: !584)
!589 = !DILocalVariable(name: "s", scope: !584, file: !18, line: 74, type: !590)
!590 = !DICompositeType(tag: DW_TAG_array_type, baseType: !511, size: 64, elements: !591)
!591 = !{!592}
!592 = !DISubrange(count: 2)
!593 = !DILocation(line: 74, column: 13, scope: !584)
!594 = !DILocation(line: 75, column: 16, scope: !584)
!595 = !DILocation(line: 75, column: 9, scope: !584)
!596 = !DILocation(line: 75, column: 14, scope: !584)
!597 = !DILocation(line: 76, column: 9, scope: !584)
!598 = !DILocation(line: 76, column: 14, scope: !584)
!599 = !DILocation(line: 77, column: 21, scope: !584)
!600 = !DILocation(line: 77, column: 5, scope: !584)
!601 = !DILocation(line: 78, column: 1, scope: !584)
!602 = distinct !DISubprogram(name: "printUnsignedLine", scope: !18, file: !18, line: 80, type: !603, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!603 = !DISubroutineType(types: !604)
!604 = !{null, !22}
!605 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !602, file: !18, line: 80, type: !22)
!606 = !DILocation(line: 80, column: 33, scope: !602)
!607 = !DILocation(line: 82, column: 20, scope: !602)
!608 = !DILocation(line: 82, column: 5, scope: !602)
!609 = !DILocation(line: 83, column: 1, scope: !602)
!610 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !18, file: !18, line: 85, type: !611, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !38}
!613 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !610, file: !18, line: 85, type: !38)
!614 = !DILocation(line: 85, column: 45, scope: !610)
!615 = !DILocation(line: 87, column: 22, scope: !610)
!616 = !DILocation(line: 87, column: 5, scope: !610)
!617 = !DILocation(line: 88, column: 1, scope: !610)
!618 = distinct !DISubprogram(name: "printDoubleLine", scope: !18, file: !18, line: 90, type: !619, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !621}
!621 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!622 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !618, file: !18, line: 90, type: !621)
!623 = !DILocation(line: 90, column: 29, scope: !618)
!624 = !DILocation(line: 92, column: 20, scope: !618)
!625 = !DILocation(line: 92, column: 5, scope: !618)
!626 = !DILocation(line: 93, column: 1, scope: !618)
!627 = distinct !DISubprogram(name: "printStructLine", scope: !18, file: !18, line: 95, type: !628, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !631, size: 64)
!631 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !632, line: 100, baseType: !633)
!632 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_093/source_code")
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !632, line: 96, size: 64, elements: !634)
!634 = !{!635, !636}
!635 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !633, file: !632, line: 98, baseType: !7, size: 32)
!636 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !633, file: !632, line: 99, baseType: !7, size: 32, offset: 32)
!637 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !627, file: !18, line: 95, type: !630)
!638 = !DILocation(line: 95, column: 40, scope: !627)
!639 = !DILocation(line: 97, column: 26, scope: !627)
!640 = !DILocation(line: 97, column: 47, scope: !627)
!641 = !DILocation(line: 97, column: 55, scope: !627)
!642 = !DILocation(line: 97, column: 76, scope: !627)
!643 = !DILocation(line: 97, column: 5, scope: !627)
!644 = !DILocation(line: 98, column: 1, scope: !627)
!645 = distinct !DISubprogram(name: "printBytesLine", scope: !18, file: !18, line: 100, type: !646, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!646 = !DISubroutineType(types: !647)
!647 = !{null, !648, !77}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!649 = !DILocalVariable(name: "bytes", arg: 1, scope: !645, file: !18, line: 100, type: !648)
!650 = !DILocation(line: 100, column: 38, scope: !645)
!651 = !DILocalVariable(name: "numBytes", arg: 2, scope: !645, file: !18, line: 100, type: !77)
!652 = !DILocation(line: 100, column: 52, scope: !645)
!653 = !DILocalVariable(name: "i", scope: !645, file: !18, line: 102, type: !77)
!654 = !DILocation(line: 102, column: 12, scope: !645)
!655 = !DILocation(line: 103, column: 12, scope: !656)
!656 = distinct !DILexicalBlock(scope: !645, file: !18, line: 103, column: 5)
!657 = !DILocation(line: 103, column: 10, scope: !656)
!658 = !DILocation(line: 103, column: 17, scope: !659)
!659 = distinct !DILexicalBlock(scope: !656, file: !18, line: 103, column: 5)
!660 = !DILocation(line: 103, column: 21, scope: !659)
!661 = !DILocation(line: 103, column: 19, scope: !659)
!662 = !DILocation(line: 103, column: 5, scope: !656)
!663 = !DILocation(line: 105, column: 24, scope: !664)
!664 = distinct !DILexicalBlock(scope: !659, file: !18, line: 104, column: 5)
!665 = !DILocation(line: 105, column: 30, scope: !664)
!666 = !DILocation(line: 105, column: 9, scope: !664)
!667 = !DILocation(line: 106, column: 5, scope: !664)
!668 = !DILocation(line: 103, column: 31, scope: !659)
!669 = !DILocation(line: 103, column: 5, scope: !659)
!670 = distinct !{!670, !662, !671, !338}
!671 = !DILocation(line: 106, column: 5, scope: !656)
!672 = !DILocation(line: 107, column: 5, scope: !645)
!673 = !DILocation(line: 108, column: 1, scope: !645)
!674 = distinct !DISubprogram(name: "decodeHexChars", scope: !18, file: !18, line: 113, type: !675, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!675 = !DISubroutineType(types: !676)
!676 = !{!77, !648, !77, !55}
!677 = !DILocalVariable(name: "bytes", arg: 1, scope: !674, file: !18, line: 113, type: !648)
!678 = !DILocation(line: 113, column: 39, scope: !674)
!679 = !DILocalVariable(name: "numBytes", arg: 2, scope: !674, file: !18, line: 113, type: !77)
!680 = !DILocation(line: 113, column: 53, scope: !674)
!681 = !DILocalVariable(name: "hex", arg: 3, scope: !674, file: !18, line: 113, type: !55)
!682 = !DILocation(line: 113, column: 71, scope: !674)
!683 = !DILocalVariable(name: "numWritten", scope: !674, file: !18, line: 115, type: !77)
!684 = !DILocation(line: 115, column: 12, scope: !674)
!685 = !DILocation(line: 121, column: 5, scope: !674)
!686 = !DILocation(line: 121, column: 12, scope: !674)
!687 = !DILocation(line: 121, column: 25, scope: !674)
!688 = !DILocation(line: 121, column: 23, scope: !674)
!689 = !DILocation(line: 121, column: 34, scope: !674)
!690 = !DILocation(line: 121, column: 37, scope: !674)
!691 = !DILocation(line: 121, column: 67, scope: !674)
!692 = !DILocation(line: 121, column: 70, scope: !674)
!693 = !DILocation(line: 0, scope: !674)
!694 = !DILocalVariable(name: "byte", scope: !695, file: !18, line: 123, type: !7)
!695 = distinct !DILexicalBlock(scope: !674, file: !18, line: 122, column: 5)
