; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.9 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_52a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_104/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_52b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_104/source_code")
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !51, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!51 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_52c.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_104/source_code")
!52 = !{!"clang version 12.0.0"}
!53 = !{i32 7, !"Dwarf Version", i32 4}
!54 = !{i32 2, !"Debug Info Version", i32 3}
!55 = !{i32 1, !"wchar_size", i32 4}
!56 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52_bad", scope: !45, file: !45, line: 37, type: !57, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!57 = !DISubroutineType(types: !58)
!58 = !{null}
!59 = !DILocalVariable(name: "data", scope: !56, file: !45, line: 39, type: !42)
!60 = !DILocation(line: 39, column: 12, scope: !56)
!61 = !DILocalVariable(name: "dataBuffer", scope: !56, file: !45, line: 40, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DILocation(line: 40, column: 10, scope: !56)
!66 = !DILocation(line: 41, column: 12, scope: !56)
!67 = !DILocation(line: 41, column: 10, scope: !56)
!68 = !DILocalVariable(name: "dataLen", scope: !69, file: !45, line: 44, type: !70)
!69 = distinct !DILexicalBlock(scope: !56, file: !45, line: 42, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 44, column: 16, scope: !69)
!74 = !DILocation(line: 44, column: 33, scope: !69)
!75 = !DILocation(line: 44, column: 26, scope: !69)
!76 = !DILocalVariable(name: "pFile", scope: !69, file: !45, line: 45, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !23, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !42, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !42, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !42, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !42, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !42, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !42, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !42, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !42, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !42, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !42, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !42, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !23, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !23, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !24, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !22, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !23, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 45, column: 16, scope: !69)
!133 = !DILocation(line: 47, column: 17, scope: !134)
!134 = distinct !DILexicalBlock(scope: !69, file: !45, line: 47, column: 13)
!135 = !DILocation(line: 47, column: 16, scope: !134)
!136 = !DILocation(line: 47, column: 25, scope: !134)
!137 = !DILocation(line: 47, column: 13, scope: !69)
!138 = !DILocation(line: 49, column: 21, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !45, line: 48, column: 9)
!140 = !DILocation(line: 49, column: 19, scope: !139)
!141 = !DILocation(line: 50, column: 17, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !45, line: 50, column: 17)
!143 = !DILocation(line: 50, column: 23, scope: !142)
!144 = !DILocation(line: 50, column: 17, scope: !139)
!145 = !DILocation(line: 53, column: 27, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !45, line: 53, column: 21)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 51, column: 13)
!148 = !DILocation(line: 53, column: 32, scope: !146)
!149 = !DILocation(line: 53, column: 31, scope: !146)
!150 = !DILocation(line: 53, column: 51, scope: !146)
!151 = !DILocation(line: 53, column: 50, scope: !146)
!152 = !DILocation(line: 53, column: 41, scope: !146)
!153 = !DILocation(line: 53, column: 61, scope: !146)
!154 = !DILocation(line: 53, column: 21, scope: !146)
!155 = !DILocation(line: 53, column: 68, scope: !146)
!156 = !DILocation(line: 53, column: 21, scope: !147)
!157 = !DILocation(line: 55, column: 21, scope: !158)
!158 = distinct !DILexicalBlock(scope: !146, file: !45, line: 54, column: 17)
!159 = !DILocation(line: 57, column: 21, scope: !158)
!160 = !DILocation(line: 57, column: 26, scope: !158)
!161 = !DILocation(line: 57, column: 35, scope: !158)
!162 = !DILocation(line: 58, column: 17, scope: !158)
!163 = !DILocation(line: 59, column: 24, scope: !147)
!164 = !DILocation(line: 59, column: 17, scope: !147)
!165 = !DILocation(line: 60, column: 13, scope: !147)
!166 = !DILocation(line: 61, column: 9, scope: !139)
!167 = !DILocation(line: 63, column: 60, scope: !56)
!168 = !DILocation(line: 63, column: 5, scope: !56)
!169 = !DILocation(line: 64, column: 1, scope: !56)
!170 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 72, type: !57, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!171 = !DILocalVariable(name: "data", scope: !170, file: !45, line: 74, type: !42)
!172 = !DILocation(line: 74, column: 12, scope: !170)
!173 = !DILocalVariable(name: "dataBuffer", scope: !170, file: !45, line: 75, type: !62)
!174 = !DILocation(line: 75, column: 10, scope: !170)
!175 = !DILocation(line: 76, column: 12, scope: !170)
!176 = !DILocation(line: 76, column: 10, scope: !170)
!177 = !DILocation(line: 78, column: 12, scope: !170)
!178 = !DILocation(line: 78, column: 5, scope: !170)
!179 = !DILocation(line: 79, column: 64, scope: !170)
!180 = !DILocation(line: 79, column: 5, scope: !170)
!181 = !DILocation(line: 80, column: 1, scope: !170)
!182 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 84, type: !57, scopeLine: 85, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!183 = !DILocalVariable(name: "data", scope: !182, file: !45, line: 86, type: !42)
!184 = !DILocation(line: 86, column: 12, scope: !182)
!185 = !DILocalVariable(name: "dataBuffer", scope: !182, file: !45, line: 87, type: !62)
!186 = !DILocation(line: 87, column: 10, scope: !182)
!187 = !DILocation(line: 88, column: 12, scope: !182)
!188 = !DILocation(line: 88, column: 10, scope: !182)
!189 = !DILocalVariable(name: "dataLen", scope: !190, file: !45, line: 91, type: !70)
!190 = distinct !DILexicalBlock(scope: !182, file: !45, line: 89, column: 5)
!191 = !DILocation(line: 91, column: 16, scope: !190)
!192 = !DILocation(line: 91, column: 33, scope: !190)
!193 = !DILocation(line: 91, column: 26, scope: !190)
!194 = !DILocalVariable(name: "pFile", scope: !190, file: !45, line: 92, type: !77)
!195 = !DILocation(line: 92, column: 16, scope: !190)
!196 = !DILocation(line: 94, column: 17, scope: !197)
!197 = distinct !DILexicalBlock(scope: !190, file: !45, line: 94, column: 13)
!198 = !DILocation(line: 94, column: 16, scope: !197)
!199 = !DILocation(line: 94, column: 25, scope: !197)
!200 = !DILocation(line: 94, column: 13, scope: !190)
!201 = !DILocation(line: 96, column: 21, scope: !202)
!202 = distinct !DILexicalBlock(scope: !197, file: !45, line: 95, column: 9)
!203 = !DILocation(line: 96, column: 19, scope: !202)
!204 = !DILocation(line: 97, column: 17, scope: !205)
!205 = distinct !DILexicalBlock(scope: !202, file: !45, line: 97, column: 17)
!206 = !DILocation(line: 97, column: 23, scope: !205)
!207 = !DILocation(line: 97, column: 17, scope: !202)
!208 = !DILocation(line: 100, column: 27, scope: !209)
!209 = distinct !DILexicalBlock(scope: !210, file: !45, line: 100, column: 21)
!210 = distinct !DILexicalBlock(scope: !205, file: !45, line: 98, column: 13)
!211 = !DILocation(line: 100, column: 32, scope: !209)
!212 = !DILocation(line: 100, column: 31, scope: !209)
!213 = !DILocation(line: 100, column: 51, scope: !209)
!214 = !DILocation(line: 100, column: 50, scope: !209)
!215 = !DILocation(line: 100, column: 41, scope: !209)
!216 = !DILocation(line: 100, column: 61, scope: !209)
!217 = !DILocation(line: 100, column: 21, scope: !209)
!218 = !DILocation(line: 100, column: 68, scope: !209)
!219 = !DILocation(line: 100, column: 21, scope: !210)
!220 = !DILocation(line: 102, column: 21, scope: !221)
!221 = distinct !DILexicalBlock(scope: !209, file: !45, line: 101, column: 17)
!222 = !DILocation(line: 104, column: 21, scope: !221)
!223 = !DILocation(line: 104, column: 26, scope: !221)
!224 = !DILocation(line: 104, column: 35, scope: !221)
!225 = !DILocation(line: 105, column: 17, scope: !221)
!226 = !DILocation(line: 106, column: 24, scope: !210)
!227 = !DILocation(line: 106, column: 17, scope: !210)
!228 = !DILocation(line: 107, column: 13, scope: !210)
!229 = !DILocation(line: 108, column: 9, scope: !202)
!230 = !DILocation(line: 110, column: 64, scope: !182)
!231 = !DILocation(line: 110, column: 5, scope: !182)
!232 = !DILocation(line: 111, column: 1, scope: !182)
!233 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52_good", scope: !45, file: !45, line: 113, type: !57, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!234 = !DILocation(line: 115, column: 5, scope: !233)
!235 = !DILocation(line: 116, column: 5, scope: !233)
!236 = !DILocation(line: 117, column: 1, scope: !233)
!237 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52b_badSink", scope: !49, file: !49, line: 37, type: !238, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!238 = !DISubroutineType(types: !239)
!239 = !{null, !42}
!240 = !DILocalVariable(name: "data", arg: 1, scope: !237, file: !49, line: 37, type: !42)
!241 = !DILocation(line: 37, column: 68, scope: !237)
!242 = !DILocation(line: 39, column: 60, scope: !237)
!243 = !DILocation(line: 39, column: 5, scope: !237)
!244 = !DILocation(line: 40, column: 1, scope: !237)
!245 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52b_goodG2BSink", scope: !49, file: !49, line: 49, type: !238, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!246 = !DILocalVariable(name: "data", arg: 1, scope: !245, file: !49, line: 49, type: !42)
!247 = !DILocation(line: 49, column: 72, scope: !245)
!248 = !DILocation(line: 51, column: 64, scope: !245)
!249 = !DILocation(line: 51, column: 5, scope: !245)
!250 = !DILocation(line: 52, column: 1, scope: !245)
!251 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52b_goodB2GSink", scope: !49, file: !49, line: 57, type: !238, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!252 = !DILocalVariable(name: "data", arg: 1, scope: !251, file: !49, line: 57, type: !42)
!253 = !DILocation(line: 57, column: 72, scope: !251)
!254 = !DILocation(line: 59, column: 64, scope: !251)
!255 = !DILocation(line: 59, column: 5, scope: !251)
!256 = !DILocation(line: 60, column: 1, scope: !251)
!257 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52c_badSink", scope: !51, file: !51, line: 34, type: !238, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!258 = !DILocalVariable(name: "data", arg: 1, scope: !257, file: !51, line: 34, type: !42)
!259 = !DILocation(line: 34, column: 68, scope: !257)
!260 = !DILocalVariable(name: "i", scope: !261, file: !51, line: 37, type: !23)
!261 = distinct !DILexicalBlock(scope: !257, file: !51, line: 36, column: 5)
!262 = !DILocation(line: 37, column: 13, scope: !261)
!263 = !DILocalVariable(name: "n", scope: !261, file: !51, line: 37, type: !23)
!264 = !DILocation(line: 37, column: 16, scope: !261)
!265 = !DILocalVariable(name: "intVariable", scope: !261, file: !51, line: 37, type: !23)
!266 = !DILocation(line: 37, column: 19, scope: !261)
!267 = !DILocation(line: 38, column: 20, scope: !268)
!268 = distinct !DILexicalBlock(scope: !261, file: !51, line: 38, column: 13)
!269 = !DILocation(line: 38, column: 13, scope: !268)
!270 = !DILocation(line: 38, column: 36, scope: !268)
!271 = !DILocation(line: 38, column: 13, scope: !261)
!272 = !DILocation(line: 41, column: 25, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !51, line: 39, column: 9)
!274 = !DILocation(line: 42, column: 20, scope: !275)
!275 = distinct !DILexicalBlock(scope: !273, file: !51, line: 42, column: 13)
!276 = !DILocation(line: 42, column: 18, scope: !275)
!277 = !DILocation(line: 42, column: 25, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !51, line: 42, column: 13)
!279 = !DILocation(line: 42, column: 29, scope: !278)
!280 = !DILocation(line: 42, column: 27, scope: !278)
!281 = !DILocation(line: 42, column: 13, scope: !275)
!282 = !DILocation(line: 45, column: 28, scope: !283)
!283 = distinct !DILexicalBlock(scope: !278, file: !51, line: 43, column: 13)
!284 = !DILocation(line: 46, column: 13, scope: !283)
!285 = !DILocation(line: 42, column: 33, scope: !278)
!286 = !DILocation(line: 42, column: 13, scope: !278)
!287 = distinct !{!287, !281, !288, !289}
!288 = !DILocation(line: 46, column: 13, scope: !275)
!289 = !{!"llvm.loop.mustprogress"}
!290 = !DILocation(line: 47, column: 26, scope: !273)
!291 = !DILocation(line: 47, column: 13, scope: !273)
!292 = !DILocation(line: 48, column: 9, scope: !273)
!293 = !DILocation(line: 50, column: 1, scope: !257)
!294 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52c_goodG2BSink", scope: !51, file: !51, line: 57, type: !238, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!295 = !DILocalVariable(name: "data", arg: 1, scope: !294, file: !51, line: 57, type: !42)
!296 = !DILocation(line: 57, column: 72, scope: !294)
!297 = !DILocalVariable(name: "i", scope: !298, file: !51, line: 60, type: !23)
!298 = distinct !DILexicalBlock(scope: !294, file: !51, line: 59, column: 5)
!299 = !DILocation(line: 60, column: 13, scope: !298)
!300 = !DILocalVariable(name: "n", scope: !298, file: !51, line: 60, type: !23)
!301 = !DILocation(line: 60, column: 16, scope: !298)
!302 = !DILocalVariable(name: "intVariable", scope: !298, file: !51, line: 60, type: !23)
!303 = !DILocation(line: 60, column: 19, scope: !298)
!304 = !DILocation(line: 61, column: 20, scope: !305)
!305 = distinct !DILexicalBlock(scope: !298, file: !51, line: 61, column: 13)
!306 = !DILocation(line: 61, column: 13, scope: !305)
!307 = !DILocation(line: 61, column: 36, scope: !305)
!308 = !DILocation(line: 61, column: 13, scope: !298)
!309 = !DILocation(line: 64, column: 25, scope: !310)
!310 = distinct !DILexicalBlock(scope: !305, file: !51, line: 62, column: 9)
!311 = !DILocation(line: 65, column: 20, scope: !312)
!312 = distinct !DILexicalBlock(scope: !310, file: !51, line: 65, column: 13)
!313 = !DILocation(line: 65, column: 18, scope: !312)
!314 = !DILocation(line: 65, column: 25, scope: !315)
!315 = distinct !DILexicalBlock(scope: !312, file: !51, line: 65, column: 13)
!316 = !DILocation(line: 65, column: 29, scope: !315)
!317 = !DILocation(line: 65, column: 27, scope: !315)
!318 = !DILocation(line: 65, column: 13, scope: !312)
!319 = !DILocation(line: 68, column: 28, scope: !320)
!320 = distinct !DILexicalBlock(scope: !315, file: !51, line: 66, column: 13)
!321 = !DILocation(line: 69, column: 13, scope: !320)
!322 = !DILocation(line: 65, column: 33, scope: !315)
!323 = !DILocation(line: 65, column: 13, scope: !315)
!324 = distinct !{!324, !318, !325, !289}
!325 = !DILocation(line: 69, column: 13, scope: !312)
!326 = !DILocation(line: 70, column: 26, scope: !310)
!327 = !DILocation(line: 70, column: 13, scope: !310)
!328 = !DILocation(line: 71, column: 9, scope: !310)
!329 = !DILocation(line: 73, column: 1, scope: !294)
!330 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_52c_goodB2GSink", scope: !51, file: !51, line: 76, type: !238, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!331 = !DILocalVariable(name: "data", arg: 1, scope: !330, file: !51, line: 76, type: !42)
!332 = !DILocation(line: 76, column: 72, scope: !330)
!333 = !DILocalVariable(name: "i", scope: !334, file: !51, line: 79, type: !23)
!334 = distinct !DILexicalBlock(scope: !330, file: !51, line: 78, column: 5)
!335 = !DILocation(line: 79, column: 13, scope: !334)
!336 = !DILocalVariable(name: "n", scope: !334, file: !51, line: 79, type: !23)
!337 = !DILocation(line: 79, column: 16, scope: !334)
!338 = !DILocalVariable(name: "intVariable", scope: !334, file: !51, line: 79, type: !23)
!339 = !DILocation(line: 79, column: 19, scope: !334)
!340 = !DILocation(line: 80, column: 20, scope: !341)
!341 = distinct !DILexicalBlock(scope: !334, file: !51, line: 80, column: 13)
!342 = !DILocation(line: 80, column: 13, scope: !341)
!343 = !DILocation(line: 80, column: 36, scope: !341)
!344 = !DILocation(line: 80, column: 13, scope: !334)
!345 = !DILocation(line: 83, column: 17, scope: !346)
!346 = distinct !DILexicalBlock(scope: !347, file: !51, line: 83, column: 17)
!347 = distinct !DILexicalBlock(scope: !341, file: !51, line: 81, column: 9)
!348 = !DILocation(line: 83, column: 19, scope: !346)
!349 = !DILocation(line: 83, column: 17, scope: !347)
!350 = !DILocation(line: 85, column: 29, scope: !351)
!351 = distinct !DILexicalBlock(scope: !346, file: !51, line: 84, column: 13)
!352 = !DILocation(line: 86, column: 24, scope: !353)
!353 = distinct !DILexicalBlock(scope: !351, file: !51, line: 86, column: 17)
!354 = !DILocation(line: 86, column: 22, scope: !353)
!355 = !DILocation(line: 86, column: 29, scope: !356)
!356 = distinct !DILexicalBlock(scope: !353, file: !51, line: 86, column: 17)
!357 = !DILocation(line: 86, column: 33, scope: !356)
!358 = !DILocation(line: 86, column: 31, scope: !356)
!359 = !DILocation(line: 86, column: 17, scope: !353)
!360 = !DILocation(line: 89, column: 32, scope: !361)
!361 = distinct !DILexicalBlock(scope: !356, file: !51, line: 87, column: 17)
!362 = !DILocation(line: 90, column: 17, scope: !361)
!363 = !DILocation(line: 86, column: 37, scope: !356)
!364 = !DILocation(line: 86, column: 17, scope: !356)
!365 = distinct !{!365, !359, !366, !289}
!366 = !DILocation(line: 90, column: 17, scope: !353)
!367 = !DILocation(line: 91, column: 30, scope: !351)
!368 = !DILocation(line: 91, column: 17, scope: !351)
!369 = !DILocation(line: 92, column: 13, scope: !351)
!370 = !DILocation(line: 93, column: 9, scope: !347)
!371 = !DILocation(line: 95, column: 1, scope: !330)
!372 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !238, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DILocalVariable(name: "line", arg: 1, scope: !372, file: !3, line: 11, type: !42)
!374 = !DILocation(line: 11, column: 25, scope: !372)
!375 = !DILocation(line: 13, column: 1, scope: !372)
!376 = !DILocation(line: 14, column: 8, scope: !377)
!377 = distinct !DILexicalBlock(scope: !372, file: !3, line: 14, column: 8)
!378 = !DILocation(line: 14, column: 13, scope: !377)
!379 = !DILocation(line: 14, column: 8, scope: !372)
!380 = !DILocation(line: 16, column: 24, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !3, line: 15, column: 5)
!382 = !DILocation(line: 16, column: 9, scope: !381)
!383 = !DILocation(line: 17, column: 5, scope: !381)
!384 = !DILocation(line: 18, column: 5, scope: !372)
!385 = !DILocation(line: 19, column: 1, scope: !372)
!386 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !238, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!387 = !DILocalVariable(name: "line", arg: 1, scope: !386, file: !3, line: 20, type: !42)
!388 = !DILocation(line: 20, column: 29, scope: !386)
!389 = !DILocation(line: 22, column: 8, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !3, line: 22, column: 8)
!391 = !DILocation(line: 22, column: 13, scope: !390)
!392 = !DILocation(line: 22, column: 8, scope: !386)
!393 = !DILocation(line: 24, column: 24, scope: !394)
!394 = distinct !DILexicalBlock(scope: !390, file: !3, line: 23, column: 5)
!395 = !DILocation(line: 24, column: 9, scope: !394)
!396 = !DILocation(line: 25, column: 5, scope: !394)
!397 = !DILocation(line: 26, column: 1, scope: !386)
!398 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !399, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!399 = !DISubroutineType(types: !400)
!400 = !{null, !401}
!401 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !402, size: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !71, line: 74, baseType: !23)
!403 = !DILocalVariable(name: "line", arg: 1, scope: !398, file: !3, line: 27, type: !401)
!404 = !DILocation(line: 27, column: 29, scope: !398)
!405 = !DILocation(line: 29, column: 8, scope: !406)
!406 = distinct !DILexicalBlock(scope: !398, file: !3, line: 29, column: 8)
!407 = !DILocation(line: 29, column: 13, scope: !406)
!408 = !DILocation(line: 29, column: 8, scope: !398)
!409 = !DILocation(line: 31, column: 27, scope: !410)
!410 = distinct !DILexicalBlock(scope: !406, file: !3, line: 30, column: 5)
!411 = !DILocation(line: 31, column: 9, scope: !410)
!412 = !DILocation(line: 32, column: 5, scope: !410)
!413 = !DILocation(line: 33, column: 1, scope: !398)
!414 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !415, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !23}
!417 = !DILocalVariable(name: "intNumber", arg: 1, scope: !414, file: !3, line: 35, type: !23)
!418 = !DILocation(line: 35, column: 24, scope: !414)
!419 = !DILocation(line: 37, column: 20, scope: !414)
!420 = !DILocation(line: 37, column: 5, scope: !414)
!421 = !DILocation(line: 38, column: 1, scope: !414)
!422 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !423, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!426 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !422, file: !3, line: 40, type: !425)
!427 = !DILocation(line: 40, column: 28, scope: !422)
!428 = !DILocation(line: 42, column: 21, scope: !422)
!429 = !DILocation(line: 42, column: 5, scope: !422)
!430 = !DILocation(line: 43, column: 1, scope: !422)
!431 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !432, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !434}
!434 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!435 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !431, file: !3, line: 45, type: !434)
!436 = !DILocation(line: 45, column: 28, scope: !431)
!437 = !DILocation(line: 47, column: 20, scope: !431)
!438 = !DILocation(line: 47, column: 5, scope: !431)
!439 = !DILocation(line: 48, column: 1, scope: !431)
!440 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !441, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!441 = !DISubroutineType(types: !442)
!442 = !{null, !105}
!443 = !DILocalVariable(name: "longNumber", arg: 1, scope: !440, file: !3, line: 50, type: !105)
!444 = !DILocation(line: 50, column: 26, scope: !440)
!445 = !DILocation(line: 52, column: 21, scope: !440)
!446 = !DILocation(line: 52, column: 5, scope: !440)
!447 = !DILocation(line: 53, column: 1, scope: !440)
!448 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !449, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !451}
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !452, line: 27, baseType: !453)
!452 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 44, baseType: !105)
!454 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !448, file: !3, line: 55, type: !451)
!455 = !DILocation(line: 55, column: 33, scope: !448)
!456 = !DILocation(line: 57, column: 29, scope: !448)
!457 = !DILocation(line: 57, column: 5, scope: !448)
!458 = !DILocation(line: 58, column: 1, scope: !448)
!459 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !460, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !70}
!462 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !459, file: !3, line: 60, type: !70)
!463 = !DILocation(line: 60, column: 29, scope: !459)
!464 = !DILocation(line: 62, column: 21, scope: !459)
!465 = !DILocation(line: 62, column: 5, scope: !459)
!466 = !DILocation(line: 63, column: 1, scope: !459)
!467 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !468, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !43}
!470 = !DILocalVariable(name: "charHex", arg: 1, scope: !467, file: !3, line: 65, type: !43)
!471 = !DILocation(line: 65, column: 29, scope: !467)
!472 = !DILocation(line: 67, column: 22, scope: !467)
!473 = !DILocation(line: 67, column: 5, scope: !467)
!474 = !DILocation(line: 68, column: 1, scope: !467)
!475 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !476, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !402}
!478 = !DILocalVariable(name: "wideChar", arg: 1, scope: !475, file: !3, line: 70, type: !402)
!479 = !DILocation(line: 70, column: 29, scope: !475)
!480 = !DILocalVariable(name: "s", scope: !475, file: !3, line: 74, type: !481)
!481 = !DICompositeType(tag: DW_TAG_array_type, baseType: !402, size: 64, elements: !482)
!482 = !{!483}
!483 = !DISubrange(count: 2)
!484 = !DILocation(line: 74, column: 13, scope: !475)
!485 = !DILocation(line: 75, column: 16, scope: !475)
!486 = !DILocation(line: 75, column: 9, scope: !475)
!487 = !DILocation(line: 75, column: 14, scope: !475)
!488 = !DILocation(line: 76, column: 9, scope: !475)
!489 = !DILocation(line: 76, column: 14, scope: !475)
!490 = !DILocation(line: 77, column: 21, scope: !475)
!491 = !DILocation(line: 77, column: 5, scope: !475)
!492 = !DILocation(line: 78, column: 1, scope: !475)
!493 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !494, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!494 = !DISubroutineType(types: !495)
!495 = !{null, !7}
!496 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !493, file: !3, line: 80, type: !7)
!497 = !DILocation(line: 80, column: 33, scope: !493)
!498 = !DILocation(line: 82, column: 20, scope: !493)
!499 = !DILocation(line: 82, column: 5, scope: !493)
!500 = !DILocation(line: 83, column: 1, scope: !493)
!501 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !502, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!502 = !DISubroutineType(types: !503)
!503 = !{null, !25}
!504 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !501, file: !3, line: 85, type: !25)
!505 = !DILocation(line: 85, column: 45, scope: !501)
!506 = !DILocation(line: 87, column: 22, scope: !501)
!507 = !DILocation(line: 87, column: 5, scope: !501)
!508 = !DILocation(line: 88, column: 1, scope: !501)
!509 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !510, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !512}
!512 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!513 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !509, file: !3, line: 90, type: !512)
!514 = !DILocation(line: 90, column: 29, scope: !509)
!515 = !DILocation(line: 92, column: 20, scope: !509)
!516 = !DILocation(line: 92, column: 5, scope: !509)
!517 = !DILocation(line: 93, column: 1, scope: !509)
!518 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !519, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !522, size: 64)
!522 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !523, line: 100, baseType: !524)
!523 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_104/source_code")
!524 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !523, line: 96, size: 64, elements: !525)
!525 = !{!526, !527}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !524, file: !523, line: 98, baseType: !23, size: 32)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !524, file: !523, line: 99, baseType: !23, size: 32, offset: 32)
!528 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !518, file: !3, line: 95, type: !521)
!529 = !DILocation(line: 95, column: 40, scope: !518)
!530 = !DILocation(line: 97, column: 26, scope: !518)
!531 = !DILocation(line: 97, column: 47, scope: !518)
!532 = !DILocation(line: 97, column: 55, scope: !518)
!533 = !DILocation(line: 97, column: 76, scope: !518)
!534 = !DILocation(line: 97, column: 5, scope: !518)
!535 = !DILocation(line: 98, column: 1, scope: !518)
!536 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !537, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!537 = !DISubroutineType(types: !538)
!538 = !{null, !539, !70}
!539 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!540 = !DILocalVariable(name: "bytes", arg: 1, scope: !536, file: !3, line: 100, type: !539)
!541 = !DILocation(line: 100, column: 38, scope: !536)
!542 = !DILocalVariable(name: "numBytes", arg: 2, scope: !536, file: !3, line: 100, type: !70)
!543 = !DILocation(line: 100, column: 52, scope: !536)
!544 = !DILocalVariable(name: "i", scope: !536, file: !3, line: 102, type: !70)
!545 = !DILocation(line: 102, column: 12, scope: !536)
!546 = !DILocation(line: 103, column: 12, scope: !547)
!547 = distinct !DILexicalBlock(scope: !536, file: !3, line: 103, column: 5)
!548 = !DILocation(line: 103, column: 10, scope: !547)
!549 = !DILocation(line: 103, column: 17, scope: !550)
!550 = distinct !DILexicalBlock(scope: !547, file: !3, line: 103, column: 5)
!551 = !DILocation(line: 103, column: 21, scope: !550)
!552 = !DILocation(line: 103, column: 19, scope: !550)
!553 = !DILocation(line: 103, column: 5, scope: !547)
!554 = !DILocation(line: 105, column: 24, scope: !555)
!555 = distinct !DILexicalBlock(scope: !550, file: !3, line: 104, column: 5)
!556 = !DILocation(line: 105, column: 30, scope: !555)
!557 = !DILocation(line: 105, column: 9, scope: !555)
!558 = !DILocation(line: 106, column: 5, scope: !555)
!559 = !DILocation(line: 103, column: 31, scope: !550)
!560 = !DILocation(line: 103, column: 5, scope: !550)
!561 = distinct !{!561, !553, !562, !289}
!562 = !DILocation(line: 106, column: 5, scope: !547)
!563 = !DILocation(line: 107, column: 5, scope: !536)
!564 = !DILocation(line: 108, column: 1, scope: !536)
!565 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !566, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!566 = !DISubroutineType(types: !567)
!567 = !{!70, !539, !70, !42}
!568 = !DILocalVariable(name: "bytes", arg: 1, scope: !565, file: !3, line: 113, type: !539)
!569 = !DILocation(line: 113, column: 39, scope: !565)
!570 = !DILocalVariable(name: "numBytes", arg: 2, scope: !565, file: !3, line: 113, type: !70)
!571 = !DILocation(line: 113, column: 53, scope: !565)
!572 = !DILocalVariable(name: "hex", arg: 3, scope: !565, file: !3, line: 113, type: !42)
!573 = !DILocation(line: 113, column: 71, scope: !565)
!574 = !DILocalVariable(name: "numWritten", scope: !565, file: !3, line: 115, type: !70)
!575 = !DILocation(line: 115, column: 12, scope: !565)
!576 = !DILocation(line: 121, column: 5, scope: !565)
!577 = !DILocation(line: 121, column: 12, scope: !565)
!578 = !DILocation(line: 121, column: 25, scope: !565)
!579 = !DILocation(line: 121, column: 23, scope: !565)
!580 = !DILocation(line: 121, column: 34, scope: !565)
!581 = !DILocation(line: 121, column: 37, scope: !565)
!582 = !DILocation(line: 121, column: 67, scope: !565)
!583 = !DILocation(line: 121, column: 70, scope: !565)
!584 = !DILocation(line: 0, scope: !565)
!585 = !DILocalVariable(name: "byte", scope: !586, file: !3, line: 123, type: !23)
!586 = distinct !DILexicalBlock(scope: !565, file: !3, line: 122, column: 5)
!587 = !DILocation(line: 123, column: 13, scope: !586)
