; ModuleID = 'CWE134_Uncontrolled_Format_String__char_file_vprintf_45.c'
source_filename = "CWE134_Uncontrolled_Format_String__char_file_vprintf_45.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@CWE134_Uncontrolled_Format_String__char_file_vprintf_45_badData = dso_local global i8* null, align 8, !dbg !0
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@CWE134_Uncontrolled_Format_String__char_file_vprintf_45_goodG2BData = dso_local global i8* null, align 8, !dbg !9
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@CWE134_Uncontrolled_Format_String__char_file_vprintf_45_goodB2GData = dso_local global i8* null, align 8, !dbg !13

; Function Attrs: noinline nounwind optnone uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_45_badData", scope: !2, file: !3, line: 32, type: !11, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_45.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_182/source_code")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !13}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_45_goodG2BData", scope: !2, file: !3, line: 33, type: !11, isLocal: false, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_45_goodB2GData", scope: !2, file: !3, line: 34, type: !11, isLocal: false, isDefinition: true)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 12.0.0"}
!19 = distinct !DISubprogram(name: "badVaSink", scope: !3, file: !3, line: 38, type: !20, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !11, null}
!22 = !DILocalVariable(name: "data", arg: 1, scope: !19, file: !3, line: 38, type: !11)
!23 = !DILocation(line: 38, column: 23, scope: !19)
!24 = !DILocalVariable(name: "args", scope: !25, file: !3, line: 41, type: !26)
!25 = distinct !DILexicalBlock(scope: !19, file: !3, line: 40, column: 5)
!26 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !27, line: 52, baseType: !28)
!27 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !29, line: 32, baseType: !30)
!29 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !31)
!31 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 192, elements: !39)
!32 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !33)
!33 = !{!34, !36, !37, !38}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !32, file: !3, line: 41, baseType: !35, size: 32)
!35 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !32, file: !3, line: 41, baseType: !35, size: 32, offset: 32)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !32, file: !3, line: 41, baseType: !6, size: 64, offset: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !32, file: !3, line: 41, baseType: !6, size: 64, offset: 128)
!39 = !{!40}
!40 = !DISubrange(count: 1)
!41 = !DILocation(line: 41, column: 17, scope: !25)
!42 = !DILocation(line: 42, column: 9, scope: !25)
!43 = !DILocation(line: 44, column: 17, scope: !25)
!44 = !DILocation(line: 44, column: 23, scope: !25)
!45 = !DILocation(line: 44, column: 9, scope: !25)
!46 = !DILocation(line: 45, column: 9, scope: !25)
!47 = !DILocation(line: 47, column: 1, scope: !19)
!48 = distinct !DISubprogram(name: "badSink", scope: !3, file: !3, line: 49, type: !49, scopeLine: 50, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!49 = !DISubroutineType(types: !50)
!50 = !{null}
!51 = !DILocalVariable(name: "data", scope: !48, file: !3, line: 51, type: !11)
!52 = !DILocation(line: 51, column: 12, scope: !48)
!53 = !DILocation(line: 51, column: 19, scope: !48)
!54 = !DILocation(line: 52, column: 15, scope: !48)
!55 = !DILocation(line: 52, column: 21, scope: !48)
!56 = !DILocation(line: 52, column: 5, scope: !48)
!57 = !DILocation(line: 53, column: 1, scope: !48)
!58 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_45_bad", scope: !3, file: !3, line: 55, type: !49, scopeLine: 56, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!59 = !DILocalVariable(name: "data", scope: !58, file: !3, line: 57, type: !11)
!60 = !DILocation(line: 57, column: 12, scope: !58)
!61 = !DILocalVariable(name: "dataBuffer", scope: !58, file: !3, line: 58, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 800, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DILocation(line: 58, column: 10, scope: !58)
!66 = !DILocation(line: 59, column: 12, scope: !58)
!67 = !DILocation(line: 59, column: 10, scope: !58)
!68 = !DILocalVariable(name: "dataLen", scope: !69, file: !3, line: 62, type: !70)
!69 = distinct !DILexicalBlock(scope: !58, file: !3, line: 60, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 62, column: 16, scope: !69)
!74 = !DILocation(line: 62, column: 33, scope: !69)
!75 = !DILocation(line: 62, column: 26, scope: !69)
!76 = !DILocalVariable(name: "pFile", scope: !69, file: !3, line: 63, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !108, !110, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !7, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !11, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !11, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !11, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !11, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !11, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !11, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !11, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !11, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !11, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !11, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !11, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !7, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !7, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !107, size: 16, offset: 1024)
!107 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !109, size: 8, offset: 1040)
!109 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !111, size: 8, offset: 1048)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !39)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !6, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !7, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocation(line: 63, column: 16, scope: !69)
!132 = !DILocation(line: 65, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !69, file: !3, line: 65, column: 13)
!134 = !DILocation(line: 65, column: 16, scope: !133)
!135 = !DILocation(line: 65, column: 25, scope: !133)
!136 = !DILocation(line: 65, column: 13, scope: !69)
!137 = !DILocation(line: 67, column: 21, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !3, line: 66, column: 9)
!139 = !DILocation(line: 67, column: 19, scope: !138)
!140 = !DILocation(line: 68, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !138, file: !3, line: 68, column: 17)
!142 = !DILocation(line: 68, column: 23, scope: !141)
!143 = !DILocation(line: 68, column: 17, scope: !138)
!144 = !DILocation(line: 71, column: 27, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !3, line: 71, column: 21)
!146 = distinct !DILexicalBlock(scope: !141, file: !3, line: 69, column: 13)
!147 = !DILocation(line: 71, column: 32, scope: !145)
!148 = !DILocation(line: 71, column: 31, scope: !145)
!149 = !DILocation(line: 71, column: 51, scope: !145)
!150 = !DILocation(line: 71, column: 50, scope: !145)
!151 = !DILocation(line: 71, column: 41, scope: !145)
!152 = !DILocation(line: 71, column: 61, scope: !145)
!153 = !DILocation(line: 71, column: 21, scope: !145)
!154 = !DILocation(line: 71, column: 68, scope: !145)
!155 = !DILocation(line: 71, column: 21, scope: !146)
!156 = !DILocation(line: 73, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !3, line: 72, column: 17)
!158 = !DILocation(line: 75, column: 21, scope: !157)
!159 = !DILocation(line: 75, column: 26, scope: !157)
!160 = !DILocation(line: 75, column: 35, scope: !157)
!161 = !DILocation(line: 76, column: 17, scope: !157)
!162 = !DILocation(line: 77, column: 24, scope: !146)
!163 = !DILocation(line: 77, column: 17, scope: !146)
!164 = !DILocation(line: 78, column: 13, scope: !146)
!165 = !DILocation(line: 79, column: 9, scope: !138)
!166 = !DILocation(line: 81, column: 71, scope: !58)
!167 = !DILocation(line: 81, column: 69, scope: !58)
!168 = !DILocation(line: 82, column: 5, scope: !58)
!169 = !DILocation(line: 83, column: 1, scope: !58)
!170 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !3, file: !3, line: 90, type: !20, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!171 = !DILocalVariable(name: "data", arg: 1, scope: !170, file: !3, line: 90, type: !11)
!172 = !DILocation(line: 90, column: 27, scope: !170)
!173 = !DILocalVariable(name: "args", scope: !174, file: !3, line: 93, type: !26)
!174 = distinct !DILexicalBlock(scope: !170, file: !3, line: 92, column: 5)
!175 = !DILocation(line: 93, column: 17, scope: !174)
!176 = !DILocation(line: 94, column: 9, scope: !174)
!177 = !DILocation(line: 96, column: 17, scope: !174)
!178 = !DILocation(line: 96, column: 23, scope: !174)
!179 = !DILocation(line: 96, column: 9, scope: !174)
!180 = !DILocation(line: 97, column: 9, scope: !174)
!181 = !DILocation(line: 99, column: 1, scope: !170)
!182 = distinct !DISubprogram(name: "goodG2BSink", scope: !3, file: !3, line: 101, type: !49, scopeLine: 102, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!183 = !DILocalVariable(name: "data", scope: !182, file: !3, line: 103, type: !11)
!184 = !DILocation(line: 103, column: 12, scope: !182)
!185 = !DILocation(line: 103, column: 19, scope: !182)
!186 = !DILocation(line: 104, column: 19, scope: !182)
!187 = !DILocation(line: 104, column: 25, scope: !182)
!188 = !DILocation(line: 104, column: 5, scope: !182)
!189 = !DILocation(line: 105, column: 1, scope: !182)
