; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_12.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_085/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_12_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocation(line: 40, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 40, column: 8)
!66 = !DILocation(line: 40, column: 8, scope: !52)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 44, type: !70)
!68 = distinct !DILexicalBlock(scope: !69, file: !45, line: 42, column: 9)
!69 = distinct !DILexicalBlock(scope: !65, file: !45, line: 41, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 44, column: 20, scope: !68)
!74 = !DILocation(line: 44, column: 37, scope: !68)
!75 = !DILocation(line: 44, column: 30, scope: !68)
!76 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 45, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !23, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !42, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !42, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !42, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !42, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !42, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !42, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !42, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !42, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !42, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !42, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !42, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !23, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !23, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !24, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !22, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !23, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 45, column: 20, scope: !68)
!133 = !DILocation(line: 47, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !68, file: !45, line: 47, column: 17)
!135 = !DILocation(line: 47, column: 20, scope: !134)
!136 = !DILocation(line: 47, column: 29, scope: !134)
!137 = !DILocation(line: 47, column: 17, scope: !68)
!138 = !DILocation(line: 49, column: 25, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !45, line: 48, column: 13)
!140 = !DILocation(line: 49, column: 23, scope: !139)
!141 = !DILocation(line: 50, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !45, line: 50, column: 21)
!143 = !DILocation(line: 50, column: 27, scope: !142)
!144 = !DILocation(line: 50, column: 21, scope: !139)
!145 = !DILocation(line: 53, column: 31, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !45, line: 53, column: 25)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 51, column: 17)
!148 = !DILocation(line: 53, column: 36, scope: !146)
!149 = !DILocation(line: 53, column: 35, scope: !146)
!150 = !DILocation(line: 53, column: 55, scope: !146)
!151 = !DILocation(line: 53, column: 54, scope: !146)
!152 = !DILocation(line: 53, column: 45, scope: !146)
!153 = !DILocation(line: 53, column: 65, scope: !146)
!154 = !DILocation(line: 53, column: 25, scope: !146)
!155 = !DILocation(line: 53, column: 72, scope: !146)
!156 = !DILocation(line: 53, column: 25, scope: !147)
!157 = !DILocation(line: 55, column: 25, scope: !158)
!158 = distinct !DILexicalBlock(scope: !146, file: !45, line: 54, column: 21)
!159 = !DILocation(line: 57, column: 25, scope: !158)
!160 = !DILocation(line: 57, column: 30, scope: !158)
!161 = !DILocation(line: 57, column: 39, scope: !158)
!162 = !DILocation(line: 58, column: 21, scope: !158)
!163 = !DILocation(line: 59, column: 28, scope: !147)
!164 = !DILocation(line: 59, column: 21, scope: !147)
!165 = !DILocation(line: 60, column: 17, scope: !147)
!166 = !DILocation(line: 61, column: 13, scope: !139)
!167 = !DILocation(line: 63, column: 5, scope: !69)
!168 = !DILocation(line: 67, column: 16, scope: !169)
!169 = distinct !DILexicalBlock(scope: !65, file: !45, line: 65, column: 5)
!170 = !DILocation(line: 67, column: 9, scope: !169)
!171 = !DILocation(line: 69, column: 8, scope: !172)
!172 = distinct !DILexicalBlock(scope: !52, file: !45, line: 69, column: 8)
!173 = !DILocation(line: 69, column: 8, scope: !52)
!174 = !DILocalVariable(name: "i", scope: !175, file: !45, line: 72, type: !23)
!175 = distinct !DILexicalBlock(scope: !176, file: !45, line: 71, column: 9)
!176 = distinct !DILexicalBlock(scope: !172, file: !45, line: 70, column: 5)
!177 = !DILocation(line: 72, column: 17, scope: !175)
!178 = !DILocalVariable(name: "n", scope: !175, file: !45, line: 72, type: !23)
!179 = !DILocation(line: 72, column: 20, scope: !175)
!180 = !DILocalVariable(name: "intVariable", scope: !175, file: !45, line: 72, type: !23)
!181 = !DILocation(line: 72, column: 23, scope: !175)
!182 = !DILocation(line: 73, column: 24, scope: !183)
!183 = distinct !DILexicalBlock(scope: !175, file: !45, line: 73, column: 17)
!184 = !DILocation(line: 73, column: 17, scope: !183)
!185 = !DILocation(line: 73, column: 40, scope: !183)
!186 = !DILocation(line: 73, column: 17, scope: !175)
!187 = !DILocation(line: 76, column: 29, scope: !188)
!188 = distinct !DILexicalBlock(scope: !183, file: !45, line: 74, column: 13)
!189 = !DILocation(line: 77, column: 24, scope: !190)
!190 = distinct !DILexicalBlock(scope: !188, file: !45, line: 77, column: 17)
!191 = !DILocation(line: 77, column: 22, scope: !190)
!192 = !DILocation(line: 77, column: 29, scope: !193)
!193 = distinct !DILexicalBlock(scope: !190, file: !45, line: 77, column: 17)
!194 = !DILocation(line: 77, column: 33, scope: !193)
!195 = !DILocation(line: 77, column: 31, scope: !193)
!196 = !DILocation(line: 77, column: 17, scope: !190)
!197 = !DILocation(line: 80, column: 32, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !45, line: 78, column: 17)
!199 = !DILocation(line: 81, column: 17, scope: !198)
!200 = !DILocation(line: 77, column: 37, scope: !193)
!201 = !DILocation(line: 77, column: 17, scope: !193)
!202 = distinct !{!202, !196, !203, !204}
!203 = !DILocation(line: 81, column: 17, scope: !190)
!204 = !{!"llvm.loop.mustprogress"}
!205 = !DILocation(line: 82, column: 30, scope: !188)
!206 = !DILocation(line: 82, column: 17, scope: !188)
!207 = !DILocation(line: 83, column: 13, scope: !188)
!208 = !DILocation(line: 85, column: 5, scope: !176)
!209 = !DILocalVariable(name: "i", scope: !210, file: !45, line: 89, type: !23)
!210 = distinct !DILexicalBlock(scope: !211, file: !45, line: 88, column: 9)
!211 = distinct !DILexicalBlock(scope: !172, file: !45, line: 87, column: 5)
!212 = !DILocation(line: 89, column: 17, scope: !210)
!213 = !DILocalVariable(name: "n", scope: !210, file: !45, line: 89, type: !23)
!214 = !DILocation(line: 89, column: 20, scope: !210)
!215 = !DILocalVariable(name: "intVariable", scope: !210, file: !45, line: 89, type: !23)
!216 = !DILocation(line: 89, column: 23, scope: !210)
!217 = !DILocation(line: 90, column: 24, scope: !218)
!218 = distinct !DILexicalBlock(scope: !210, file: !45, line: 90, column: 17)
!219 = !DILocation(line: 90, column: 17, scope: !218)
!220 = !DILocation(line: 90, column: 40, scope: !218)
!221 = !DILocation(line: 90, column: 17, scope: !210)
!222 = !DILocation(line: 93, column: 21, scope: !223)
!223 = distinct !DILexicalBlock(scope: !224, file: !45, line: 93, column: 21)
!224 = distinct !DILexicalBlock(scope: !218, file: !45, line: 91, column: 13)
!225 = !DILocation(line: 93, column: 23, scope: !223)
!226 = !DILocation(line: 93, column: 21, scope: !224)
!227 = !DILocation(line: 95, column: 33, scope: !228)
!228 = distinct !DILexicalBlock(scope: !223, file: !45, line: 94, column: 17)
!229 = !DILocation(line: 96, column: 28, scope: !230)
!230 = distinct !DILexicalBlock(scope: !228, file: !45, line: 96, column: 21)
!231 = !DILocation(line: 96, column: 26, scope: !230)
!232 = !DILocation(line: 96, column: 33, scope: !233)
!233 = distinct !DILexicalBlock(scope: !230, file: !45, line: 96, column: 21)
!234 = !DILocation(line: 96, column: 37, scope: !233)
!235 = !DILocation(line: 96, column: 35, scope: !233)
!236 = !DILocation(line: 96, column: 21, scope: !230)
!237 = !DILocation(line: 99, column: 36, scope: !238)
!238 = distinct !DILexicalBlock(scope: !233, file: !45, line: 97, column: 21)
!239 = !DILocation(line: 100, column: 21, scope: !238)
!240 = !DILocation(line: 96, column: 41, scope: !233)
!241 = !DILocation(line: 96, column: 21, scope: !233)
!242 = distinct !{!242, !236, !243, !204}
!243 = !DILocation(line: 100, column: 21, scope: !230)
!244 = !DILocation(line: 101, column: 34, scope: !228)
!245 = !DILocation(line: 101, column: 21, scope: !228)
!246 = !DILocation(line: 102, column: 17, scope: !228)
!247 = !DILocation(line: 103, column: 13, scope: !224)
!248 = !DILocation(line: 106, column: 1, scope: !52)
!249 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 115, type: !53, scopeLine: 116, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!250 = !DILocalVariable(name: "data", scope: !249, file: !45, line: 117, type: !42)
!251 = !DILocation(line: 117, column: 12, scope: !249)
!252 = !DILocalVariable(name: "dataBuffer", scope: !249, file: !45, line: 118, type: !58)
!253 = !DILocation(line: 118, column: 10, scope: !249)
!254 = !DILocation(line: 119, column: 12, scope: !249)
!255 = !DILocation(line: 119, column: 10, scope: !249)
!256 = !DILocation(line: 120, column: 8, scope: !257)
!257 = distinct !DILexicalBlock(scope: !249, file: !45, line: 120, column: 8)
!258 = !DILocation(line: 120, column: 8, scope: !249)
!259 = !DILocalVariable(name: "dataLen", scope: !260, file: !45, line: 124, type: !70)
!260 = distinct !DILexicalBlock(scope: !261, file: !45, line: 122, column: 9)
!261 = distinct !DILexicalBlock(scope: !257, file: !45, line: 121, column: 5)
!262 = !DILocation(line: 124, column: 20, scope: !260)
!263 = !DILocation(line: 124, column: 37, scope: !260)
!264 = !DILocation(line: 124, column: 30, scope: !260)
!265 = !DILocalVariable(name: "pFile", scope: !260, file: !45, line: 125, type: !77)
!266 = !DILocation(line: 125, column: 20, scope: !260)
!267 = !DILocation(line: 127, column: 21, scope: !268)
!268 = distinct !DILexicalBlock(scope: !260, file: !45, line: 127, column: 17)
!269 = !DILocation(line: 127, column: 20, scope: !268)
!270 = !DILocation(line: 127, column: 29, scope: !268)
!271 = !DILocation(line: 127, column: 17, scope: !260)
!272 = !DILocation(line: 129, column: 25, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !45, line: 128, column: 13)
!274 = !DILocation(line: 129, column: 23, scope: !273)
!275 = !DILocation(line: 130, column: 21, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !45, line: 130, column: 21)
!277 = !DILocation(line: 130, column: 27, scope: !276)
!278 = !DILocation(line: 130, column: 21, scope: !273)
!279 = !DILocation(line: 133, column: 31, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !45, line: 133, column: 25)
!281 = distinct !DILexicalBlock(scope: !276, file: !45, line: 131, column: 17)
!282 = !DILocation(line: 133, column: 36, scope: !280)
!283 = !DILocation(line: 133, column: 35, scope: !280)
!284 = !DILocation(line: 133, column: 55, scope: !280)
!285 = !DILocation(line: 133, column: 54, scope: !280)
!286 = !DILocation(line: 133, column: 45, scope: !280)
!287 = !DILocation(line: 133, column: 65, scope: !280)
!288 = !DILocation(line: 133, column: 25, scope: !280)
!289 = !DILocation(line: 133, column: 72, scope: !280)
!290 = !DILocation(line: 133, column: 25, scope: !281)
!291 = !DILocation(line: 135, column: 25, scope: !292)
!292 = distinct !DILexicalBlock(scope: !280, file: !45, line: 134, column: 21)
!293 = !DILocation(line: 137, column: 25, scope: !292)
!294 = !DILocation(line: 137, column: 30, scope: !292)
!295 = !DILocation(line: 137, column: 39, scope: !292)
!296 = !DILocation(line: 138, column: 21, scope: !292)
!297 = !DILocation(line: 139, column: 28, scope: !281)
!298 = !DILocation(line: 139, column: 21, scope: !281)
!299 = !DILocation(line: 140, column: 17, scope: !281)
!300 = !DILocation(line: 141, column: 13, scope: !273)
!301 = !DILocation(line: 143, column: 5, scope: !261)
!302 = !DILocalVariable(name: "dataLen", scope: !303, file: !45, line: 148, type: !70)
!303 = distinct !DILexicalBlock(scope: !304, file: !45, line: 146, column: 9)
!304 = distinct !DILexicalBlock(scope: !257, file: !45, line: 145, column: 5)
!305 = !DILocation(line: 148, column: 20, scope: !303)
!306 = !DILocation(line: 148, column: 37, scope: !303)
!307 = !DILocation(line: 148, column: 30, scope: !303)
!308 = !DILocalVariable(name: "pFile", scope: !303, file: !45, line: 149, type: !77)
!309 = !DILocation(line: 149, column: 20, scope: !303)
!310 = !DILocation(line: 151, column: 21, scope: !311)
!311 = distinct !DILexicalBlock(scope: !303, file: !45, line: 151, column: 17)
!312 = !DILocation(line: 151, column: 20, scope: !311)
!313 = !DILocation(line: 151, column: 29, scope: !311)
!314 = !DILocation(line: 151, column: 17, scope: !303)
!315 = !DILocation(line: 153, column: 25, scope: !316)
!316 = distinct !DILexicalBlock(scope: !311, file: !45, line: 152, column: 13)
!317 = !DILocation(line: 153, column: 23, scope: !316)
!318 = !DILocation(line: 154, column: 21, scope: !319)
!319 = distinct !DILexicalBlock(scope: !316, file: !45, line: 154, column: 21)
!320 = !DILocation(line: 154, column: 27, scope: !319)
!321 = !DILocation(line: 154, column: 21, scope: !316)
!322 = !DILocation(line: 157, column: 31, scope: !323)
!323 = distinct !DILexicalBlock(scope: !324, file: !45, line: 157, column: 25)
!324 = distinct !DILexicalBlock(scope: !319, file: !45, line: 155, column: 17)
!325 = !DILocation(line: 157, column: 36, scope: !323)
!326 = !DILocation(line: 157, column: 35, scope: !323)
!327 = !DILocation(line: 157, column: 55, scope: !323)
!328 = !DILocation(line: 157, column: 54, scope: !323)
!329 = !DILocation(line: 157, column: 45, scope: !323)
!330 = !DILocation(line: 157, column: 65, scope: !323)
!331 = !DILocation(line: 157, column: 25, scope: !323)
!332 = !DILocation(line: 157, column: 72, scope: !323)
!333 = !DILocation(line: 157, column: 25, scope: !324)
!334 = !DILocation(line: 159, column: 25, scope: !335)
!335 = distinct !DILexicalBlock(scope: !323, file: !45, line: 158, column: 21)
!336 = !DILocation(line: 161, column: 25, scope: !335)
!337 = !DILocation(line: 161, column: 30, scope: !335)
!338 = !DILocation(line: 161, column: 39, scope: !335)
!339 = !DILocation(line: 162, column: 21, scope: !335)
!340 = !DILocation(line: 163, column: 28, scope: !324)
!341 = !DILocation(line: 163, column: 21, scope: !324)
!342 = !DILocation(line: 164, column: 17, scope: !324)
!343 = !DILocation(line: 165, column: 13, scope: !316)
!344 = !DILocation(line: 168, column: 8, scope: !345)
!345 = distinct !DILexicalBlock(scope: !249, file: !45, line: 168, column: 8)
!346 = !DILocation(line: 168, column: 8, scope: !249)
!347 = !DILocalVariable(name: "i", scope: !348, file: !45, line: 171, type: !23)
!348 = distinct !DILexicalBlock(scope: !349, file: !45, line: 170, column: 9)
!349 = distinct !DILexicalBlock(scope: !345, file: !45, line: 169, column: 5)
!350 = !DILocation(line: 171, column: 17, scope: !348)
!351 = !DILocalVariable(name: "n", scope: !348, file: !45, line: 171, type: !23)
!352 = !DILocation(line: 171, column: 20, scope: !348)
!353 = !DILocalVariable(name: "intVariable", scope: !348, file: !45, line: 171, type: !23)
!354 = !DILocation(line: 171, column: 23, scope: !348)
!355 = !DILocation(line: 172, column: 24, scope: !356)
!356 = distinct !DILexicalBlock(scope: !348, file: !45, line: 172, column: 17)
!357 = !DILocation(line: 172, column: 17, scope: !356)
!358 = !DILocation(line: 172, column: 40, scope: !356)
!359 = !DILocation(line: 172, column: 17, scope: !348)
!360 = !DILocation(line: 175, column: 21, scope: !361)
!361 = distinct !DILexicalBlock(scope: !362, file: !45, line: 175, column: 21)
!362 = distinct !DILexicalBlock(scope: !356, file: !45, line: 173, column: 13)
!363 = !DILocation(line: 175, column: 23, scope: !361)
!364 = !DILocation(line: 175, column: 21, scope: !362)
!365 = !DILocation(line: 177, column: 33, scope: !366)
!366 = distinct !DILexicalBlock(scope: !361, file: !45, line: 176, column: 17)
!367 = !DILocation(line: 178, column: 28, scope: !368)
!368 = distinct !DILexicalBlock(scope: !366, file: !45, line: 178, column: 21)
!369 = !DILocation(line: 178, column: 26, scope: !368)
!370 = !DILocation(line: 178, column: 33, scope: !371)
!371 = distinct !DILexicalBlock(scope: !368, file: !45, line: 178, column: 21)
!372 = !DILocation(line: 178, column: 37, scope: !371)
!373 = !DILocation(line: 178, column: 35, scope: !371)
!374 = !DILocation(line: 178, column: 21, scope: !368)
!375 = !DILocation(line: 181, column: 36, scope: !376)
!376 = distinct !DILexicalBlock(scope: !371, file: !45, line: 179, column: 21)
!377 = !DILocation(line: 182, column: 21, scope: !376)
!378 = !DILocation(line: 178, column: 41, scope: !371)
!379 = !DILocation(line: 178, column: 21, scope: !371)
!380 = distinct !{!380, !374, !381, !204}
!381 = !DILocation(line: 182, column: 21, scope: !368)
!382 = !DILocation(line: 183, column: 34, scope: !366)
!383 = !DILocation(line: 183, column: 21, scope: !366)
!384 = !DILocation(line: 184, column: 17, scope: !366)
!385 = !DILocation(line: 185, column: 13, scope: !362)
!386 = !DILocation(line: 187, column: 5, scope: !349)
!387 = !DILocalVariable(name: "i", scope: !388, file: !45, line: 191, type: !23)
!388 = distinct !DILexicalBlock(scope: !389, file: !45, line: 190, column: 9)
!389 = distinct !DILexicalBlock(scope: !345, file: !45, line: 189, column: 5)
!390 = !DILocation(line: 191, column: 17, scope: !388)
!391 = !DILocalVariable(name: "n", scope: !388, file: !45, line: 191, type: !23)
!392 = !DILocation(line: 191, column: 20, scope: !388)
!393 = !DILocalVariable(name: "intVariable", scope: !388, file: !45, line: 191, type: !23)
!394 = !DILocation(line: 191, column: 23, scope: !388)
!395 = !DILocation(line: 192, column: 24, scope: !396)
!396 = distinct !DILexicalBlock(scope: !388, file: !45, line: 192, column: 17)
!397 = !DILocation(line: 192, column: 17, scope: !396)
!398 = !DILocation(line: 192, column: 40, scope: !396)
!399 = !DILocation(line: 192, column: 17, scope: !388)
!400 = !DILocation(line: 195, column: 21, scope: !401)
!401 = distinct !DILexicalBlock(scope: !402, file: !45, line: 195, column: 21)
!402 = distinct !DILexicalBlock(scope: !396, file: !45, line: 193, column: 13)
!403 = !DILocation(line: 195, column: 23, scope: !401)
!404 = !DILocation(line: 195, column: 21, scope: !402)
!405 = !DILocation(line: 197, column: 33, scope: !406)
!406 = distinct !DILexicalBlock(scope: !401, file: !45, line: 196, column: 17)
!407 = !DILocation(line: 198, column: 28, scope: !408)
!408 = distinct !DILexicalBlock(scope: !406, file: !45, line: 198, column: 21)
!409 = !DILocation(line: 198, column: 26, scope: !408)
!410 = !DILocation(line: 198, column: 33, scope: !411)
!411 = distinct !DILexicalBlock(scope: !408, file: !45, line: 198, column: 21)
!412 = !DILocation(line: 198, column: 37, scope: !411)
!413 = !DILocation(line: 198, column: 35, scope: !411)
!414 = !DILocation(line: 198, column: 21, scope: !408)
!415 = !DILocation(line: 201, column: 36, scope: !416)
!416 = distinct !DILexicalBlock(scope: !411, file: !45, line: 199, column: 21)
!417 = !DILocation(line: 202, column: 21, scope: !416)
!418 = !DILocation(line: 198, column: 41, scope: !411)
!419 = !DILocation(line: 198, column: 21, scope: !411)
!420 = distinct !{!420, !414, !421, !204}
!421 = !DILocation(line: 202, column: 21, scope: !408)
!422 = !DILocation(line: 203, column: 34, scope: !406)
!423 = !DILocation(line: 203, column: 21, scope: !406)
!424 = !DILocation(line: 204, column: 17, scope: !406)
!425 = !DILocation(line: 205, column: 13, scope: !402)
!426 = !DILocation(line: 208, column: 1, scope: !249)
!427 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 213, type: !53, scopeLine: 214, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!428 = !DILocalVariable(name: "data", scope: !427, file: !45, line: 215, type: !42)
!429 = !DILocation(line: 215, column: 12, scope: !427)
!430 = !DILocalVariable(name: "dataBuffer", scope: !427, file: !45, line: 216, type: !58)
!431 = !DILocation(line: 216, column: 10, scope: !427)
!432 = !DILocation(line: 217, column: 12, scope: !427)
!433 = !DILocation(line: 217, column: 10, scope: !427)
!434 = !DILocation(line: 218, column: 8, scope: !435)
!435 = distinct !DILexicalBlock(scope: !427, file: !45, line: 218, column: 8)
!436 = !DILocation(line: 218, column: 8, scope: !427)
!437 = !DILocation(line: 221, column: 16, scope: !438)
!438 = distinct !DILexicalBlock(scope: !435, file: !45, line: 219, column: 5)
!439 = !DILocation(line: 221, column: 9, scope: !438)
!440 = !DILocation(line: 222, column: 5, scope: !438)
!441 = !DILocation(line: 226, column: 16, scope: !442)
!442 = distinct !DILexicalBlock(scope: !435, file: !45, line: 224, column: 5)
!443 = !DILocation(line: 226, column: 9, scope: !442)
!444 = !DILocation(line: 228, column: 8, scope: !445)
!445 = distinct !DILexicalBlock(scope: !427, file: !45, line: 228, column: 8)
!446 = !DILocation(line: 228, column: 8, scope: !427)
!447 = !DILocalVariable(name: "i", scope: !448, file: !45, line: 231, type: !23)
!448 = distinct !DILexicalBlock(scope: !449, file: !45, line: 230, column: 9)
!449 = distinct !DILexicalBlock(scope: !445, file: !45, line: 229, column: 5)
!450 = !DILocation(line: 231, column: 17, scope: !448)
!451 = !DILocalVariable(name: "n", scope: !448, file: !45, line: 231, type: !23)
!452 = !DILocation(line: 231, column: 20, scope: !448)
!453 = !DILocalVariable(name: "intVariable", scope: !448, file: !45, line: 231, type: !23)
!454 = !DILocation(line: 231, column: 23, scope: !448)
!455 = !DILocation(line: 232, column: 24, scope: !456)
!456 = distinct !DILexicalBlock(scope: !448, file: !45, line: 232, column: 17)
!457 = !DILocation(line: 232, column: 17, scope: !456)
!458 = !DILocation(line: 232, column: 40, scope: !456)
!459 = !DILocation(line: 232, column: 17, scope: !448)
!460 = !DILocation(line: 235, column: 29, scope: !461)
!461 = distinct !DILexicalBlock(scope: !456, file: !45, line: 233, column: 13)
!462 = !DILocation(line: 236, column: 24, scope: !463)
!463 = distinct !DILexicalBlock(scope: !461, file: !45, line: 236, column: 17)
!464 = !DILocation(line: 236, column: 22, scope: !463)
!465 = !DILocation(line: 236, column: 29, scope: !466)
!466 = distinct !DILexicalBlock(scope: !463, file: !45, line: 236, column: 17)
!467 = !DILocation(line: 236, column: 33, scope: !466)
!468 = !DILocation(line: 236, column: 31, scope: !466)
!469 = !DILocation(line: 236, column: 17, scope: !463)
!470 = !DILocation(line: 239, column: 32, scope: !471)
!471 = distinct !DILexicalBlock(scope: !466, file: !45, line: 237, column: 17)
!472 = !DILocation(line: 240, column: 17, scope: !471)
!473 = !DILocation(line: 236, column: 37, scope: !466)
!474 = !DILocation(line: 236, column: 17, scope: !466)
!475 = distinct !{!475, !469, !476, !204}
!476 = !DILocation(line: 240, column: 17, scope: !463)
!477 = !DILocation(line: 241, column: 30, scope: !461)
!478 = !DILocation(line: 241, column: 17, scope: !461)
!479 = !DILocation(line: 242, column: 13, scope: !461)
!480 = !DILocation(line: 244, column: 5, scope: !449)
!481 = !DILocalVariable(name: "i", scope: !482, file: !45, line: 248, type: !23)
!482 = distinct !DILexicalBlock(scope: !483, file: !45, line: 247, column: 9)
!483 = distinct !DILexicalBlock(scope: !445, file: !45, line: 246, column: 5)
!484 = !DILocation(line: 248, column: 17, scope: !482)
!485 = !DILocalVariable(name: "n", scope: !482, file: !45, line: 248, type: !23)
!486 = !DILocation(line: 248, column: 20, scope: !482)
!487 = !DILocalVariable(name: "intVariable", scope: !482, file: !45, line: 248, type: !23)
!488 = !DILocation(line: 248, column: 23, scope: !482)
!489 = !DILocation(line: 249, column: 24, scope: !490)
!490 = distinct !DILexicalBlock(scope: !482, file: !45, line: 249, column: 17)
!491 = !DILocation(line: 249, column: 17, scope: !490)
!492 = !DILocation(line: 249, column: 40, scope: !490)
!493 = !DILocation(line: 249, column: 17, scope: !482)
!494 = !DILocation(line: 252, column: 29, scope: !495)
!495 = distinct !DILexicalBlock(scope: !490, file: !45, line: 250, column: 13)
!496 = !DILocation(line: 253, column: 24, scope: !497)
!497 = distinct !DILexicalBlock(scope: !495, file: !45, line: 253, column: 17)
!498 = !DILocation(line: 253, column: 22, scope: !497)
!499 = !DILocation(line: 253, column: 29, scope: !500)
!500 = distinct !DILexicalBlock(scope: !497, file: !45, line: 253, column: 17)
!501 = !DILocation(line: 253, column: 33, scope: !500)
!502 = !DILocation(line: 253, column: 31, scope: !500)
!503 = !DILocation(line: 253, column: 17, scope: !497)
!504 = !DILocation(line: 256, column: 32, scope: !505)
!505 = distinct !DILexicalBlock(scope: !500, file: !45, line: 254, column: 17)
!506 = !DILocation(line: 257, column: 17, scope: !505)
!507 = !DILocation(line: 253, column: 37, scope: !500)
!508 = !DILocation(line: 253, column: 17, scope: !500)
!509 = distinct !{!509, !503, !510, !204}
!510 = !DILocation(line: 257, column: 17, scope: !497)
!511 = !DILocation(line: 258, column: 30, scope: !495)
!512 = !DILocation(line: 258, column: 17, scope: !495)
!513 = !DILocation(line: 259, column: 13, scope: !495)
!514 = !DILocation(line: 262, column: 1, scope: !427)
!515 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_12_good", scope: !45, file: !45, line: 264, type: !53, scopeLine: 265, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!516 = !DILocation(line: 266, column: 5, scope: !515)
!517 = !DILocation(line: 267, column: 5, scope: !515)
!518 = !DILocation(line: 268, column: 1, scope: !515)
!519 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !520, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!520 = !DISubroutineType(types: !521)
!521 = !{null, !42}
!522 = !DILocalVariable(name: "line", arg: 1, scope: !519, file: !3, line: 11, type: !42)
!523 = !DILocation(line: 11, column: 25, scope: !519)
!524 = !DILocation(line: 13, column: 1, scope: !519)
!525 = !DILocation(line: 14, column: 8, scope: !526)
!526 = distinct !DILexicalBlock(scope: !519, file: !3, line: 14, column: 8)
!527 = !DILocation(line: 14, column: 13, scope: !526)
!528 = !DILocation(line: 14, column: 8, scope: !519)
!529 = !DILocation(line: 16, column: 24, scope: !530)
!530 = distinct !DILexicalBlock(scope: !526, file: !3, line: 15, column: 5)
!531 = !DILocation(line: 16, column: 9, scope: !530)
!532 = !DILocation(line: 17, column: 5, scope: !530)
!533 = !DILocation(line: 18, column: 5, scope: !519)
!534 = !DILocation(line: 19, column: 1, scope: !519)
!535 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !520, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!536 = !DILocalVariable(name: "line", arg: 1, scope: !535, file: !3, line: 20, type: !42)
!537 = !DILocation(line: 20, column: 29, scope: !535)
!538 = !DILocation(line: 22, column: 8, scope: !539)
!539 = distinct !DILexicalBlock(scope: !535, file: !3, line: 22, column: 8)
!540 = !DILocation(line: 22, column: 13, scope: !539)
!541 = !DILocation(line: 22, column: 8, scope: !535)
!542 = !DILocation(line: 24, column: 24, scope: !543)
!543 = distinct !DILexicalBlock(scope: !539, file: !3, line: 23, column: 5)
!544 = !DILocation(line: 24, column: 9, scope: !543)
!545 = !DILocation(line: 25, column: 5, scope: !543)
!546 = !DILocation(line: 26, column: 1, scope: !535)
!547 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !548, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !550}
!550 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !551, size: 64)
!551 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !71, line: 74, baseType: !23)
!552 = !DILocalVariable(name: "line", arg: 1, scope: !547, file: !3, line: 27, type: !550)
!553 = !DILocation(line: 27, column: 29, scope: !547)
!554 = !DILocation(line: 29, column: 8, scope: !555)
!555 = distinct !DILexicalBlock(scope: !547, file: !3, line: 29, column: 8)
!556 = !DILocation(line: 29, column: 13, scope: !555)
!557 = !DILocation(line: 29, column: 8, scope: !547)
!558 = !DILocation(line: 31, column: 27, scope: !559)
!559 = distinct !DILexicalBlock(scope: !555, file: !3, line: 30, column: 5)
!560 = !DILocation(line: 31, column: 9, scope: !559)
!561 = !DILocation(line: 32, column: 5, scope: !559)
!562 = !DILocation(line: 33, column: 1, scope: !547)
!563 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !564, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!564 = !DISubroutineType(types: !565)
!565 = !{null, !23}
!566 = !DILocalVariable(name: "intNumber", arg: 1, scope: !563, file: !3, line: 35, type: !23)
!567 = !DILocation(line: 35, column: 24, scope: !563)
!568 = !DILocation(line: 37, column: 20, scope: !563)
!569 = !DILocation(line: 37, column: 5, scope: !563)
!570 = !DILocation(line: 38, column: 1, scope: !563)
!571 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !572, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!572 = !DISubroutineType(types: !573)
!573 = !{null, !574}
!574 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!575 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !571, file: !3, line: 40, type: !574)
!576 = !DILocation(line: 40, column: 28, scope: !571)
!577 = !DILocation(line: 42, column: 21, scope: !571)
!578 = !DILocation(line: 42, column: 5, scope: !571)
!579 = !DILocation(line: 43, column: 1, scope: !571)
!580 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !581, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !583}
!583 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!584 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !580, file: !3, line: 45, type: !583)
!585 = !DILocation(line: 45, column: 28, scope: !580)
!586 = !DILocation(line: 47, column: 20, scope: !580)
!587 = !DILocation(line: 47, column: 5, scope: !580)
!588 = !DILocation(line: 48, column: 1, scope: !580)
!589 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !590, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !105}
!592 = !DILocalVariable(name: "longNumber", arg: 1, scope: !589, file: !3, line: 50, type: !105)
!593 = !DILocation(line: 50, column: 26, scope: !589)
!594 = !DILocation(line: 52, column: 21, scope: !589)
!595 = !DILocation(line: 52, column: 5, scope: !589)
!596 = !DILocation(line: 53, column: 1, scope: !589)
!597 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !598, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !600}
!600 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !601, line: 27, baseType: !602)
!601 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!602 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 44, baseType: !105)
!603 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !597, file: !3, line: 55, type: !600)
!604 = !DILocation(line: 55, column: 33, scope: !597)
!605 = !DILocation(line: 57, column: 29, scope: !597)
!606 = !DILocation(line: 57, column: 5, scope: !597)
!607 = !DILocation(line: 58, column: 1, scope: !597)
!608 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !609, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !70}
!611 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !608, file: !3, line: 60, type: !70)
!612 = !DILocation(line: 60, column: 29, scope: !608)
!613 = !DILocation(line: 62, column: 21, scope: !608)
!614 = !DILocation(line: 62, column: 5, scope: !608)
!615 = !DILocation(line: 63, column: 1, scope: !608)
!616 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !617, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !43}
!619 = !DILocalVariable(name: "charHex", arg: 1, scope: !616, file: !3, line: 65, type: !43)
!620 = !DILocation(line: 65, column: 29, scope: !616)
!621 = !DILocation(line: 67, column: 22, scope: !616)
!622 = !DILocation(line: 67, column: 5, scope: !616)
!623 = !DILocation(line: 68, column: 1, scope: !616)
!624 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !625, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !551}
!627 = !DILocalVariable(name: "wideChar", arg: 1, scope: !624, file: !3, line: 70, type: !551)
!628 = !DILocation(line: 70, column: 29, scope: !624)
!629 = !DILocalVariable(name: "s", scope: !624, file: !3, line: 74, type: !630)
!630 = !DICompositeType(tag: DW_TAG_array_type, baseType: !551, size: 64, elements: !631)
!631 = !{!632}
!632 = !DISubrange(count: 2)
!633 = !DILocation(line: 74, column: 13, scope: !624)
!634 = !DILocation(line: 75, column: 16, scope: !624)
!635 = !DILocation(line: 75, column: 9, scope: !624)
!636 = !DILocation(line: 75, column: 14, scope: !624)
!637 = !DILocation(line: 76, column: 9, scope: !624)
!638 = !DILocation(line: 76, column: 14, scope: !624)
!639 = !DILocation(line: 77, column: 21, scope: !624)
!640 = !DILocation(line: 77, column: 5, scope: !624)
!641 = !DILocation(line: 78, column: 1, scope: !624)
!642 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !643, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!643 = !DISubroutineType(types: !644)
!644 = !{null, !7}
!645 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !642, file: !3, line: 80, type: !7)
!646 = !DILocation(line: 80, column: 33, scope: !642)
!647 = !DILocation(line: 82, column: 20, scope: !642)
!648 = !DILocation(line: 82, column: 5, scope: !642)
!649 = !DILocation(line: 83, column: 1, scope: !642)
!650 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !651, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!651 = !DISubroutineType(types: !652)
!652 = !{null, !25}
!653 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !650, file: !3, line: 85, type: !25)
!654 = !DILocation(line: 85, column: 45, scope: !650)
!655 = !DILocation(line: 87, column: 22, scope: !650)
!656 = !DILocation(line: 87, column: 5, scope: !650)
!657 = !DILocation(line: 88, column: 1, scope: !650)
!658 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !659, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!659 = !DISubroutineType(types: !660)
!660 = !{null, !661}
!661 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!662 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !658, file: !3, line: 90, type: !661)
!663 = !DILocation(line: 90, column: 29, scope: !658)
!664 = !DILocation(line: 92, column: 20, scope: !658)
!665 = !DILocation(line: 92, column: 5, scope: !658)
!666 = !DILocation(line: 93, column: 1, scope: !658)
!667 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !668, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!668 = !DISubroutineType(types: !669)
!669 = !{null, !670}
!670 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !671, size: 64)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !672, line: 100, baseType: !673)
!672 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_085/source_code")
!673 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !672, line: 96, size: 64, elements: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !673, file: !672, line: 98, baseType: !23, size: 32)
!676 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !673, file: !672, line: 99, baseType: !23, size: 32, offset: 32)
!677 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !667, file: !3, line: 95, type: !670)
!678 = !DILocation(line: 95, column: 40, scope: !667)
!679 = !DILocation(line: 97, column: 26, scope: !667)
!680 = !DILocation(line: 97, column: 47, scope: !667)
!681 = !DILocation(line: 97, column: 55, scope: !667)
!682 = !DILocation(line: 97, column: 76, scope: !667)
!683 = !DILocation(line: 97, column: 5, scope: !667)
!684 = !DILocation(line: 98, column: 1, scope: !667)
!685 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !686, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!686 = !DISubroutineType(types: !687)
!687 = !{null, !688, !70}
!688 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!689 = !DILocalVariable(name: "bytes", arg: 1, scope: !685, file: !3, line: 100, type: !688)
!690 = !DILocation(line: 100, column: 38, scope: !685)
!691 = !DILocalVariable(name: "numBytes", arg: 2, scope: !685, file: !3, line: 100, type: !70)
!692 = !DILocation(line: 100, column: 52, scope: !685)
!693 = !DILocalVariable(name: "i", scope: !685, file: !3, line: 102, type: !70)
!694 = !DILocation(line: 102, column: 12, scope: !685)
!695 = !DILocation(line: 103, column: 12, scope: !696)
!696 = distinct !DILexicalBlock(scope: !685, file: !3, line: 103, column: 5)
!697 = !DILocation(line: 103, column: 10, scope: !696)
!698 = !DILocation(line: 103, column: 17, scope: !699)
!699 = distinct !DILexicalBlock(scope: !696, file: !3, line: 103, column: 5)
!700 = !DILocation(line: 103, column: 21, scope: !699)
!701 = !DILocation(line: 103, column: 19, scope: !699)
!702 = !DILocation(line: 103, column: 5, scope: !696)
!703 = !DILocation(line: 105, column: 24, scope: !704)
!704 = distinct !DILexicalBlock(scope: !699, file: !3, line: 104, column: 5)
!705 = !DILocation(line: 105, column: 30, scope: !704)
!706 = !DILocation(line: 105, column: 9, scope: !704)
!707 = !DILocation(line: 106, column: 5, scope: !704)
!708 = !DILocation(line: 103, column: 31, scope: !699)
!709 = !DILocation(line: 103, column: 5, scope: !699)
!710 = distinct !{!710, !702, !711, !204}
!711 = !DILocation(line: 106, column: 5, scope: !696)
!712 = !DILocation(line: 107, column: 5, scope: !685)
!713 = !DILocation(line: 108, column: 1, scope: !685)
!714 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !715, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!715 = !DISubroutineType(types: !716)
!716 = !{!70, !688, !70, !42}
!717 = !DILocalVariable(name: "bytes", arg: 1, scope: !714, file: !3, line: 113, type: !688)
!718 = !DILocation(line: 113, column: 39, scope: !714)
!719 = !DILocalVariable(name: "numBytes", arg: 2, scope: !714, file: !3, line: 113, type: !70)
!720 = !DILocation(line: 113, column: 53, scope: !714)
!721 = !DILocalVariable(name: "hex", arg: 3, scope: !714, file: !3, line: 113, type: !42)
!722 = !DILocation(line: 113, column: 71, scope: !714)
!723 = !DILocalVariable(name: "numWritten", scope: !714, file: !3, line: 115, type: !70)
!724 = !DILocation(line: 115, column: 12, scope: !714)
!725 = !DILocation(line: 121, column: 5, scope: !714)
!726 = !DILocation(line: 121, column: 12, scope: !714)
!727 = !DILocation(line: 121, column: 25, scope: !714)
!728 = !DILocation(line: 121, column: 23, scope: !714)
!729 = !DILocation(line: 121, column: 34, scope: !714)
!730 = !DILocation(line: 121, column: 37, scope: !714)
!731 = !DILocation(line: 121, column: 67, scope: !714)
!732 = !DILocation(line: 121, column: 70, scope: !714)
!733 = !DILocation(line: 0, scope: !714)
!734 = !DILocalVariable(name: "byte", scope: !735, file: !3, line: 123, type: !23)
!735 = distinct !DILexicalBlock(scope: !714, file: !3, line: 122, column: 5)
!736 = !DILocation(line: 123, column: 13, scope: !735)
