; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_63a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_109/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_63b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_109/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_63_bad", scope: !45, file: !45, line: 37, type: !55, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 39, type: !42)
!58 = !DILocation(line: 39, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 40, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 100)
!63 = !DILocation(line: 40, column: 10, scope: !54)
!64 = !DILocation(line: 41, column: 12, scope: !54)
!65 = !DILocation(line: 41, column: 10, scope: !54)
!66 = !DILocalVariable(name: "dataLen", scope: !67, file: !45, line: 44, type: !68)
!67 = distinct !DILexicalBlock(scope: !54, file: !45, line: 42, column: 5)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 44, column: 16, scope: !67)
!72 = !DILocation(line: 44, column: 33, scope: !67)
!73 = !DILocation(line: 44, column: 26, scope: !67)
!74 = !DILocalVariable(name: "pFile", scope: !67, file: !45, line: 45, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !23, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !42, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !42, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !42, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !42, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !42, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !42, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !42, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !42, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !42, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !42, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !23, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !23, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !24, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !22, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !23, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 45, column: 16, scope: !67)
!131 = !DILocation(line: 47, column: 17, scope: !132)
!132 = distinct !DILexicalBlock(scope: !67, file: !45, line: 47, column: 13)
!133 = !DILocation(line: 47, column: 16, scope: !132)
!134 = !DILocation(line: 47, column: 25, scope: !132)
!135 = !DILocation(line: 47, column: 13, scope: !67)
!136 = !DILocation(line: 49, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !45, line: 48, column: 9)
!138 = !DILocation(line: 49, column: 19, scope: !137)
!139 = !DILocation(line: 50, column: 17, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !45, line: 50, column: 17)
!141 = !DILocation(line: 50, column: 23, scope: !140)
!142 = !DILocation(line: 50, column: 17, scope: !137)
!143 = !DILocation(line: 53, column: 27, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !45, line: 53, column: 21)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 51, column: 13)
!146 = !DILocation(line: 53, column: 32, scope: !144)
!147 = !DILocation(line: 53, column: 31, scope: !144)
!148 = !DILocation(line: 53, column: 51, scope: !144)
!149 = !DILocation(line: 53, column: 50, scope: !144)
!150 = !DILocation(line: 53, column: 41, scope: !144)
!151 = !DILocation(line: 53, column: 61, scope: !144)
!152 = !DILocation(line: 53, column: 21, scope: !144)
!153 = !DILocation(line: 53, column: 68, scope: !144)
!154 = !DILocation(line: 53, column: 21, scope: !145)
!155 = !DILocation(line: 55, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !45, line: 54, column: 17)
!157 = !DILocation(line: 57, column: 21, scope: !156)
!158 = !DILocation(line: 57, column: 26, scope: !156)
!159 = !DILocation(line: 57, column: 35, scope: !156)
!160 = !DILocation(line: 58, column: 17, scope: !156)
!161 = !DILocation(line: 59, column: 24, scope: !145)
!162 = !DILocation(line: 59, column: 17, scope: !145)
!163 = !DILocation(line: 60, column: 13, scope: !145)
!164 = !DILocation(line: 61, column: 9, scope: !137)
!165 = !DILocation(line: 63, column: 5, scope: !54)
!166 = !DILocation(line: 64, column: 1, scope: !54)
!167 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 72, type: !55, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!168 = !DILocalVariable(name: "data", scope: !167, file: !45, line: 74, type: !42)
!169 = !DILocation(line: 74, column: 12, scope: !167)
!170 = !DILocalVariable(name: "dataBuffer", scope: !167, file: !45, line: 75, type: !60)
!171 = !DILocation(line: 75, column: 10, scope: !167)
!172 = !DILocation(line: 76, column: 12, scope: !167)
!173 = !DILocation(line: 76, column: 10, scope: !167)
!174 = !DILocation(line: 78, column: 12, scope: !167)
!175 = !DILocation(line: 78, column: 5, scope: !167)
!176 = !DILocation(line: 79, column: 5, scope: !167)
!177 = !DILocation(line: 80, column: 1, scope: !167)
!178 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 84, type: !55, scopeLine: 85, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!179 = !DILocalVariable(name: "data", scope: !178, file: !45, line: 86, type: !42)
!180 = !DILocation(line: 86, column: 12, scope: !178)
!181 = !DILocalVariable(name: "dataBuffer", scope: !178, file: !45, line: 87, type: !60)
!182 = !DILocation(line: 87, column: 10, scope: !178)
!183 = !DILocation(line: 88, column: 12, scope: !178)
!184 = !DILocation(line: 88, column: 10, scope: !178)
!185 = !DILocalVariable(name: "dataLen", scope: !186, file: !45, line: 91, type: !68)
!186 = distinct !DILexicalBlock(scope: !178, file: !45, line: 89, column: 5)
!187 = !DILocation(line: 91, column: 16, scope: !186)
!188 = !DILocation(line: 91, column: 33, scope: !186)
!189 = !DILocation(line: 91, column: 26, scope: !186)
!190 = !DILocalVariable(name: "pFile", scope: !186, file: !45, line: 92, type: !75)
!191 = !DILocation(line: 92, column: 16, scope: !186)
!192 = !DILocation(line: 94, column: 17, scope: !193)
!193 = distinct !DILexicalBlock(scope: !186, file: !45, line: 94, column: 13)
!194 = !DILocation(line: 94, column: 16, scope: !193)
!195 = !DILocation(line: 94, column: 25, scope: !193)
!196 = !DILocation(line: 94, column: 13, scope: !186)
!197 = !DILocation(line: 96, column: 21, scope: !198)
!198 = distinct !DILexicalBlock(scope: !193, file: !45, line: 95, column: 9)
!199 = !DILocation(line: 96, column: 19, scope: !198)
!200 = !DILocation(line: 97, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !198, file: !45, line: 97, column: 17)
!202 = !DILocation(line: 97, column: 23, scope: !201)
!203 = !DILocation(line: 97, column: 17, scope: !198)
!204 = !DILocation(line: 100, column: 27, scope: !205)
!205 = distinct !DILexicalBlock(scope: !206, file: !45, line: 100, column: 21)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 98, column: 13)
!207 = !DILocation(line: 100, column: 32, scope: !205)
!208 = !DILocation(line: 100, column: 31, scope: !205)
!209 = !DILocation(line: 100, column: 51, scope: !205)
!210 = !DILocation(line: 100, column: 50, scope: !205)
!211 = !DILocation(line: 100, column: 41, scope: !205)
!212 = !DILocation(line: 100, column: 61, scope: !205)
!213 = !DILocation(line: 100, column: 21, scope: !205)
!214 = !DILocation(line: 100, column: 68, scope: !205)
!215 = !DILocation(line: 100, column: 21, scope: !206)
!216 = !DILocation(line: 102, column: 21, scope: !217)
!217 = distinct !DILexicalBlock(scope: !205, file: !45, line: 101, column: 17)
!218 = !DILocation(line: 104, column: 21, scope: !217)
!219 = !DILocation(line: 104, column: 26, scope: !217)
!220 = !DILocation(line: 104, column: 35, scope: !217)
!221 = !DILocation(line: 105, column: 17, scope: !217)
!222 = !DILocation(line: 106, column: 24, scope: !206)
!223 = !DILocation(line: 106, column: 17, scope: !206)
!224 = !DILocation(line: 107, column: 13, scope: !206)
!225 = !DILocation(line: 108, column: 9, scope: !198)
!226 = !DILocation(line: 110, column: 5, scope: !178)
!227 = !DILocation(line: 111, column: 1, scope: !178)
!228 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_63_good", scope: !45, file: !45, line: 113, type: !55, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!229 = !DILocation(line: 115, column: 5, scope: !228)
!230 = !DILocation(line: 116, column: 5, scope: !228)
!231 = !DILocation(line: 117, column: 1, scope: !228)
!232 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_63b_badSink", scope: !49, file: !49, line: 34, type: !233, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!233 = !DISubroutineType(types: !234)
!234 = !{null, !41}
!235 = !DILocalVariable(name: "dataPtr", arg: 1, scope: !232, file: !49, line: 34, type: !41)
!236 = !DILocation(line: 34, column: 70, scope: !232)
!237 = !DILocalVariable(name: "data", scope: !232, file: !49, line: 36, type: !42)
!238 = !DILocation(line: 36, column: 12, scope: !232)
!239 = !DILocation(line: 36, column: 20, scope: !232)
!240 = !DILocation(line: 36, column: 19, scope: !232)
!241 = !DILocalVariable(name: "i", scope: !242, file: !49, line: 38, type: !23)
!242 = distinct !DILexicalBlock(scope: !232, file: !49, line: 37, column: 5)
!243 = !DILocation(line: 38, column: 13, scope: !242)
!244 = !DILocalVariable(name: "n", scope: !242, file: !49, line: 38, type: !23)
!245 = !DILocation(line: 38, column: 16, scope: !242)
!246 = !DILocalVariable(name: "intVariable", scope: !242, file: !49, line: 38, type: !23)
!247 = !DILocation(line: 38, column: 19, scope: !242)
!248 = !DILocation(line: 39, column: 20, scope: !249)
!249 = distinct !DILexicalBlock(scope: !242, file: !49, line: 39, column: 13)
!250 = !DILocation(line: 39, column: 13, scope: !249)
!251 = !DILocation(line: 39, column: 36, scope: !249)
!252 = !DILocation(line: 39, column: 13, scope: !242)
!253 = !DILocation(line: 42, column: 25, scope: !254)
!254 = distinct !DILexicalBlock(scope: !249, file: !49, line: 40, column: 9)
!255 = !DILocation(line: 43, column: 20, scope: !256)
!256 = distinct !DILexicalBlock(scope: !254, file: !49, line: 43, column: 13)
!257 = !DILocation(line: 43, column: 18, scope: !256)
!258 = !DILocation(line: 43, column: 25, scope: !259)
!259 = distinct !DILexicalBlock(scope: !256, file: !49, line: 43, column: 13)
!260 = !DILocation(line: 43, column: 29, scope: !259)
!261 = !DILocation(line: 43, column: 27, scope: !259)
!262 = !DILocation(line: 43, column: 13, scope: !256)
!263 = !DILocation(line: 46, column: 28, scope: !264)
!264 = distinct !DILexicalBlock(scope: !259, file: !49, line: 44, column: 13)
!265 = !DILocation(line: 47, column: 13, scope: !264)
!266 = !DILocation(line: 43, column: 33, scope: !259)
!267 = !DILocation(line: 43, column: 13, scope: !259)
!268 = distinct !{!268, !262, !269, !270}
!269 = !DILocation(line: 47, column: 13, scope: !256)
!270 = !{!"llvm.loop.mustprogress"}
!271 = !DILocation(line: 48, column: 26, scope: !254)
!272 = !DILocation(line: 48, column: 13, scope: !254)
!273 = !DILocation(line: 49, column: 9, scope: !254)
!274 = !DILocation(line: 51, column: 1, scope: !232)
!275 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_63b_goodG2BSink", scope: !49, file: !49, line: 58, type: !233, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!276 = !DILocalVariable(name: "dataPtr", arg: 1, scope: !275, file: !49, line: 58, type: !41)
!277 = !DILocation(line: 58, column: 74, scope: !275)
!278 = !DILocalVariable(name: "data", scope: !275, file: !49, line: 60, type: !42)
!279 = !DILocation(line: 60, column: 12, scope: !275)
!280 = !DILocation(line: 60, column: 20, scope: !275)
!281 = !DILocation(line: 60, column: 19, scope: !275)
!282 = !DILocalVariable(name: "i", scope: !283, file: !49, line: 62, type: !23)
!283 = distinct !DILexicalBlock(scope: !275, file: !49, line: 61, column: 5)
!284 = !DILocation(line: 62, column: 13, scope: !283)
!285 = !DILocalVariable(name: "n", scope: !283, file: !49, line: 62, type: !23)
!286 = !DILocation(line: 62, column: 16, scope: !283)
!287 = !DILocalVariable(name: "intVariable", scope: !283, file: !49, line: 62, type: !23)
!288 = !DILocation(line: 62, column: 19, scope: !283)
!289 = !DILocation(line: 63, column: 20, scope: !290)
!290 = distinct !DILexicalBlock(scope: !283, file: !49, line: 63, column: 13)
!291 = !DILocation(line: 63, column: 13, scope: !290)
!292 = !DILocation(line: 63, column: 36, scope: !290)
!293 = !DILocation(line: 63, column: 13, scope: !283)
!294 = !DILocation(line: 66, column: 25, scope: !295)
!295 = distinct !DILexicalBlock(scope: !290, file: !49, line: 64, column: 9)
!296 = !DILocation(line: 67, column: 20, scope: !297)
!297 = distinct !DILexicalBlock(scope: !295, file: !49, line: 67, column: 13)
!298 = !DILocation(line: 67, column: 18, scope: !297)
!299 = !DILocation(line: 67, column: 25, scope: !300)
!300 = distinct !DILexicalBlock(scope: !297, file: !49, line: 67, column: 13)
!301 = !DILocation(line: 67, column: 29, scope: !300)
!302 = !DILocation(line: 67, column: 27, scope: !300)
!303 = !DILocation(line: 67, column: 13, scope: !297)
!304 = !DILocation(line: 70, column: 28, scope: !305)
!305 = distinct !DILexicalBlock(scope: !300, file: !49, line: 68, column: 13)
!306 = !DILocation(line: 71, column: 13, scope: !305)
!307 = !DILocation(line: 67, column: 33, scope: !300)
!308 = !DILocation(line: 67, column: 13, scope: !300)
!309 = distinct !{!309, !303, !310, !270}
!310 = !DILocation(line: 71, column: 13, scope: !297)
!311 = !DILocation(line: 72, column: 26, scope: !295)
!312 = !DILocation(line: 72, column: 13, scope: !295)
!313 = !DILocation(line: 73, column: 9, scope: !295)
!314 = !DILocation(line: 75, column: 1, scope: !275)
!315 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_63b_goodB2GSink", scope: !49, file: !49, line: 78, type: !233, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!316 = !DILocalVariable(name: "dataPtr", arg: 1, scope: !315, file: !49, line: 78, type: !41)
!317 = !DILocation(line: 78, column: 74, scope: !315)
!318 = !DILocalVariable(name: "data", scope: !315, file: !49, line: 80, type: !42)
!319 = !DILocation(line: 80, column: 12, scope: !315)
!320 = !DILocation(line: 80, column: 20, scope: !315)
!321 = !DILocation(line: 80, column: 19, scope: !315)
!322 = !DILocalVariable(name: "i", scope: !323, file: !49, line: 82, type: !23)
!323 = distinct !DILexicalBlock(scope: !315, file: !49, line: 81, column: 5)
!324 = !DILocation(line: 82, column: 13, scope: !323)
!325 = !DILocalVariable(name: "n", scope: !323, file: !49, line: 82, type: !23)
!326 = !DILocation(line: 82, column: 16, scope: !323)
!327 = !DILocalVariable(name: "intVariable", scope: !323, file: !49, line: 82, type: !23)
!328 = !DILocation(line: 82, column: 19, scope: !323)
!329 = !DILocation(line: 83, column: 20, scope: !330)
!330 = distinct !DILexicalBlock(scope: !323, file: !49, line: 83, column: 13)
!331 = !DILocation(line: 83, column: 13, scope: !330)
!332 = !DILocation(line: 83, column: 36, scope: !330)
!333 = !DILocation(line: 83, column: 13, scope: !323)
!334 = !DILocation(line: 86, column: 17, scope: !335)
!335 = distinct !DILexicalBlock(scope: !336, file: !49, line: 86, column: 17)
!336 = distinct !DILexicalBlock(scope: !330, file: !49, line: 84, column: 9)
!337 = !DILocation(line: 86, column: 19, scope: !335)
!338 = !DILocation(line: 86, column: 17, scope: !336)
!339 = !DILocation(line: 88, column: 29, scope: !340)
!340 = distinct !DILexicalBlock(scope: !335, file: !49, line: 87, column: 13)
!341 = !DILocation(line: 89, column: 24, scope: !342)
!342 = distinct !DILexicalBlock(scope: !340, file: !49, line: 89, column: 17)
!343 = !DILocation(line: 89, column: 22, scope: !342)
!344 = !DILocation(line: 89, column: 29, scope: !345)
!345 = distinct !DILexicalBlock(scope: !342, file: !49, line: 89, column: 17)
!346 = !DILocation(line: 89, column: 33, scope: !345)
!347 = !DILocation(line: 89, column: 31, scope: !345)
!348 = !DILocation(line: 89, column: 17, scope: !342)
!349 = !DILocation(line: 92, column: 32, scope: !350)
!350 = distinct !DILexicalBlock(scope: !345, file: !49, line: 90, column: 17)
!351 = !DILocation(line: 93, column: 17, scope: !350)
!352 = !DILocation(line: 89, column: 37, scope: !345)
!353 = !DILocation(line: 89, column: 17, scope: !345)
!354 = distinct !{!354, !348, !355, !270}
!355 = !DILocation(line: 93, column: 17, scope: !342)
!356 = !DILocation(line: 94, column: 30, scope: !340)
!357 = !DILocation(line: 94, column: 17, scope: !340)
!358 = !DILocation(line: 95, column: 13, scope: !340)
!359 = !DILocation(line: 96, column: 9, scope: !336)
!360 = !DILocation(line: 98, column: 1, scope: !315)
!361 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !362, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!362 = !DISubroutineType(types: !363)
!363 = !{null, !42}
!364 = !DILocalVariable(name: "line", arg: 1, scope: !361, file: !3, line: 11, type: !42)
!365 = !DILocation(line: 11, column: 25, scope: !361)
!366 = !DILocation(line: 13, column: 1, scope: !361)
!367 = !DILocation(line: 14, column: 8, scope: !368)
!368 = distinct !DILexicalBlock(scope: !361, file: !3, line: 14, column: 8)
!369 = !DILocation(line: 14, column: 13, scope: !368)
!370 = !DILocation(line: 14, column: 8, scope: !361)
!371 = !DILocation(line: 16, column: 24, scope: !372)
!372 = distinct !DILexicalBlock(scope: !368, file: !3, line: 15, column: 5)
!373 = !DILocation(line: 16, column: 9, scope: !372)
!374 = !DILocation(line: 17, column: 5, scope: !372)
!375 = !DILocation(line: 18, column: 5, scope: !361)
!376 = !DILocation(line: 19, column: 1, scope: !361)
!377 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !362, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!378 = !DILocalVariable(name: "line", arg: 1, scope: !377, file: !3, line: 20, type: !42)
!379 = !DILocation(line: 20, column: 29, scope: !377)
!380 = !DILocation(line: 22, column: 8, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !3, line: 22, column: 8)
!382 = !DILocation(line: 22, column: 13, scope: !381)
!383 = !DILocation(line: 22, column: 8, scope: !377)
!384 = !DILocation(line: 24, column: 24, scope: !385)
!385 = distinct !DILexicalBlock(scope: !381, file: !3, line: 23, column: 5)
!386 = !DILocation(line: 24, column: 9, scope: !385)
!387 = !DILocation(line: 25, column: 5, scope: !385)
!388 = !DILocation(line: 26, column: 1, scope: !377)
!389 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !390, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392}
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64)
!393 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !23)
!394 = !DILocalVariable(name: "line", arg: 1, scope: !389, file: !3, line: 27, type: !392)
!395 = !DILocation(line: 27, column: 29, scope: !389)
!396 = !DILocation(line: 29, column: 8, scope: !397)
!397 = distinct !DILexicalBlock(scope: !389, file: !3, line: 29, column: 8)
!398 = !DILocation(line: 29, column: 13, scope: !397)
!399 = !DILocation(line: 29, column: 8, scope: !389)
!400 = !DILocation(line: 31, column: 27, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 30, column: 5)
!402 = !DILocation(line: 31, column: 9, scope: !401)
!403 = !DILocation(line: 32, column: 5, scope: !401)
!404 = !DILocation(line: 33, column: 1, scope: !389)
!405 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !406, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !23}
!408 = !DILocalVariable(name: "intNumber", arg: 1, scope: !405, file: !3, line: 35, type: !23)
!409 = !DILocation(line: 35, column: 24, scope: !405)
!410 = !DILocation(line: 37, column: 20, scope: !405)
!411 = !DILocation(line: 37, column: 5, scope: !405)
!412 = !DILocation(line: 38, column: 1, scope: !405)
!413 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !414, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !416}
!416 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!417 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !413, file: !3, line: 40, type: !416)
!418 = !DILocation(line: 40, column: 28, scope: !413)
!419 = !DILocation(line: 42, column: 21, scope: !413)
!420 = !DILocation(line: 42, column: 5, scope: !413)
!421 = !DILocation(line: 43, column: 1, scope: !413)
!422 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !423, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!426 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !422, file: !3, line: 45, type: !425)
!427 = !DILocation(line: 45, column: 28, scope: !422)
!428 = !DILocation(line: 47, column: 20, scope: !422)
!429 = !DILocation(line: 47, column: 5, scope: !422)
!430 = !DILocation(line: 48, column: 1, scope: !422)
!431 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !432, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !103}
!434 = !DILocalVariable(name: "longNumber", arg: 1, scope: !431, file: !3, line: 50, type: !103)
!435 = !DILocation(line: 50, column: 26, scope: !431)
!436 = !DILocation(line: 52, column: 21, scope: !431)
!437 = !DILocation(line: 52, column: 5, scope: !431)
!438 = !DILocation(line: 53, column: 1, scope: !431)
!439 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !440, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !442}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !443, line: 27, baseType: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 44, baseType: !103)
!445 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !439, file: !3, line: 55, type: !442)
!446 = !DILocation(line: 55, column: 33, scope: !439)
!447 = !DILocation(line: 57, column: 29, scope: !439)
!448 = !DILocation(line: 57, column: 5, scope: !439)
!449 = !DILocation(line: 58, column: 1, scope: !439)
!450 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !451, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !68}
!453 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !450, file: !3, line: 60, type: !68)
!454 = !DILocation(line: 60, column: 29, scope: !450)
!455 = !DILocation(line: 62, column: 21, scope: !450)
!456 = !DILocation(line: 62, column: 5, scope: !450)
!457 = !DILocation(line: 63, column: 1, scope: !450)
!458 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !459, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !43}
!461 = !DILocalVariable(name: "charHex", arg: 1, scope: !458, file: !3, line: 65, type: !43)
!462 = !DILocation(line: 65, column: 29, scope: !458)
!463 = !DILocation(line: 67, column: 22, scope: !458)
!464 = !DILocation(line: 67, column: 5, scope: !458)
!465 = !DILocation(line: 68, column: 1, scope: !458)
!466 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !467, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !393}
!469 = !DILocalVariable(name: "wideChar", arg: 1, scope: !466, file: !3, line: 70, type: !393)
!470 = !DILocation(line: 70, column: 29, scope: !466)
!471 = !DILocalVariable(name: "s", scope: !466, file: !3, line: 74, type: !472)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !393, size: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 2)
!475 = !DILocation(line: 74, column: 13, scope: !466)
!476 = !DILocation(line: 75, column: 16, scope: !466)
!477 = !DILocation(line: 75, column: 9, scope: !466)
!478 = !DILocation(line: 75, column: 14, scope: !466)
!479 = !DILocation(line: 76, column: 9, scope: !466)
!480 = !DILocation(line: 76, column: 14, scope: !466)
!481 = !DILocation(line: 77, column: 21, scope: !466)
!482 = !DILocation(line: 77, column: 5, scope: !466)
!483 = !DILocation(line: 78, column: 1, scope: !466)
!484 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !485, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !7}
!487 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !484, file: !3, line: 80, type: !7)
!488 = !DILocation(line: 80, column: 33, scope: !484)
!489 = !DILocation(line: 82, column: 20, scope: !484)
!490 = !DILocation(line: 82, column: 5, scope: !484)
!491 = !DILocation(line: 83, column: 1, scope: !484)
!492 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !493, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !25}
!495 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !492, file: !3, line: 85, type: !25)
!496 = !DILocation(line: 85, column: 45, scope: !492)
!497 = !DILocation(line: 87, column: 22, scope: !492)
!498 = !DILocation(line: 87, column: 5, scope: !492)
!499 = !DILocation(line: 88, column: 1, scope: !492)
!500 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !501, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !503}
!503 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!504 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !500, file: !3, line: 90, type: !503)
!505 = !DILocation(line: 90, column: 29, scope: !500)
!506 = !DILocation(line: 92, column: 20, scope: !500)
!507 = !DILocation(line: 92, column: 5, scope: !500)
!508 = !DILocation(line: 93, column: 1, scope: !500)
!509 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !510, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !514, line: 100, baseType: !515)
!514 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_109/source_code")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !514, line: 96, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !515, file: !514, line: 98, baseType: !23, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !515, file: !514, line: 99, baseType: !23, size: 32, offset: 32)
!519 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !509, file: !3, line: 95, type: !512)
!520 = !DILocation(line: 95, column: 40, scope: !509)
!521 = !DILocation(line: 97, column: 26, scope: !509)
!522 = !DILocation(line: 97, column: 47, scope: !509)
!523 = !DILocation(line: 97, column: 55, scope: !509)
!524 = !DILocation(line: 97, column: 76, scope: !509)
!525 = !DILocation(line: 97, column: 5, scope: !509)
!526 = !DILocation(line: 98, column: 1, scope: !509)
!527 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !528, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530, !68}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!531 = !DILocalVariable(name: "bytes", arg: 1, scope: !527, file: !3, line: 100, type: !530)
!532 = !DILocation(line: 100, column: 38, scope: !527)
!533 = !DILocalVariable(name: "numBytes", arg: 2, scope: !527, file: !3, line: 100, type: !68)
!534 = !DILocation(line: 100, column: 52, scope: !527)
!535 = !DILocalVariable(name: "i", scope: !527, file: !3, line: 102, type: !68)
!536 = !DILocation(line: 102, column: 12, scope: !527)
!537 = !DILocation(line: 103, column: 12, scope: !538)
!538 = distinct !DILexicalBlock(scope: !527, file: !3, line: 103, column: 5)
!539 = !DILocation(line: 103, column: 10, scope: !538)
!540 = !DILocation(line: 103, column: 17, scope: !541)
!541 = distinct !DILexicalBlock(scope: !538, file: !3, line: 103, column: 5)
!542 = !DILocation(line: 103, column: 21, scope: !541)
!543 = !DILocation(line: 103, column: 19, scope: !541)
!544 = !DILocation(line: 103, column: 5, scope: !538)
!545 = !DILocation(line: 105, column: 24, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !3, line: 104, column: 5)
!547 = !DILocation(line: 105, column: 30, scope: !546)
!548 = !DILocation(line: 105, column: 9, scope: !546)
!549 = !DILocation(line: 106, column: 5, scope: !546)
!550 = !DILocation(line: 103, column: 31, scope: !541)
!551 = !DILocation(line: 103, column: 5, scope: !541)
!552 = distinct !{!552, !544, !553, !270}
!553 = !DILocation(line: 106, column: 5, scope: !538)
!554 = !DILocation(line: 107, column: 5, scope: !527)
!555 = !DILocation(line: 108, column: 1, scope: !527)
!556 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !557, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!557 = !DISubroutineType(types: !558)
!558 = !{!68, !530, !68, !42}
!559 = !DILocalVariable(name: "bytes", arg: 1, scope: !556, file: !3, line: 113, type: !530)
!560 = !DILocation(line: 113, column: 39, scope: !556)
!561 = !DILocalVariable(name: "numBytes", arg: 2, scope: !556, file: !3, line: 113, type: !68)
!562 = !DILocation(line: 113, column: 53, scope: !556)
!563 = !DILocalVariable(name: "hex", arg: 3, scope: !556, file: !3, line: 113, type: !42)
!564 = !DILocation(line: 113, column: 71, scope: !556)
!565 = !DILocalVariable(name: "numWritten", scope: !556, file: !3, line: 115, type: !68)
!566 = !DILocation(line: 115, column: 12, scope: !556)
!567 = !DILocation(line: 121, column: 5, scope: !556)
!568 = !DILocation(line: 121, column: 12, scope: !556)
!569 = !DILocation(line: 121, column: 25, scope: !556)
!570 = !DILocation(line: 121, column: 23, scope: !556)
!571 = !DILocation(line: 121, column: 34, scope: !556)
!572 = !DILocation(line: 121, column: 37, scope: !556)
!573 = !DILocation(line: 121, column: 67, scope: !556)
!574 = !DILocation(line: 121, column: 70, scope: !556)
!575 = !DILocation(line: 0, scope: !556)
!576 = !DILocalVariable(name: "byte", scope: !577, file: !3, line: 123, type: !23)
!577 = distinct !DILexicalBlock(scope: !556, file: !3, line: 122, column: 5)
!578 = !DILocation(line: 123, column: 13, scope: !577)
