; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@CWE134_Uncontrolled_Format_String__char_file_fprintf_68_badData = dso_local global i8* null, align 8, !dbg !0
@CWE134_Uncontrolled_Format_String__char_file_fprintf_68_goodG2BData = dso_local global i8* null, align 8, !dbg !9
@CWE134_Uncontrolled_Format_String__char_file_fprintf_68_goodB2GData = dso_local global i8* null, align 8, !dbg !13
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !15

!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !36, globals: !39, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_002/source_code")
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !22, size: 32, elements: !23)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!36 = !{!6, !7, !37, !38}
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!15, !40, !42, !44, !46, !48, !50, !52}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !17, file: !18, line: 175, type: !7, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !17, file: !18, line: 176, type: !7, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "globalTrue", scope: !17, file: !18, line: 181, type: !7, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "globalFalse", scope: !17, file: !18, line: 182, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalFive", scope: !17, file: !18, line: 183, type: !7, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "globalArgc", scope: !17, file: !18, line: 214, type: !7, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "globalArgv", scope: !17, file: !18, line: 215, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !56, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!56 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_68b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_002/source_code")
!57 = !{!"clang version 12.0.0"}
!58 = !{i32 7, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_68_bad", scope: !3, file: !3, line: 39, type: !62, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!62 = !DISubroutineType(types: !63)
!63 = !{null}
!64 = !DILocalVariable(name: "data", scope: !61, file: !3, line: 41, type: !11)
!65 = !DILocation(line: 41, column: 12, scope: !61)
!66 = !DILocalVariable(name: "dataBuffer", scope: !61, file: !3, line: 42, type: !67)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 800, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 100)
!70 = !DILocation(line: 42, column: 10, scope: !61)
!71 = !DILocation(line: 43, column: 12, scope: !61)
!72 = !DILocation(line: 43, column: 10, scope: !61)
!73 = !DILocalVariable(name: "dataLen", scope: !74, file: !3, line: 46, type: !75)
!74 = distinct !DILexicalBlock(scope: !61, file: !3, line: 44, column: 5)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DILocation(line: 46, column: 16, scope: !74)
!79 = !DILocation(line: 46, column: 33, scope: !74)
!80 = !DILocation(line: 46, column: 26, scope: !74)
!81 = !DILocalVariable(name: "pFile", scope: !74, file: !3, line: 47, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 7, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !105, !106, !107, !111, !112, !114, !118, !121, !123, !126, !129, !130, !131, !132, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !7, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !11, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !11, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !11, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !11, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !11, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !11, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !11, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !11, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !11, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !11, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !11, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !7, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !7, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !37, size: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !113, size: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !115, size: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !119, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !122, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 153, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !104, size: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !6, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !75, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !7, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 47, column: 16, scope: !74)
!138 = !DILocation(line: 49, column: 17, scope: !139)
!139 = distinct !DILexicalBlock(scope: !74, file: !3, line: 49, column: 13)
!140 = !DILocation(line: 49, column: 16, scope: !139)
!141 = !DILocation(line: 49, column: 25, scope: !139)
!142 = !DILocation(line: 49, column: 13, scope: !74)
!143 = !DILocation(line: 51, column: 21, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !3, line: 50, column: 9)
!145 = !DILocation(line: 51, column: 19, scope: !144)
!146 = !DILocation(line: 52, column: 17, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !3, line: 52, column: 17)
!148 = !DILocation(line: 52, column: 23, scope: !147)
!149 = !DILocation(line: 52, column: 17, scope: !144)
!150 = !DILocation(line: 55, column: 27, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 55, column: 21)
!152 = distinct !DILexicalBlock(scope: !147, file: !3, line: 53, column: 13)
!153 = !DILocation(line: 55, column: 32, scope: !151)
!154 = !DILocation(line: 55, column: 31, scope: !151)
!155 = !DILocation(line: 55, column: 51, scope: !151)
!156 = !DILocation(line: 55, column: 50, scope: !151)
!157 = !DILocation(line: 55, column: 41, scope: !151)
!158 = !DILocation(line: 55, column: 61, scope: !151)
!159 = !DILocation(line: 55, column: 21, scope: !151)
!160 = !DILocation(line: 55, column: 68, scope: !151)
!161 = !DILocation(line: 55, column: 21, scope: !152)
!162 = !DILocation(line: 57, column: 21, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !3, line: 56, column: 17)
!164 = !DILocation(line: 59, column: 21, scope: !163)
!165 = !DILocation(line: 59, column: 26, scope: !163)
!166 = !DILocation(line: 59, column: 35, scope: !163)
!167 = !DILocation(line: 60, column: 17, scope: !163)
!168 = !DILocation(line: 61, column: 24, scope: !152)
!169 = !DILocation(line: 61, column: 17, scope: !152)
!170 = !DILocation(line: 62, column: 13, scope: !152)
!171 = !DILocation(line: 63, column: 9, scope: !144)
!172 = !DILocation(line: 65, column: 71, scope: !61)
!173 = !DILocation(line: 65, column: 69, scope: !61)
!174 = !DILocation(line: 66, column: 5, scope: !61)
!175 = !DILocation(line: 67, column: 1, scope: !61)
!176 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 76, type: !62, scopeLine: 77, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!177 = !DILocalVariable(name: "data", scope: !176, file: !3, line: 78, type: !11)
!178 = !DILocation(line: 78, column: 12, scope: !176)
!179 = !DILocalVariable(name: "dataBuffer", scope: !176, file: !3, line: 79, type: !67)
!180 = !DILocation(line: 79, column: 10, scope: !176)
!181 = !DILocation(line: 80, column: 12, scope: !176)
!182 = !DILocation(line: 80, column: 10, scope: !176)
!183 = !DILocation(line: 82, column: 12, scope: !176)
!184 = !DILocation(line: 82, column: 5, scope: !176)
!185 = !DILocation(line: 83, column: 75, scope: !176)
!186 = !DILocation(line: 83, column: 73, scope: !176)
!187 = !DILocation(line: 84, column: 5, scope: !176)
!188 = !DILocation(line: 85, column: 1, scope: !176)
!189 = distinct !DISubprogram(name: "goodB2G", scope: !3, file: !3, line: 88, type: !62, scopeLine: 89, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!190 = !DILocalVariable(name: "data", scope: !189, file: !3, line: 90, type: !11)
!191 = !DILocation(line: 90, column: 12, scope: !189)
!192 = !DILocalVariable(name: "dataBuffer", scope: !189, file: !3, line: 91, type: !67)
!193 = !DILocation(line: 91, column: 10, scope: !189)
!194 = !DILocation(line: 92, column: 12, scope: !189)
!195 = !DILocation(line: 92, column: 10, scope: !189)
!196 = !DILocalVariable(name: "dataLen", scope: !197, file: !3, line: 95, type: !75)
!197 = distinct !DILexicalBlock(scope: !189, file: !3, line: 93, column: 5)
!198 = !DILocation(line: 95, column: 16, scope: !197)
!199 = !DILocation(line: 95, column: 33, scope: !197)
!200 = !DILocation(line: 95, column: 26, scope: !197)
!201 = !DILocalVariable(name: "pFile", scope: !197, file: !3, line: 96, type: !82)
!202 = !DILocation(line: 96, column: 16, scope: !197)
!203 = !DILocation(line: 98, column: 17, scope: !204)
!204 = distinct !DILexicalBlock(scope: !197, file: !3, line: 98, column: 13)
!205 = !DILocation(line: 98, column: 16, scope: !204)
!206 = !DILocation(line: 98, column: 25, scope: !204)
!207 = !DILocation(line: 98, column: 13, scope: !197)
!208 = !DILocation(line: 100, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !204, file: !3, line: 99, column: 9)
!210 = !DILocation(line: 100, column: 19, scope: !209)
!211 = !DILocation(line: 101, column: 17, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !3, line: 101, column: 17)
!213 = !DILocation(line: 101, column: 23, scope: !212)
!214 = !DILocation(line: 101, column: 17, scope: !209)
!215 = !DILocation(line: 104, column: 27, scope: !216)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 104, column: 21)
!217 = distinct !DILexicalBlock(scope: !212, file: !3, line: 102, column: 13)
!218 = !DILocation(line: 104, column: 32, scope: !216)
!219 = !DILocation(line: 104, column: 31, scope: !216)
!220 = !DILocation(line: 104, column: 51, scope: !216)
!221 = !DILocation(line: 104, column: 50, scope: !216)
!222 = !DILocation(line: 104, column: 41, scope: !216)
!223 = !DILocation(line: 104, column: 61, scope: !216)
!224 = !DILocation(line: 104, column: 21, scope: !216)
!225 = !DILocation(line: 104, column: 68, scope: !216)
!226 = !DILocation(line: 104, column: 21, scope: !217)
!227 = !DILocation(line: 106, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !216, file: !3, line: 105, column: 17)
!229 = !DILocation(line: 108, column: 21, scope: !228)
!230 = !DILocation(line: 108, column: 26, scope: !228)
!231 = !DILocation(line: 108, column: 35, scope: !228)
!232 = !DILocation(line: 109, column: 17, scope: !228)
!233 = !DILocation(line: 110, column: 24, scope: !217)
!234 = !DILocation(line: 110, column: 17, scope: !217)
!235 = !DILocation(line: 111, column: 13, scope: !217)
!236 = !DILocation(line: 112, column: 9, scope: !209)
!237 = !DILocation(line: 114, column: 75, scope: !189)
!238 = !DILocation(line: 114, column: 73, scope: !189)
!239 = !DILocation(line: 115, column: 5, scope: !189)
!240 = !DILocation(line: 116, column: 1, scope: !189)
!241 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_68_good", scope: !3, file: !3, line: 118, type: !62, scopeLine: 119, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!242 = !DILocation(line: 120, column: 5, scope: !241)
!243 = !DILocation(line: 121, column: 5, scope: !241)
!244 = !DILocation(line: 122, column: 1, scope: !241)
!245 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_68b_badSink", scope: !56, file: !56, line: 36, type: !62, scopeLine: 37, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!246 = !DILocalVariable(name: "data", scope: !245, file: !56, line: 38, type: !11)
!247 = !DILocation(line: 38, column: 12, scope: !245)
!248 = !DILocation(line: 38, column: 19, scope: !245)
!249 = !DILocation(line: 40, column: 13, scope: !245)
!250 = !DILocation(line: 40, column: 21, scope: !245)
!251 = !DILocation(line: 40, column: 5, scope: !245)
!252 = !DILocation(line: 41, column: 1, scope: !245)
!253 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_68b_goodG2BSink", scope: !56, file: !56, line: 48, type: !62, scopeLine: 49, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!254 = !DILocalVariable(name: "data", scope: !253, file: !56, line: 50, type: !11)
!255 = !DILocation(line: 50, column: 12, scope: !253)
!256 = !DILocation(line: 50, column: 19, scope: !253)
!257 = !DILocation(line: 52, column: 13, scope: !253)
!258 = !DILocation(line: 52, column: 21, scope: !253)
!259 = !DILocation(line: 52, column: 5, scope: !253)
!260 = !DILocation(line: 53, column: 1, scope: !253)
!261 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_68b_goodB2GSink", scope: !56, file: !56, line: 56, type: !62, scopeLine: 57, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!262 = !DILocalVariable(name: "data", scope: !261, file: !56, line: 58, type: !11)
!263 = !DILocation(line: 58, column: 12, scope: !261)
!264 = !DILocation(line: 58, column: 19, scope: !261)
!265 = !DILocation(line: 60, column: 13, scope: !261)
!266 = !DILocation(line: 60, column: 29, scope: !261)
!267 = !DILocation(line: 60, column: 5, scope: !261)
!268 = !DILocation(line: 61, column: 1, scope: !261)
!269 = distinct !DISubprogram(name: "printLine", scope: !18, file: !18, line: 11, type: !270, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!270 = !DISubroutineType(types: !271)
!271 = !{null, !11}
!272 = !DILocalVariable(name: "line", arg: 1, scope: !269, file: !18, line: 11, type: !11)
!273 = !DILocation(line: 11, column: 25, scope: !269)
!274 = !DILocation(line: 13, column: 1, scope: !269)
!275 = !DILocation(line: 14, column: 8, scope: !276)
!276 = distinct !DILexicalBlock(scope: !269, file: !18, line: 14, column: 8)
!277 = !DILocation(line: 14, column: 13, scope: !276)
!278 = !DILocation(line: 14, column: 8, scope: !269)
!279 = !DILocation(line: 16, column: 24, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !18, line: 15, column: 5)
!281 = !DILocation(line: 16, column: 9, scope: !280)
!282 = !DILocation(line: 17, column: 5, scope: !280)
!283 = !DILocation(line: 18, column: 5, scope: !269)
!284 = !DILocation(line: 19, column: 1, scope: !269)
!285 = distinct !DISubprogram(name: "printSinkLine", scope: !18, file: !18, line: 20, type: !270, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!286 = !DILocalVariable(name: "line", arg: 1, scope: !285, file: !18, line: 20, type: !11)
!287 = !DILocation(line: 20, column: 29, scope: !285)
!288 = !DILocation(line: 22, column: 8, scope: !289)
!289 = distinct !DILexicalBlock(scope: !285, file: !18, line: 22, column: 8)
!290 = !DILocation(line: 22, column: 13, scope: !289)
!291 = !DILocation(line: 22, column: 8, scope: !285)
!292 = !DILocation(line: 24, column: 24, scope: !293)
!293 = distinct !DILexicalBlock(scope: !289, file: !18, line: 23, column: 5)
!294 = !DILocation(line: 24, column: 9, scope: !293)
!295 = !DILocation(line: 25, column: 5, scope: !293)
!296 = !DILocation(line: 26, column: 1, scope: !285)
!297 = distinct !DISubprogram(name: "printWLine", scope: !18, file: !18, line: 27, type: !298, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!298 = !DISubroutineType(types: !299)
!299 = !{null, !300}
!300 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !301, size: 64)
!301 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !76, line: 74, baseType: !7)
!302 = !DILocalVariable(name: "line", arg: 1, scope: !297, file: !18, line: 27, type: !300)
!303 = !DILocation(line: 27, column: 29, scope: !297)
!304 = !DILocation(line: 29, column: 8, scope: !305)
!305 = distinct !DILexicalBlock(scope: !297, file: !18, line: 29, column: 8)
!306 = !DILocation(line: 29, column: 13, scope: !305)
!307 = !DILocation(line: 29, column: 8, scope: !297)
!308 = !DILocation(line: 31, column: 27, scope: !309)
!309 = distinct !DILexicalBlock(scope: !305, file: !18, line: 30, column: 5)
!310 = !DILocation(line: 31, column: 9, scope: !309)
!311 = !DILocation(line: 32, column: 5, scope: !309)
!312 = !DILocation(line: 33, column: 1, scope: !297)
!313 = distinct !DISubprogram(name: "printIntLine", scope: !18, file: !18, line: 35, type: !314, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !7}
!316 = !DILocalVariable(name: "intNumber", arg: 1, scope: !313, file: !18, line: 35, type: !7)
!317 = !DILocation(line: 35, column: 24, scope: !313)
!318 = !DILocation(line: 37, column: 20, scope: !313)
!319 = !DILocation(line: 37, column: 5, scope: !313)
!320 = !DILocation(line: 38, column: 1, scope: !313)
!321 = distinct !DISubprogram(name: "printShortLine", scope: !18, file: !18, line: 40, type: !322, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !324}
!324 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!325 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !321, file: !18, line: 40, type: !324)
!326 = !DILocation(line: 40, column: 28, scope: !321)
!327 = !DILocation(line: 42, column: 21, scope: !321)
!328 = !DILocation(line: 42, column: 5, scope: !321)
!329 = !DILocation(line: 43, column: 1, scope: !321)
!330 = distinct !DISubprogram(name: "printFloatLine", scope: !18, file: !18, line: 45, type: !331, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !333}
!333 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!334 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !330, file: !18, line: 45, type: !333)
!335 = !DILocation(line: 45, column: 28, scope: !330)
!336 = !DILocation(line: 47, column: 20, scope: !330)
!337 = !DILocation(line: 47, column: 5, scope: !330)
!338 = !DILocation(line: 48, column: 1, scope: !330)
!339 = distinct !DISubprogram(name: "printLongLine", scope: !18, file: !18, line: 50, type: !340, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !110}
!342 = !DILocalVariable(name: "longNumber", arg: 1, scope: !339, file: !18, line: 50, type: !110)
!343 = !DILocation(line: 50, column: 26, scope: !339)
!344 = !DILocation(line: 52, column: 21, scope: !339)
!345 = !DILocation(line: 52, column: 5, scope: !339)
!346 = !DILocation(line: 53, column: 1, scope: !339)
!347 = distinct !DISubprogram(name: "printLongLongLine", scope: !18, file: !18, line: 55, type: !348, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !350}
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !351, line: 27, baseType: !352)
!351 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!352 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 44, baseType: !110)
!353 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !347, file: !18, line: 55, type: !350)
!354 = !DILocation(line: 55, column: 33, scope: !347)
!355 = !DILocation(line: 57, column: 29, scope: !347)
!356 = !DILocation(line: 57, column: 5, scope: !347)
!357 = !DILocation(line: 58, column: 1, scope: !347)
!358 = distinct !DISubprogram(name: "printSizeTLine", scope: !18, file: !18, line: 60, type: !359, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !75}
!361 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !358, file: !18, line: 60, type: !75)
!362 = !DILocation(line: 60, column: 29, scope: !358)
!363 = !DILocation(line: 62, column: 21, scope: !358)
!364 = !DILocation(line: 62, column: 5, scope: !358)
!365 = !DILocation(line: 63, column: 1, scope: !358)
!366 = distinct !DISubprogram(name: "printHexCharLine", scope: !18, file: !18, line: 65, type: !367, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !12}
!369 = !DILocalVariable(name: "charHex", arg: 1, scope: !366, file: !18, line: 65, type: !12)
!370 = !DILocation(line: 65, column: 29, scope: !366)
!371 = !DILocation(line: 67, column: 22, scope: !366)
!372 = !DILocation(line: 67, column: 5, scope: !366)
!373 = !DILocation(line: 68, column: 1, scope: !366)
!374 = distinct !DISubprogram(name: "printWcharLine", scope: !18, file: !18, line: 70, type: !375, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !301}
!377 = !DILocalVariable(name: "wideChar", arg: 1, scope: !374, file: !18, line: 70, type: !301)
!378 = !DILocation(line: 70, column: 29, scope: !374)
!379 = !DILocalVariable(name: "s", scope: !374, file: !18, line: 74, type: !380)
!380 = !DICompositeType(tag: DW_TAG_array_type, baseType: !301, size: 64, elements: !381)
!381 = !{!382}
!382 = !DISubrange(count: 2)
!383 = !DILocation(line: 74, column: 13, scope: !374)
!384 = !DILocation(line: 75, column: 16, scope: !374)
!385 = !DILocation(line: 75, column: 9, scope: !374)
!386 = !DILocation(line: 75, column: 14, scope: !374)
!387 = !DILocation(line: 76, column: 9, scope: !374)
!388 = !DILocation(line: 76, column: 14, scope: !374)
!389 = !DILocation(line: 77, column: 21, scope: !374)
!390 = !DILocation(line: 77, column: 5, scope: !374)
!391 = !DILocation(line: 78, column: 1, scope: !374)
!392 = distinct !DISubprogram(name: "printUnsignedLine", scope: !18, file: !18, line: 80, type: !393, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !22}
!395 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !392, file: !18, line: 80, type: !22)
!396 = !DILocation(line: 80, column: 33, scope: !392)
!397 = !DILocation(line: 82, column: 20, scope: !392)
!398 = !DILocation(line: 82, column: 5, scope: !392)
!399 = !DILocation(line: 83, column: 1, scope: !392)
!400 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !18, file: !18, line: 85, type: !401, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !38}
!403 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !400, file: !18, line: 85, type: !38)
!404 = !DILocation(line: 85, column: 45, scope: !400)
!405 = !DILocation(line: 87, column: 22, scope: !400)
!406 = !DILocation(line: 87, column: 5, scope: !400)
!407 = !DILocation(line: 88, column: 1, scope: !400)
!408 = distinct !DISubprogram(name: "printDoubleLine", scope: !18, file: !18, line: 90, type: !409, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411}
!411 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!412 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !408, file: !18, line: 90, type: !411)
!413 = !DILocation(line: 90, column: 29, scope: !408)
!414 = !DILocation(line: 92, column: 20, scope: !408)
!415 = !DILocation(line: 92, column: 5, scope: !408)
!416 = !DILocation(line: 93, column: 1, scope: !408)
!417 = distinct !DISubprogram(name: "printStructLine", scope: !18, file: !18, line: 95, type: !418, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !422, line: 100, baseType: !423)
!422 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_002/source_code")
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !422, line: 96, size: 64, elements: !424)
!424 = !{!425, !426}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !423, file: !422, line: 98, baseType: !7, size: 32)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !423, file: !422, line: 99, baseType: !7, size: 32, offset: 32)
!427 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !417, file: !18, line: 95, type: !420)
!428 = !DILocation(line: 95, column: 40, scope: !417)
!429 = !DILocation(line: 97, column: 26, scope: !417)
!430 = !DILocation(line: 97, column: 47, scope: !417)
!431 = !DILocation(line: 97, column: 55, scope: !417)
!432 = !DILocation(line: 97, column: 76, scope: !417)
!433 = !DILocation(line: 97, column: 5, scope: !417)
!434 = !DILocation(line: 98, column: 1, scope: !417)
!435 = distinct !DISubprogram(name: "printBytesLine", scope: !18, file: !18, line: 100, type: !436, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438, !75}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!439 = !DILocalVariable(name: "bytes", arg: 1, scope: !435, file: !18, line: 100, type: !438)
!440 = !DILocation(line: 100, column: 38, scope: !435)
!441 = !DILocalVariable(name: "numBytes", arg: 2, scope: !435, file: !18, line: 100, type: !75)
!442 = !DILocation(line: 100, column: 52, scope: !435)
!443 = !DILocalVariable(name: "i", scope: !435, file: !18, line: 102, type: !75)
!444 = !DILocation(line: 102, column: 12, scope: !435)
!445 = !DILocation(line: 103, column: 12, scope: !446)
!446 = distinct !DILexicalBlock(scope: !435, file: !18, line: 103, column: 5)
!447 = !DILocation(line: 103, column: 10, scope: !446)
!448 = !DILocation(line: 103, column: 17, scope: !449)
!449 = distinct !DILexicalBlock(scope: !446, file: !18, line: 103, column: 5)
!450 = !DILocation(line: 103, column: 21, scope: !449)
!451 = !DILocation(line: 103, column: 19, scope: !449)
!452 = !DILocation(line: 103, column: 5, scope: !446)
!453 = !DILocation(line: 105, column: 24, scope: !454)
!454 = distinct !DILexicalBlock(scope: !449, file: !18, line: 104, column: 5)
!455 = !DILocation(line: 105, column: 30, scope: !454)
!456 = !DILocation(line: 105, column: 9, scope: !454)
!457 = !DILocation(line: 106, column: 5, scope: !454)
!458 = !DILocation(line: 103, column: 31, scope: !449)
!459 = !DILocation(line: 103, column: 5, scope: !449)
!460 = distinct !{!460, !452, !461, !462}
!461 = !DILocation(line: 106, column: 5, scope: !446)
!462 = !{!"llvm.loop.mustprogress"}
!463 = !DILocation(line: 107, column: 5, scope: !435)
!464 = !DILocation(line: 108, column: 1, scope: !435)
!465 = distinct !DISubprogram(name: "decodeHexChars", scope: !18, file: !18, line: 113, type: !466, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!466 = !DISubroutineType(types: !467)
!467 = !{!75, !438, !75, !11}
!468 = !DILocalVariable(name: "bytes", arg: 1, scope: !465, file: !18, line: 113, type: !438)
!469 = !DILocation(line: 113, column: 39, scope: !465)
!470 = !DILocalVariable(name: "numBytes", arg: 2, scope: !465, file: !18, line: 113, type: !75)
!471 = !DILocation(line: 113, column: 53, scope: !465)
!472 = !DILocalVariable(name: "hex", arg: 3, scope: !465, file: !18, line: 113, type: !11)
!473 = !DILocation(line: 113, column: 71, scope: !465)
!474 = !DILocalVariable(name: "numWritten", scope: !465, file: !18, line: 115, type: !75)
!475 = !DILocation(line: 115, column: 12, scope: !465)
!476 = !DILocation(line: 121, column: 5, scope: !465)
!477 = !DILocation(line: 121, column: 12, scope: !465)
!478 = !DILocation(line: 121, column: 25, scope: !465)
!479 = !DILocation(line: 121, column: 23, scope: !465)
!480 = !DILocation(line: 121, column: 34, scope: !465)
!481 = !DILocation(line: 121, column: 37, scope: !465)
!482 = !DILocation(line: 121, column: 67, scope: !465)
!483 = !DILocation(line: 121, column: 70, scope: !465)
!484 = !DILocation(line: 0, scope: !465)
!485 = !DILocalVariable(name: "byte", scope: !486, file: !18, line: 123, type: !7)
!486 = distinct !DILexicalBlock(scope: !465, file: !18, line: 122, column: 5)
