; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_13.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_13.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@GLOBAL_CONST_FIVE = external dso_local global i32, align 4
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_13_bad() #0 !dbg !10 {
entry:
  %data = alloca i8*, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_13.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_086/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_13_bad", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 37, type: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocation(line: 37, column: 12, scope: !10)
!17 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 38, type: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 100)
!21 = !DILocation(line: 38, column: 10, scope: !10)
!22 = !DILocation(line: 39, column: 12, scope: !10)
!23 = !DILocation(line: 39, column: 10, scope: !10)
!24 = !DILocation(line: 40, column: 8, scope: !25)
!25 = distinct !DILexicalBlock(scope: !10, file: !1, line: 40, column: 8)
!26 = !DILocation(line: 40, column: 25, scope: !25)
!27 = !DILocation(line: 40, column: 8, scope: !10)
!28 = !DILocalVariable(name: "dataLen", scope: !29, file: !1, line: 44, type: !31)
!29 = distinct !DILexicalBlock(scope: !30, file: !1, line: 42, column: 9)
!30 = distinct !DILexicalBlock(scope: !25, file: !1, line: 41, column: 5)
!31 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !32, line: 46, baseType: !33)
!32 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!33 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!34 = !DILocation(line: 44, column: 20, scope: !29)
!35 = !DILocation(line: 44, column: 37, scope: !29)
!36 = !DILocation(line: 44, column: 30, scope: !29)
!37 = !DILocalVariable(name: "pFile", scope: !29, file: !1, line: 45, type: !38)
!38 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!39 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !40, line: 7, baseType: !41)
!40 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!41 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !42, line: 49, size: 1728, elements: !43)
!42 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!43 = !{!44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !59, !61, !62, !63, !67, !69, !71, !75, !78, !80, !83, !86, !87, !88, !89, !90}
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !41, file: !42, line: 51, baseType: !5, size: 32)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !41, file: !42, line: 54, baseType: !14, size: 64, offset: 64)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !41, file: !42, line: 55, baseType: !14, size: 64, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !41, file: !42, line: 56, baseType: !14, size: 64, offset: 192)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !41, file: !42, line: 57, baseType: !14, size: 64, offset: 256)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !41, file: !42, line: 58, baseType: !14, size: 64, offset: 320)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !41, file: !42, line: 59, baseType: !14, size: 64, offset: 384)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !41, file: !42, line: 60, baseType: !14, size: 64, offset: 448)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !41, file: !42, line: 61, baseType: !14, size: 64, offset: 512)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !41, file: !42, line: 64, baseType: !14, size: 64, offset: 576)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !41, file: !42, line: 65, baseType: !14, size: 64, offset: 640)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !41, file: !42, line: 66, baseType: !14, size: 64, offset: 704)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !41, file: !42, line: 68, baseType: !57, size: 64, offset: 768)
!57 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !58, size: 64)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !42, line: 36, flags: DIFlagFwdDecl)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !41, file: !42, line: 70, baseType: !60, size: 64, offset: 832)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !41, file: !42, line: 72, baseType: !5, size: 32, offset: 896)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !41, file: !42, line: 73, baseType: !5, size: 32, offset: 928)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !41, file: !42, line: 74, baseType: !64, size: 64, offset: 960)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !65, line: 152, baseType: !66)
!65 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!66 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !41, file: !42, line: 77, baseType: !68, size: 16, offset: 1024)
!68 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !41, file: !42, line: 78, baseType: !70, size: 8, offset: 1040)
!70 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !41, file: !42, line: 79, baseType: !72, size: 8, offset: 1048)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !73)
!73 = !{!74}
!74 = !DISubrange(count: 1)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !41, file: !42, line: 81, baseType: !76, size: 64, offset: 1088)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !42, line: 43, baseType: null)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !41, file: !42, line: 89, baseType: !79, size: 64, offset: 1152)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !65, line: 153, baseType: !66)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !41, file: !42, line: 91, baseType: !81, size: 64, offset: 1216)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !42, line: 37, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !41, file: !42, line: 92, baseType: !84, size: 64, offset: 1280)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !42, line: 38, flags: DIFlagFwdDecl)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !41, file: !42, line: 93, baseType: !60, size: 64, offset: 1344)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !41, file: !42, line: 94, baseType: !4, size: 64, offset: 1408)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !41, file: !42, line: 95, baseType: !31, size: 64, offset: 1472)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !41, file: !42, line: 96, baseType: !5, size: 32, offset: 1536)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !41, file: !42, line: 98, baseType: !91, size: 160, offset: 1568)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !92)
!92 = !{!93}
!93 = !DISubrange(count: 20)
!94 = !DILocation(line: 45, column: 20, scope: !29)
!95 = !DILocation(line: 47, column: 21, scope: !96)
!96 = distinct !DILexicalBlock(scope: !29, file: !1, line: 47, column: 17)
!97 = !DILocation(line: 47, column: 20, scope: !96)
!98 = !DILocation(line: 47, column: 29, scope: !96)
!99 = !DILocation(line: 47, column: 17, scope: !29)
!100 = !DILocation(line: 49, column: 25, scope: !101)
!101 = distinct !DILexicalBlock(scope: !96, file: !1, line: 48, column: 13)
!102 = !DILocation(line: 49, column: 23, scope: !101)
!103 = !DILocation(line: 50, column: 21, scope: !104)
!104 = distinct !DILexicalBlock(scope: !101, file: !1, line: 50, column: 21)
!105 = !DILocation(line: 50, column: 27, scope: !104)
!106 = !DILocation(line: 50, column: 21, scope: !101)
!107 = !DILocation(line: 53, column: 31, scope: !108)
!108 = distinct !DILexicalBlock(scope: !109, file: !1, line: 53, column: 25)
!109 = distinct !DILexicalBlock(scope: !104, file: !1, line: 51, column: 17)
!110 = !DILocation(line: 53, column: 36, scope: !108)
!111 = !DILocation(line: 53, column: 35, scope: !108)
!112 = !DILocation(line: 53, column: 55, scope: !108)
!113 = !DILocation(line: 53, column: 54, scope: !108)
!114 = !DILocation(line: 53, column: 45, scope: !108)
!115 = !DILocation(line: 53, column: 65, scope: !108)
!116 = !DILocation(line: 53, column: 25, scope: !108)
!117 = !DILocation(line: 53, column: 72, scope: !108)
!118 = !DILocation(line: 53, column: 25, scope: !109)
!119 = !DILocation(line: 55, column: 25, scope: !120)
!120 = distinct !DILexicalBlock(scope: !108, file: !1, line: 54, column: 21)
!121 = !DILocation(line: 57, column: 25, scope: !120)
!122 = !DILocation(line: 57, column: 30, scope: !120)
!123 = !DILocation(line: 57, column: 39, scope: !120)
!124 = !DILocation(line: 58, column: 21, scope: !120)
!125 = !DILocation(line: 59, column: 28, scope: !109)
!126 = !DILocation(line: 59, column: 21, scope: !109)
!127 = !DILocation(line: 60, column: 17, scope: !109)
!128 = !DILocation(line: 61, column: 13, scope: !101)
!129 = !DILocation(line: 63, column: 5, scope: !30)
!130 = !DILocation(line: 64, column: 8, scope: !131)
!131 = distinct !DILexicalBlock(scope: !10, file: !1, line: 64, column: 8)
!132 = !DILocation(line: 64, column: 25, scope: !131)
!133 = !DILocation(line: 64, column: 8, scope: !10)
!134 = !DILocalVariable(name: "i", scope: !135, file: !1, line: 67, type: !5)
!135 = distinct !DILexicalBlock(scope: !136, file: !1, line: 66, column: 9)
!136 = distinct !DILexicalBlock(scope: !131, file: !1, line: 65, column: 5)
!137 = !DILocation(line: 67, column: 17, scope: !135)
!138 = !DILocalVariable(name: "n", scope: !135, file: !1, line: 67, type: !5)
!139 = !DILocation(line: 67, column: 20, scope: !135)
!140 = !DILocalVariable(name: "intVariable", scope: !135, file: !1, line: 67, type: !5)
!141 = !DILocation(line: 67, column: 23, scope: !135)
!142 = !DILocation(line: 68, column: 24, scope: !143)
!143 = distinct !DILexicalBlock(scope: !135, file: !1, line: 68, column: 17)
!144 = !DILocation(line: 68, column: 17, scope: !143)
!145 = !DILocation(line: 68, column: 40, scope: !143)
!146 = !DILocation(line: 68, column: 17, scope: !135)
!147 = !DILocation(line: 71, column: 29, scope: !148)
!148 = distinct !DILexicalBlock(scope: !143, file: !1, line: 69, column: 13)
!149 = !DILocation(line: 72, column: 24, scope: !150)
!150 = distinct !DILexicalBlock(scope: !148, file: !1, line: 72, column: 17)
!151 = !DILocation(line: 72, column: 22, scope: !150)
!152 = !DILocation(line: 72, column: 29, scope: !153)
!153 = distinct !DILexicalBlock(scope: !150, file: !1, line: 72, column: 17)
!154 = !DILocation(line: 72, column: 33, scope: !153)
!155 = !DILocation(line: 72, column: 31, scope: !153)
!156 = !DILocation(line: 72, column: 17, scope: !150)
