; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.21 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_54a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_106/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_54b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_106/source_code")
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !51, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!51 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_54c.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_106/source_code")
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!53 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_54d.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_106/source_code")
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!55 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_54e.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_106/source_code")
!56 = !{!"clang version 12.0.0"}
!57 = !{i32 7, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54_bad", scope: !45, file: !45, line: 37, type: !61, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !DILocalVariable(name: "data", scope: !60, file: !45, line: 39, type: !42)
!64 = !DILocation(line: 39, column: 12, scope: !60)
!65 = !DILocalVariable(name: "dataBuffer", scope: !60, file: !45, line: 40, type: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 100)
!69 = !DILocation(line: 40, column: 10, scope: !60)
!70 = !DILocation(line: 41, column: 12, scope: !60)
!71 = !DILocation(line: 41, column: 10, scope: !60)
!72 = !DILocalVariable(name: "dataLen", scope: !73, file: !45, line: 44, type: !74)
!73 = distinct !DILexicalBlock(scope: !60, file: !45, line: 42, column: 5)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DILocation(line: 44, column: 16, scope: !73)
!78 = !DILocation(line: 44, column: 33, scope: !73)
!79 = !DILocation(line: 44, column: 26, scope: !73)
!80 = !DILocalVariable(name: "pFile", scope: !73, file: !45, line: 45, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !83, line: 7, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !102, !104, !105, !106, !110, !111, !113, !117, !120, !122, !125, !128, !129, !130, !131, !132}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !84, file: !85, line: 51, baseType: !23, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !84, file: !85, line: 54, baseType: !42, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !84, file: !85, line: 55, baseType: !42, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !84, file: !85, line: 56, baseType: !42, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !84, file: !85, line: 57, baseType: !42, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !84, file: !85, line: 58, baseType: !42, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !84, file: !85, line: 59, baseType: !42, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !84, file: !85, line: 60, baseType: !42, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !84, file: !85, line: 61, baseType: !42, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !84, file: !85, line: 64, baseType: !42, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !84, file: !85, line: 65, baseType: !42, size: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !84, file: !85, line: 66, baseType: !42, size: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !84, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !85, line: 36, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !84, file: !85, line: 70, baseType: !103, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !84, file: !85, line: 72, baseType: !23, size: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !84, file: !85, line: 73, baseType: !23, size: 32, offset: 928)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !84, file: !85, line: 74, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 152, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !84, file: !85, line: 77, baseType: !24, size: 16, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !84, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !84, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !84, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !85, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !84, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 153, baseType: !109)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !84, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !85, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !84, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !85, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !84, file: !85, line: 93, baseType: !103, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !84, file: !85, line: 94, baseType: !22, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !84, file: !85, line: 95, baseType: !74, size: 64, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !84, file: !85, line: 96, baseType: !23, size: 32, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !84, file: !85, line: 98, baseType: !133, size: 160, offset: 1568)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 20)
!136 = !DILocation(line: 45, column: 16, scope: !73)
!137 = !DILocation(line: 47, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !73, file: !45, line: 47, column: 13)
!139 = !DILocation(line: 47, column: 16, scope: !138)
!140 = !DILocation(line: 47, column: 25, scope: !138)
!141 = !DILocation(line: 47, column: 13, scope: !73)
!142 = !DILocation(line: 49, column: 21, scope: !143)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 48, column: 9)
!144 = !DILocation(line: 49, column: 19, scope: !143)
!145 = !DILocation(line: 50, column: 17, scope: !146)
!146 = distinct !DILexicalBlock(scope: !143, file: !45, line: 50, column: 17)
!147 = !DILocation(line: 50, column: 23, scope: !146)
!148 = !DILocation(line: 50, column: 17, scope: !143)
!149 = !DILocation(line: 53, column: 27, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !45, line: 53, column: 21)
!151 = distinct !DILexicalBlock(scope: !146, file: !45, line: 51, column: 13)
!152 = !DILocation(line: 53, column: 32, scope: !150)
!153 = !DILocation(line: 53, column: 31, scope: !150)
!154 = !DILocation(line: 53, column: 51, scope: !150)
!155 = !DILocation(line: 53, column: 50, scope: !150)
!156 = !DILocation(line: 53, column: 41, scope: !150)
!157 = !DILocation(line: 53, column: 61, scope: !150)
!158 = !DILocation(line: 53, column: 21, scope: !150)
!159 = !DILocation(line: 53, column: 68, scope: !150)
!160 = !DILocation(line: 53, column: 21, scope: !151)
!161 = !DILocation(line: 55, column: 21, scope: !162)
!162 = distinct !DILexicalBlock(scope: !150, file: !45, line: 54, column: 17)
!163 = !DILocation(line: 57, column: 21, scope: !162)
!164 = !DILocation(line: 57, column: 26, scope: !162)
!165 = !DILocation(line: 57, column: 35, scope: !162)
!166 = !DILocation(line: 58, column: 17, scope: !162)
!167 = !DILocation(line: 59, column: 24, scope: !151)
!168 = !DILocation(line: 59, column: 17, scope: !151)
!169 = !DILocation(line: 60, column: 13, scope: !151)
!170 = !DILocation(line: 61, column: 9, scope: !143)
!171 = !DILocation(line: 63, column: 60, scope: !60)
!172 = !DILocation(line: 63, column: 5, scope: !60)
!173 = !DILocation(line: 64, column: 1, scope: !60)
!174 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 72, type: !61, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!175 = !DILocalVariable(name: "data", scope: !174, file: !45, line: 74, type: !42)
!176 = !DILocation(line: 74, column: 12, scope: !174)
!177 = !DILocalVariable(name: "dataBuffer", scope: !174, file: !45, line: 75, type: !66)
!178 = !DILocation(line: 75, column: 10, scope: !174)
!179 = !DILocation(line: 76, column: 12, scope: !174)
!180 = !DILocation(line: 76, column: 10, scope: !174)
!181 = !DILocation(line: 78, column: 12, scope: !174)
!182 = !DILocation(line: 78, column: 5, scope: !174)
!183 = !DILocation(line: 79, column: 64, scope: !174)
!184 = !DILocation(line: 79, column: 5, scope: !174)
!185 = !DILocation(line: 80, column: 1, scope: !174)
!186 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 84, type: !61, scopeLine: 85, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!187 = !DILocalVariable(name: "data", scope: !186, file: !45, line: 86, type: !42)
!188 = !DILocation(line: 86, column: 12, scope: !186)
!189 = !DILocalVariable(name: "dataBuffer", scope: !186, file: !45, line: 87, type: !66)
!190 = !DILocation(line: 87, column: 10, scope: !186)
!191 = !DILocation(line: 88, column: 12, scope: !186)
!192 = !DILocation(line: 88, column: 10, scope: !186)
!193 = !DILocalVariable(name: "dataLen", scope: !194, file: !45, line: 91, type: !74)
!194 = distinct !DILexicalBlock(scope: !186, file: !45, line: 89, column: 5)
!195 = !DILocation(line: 91, column: 16, scope: !194)
!196 = !DILocation(line: 91, column: 33, scope: !194)
!197 = !DILocation(line: 91, column: 26, scope: !194)
!198 = !DILocalVariable(name: "pFile", scope: !194, file: !45, line: 92, type: !81)
!199 = !DILocation(line: 92, column: 16, scope: !194)
!200 = !DILocation(line: 94, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !194, file: !45, line: 94, column: 13)
!202 = !DILocation(line: 94, column: 16, scope: !201)
!203 = !DILocation(line: 94, column: 25, scope: !201)
!204 = !DILocation(line: 94, column: 13, scope: !194)
!205 = !DILocation(line: 96, column: 21, scope: !206)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 95, column: 9)
!207 = !DILocation(line: 96, column: 19, scope: !206)
!208 = !DILocation(line: 97, column: 17, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !45, line: 97, column: 17)
!210 = !DILocation(line: 97, column: 23, scope: !209)
!211 = !DILocation(line: 97, column: 17, scope: !206)
!212 = !DILocation(line: 100, column: 27, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !45, line: 100, column: 21)
!214 = distinct !DILexicalBlock(scope: !209, file: !45, line: 98, column: 13)
!215 = !DILocation(line: 100, column: 32, scope: !213)
!216 = !DILocation(line: 100, column: 31, scope: !213)
!217 = !DILocation(line: 100, column: 51, scope: !213)
!218 = !DILocation(line: 100, column: 50, scope: !213)
!219 = !DILocation(line: 100, column: 41, scope: !213)
!220 = !DILocation(line: 100, column: 61, scope: !213)
!221 = !DILocation(line: 100, column: 21, scope: !213)
!222 = !DILocation(line: 100, column: 68, scope: !213)
!223 = !DILocation(line: 100, column: 21, scope: !214)
!224 = !DILocation(line: 102, column: 21, scope: !225)
!225 = distinct !DILexicalBlock(scope: !213, file: !45, line: 101, column: 17)
!226 = !DILocation(line: 104, column: 21, scope: !225)
!227 = !DILocation(line: 104, column: 26, scope: !225)
!228 = !DILocation(line: 104, column: 35, scope: !225)
!229 = !DILocation(line: 105, column: 17, scope: !225)
!230 = !DILocation(line: 106, column: 24, scope: !214)
!231 = !DILocation(line: 106, column: 17, scope: !214)
!232 = !DILocation(line: 107, column: 13, scope: !214)
!233 = !DILocation(line: 108, column: 9, scope: !206)
!234 = !DILocation(line: 110, column: 64, scope: !186)
!235 = !DILocation(line: 110, column: 5, scope: !186)
!236 = !DILocation(line: 111, column: 1, scope: !186)
!237 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54_good", scope: !45, file: !45, line: 113, type: !61, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!238 = !DILocation(line: 115, column: 5, scope: !237)
!239 = !DILocation(line: 116, column: 5, scope: !237)
!240 = !DILocation(line: 117, column: 1, scope: !237)
!241 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54b_badSink", scope: !49, file: !49, line: 37, type: !242, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !42}
!244 = !DILocalVariable(name: "data", arg: 1, scope: !241, file: !49, line: 37, type: !42)
!245 = !DILocation(line: 37, column: 68, scope: !241)
!246 = !DILocation(line: 39, column: 60, scope: !241)
!247 = !DILocation(line: 39, column: 5, scope: !241)
!248 = !DILocation(line: 40, column: 1, scope: !241)
!249 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54b_goodG2BSink", scope: !49, file: !49, line: 49, type: !242, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!250 = !DILocalVariable(name: "data", arg: 1, scope: !249, file: !49, line: 49, type: !42)
!251 = !DILocation(line: 49, column: 72, scope: !249)
!252 = !DILocation(line: 51, column: 64, scope: !249)
!253 = !DILocation(line: 51, column: 5, scope: !249)
!254 = !DILocation(line: 52, column: 1, scope: !249)
!255 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54b_goodB2GSink", scope: !49, file: !49, line: 57, type: !242, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!256 = !DILocalVariable(name: "data", arg: 1, scope: !255, file: !49, line: 57, type: !42)
!257 = !DILocation(line: 57, column: 72, scope: !255)
!258 = !DILocation(line: 59, column: 64, scope: !255)
!259 = !DILocation(line: 59, column: 5, scope: !255)
!260 = !DILocation(line: 60, column: 1, scope: !255)
!261 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54c_badSink", scope: !51, file: !51, line: 37, type: !242, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!262 = !DILocalVariable(name: "data", arg: 1, scope: !261, file: !51, line: 37, type: !42)
!263 = !DILocation(line: 37, column: 68, scope: !261)
!264 = !DILocation(line: 39, column: 60, scope: !261)
!265 = !DILocation(line: 39, column: 5, scope: !261)
!266 = !DILocation(line: 40, column: 1, scope: !261)
!267 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54c_goodG2BSink", scope: !51, file: !51, line: 49, type: !242, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!268 = !DILocalVariable(name: "data", arg: 1, scope: !267, file: !51, line: 49, type: !42)
!269 = !DILocation(line: 49, column: 72, scope: !267)
!270 = !DILocation(line: 51, column: 64, scope: !267)
!271 = !DILocation(line: 51, column: 5, scope: !267)
!272 = !DILocation(line: 52, column: 1, scope: !267)
!273 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54c_goodB2GSink", scope: !51, file: !51, line: 57, type: !242, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!274 = !DILocalVariable(name: "data", arg: 1, scope: !273, file: !51, line: 57, type: !42)
!275 = !DILocation(line: 57, column: 72, scope: !273)
!276 = !DILocation(line: 59, column: 64, scope: !273)
!277 = !DILocation(line: 59, column: 5, scope: !273)
!278 = !DILocation(line: 60, column: 1, scope: !273)
!279 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54d_badSink", scope: !53, file: !53, line: 37, type: !242, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!280 = !DILocalVariable(name: "data", arg: 1, scope: !279, file: !53, line: 37, type: !42)
!281 = !DILocation(line: 37, column: 68, scope: !279)
!282 = !DILocation(line: 39, column: 60, scope: !279)
!283 = !DILocation(line: 39, column: 5, scope: !279)
!284 = !DILocation(line: 40, column: 1, scope: !279)
!285 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54d_goodG2BSink", scope: !53, file: !53, line: 49, type: !242, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!286 = !DILocalVariable(name: "data", arg: 1, scope: !285, file: !53, line: 49, type: !42)
!287 = !DILocation(line: 49, column: 72, scope: !285)
!288 = !DILocation(line: 51, column: 64, scope: !285)
!289 = !DILocation(line: 51, column: 5, scope: !285)
!290 = !DILocation(line: 52, column: 1, scope: !285)
!291 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54d_goodB2GSink", scope: !53, file: !53, line: 57, type: !242, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!292 = !DILocalVariable(name: "data", arg: 1, scope: !291, file: !53, line: 57, type: !42)
!293 = !DILocation(line: 57, column: 72, scope: !291)
!294 = !DILocation(line: 59, column: 64, scope: !291)
!295 = !DILocation(line: 59, column: 5, scope: !291)
!296 = !DILocation(line: 60, column: 1, scope: !291)
!297 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54e_badSink", scope: !55, file: !55, line: 34, type: !242, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !46)
!298 = !DILocalVariable(name: "data", arg: 1, scope: !297, file: !55, line: 34, type: !42)
!299 = !DILocation(line: 34, column: 68, scope: !297)
!300 = !DILocalVariable(name: "i", scope: !301, file: !55, line: 37, type: !23)
!301 = distinct !DILexicalBlock(scope: !297, file: !55, line: 36, column: 5)
!302 = !DILocation(line: 37, column: 13, scope: !301)
!303 = !DILocalVariable(name: "n", scope: !301, file: !55, line: 37, type: !23)
!304 = !DILocation(line: 37, column: 16, scope: !301)
!305 = !DILocalVariable(name: "intVariable", scope: !301, file: !55, line: 37, type: !23)
!306 = !DILocation(line: 37, column: 19, scope: !301)
!307 = !DILocation(line: 38, column: 20, scope: !308)
!308 = distinct !DILexicalBlock(scope: !301, file: !55, line: 38, column: 13)
!309 = !DILocation(line: 38, column: 13, scope: !308)
!310 = !DILocation(line: 38, column: 36, scope: !308)
!311 = !DILocation(line: 38, column: 13, scope: !301)
!312 = !DILocation(line: 41, column: 25, scope: !313)
!313 = distinct !DILexicalBlock(scope: !308, file: !55, line: 39, column: 9)
!314 = !DILocation(line: 42, column: 20, scope: !315)
!315 = distinct !DILexicalBlock(scope: !313, file: !55, line: 42, column: 13)
!316 = !DILocation(line: 42, column: 18, scope: !315)
!317 = !DILocation(line: 42, column: 25, scope: !318)
!318 = distinct !DILexicalBlock(scope: !315, file: !55, line: 42, column: 13)
!319 = !DILocation(line: 42, column: 29, scope: !318)
!320 = !DILocation(line: 42, column: 27, scope: !318)
!321 = !DILocation(line: 42, column: 13, scope: !315)
!322 = !DILocation(line: 45, column: 28, scope: !323)
!323 = distinct !DILexicalBlock(scope: !318, file: !55, line: 43, column: 13)
!324 = !DILocation(line: 46, column: 13, scope: !323)
!325 = !DILocation(line: 42, column: 33, scope: !318)
!326 = !DILocation(line: 42, column: 13, scope: !318)
!327 = distinct !{!327, !321, !328, !329}
!328 = !DILocation(line: 46, column: 13, scope: !315)
!329 = !{!"llvm.loop.mustprogress"}
!330 = !DILocation(line: 47, column: 26, scope: !313)
!331 = !DILocation(line: 47, column: 13, scope: !313)
!332 = !DILocation(line: 48, column: 9, scope: !313)
!333 = !DILocation(line: 50, column: 1, scope: !297)
!334 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54e_goodG2BSink", scope: !55, file: !55, line: 57, type: !242, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !46)
!335 = !DILocalVariable(name: "data", arg: 1, scope: !334, file: !55, line: 57, type: !42)
!336 = !DILocation(line: 57, column: 72, scope: !334)
!337 = !DILocalVariable(name: "i", scope: !338, file: !55, line: 60, type: !23)
!338 = distinct !DILexicalBlock(scope: !334, file: !55, line: 59, column: 5)
!339 = !DILocation(line: 60, column: 13, scope: !338)
!340 = !DILocalVariable(name: "n", scope: !338, file: !55, line: 60, type: !23)
!341 = !DILocation(line: 60, column: 16, scope: !338)
!342 = !DILocalVariable(name: "intVariable", scope: !338, file: !55, line: 60, type: !23)
!343 = !DILocation(line: 60, column: 19, scope: !338)
!344 = !DILocation(line: 61, column: 20, scope: !345)
!345 = distinct !DILexicalBlock(scope: !338, file: !55, line: 61, column: 13)
!346 = !DILocation(line: 61, column: 13, scope: !345)
!347 = !DILocation(line: 61, column: 36, scope: !345)
!348 = !DILocation(line: 61, column: 13, scope: !338)
!349 = !DILocation(line: 64, column: 25, scope: !350)
!350 = distinct !DILexicalBlock(scope: !345, file: !55, line: 62, column: 9)
!351 = !DILocation(line: 65, column: 20, scope: !352)
!352 = distinct !DILexicalBlock(scope: !350, file: !55, line: 65, column: 13)
!353 = !DILocation(line: 65, column: 18, scope: !352)
!354 = !DILocation(line: 65, column: 25, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !55, line: 65, column: 13)
!356 = !DILocation(line: 65, column: 29, scope: !355)
!357 = !DILocation(line: 65, column: 27, scope: !355)
!358 = !DILocation(line: 65, column: 13, scope: !352)
!359 = !DILocation(line: 68, column: 28, scope: !360)
!360 = distinct !DILexicalBlock(scope: !355, file: !55, line: 66, column: 13)
!361 = !DILocation(line: 69, column: 13, scope: !360)
!362 = !DILocation(line: 65, column: 33, scope: !355)
!363 = !DILocation(line: 65, column: 13, scope: !355)
!364 = distinct !{!364, !358, !365, !329}
!365 = !DILocation(line: 69, column: 13, scope: !352)
!366 = !DILocation(line: 70, column: 26, scope: !350)
!367 = !DILocation(line: 70, column: 13, scope: !350)
!368 = !DILocation(line: 71, column: 9, scope: !350)
!369 = !DILocation(line: 73, column: 1, scope: !334)
!370 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_54e_goodB2GSink", scope: !55, file: !55, line: 76, type: !242, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !46)
!371 = !DILocalVariable(name: "data", arg: 1, scope: !370, file: !55, line: 76, type: !42)
!372 = !DILocation(line: 76, column: 72, scope: !370)
!373 = !DILocalVariable(name: "i", scope: !374, file: !55, line: 79, type: !23)
!374 = distinct !DILexicalBlock(scope: !370, file: !55, line: 78, column: 5)
!375 = !DILocation(line: 79, column: 13, scope: !374)
!376 = !DILocalVariable(name: "n", scope: !374, file: !55, line: 79, type: !23)
!377 = !DILocation(line: 79, column: 16, scope: !374)
!378 = !DILocalVariable(name: "intVariable", scope: !374, file: !55, line: 79, type: !23)
!379 = !DILocation(line: 79, column: 19, scope: !374)
!380 = !DILocation(line: 80, column: 20, scope: !381)
!381 = distinct !DILexicalBlock(scope: !374, file: !55, line: 80, column: 13)
!382 = !DILocation(line: 80, column: 13, scope: !381)
!383 = !DILocation(line: 80, column: 36, scope: !381)
!384 = !DILocation(line: 80, column: 13, scope: !374)
!385 = !DILocation(line: 83, column: 17, scope: !386)
!386 = distinct !DILexicalBlock(scope: !387, file: !55, line: 83, column: 17)
!387 = distinct !DILexicalBlock(scope: !381, file: !55, line: 81, column: 9)
!388 = !DILocation(line: 83, column: 19, scope: !386)
!389 = !DILocation(line: 83, column: 17, scope: !387)
!390 = !DILocation(line: 85, column: 29, scope: !391)
!391 = distinct !DILexicalBlock(scope: !386, file: !55, line: 84, column: 13)
!392 = !DILocation(line: 86, column: 24, scope: !393)
!393 = distinct !DILexicalBlock(scope: !391, file: !55, line: 86, column: 17)
!394 = !DILocation(line: 86, column: 22, scope: !393)
!395 = !DILocation(line: 86, column: 29, scope: !396)
!396 = distinct !DILexicalBlock(scope: !393, file: !55, line: 86, column: 17)
!397 = !DILocation(line: 86, column: 33, scope: !396)
!398 = !DILocation(line: 86, column: 31, scope: !396)
!399 = !DILocation(line: 86, column: 17, scope: !393)
!400 = !DILocation(line: 89, column: 32, scope: !401)
!401 = distinct !DILexicalBlock(scope: !396, file: !55, line: 87, column: 17)
!402 = !DILocation(line: 90, column: 17, scope: !401)
!403 = !DILocation(line: 86, column: 37, scope: !396)
!404 = !DILocation(line: 86, column: 17, scope: !396)
!405 = distinct !{!405, !399, !406, !329}
!406 = !DILocation(line: 90, column: 17, scope: !393)
!407 = !DILocation(line: 91, column: 30, scope: !391)
!408 = !DILocation(line: 91, column: 17, scope: !391)
!409 = !DILocation(line: 92, column: 13, scope: !391)
!410 = !DILocation(line: 93, column: 9, scope: !387)
!411 = !DILocation(line: 95, column: 1, scope: !370)
!412 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !242, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!413 = !DILocalVariable(name: "line", arg: 1, scope: !412, file: !3, line: 11, type: !42)
!414 = !DILocation(line: 11, column: 25, scope: !412)
!415 = !DILocation(line: 13, column: 1, scope: !412)
!416 = !DILocation(line: 14, column: 8, scope: !417)
!417 = distinct !DILexicalBlock(scope: !412, file: !3, line: 14, column: 8)
!418 = !DILocation(line: 14, column: 13, scope: !417)
!419 = !DILocation(line: 14, column: 8, scope: !412)
!420 = !DILocation(line: 16, column: 24, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !3, line: 15, column: 5)
!422 = !DILocation(line: 16, column: 9, scope: !421)
!423 = !DILocation(line: 17, column: 5, scope: !421)
!424 = !DILocation(line: 18, column: 5, scope: !412)
!425 = !DILocation(line: 19, column: 1, scope: !412)
!426 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !242, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!427 = !DILocalVariable(name: "line", arg: 1, scope: !426, file: !3, line: 20, type: !42)
!428 = !DILocation(line: 20, column: 29, scope: !426)
!429 = !DILocation(line: 22, column: 8, scope: !430)
!430 = distinct !DILexicalBlock(scope: !426, file: !3, line: 22, column: 8)
!431 = !DILocation(line: 22, column: 13, scope: !430)
!432 = !DILocation(line: 22, column: 8, scope: !426)
!433 = !DILocation(line: 24, column: 24, scope: !434)
!434 = distinct !DILexicalBlock(scope: !430, file: !3, line: 23, column: 5)
!435 = !DILocation(line: 24, column: 9, scope: !434)
!436 = !DILocation(line: 25, column: 5, scope: !434)
!437 = !DILocation(line: 26, column: 1, scope: !426)
!438 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !439, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !442, size: 64)
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !75, line: 74, baseType: !23)
!443 = !DILocalVariable(name: "line", arg: 1, scope: !438, file: !3, line: 27, type: !441)
!444 = !DILocation(line: 27, column: 29, scope: !438)
!445 = !DILocation(line: 29, column: 8, scope: !446)
!446 = distinct !DILexicalBlock(scope: !438, file: !3, line: 29, column: 8)
!447 = !DILocation(line: 29, column: 13, scope: !446)
!448 = !DILocation(line: 29, column: 8, scope: !438)
!449 = !DILocation(line: 31, column: 27, scope: !450)
!450 = distinct !DILexicalBlock(scope: !446, file: !3, line: 30, column: 5)
!451 = !DILocation(line: 31, column: 9, scope: !450)
!452 = !DILocation(line: 32, column: 5, scope: !450)
!453 = !DILocation(line: 33, column: 1, scope: !438)
!454 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !455, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !23}
!457 = !DILocalVariable(name: "intNumber", arg: 1, scope: !454, file: !3, line: 35, type: !23)
!458 = !DILocation(line: 35, column: 24, scope: !454)
!459 = !DILocation(line: 37, column: 20, scope: !454)
!460 = !DILocation(line: 37, column: 5, scope: !454)
!461 = !DILocation(line: 38, column: 1, scope: !454)
!462 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !463, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!466 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !462, file: !3, line: 40, type: !465)
!467 = !DILocation(line: 40, column: 28, scope: !462)
!468 = !DILocation(line: 42, column: 21, scope: !462)
!469 = !DILocation(line: 42, column: 5, scope: !462)
!470 = !DILocation(line: 43, column: 1, scope: !462)
!471 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !472, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !474}
!474 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!475 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !471, file: !3, line: 45, type: !474)
!476 = !DILocation(line: 45, column: 28, scope: !471)
!477 = !DILocation(line: 47, column: 20, scope: !471)
!478 = !DILocation(line: 47, column: 5, scope: !471)
!479 = !DILocation(line: 48, column: 1, scope: !471)
!480 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !481, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !109}
!483 = !DILocalVariable(name: "longNumber", arg: 1, scope: !480, file: !3, line: 50, type: !109)
!484 = !DILocation(line: 50, column: 26, scope: !480)
!485 = !DILocation(line: 52, column: 21, scope: !480)
!486 = !DILocation(line: 52, column: 5, scope: !480)
!487 = !DILocation(line: 53, column: 1, scope: !480)
!488 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !489, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !491}
!491 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !492, line: 27, baseType: !493)
!492 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !108, line: 44, baseType: !109)
!494 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !488, file: !3, line: 55, type: !491)
!495 = !DILocation(line: 55, column: 33, scope: !488)
!496 = !DILocation(line: 57, column: 29, scope: !488)
!497 = !DILocation(line: 57, column: 5, scope: !488)
!498 = !DILocation(line: 58, column: 1, scope: !488)
!499 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !500, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!500 = !DISubroutineType(types: !501)
!501 = !{null, !74}
!502 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !499, file: !3, line: 60, type: !74)
!503 = !DILocation(line: 60, column: 29, scope: !499)
!504 = !DILocation(line: 62, column: 21, scope: !499)
!505 = !DILocation(line: 62, column: 5, scope: !499)
!506 = !DILocation(line: 63, column: 1, scope: !499)
!507 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !508, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !43}
!510 = !DILocalVariable(name: "charHex", arg: 1, scope: !507, file: !3, line: 65, type: !43)
!511 = !DILocation(line: 65, column: 29, scope: !507)
!512 = !DILocation(line: 67, column: 22, scope: !507)
!513 = !DILocation(line: 67, column: 5, scope: !507)
!514 = !DILocation(line: 68, column: 1, scope: !507)
!515 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !516, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !442}
!518 = !DILocalVariable(name: "wideChar", arg: 1, scope: !515, file: !3, line: 70, type: !442)
!519 = !DILocation(line: 70, column: 29, scope: !515)
!520 = !DILocalVariable(name: "s", scope: !515, file: !3, line: 74, type: !521)
!521 = !DICompositeType(tag: DW_TAG_array_type, baseType: !442, size: 64, elements: !522)
!522 = !{!523}
!523 = !DISubrange(count: 2)
!524 = !DILocation(line: 74, column: 13, scope: !515)
!525 = !DILocation(line: 75, column: 16, scope: !515)
!526 = !DILocation(line: 75, column: 9, scope: !515)
!527 = !DILocation(line: 75, column: 14, scope: !515)
!528 = !DILocation(line: 76, column: 9, scope: !515)
!529 = !DILocation(line: 76, column: 14, scope: !515)
!530 = !DILocation(line: 77, column: 21, scope: !515)
!531 = !DILocation(line: 77, column: 5, scope: !515)
!532 = !DILocation(line: 78, column: 1, scope: !515)
!533 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !534, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !7}
!536 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !533, file: !3, line: 80, type: !7)
!537 = !DILocation(line: 80, column: 33, scope: !533)
!538 = !DILocation(line: 82, column: 20, scope: !533)
!539 = !DILocation(line: 82, column: 5, scope: !533)
!540 = !DILocation(line: 83, column: 1, scope: !533)
!541 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !542, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!542 = !DISubroutineType(types: !543)
!543 = !{null, !25}
!544 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !541, file: !3, line: 85, type: !25)
!545 = !DILocation(line: 85, column: 45, scope: !541)
!546 = !DILocation(line: 87, column: 22, scope: !541)
!547 = !DILocation(line: 87, column: 5, scope: !541)
!548 = !DILocation(line: 88, column: 1, scope: !541)
!549 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !550, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!550 = !DISubroutineType(types: !551)
!551 = !{null, !552}
!552 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!553 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !549, file: !3, line: 90, type: !552)
!554 = !DILocation(line: 90, column: 29, scope: !549)
!555 = !DILocation(line: 92, column: 20, scope: !549)
!556 = !DILocation(line: 92, column: 5, scope: !549)
!557 = !DILocation(line: 93, column: 1, scope: !549)
!558 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !559, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !561}
!561 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !562, size: 64)
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !563, line: 100, baseType: !564)
!563 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_106/source_code")
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !563, line: 96, size: 64, elements: !565)
!565 = !{!566, !567}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !564, file: !563, line: 98, baseType: !23, size: 32)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !564, file: !563, line: 99, baseType: !23, size: 32, offset: 32)
!568 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !558, file: !3, line: 95, type: !561)
!569 = !DILocation(line: 95, column: 40, scope: !558)
!570 = !DILocation(line: 97, column: 26, scope: !558)
!571 = !DILocation(line: 97, column: 47, scope: !558)
!572 = !DILocation(line: 97, column: 55, scope: !558)
!573 = !DILocation(line: 97, column: 76, scope: !558)
!574 = !DILocation(line: 97, column: 5, scope: !558)
!575 = !DILocation(line: 98, column: 1, scope: !558)
!576 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !577, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579, !74}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!580 = !DILocalVariable(name: "bytes", arg: 1, scope: !576, file: !3, line: 100, type: !579)
!581 = !DILocation(line: 100, column: 38, scope: !576)
!582 = !DILocalVariable(name: "numBytes", arg: 2, scope: !576, file: !3, line: 100, type: !74)
!583 = !DILocation(line: 100, column: 52, scope: !576)
!584 = !DILocalVariable(name: "i", scope: !576, file: !3, line: 102, type: !74)
!585 = !DILocation(line: 102, column: 12, scope: !576)
!586 = !DILocation(line: 103, column: 12, scope: !587)
!587 = distinct !DILexicalBlock(scope: !576, file: !3, line: 103, column: 5)
!588 = !DILocation(line: 103, column: 10, scope: !587)
!589 = !DILocation(line: 103, column: 17, scope: !590)
!590 = distinct !DILexicalBlock(scope: !587, file: !3, line: 103, column: 5)
!591 = !DILocation(line: 103, column: 21, scope: !590)
!592 = !DILocation(line: 103, column: 19, scope: !590)
!593 = !DILocation(line: 103, column: 5, scope: !587)
!594 = !DILocation(line: 105, column: 24, scope: !595)
!595 = distinct !DILexicalBlock(scope: !590, file: !3, line: 104, column: 5)
!596 = !DILocation(line: 105, column: 30, scope: !595)
!597 = !DILocation(line: 105, column: 9, scope: !595)
!598 = !DILocation(line: 106, column: 5, scope: !595)
!599 = !DILocation(line: 103, column: 31, scope: !590)
!600 = !DILocation(line: 103, column: 5, scope: !590)
!601 = distinct !{!601, !593, !602, !329}
!602 = !DILocation(line: 106, column: 5, scope: !587)
!603 = !DILocation(line: 107, column: 5, scope: !576)
!604 = !DILocation(line: 108, column: 1, scope: !576)
!605 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !606, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!606 = !DISubroutineType(types: !607)
!607 = !{!74, !579, !74, !42}
!608 = !DILocalVariable(name: "bytes", arg: 1, scope: !605, file: !3, line: 113, type: !579)
!609 = !DILocation(line: 113, column: 39, scope: !605)
!610 = !DILocalVariable(name: "numBytes", arg: 2, scope: !605, file: !3, line: 113, type: !74)
!611 = !DILocation(line: 113, column: 53, scope: !605)
!612 = !DILocalVariable(name: "hex", arg: 3, scope: !605, file: !3, line: 113, type: !42)
!613 = !DILocation(line: 113, column: 71, scope: !605)
!614 = !DILocalVariable(name: "numWritten", scope: !605, file: !3, line: 115, type: !74)
!615 = !DILocation(line: 115, column: 12, scope: !605)
!616 = !DILocation(line: 121, column: 5, scope: !605)
!617 = !DILocation(line: 121, column: 12, scope: !605)
!618 = !DILocation(line: 121, column: 25, scope: !605)
!619 = !DILocation(line: 121, column: 23, scope: !605)
!620 = !DILocation(line: 121, column: 34, scope: !605)
!621 = !DILocation(line: 121, column: 37, scope: !605)
!622 = !DILocation(line: 121, column: 67, scope: !605)
!623 = !DILocation(line: 121, column: 70, scope: !605)
!624 = !DILocation(line: 0, scope: !605)
!625 = !DILocalVariable(name: "byte", scope: !626, file: !3, line: 123, type: !23)
!626 = distinct !DILexicalBlock(scope: !605, file: !3, line: 122, column: 5)
!627 = !DILocation(line: 123, column: 13, scope: !626)
