; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_10.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_10.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@globalTrue = external dso_local global i32, align 4
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@globalFalse = external dso_local global i32, align 4
@.str.4 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_10_bad() #0 !dbg !10 {
entry:
  %data = alloca i8*, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_10.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_083/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_10_bad", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 37, type: !14)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!16 = !DILocation(line: 37, column: 12, scope: !10)
!17 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 38, type: !18)
!18 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 800, elements: !19)
!19 = !{!20}
!20 = !DISubrange(count: 100)
!21 = !DILocation(line: 38, column: 10, scope: !10)
!22 = !DILocation(line: 39, column: 12, scope: !10)
!23 = !DILocation(line: 39, column: 10, scope: !10)
!24 = !DILocation(line: 40, column: 8, scope: !25)
!25 = distinct !DILexicalBlock(scope: !10, file: !1, line: 40, column: 8)
!26 = !DILocation(line: 40, column: 8, scope: !10)
!27 = !DILocalVariable(name: "dataLen", scope: !28, file: !1, line: 44, type: !30)
!28 = distinct !DILexicalBlock(scope: !29, file: !1, line: 42, column: 9)
!29 = distinct !DILexicalBlock(scope: !25, file: !1, line: 41, column: 5)
!30 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !31, line: 46, baseType: !32)
!31 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!32 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!33 = !DILocation(line: 44, column: 20, scope: !28)
!34 = !DILocation(line: 44, column: 37, scope: !28)
!35 = !DILocation(line: 44, column: 30, scope: !28)
!36 = !DILocalVariable(name: "pFile", scope: !28, file: !1, line: 45, type: !37)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !39, line: 7, baseType: !40)
!39 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!40 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !41, line: 49, size: 1728, elements: !42)
!41 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!42 = !{!43, !44, !45, !46, !47, !48, !49, !50, !51, !52, !53, !54, !55, !58, !60, !61, !62, !66, !68, !70, !74, !77, !79, !82, !85, !86, !87, !88, !89}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !40, file: !41, line: 51, baseType: !5, size: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !40, file: !41, line: 54, baseType: !14, size: 64, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !40, file: !41, line: 55, baseType: !14, size: 64, offset: 128)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !40, file: !41, line: 56, baseType: !14, size: 64, offset: 192)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !40, file: !41, line: 57, baseType: !14, size: 64, offset: 256)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !40, file: !41, line: 58, baseType: !14, size: 64, offset: 320)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !40, file: !41, line: 59, baseType: !14, size: 64, offset: 384)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !40, file: !41, line: 60, baseType: !14, size: 64, offset: 448)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !40, file: !41, line: 61, baseType: !14, size: 64, offset: 512)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !40, file: !41, line: 64, baseType: !14, size: 64, offset: 576)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !40, file: !41, line: 65, baseType: !14, size: 64, offset: 640)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !40, file: !41, line: 66, baseType: !14, size: 64, offset: 704)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !40, file: !41, line: 68, baseType: !56, size: 64, offset: 768)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !41, line: 36, flags: DIFlagFwdDecl)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !40, file: !41, line: 70, baseType: !59, size: 64, offset: 832)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !40, file: !41, line: 72, baseType: !5, size: 32, offset: 896)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !40, file: !41, line: 73, baseType: !5, size: 32, offset: 928)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !40, file: !41, line: 74, baseType: !63, size: 64, offset: 960)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !64, line: 152, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!65 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !40, file: !41, line: 77, baseType: !67, size: 16, offset: 1024)
!67 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !40, file: !41, line: 78, baseType: !69, size: 8, offset: 1040)
!69 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !40, file: !41, line: 79, baseType: !71, size: 8, offset: 1048)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 8, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 1)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !40, file: !41, line: 81, baseType: !75, size: 64, offset: 1088)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !41, line: 43, baseType: null)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !40, file: !41, line: 89, baseType: !78, size: 64, offset: 1152)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !64, line: 153, baseType: !65)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !40, file: !41, line: 91, baseType: !80, size: 64, offset: 1216)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !41, line: 37, flags: DIFlagFwdDecl)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !40, file: !41, line: 92, baseType: !83, size: 64, offset: 1280)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !41, line: 38, flags: DIFlagFwdDecl)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !40, file: !41, line: 93, baseType: !59, size: 64, offset: 1344)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !40, file: !41, line: 94, baseType: !4, size: 64, offset: 1408)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !40, file: !41, line: 95, baseType: !30, size: 64, offset: 1472)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !40, file: !41, line: 96, baseType: !5, size: 32, offset: 1536)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !40, file: !41, line: 98, baseType: !90, size: 160, offset: 1568)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !15, size: 160, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 20)
!93 = !DILocation(line: 45, column: 20, scope: !28)
!94 = !DILocation(line: 47, column: 21, scope: !95)
!95 = distinct !DILexicalBlock(scope: !28, file: !1, line: 47, column: 17)
!96 = !DILocation(line: 47, column: 20, scope: !95)
!97 = !DILocation(line: 47, column: 29, scope: !95)
!98 = !DILocation(line: 47, column: 17, scope: !28)
!99 = !DILocation(line: 49, column: 25, scope: !100)
!100 = distinct !DILexicalBlock(scope: !95, file: !1, line: 48, column: 13)
!101 = !DILocation(line: 49, column: 23, scope: !100)
!102 = !DILocation(line: 50, column: 21, scope: !103)
!103 = distinct !DILexicalBlock(scope: !100, file: !1, line: 50, column: 21)
!104 = !DILocation(line: 50, column: 27, scope: !103)
!105 = !DILocation(line: 50, column: 21, scope: !100)
!106 = !DILocation(line: 53, column: 31, scope: !107)
!107 = distinct !DILexicalBlock(scope: !108, file: !1, line: 53, column: 25)
!108 = distinct !DILexicalBlock(scope: !103, file: !1, line: 51, column: 17)
!109 = !DILocation(line: 53, column: 36, scope: !107)
!110 = !DILocation(line: 53, column: 35, scope: !107)
!111 = !DILocation(line: 53, column: 55, scope: !107)
!112 = !DILocation(line: 53, column: 54, scope: !107)
!113 = !DILocation(line: 53, column: 45, scope: !107)
!114 = !DILocation(line: 53, column: 65, scope: !107)
!115 = !DILocation(line: 53, column: 25, scope: !107)
!116 = !DILocation(line: 53, column: 72, scope: !107)
!117 = !DILocation(line: 53, column: 25, scope: !108)
!118 = !DILocation(line: 55, column: 25, scope: !119)
!119 = distinct !DILexicalBlock(scope: !107, file: !1, line: 54, column: 21)
!120 = !DILocation(line: 57, column: 25, scope: !119)
!121 = !DILocation(line: 57, column: 30, scope: !119)
!122 = !DILocation(line: 57, column: 39, scope: !119)
!123 = !DILocation(line: 58, column: 21, scope: !119)
!124 = !DILocation(line: 59, column: 28, scope: !108)
!125 = !DILocation(line: 59, column: 21, scope: !108)
!126 = !DILocation(line: 60, column: 17, scope: !108)
!127 = !DILocation(line: 61, column: 13, scope: !100)
!128 = !DILocation(line: 63, column: 5, scope: !29)
!129 = !DILocation(line: 64, column: 8, scope: !130)
!130 = distinct !DILexicalBlock(scope: !10, file: !1, line: 64, column: 8)
!131 = !DILocation(line: 64, column: 8, scope: !10)
!132 = !DILocalVariable(name: "i", scope: !133, file: !1, line: 67, type: !5)
!133 = distinct !DILexicalBlock(scope: !134, file: !1, line: 66, column: 9)
!134 = distinct !DILexicalBlock(scope: !130, file: !1, line: 65, column: 5)
!135 = !DILocation(line: 67, column: 17, scope: !133)
!136 = !DILocalVariable(name: "n", scope: !133, file: !1, line: 67, type: !5)
!137 = !DILocation(line: 67, column: 20, scope: !133)
!138 = !DILocalVariable(name: "intVariable", scope: !133, file: !1, line: 67, type: !5)
!139 = !DILocation(line: 67, column: 23, scope: !133)
!140 = !DILocation(line: 68, column: 24, scope: !141)
!141 = distinct !DILexicalBlock(scope: !133, file: !1, line: 68, column: 17)
!142 = !DILocation(line: 68, column: 17, scope: !141)
!143 = !DILocation(line: 68, column: 40, scope: !141)
!144 = !DILocation(line: 68, column: 17, scope: !133)
!145 = !DILocation(line: 71, column: 29, scope: !146)
!146 = distinct !DILexicalBlock(scope: !141, file: !1, line: 69, column: 13)
!147 = !DILocation(line: 72, column: 24, scope: !148)
!148 = distinct !DILexicalBlock(scope: !146, file: !1, line: 72, column: 17)
!149 = !DILocation(line: 72, column: 22, scope: !148)
!150 = !DILocation(line: 72, column: 29, scope: !151)
!151 = distinct !DILexicalBlock(scope: !148, file: !1, line: 72, column: 17)
!152 = !DILocation(line: 72, column: 33, scope: !151)
!153 = !DILocation(line: 72, column: 31, scope: !151)
!154 = !DILocation(line: 72, column: 17, scope: !148)
!155 = !DILocation(line: 75, column: 32, scope: !156)
