; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@CWE606_Unchecked_Loop_Condition__wchar_t_file_45_badData = dso_local global i32* null, align 8, !dbg !0
@CWE606_Unchecked_Loop_Condition__wchar_t_file_45_goodG2BData = dso_local global i32* null, align 8, !dbg !9
@CWE606_Unchecked_Loop_Condition__wchar_t_file_45_goodB2GData = dso_local global i32* null, align 8, !dbg !14
@.str = private unnamed_addr constant [3 x i32] [i32 37, i32 100, i32 0], align 4
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fgetws() failed\00", align 1
@.str.4 = private unnamed_addr constant [3 x i32] [i32 49, i32 53, i32 0], align 4
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !16
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !41

!43 = !DIGlobalVariableExpression(var: !44, expr: !DIExpression())
!44 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !18, file: !19, line: 176, type: !7, isLocal: false, isDefinition: true)
!45 = !DIGlobalVariableExpression(var: !46, expr: !DIExpression())
!46 = distinct !DIGlobalVariable(name: "globalTrue", scope: !18, file: !19, line: 181, type: !7, isLocal: false, isDefinition: true)
!47 = !DIGlobalVariableExpression(var: !48, expr: !DIExpression())
!48 = distinct !DIGlobalVariable(name: "globalFalse", scope: !18, file: !19, line: 182, type: !7, isLocal: false, isDefinition: true)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "globalFive", scope: !18, file: !19, line: 183, type: !7, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "globalArgc", scope: !18, file: !19, line: 214, type: !7, isLocal: false, isDefinition: true)
!53 = !DIGlobalVariableExpression(var: !54, expr: !DIExpression())
!54 = distinct !DIGlobalVariable(name: "globalArgv", scope: !18, file: !19, line: 215, type: !55, isLocal: false, isDefinition: true)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!57 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!58 = !{!"clang version 12.0.0"}
!59 = !{i32 7, !"Dwarf Version", i32 4}
!60 = !{i32 2, !"Debug Info Version", i32 3}
!61 = !{i32 1, !"wchar_size", i32 4}
!62 = distinct !DISubprogram(name: "badSink", scope: !3, file: !3, line: 39, type: !63, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!63 = !DISubroutineType(types: !64)
!64 = !{null}
!65 = !DILocalVariable(name: "data", scope: !62, file: !3, line: 41, type: !11)
!66 = !DILocation(line: 41, column: 15, scope: !62)
!67 = !DILocation(line: 41, column: 22, scope: !62)
!68 = !DILocalVariable(name: "i", scope: !69, file: !3, line: 43, type: !7)
!69 = distinct !DILexicalBlock(scope: !62, file: !3, line: 42, column: 5)
!70 = !DILocation(line: 43, column: 13, scope: !69)
!71 = !DILocalVariable(name: "n", scope: !69, file: !3, line: 43, type: !7)
!72 = !DILocation(line: 43, column: 16, scope: !69)
!73 = !DILocalVariable(name: "intVariable", scope: !69, file: !3, line: 43, type: !7)
!74 = !DILocation(line: 43, column: 19, scope: !69)
!75 = !DILocation(line: 44, column: 21, scope: !76)
!76 = distinct !DILexicalBlock(scope: !69, file: !3, line: 44, column: 13)
!77 = !DILocation(line: 44, column: 13, scope: !76)
!78 = !DILocation(line: 44, column: 38, scope: !76)
!79 = !DILocation(line: 44, column: 13, scope: !69)
!80 = !DILocation(line: 47, column: 25, scope: !81)
!81 = distinct !DILexicalBlock(scope: !76, file: !3, line: 45, column: 9)
!82 = !DILocation(line: 48, column: 20, scope: !83)
!83 = distinct !DILexicalBlock(scope: !81, file: !3, line: 48, column: 13)
!84 = !DILocation(line: 48, column: 18, scope: !83)
!85 = !DILocation(line: 48, column: 25, scope: !86)
!86 = distinct !DILexicalBlock(scope: !83, file: !3, line: 48, column: 13)
!87 = !DILocation(line: 48, column: 29, scope: !86)
!88 = !DILocation(line: 48, column: 27, scope: !86)
!89 = !DILocation(line: 48, column: 13, scope: !83)
!90 = !DILocation(line: 51, column: 28, scope: !91)
!91 = distinct !DILexicalBlock(scope: !86, file: !3, line: 49, column: 13)
!92 = !DILocation(line: 52, column: 13, scope: !91)
!93 = !DILocation(line: 48, column: 33, scope: !86)
!94 = !DILocation(line: 48, column: 13, scope: !86)
!95 = distinct !{!95, !89, !96, !97}
!96 = !DILocation(line: 52, column: 13, scope: !83)
!97 = !{!"llvm.loop.mustprogress"}
!98 = !DILocation(line: 53, column: 26, scope: !81)
!99 = !DILocation(line: 53, column: 13, scope: !81)
!100 = !DILocation(line: 54, column: 9, scope: !81)
!101 = !DILocation(line: 56, column: 1, scope: !62)
!102 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45_bad", scope: !3, file: !3, line: 58, type: !63, scopeLine: 59, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!103 = !DILocalVariable(name: "data", scope: !102, file: !3, line: 60, type: !11)
!104 = !DILocation(line: 60, column: 15, scope: !102)
!105 = !DILocalVariable(name: "dataBuffer", scope: !102, file: !3, line: 61, type: !106)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 3200, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 100)
!109 = !DILocation(line: 61, column: 13, scope: !102)
!110 = !DILocation(line: 62, column: 12, scope: !102)
!111 = !DILocation(line: 62, column: 10, scope: !102)
!112 = !DILocalVariable(name: "dataLen", scope: !113, file: !3, line: 65, type: !114)
!113 = distinct !DILexicalBlock(scope: !102, file: !3, line: 63, column: 5)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !115)
!115 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!116 = !DILocation(line: 65, column: 16, scope: !113)
!117 = !DILocation(line: 65, column: 33, scope: !113)
!118 = !DILocation(line: 65, column: 26, scope: !113)
!119 = !DILocalVariable(name: "pFile", scope: !113, file: !3, line: 66, type: !120)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !122, line: 7, baseType: !123)
!122 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!123 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !124, line: 49, size: 1728, elements: !125)
!124 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !141, !143, !144, !145, !149, !150, !152, !156, !159, !161, !164, !167, !168, !169, !170, !171}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !123, file: !124, line: 51, baseType: !7, size: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !123, file: !124, line: 54, baseType: !56, size: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !123, file: !124, line: 55, baseType: !56, size: 64, offset: 128)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !123, file: !124, line: 56, baseType: !56, size: 64, offset: 192)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !123, file: !124, line: 57, baseType: !56, size: 64, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !123, file: !124, line: 58, baseType: !56, size: 64, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !123, file: !124, line: 59, baseType: !56, size: 64, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !123, file: !124, line: 60, baseType: !56, size: 64, offset: 448)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !123, file: !124, line: 61, baseType: !56, size: 64, offset: 512)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !123, file: !124, line: 64, baseType: !56, size: 64, offset: 576)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !123, file: !124, line: 65, baseType: !56, size: 64, offset: 640)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !123, file: !124, line: 66, baseType: !56, size: 64, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !123, file: !124, line: 68, baseType: !139, size: 64, offset: 768)
!139 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !140, size: 64)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !124, line: 36, flags: DIFlagFwdDecl)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !123, file: !124, line: 70, baseType: !142, size: 64, offset: 832)
!142 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !123, file: !124, line: 72, baseType: !7, size: 32, offset: 896)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !123, file: !124, line: 73, baseType: !7, size: 32, offset: 928)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !123, file: !124, line: 74, baseType: !146, size: 64, offset: 960)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !147, line: 152, baseType: !148)
!147 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!148 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !123, file: !124, line: 77, baseType: !38, size: 16, offset: 1024)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !123, file: !124, line: 78, baseType: !151, size: 8, offset: 1040)
!151 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !123, file: !124, line: 79, baseType: !153, size: 8, offset: 1048)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 8, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 1)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !123, file: !124, line: 81, baseType: !157, size: 64, offset: 1088)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !124, line: 43, baseType: null)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !123, file: !124, line: 89, baseType: !160, size: 64, offset: 1152)
!160 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !147, line: 153, baseType: !148)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !123, file: !124, line: 91, baseType: !162, size: 64, offset: 1216)
!162 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !163, size: 64)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !124, line: 37, flags: DIFlagFwdDecl)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !123, file: !124, line: 92, baseType: !165, size: 64, offset: 1280)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !124, line: 38, flags: DIFlagFwdDecl)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !123, file: !124, line: 93, baseType: !142, size: 64, offset: 1344)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !123, file: !124, line: 94, baseType: !6, size: 64, offset: 1408)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !123, file: !124, line: 95, baseType: !114, size: 64, offset: 1472)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !123, file: !124, line: 96, baseType: !7, size: 32, offset: 1536)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !123, file: !124, line: 98, baseType: !172, size: 160, offset: 1568)
!172 = !DICompositeType(tag: DW_TAG_array_type, baseType: !57, size: 160, elements: !173)
!173 = !{!174}
!174 = !DISubrange(count: 20)
!175 = !DILocation(line: 66, column: 16, scope: !113)
!176 = !DILocation(line: 68, column: 17, scope: !177)
!177 = distinct !DILexicalBlock(scope: !113, file: !3, line: 68, column: 13)
!178 = !DILocation(line: 68, column: 16, scope: !177)
!179 = !DILocation(line: 68, column: 25, scope: !177)
!180 = !DILocation(line: 68, column: 13, scope: !113)
!181 = !DILocation(line: 70, column: 21, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !3, line: 69, column: 9)
!183 = !DILocation(line: 70, column: 19, scope: !182)
!184 = !DILocation(line: 71, column: 17, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !3, line: 71, column: 17)
!186 = !DILocation(line: 71, column: 23, scope: !185)
!187 = !DILocation(line: 71, column: 17, scope: !182)
!188 = !DILocation(line: 74, column: 28, scope: !189)
!189 = distinct !DILexicalBlock(scope: !190, file: !3, line: 74, column: 21)
!190 = distinct !DILexicalBlock(scope: !185, file: !3, line: 72, column: 13)
!191 = !DILocation(line: 74, column: 33, scope: !189)
!192 = !DILocation(line: 74, column: 32, scope: !189)
!193 = !DILocation(line: 74, column: 52, scope: !189)
!194 = !DILocation(line: 74, column: 51, scope: !189)
!195 = !DILocation(line: 74, column: 42, scope: !189)
!196 = !DILocation(line: 74, column: 62, scope: !189)
!197 = !DILocation(line: 74, column: 21, scope: !189)
!198 = !DILocation(line: 74, column: 69, scope: !189)
!199 = !DILocation(line: 74, column: 21, scope: !190)
!200 = !DILocation(line: 76, column: 21, scope: !201)
!201 = distinct !DILexicalBlock(scope: !189, file: !3, line: 75, column: 17)
!202 = !DILocation(line: 78, column: 21, scope: !201)
!203 = !DILocation(line: 78, column: 26, scope: !201)
!204 = !DILocation(line: 78, column: 35, scope: !201)
!205 = !DILocation(line: 79, column: 17, scope: !201)
!206 = !DILocation(line: 80, column: 24, scope: !190)
!207 = !DILocation(line: 80, column: 17, scope: !190)
!208 = !DILocation(line: 81, column: 13, scope: !190)
!209 = !DILocation(line: 82, column: 9, scope: !182)
!210 = !DILocation(line: 84, column: 64, scope: !102)
!211 = !DILocation(line: 84, column: 62, scope: !102)
!212 = !DILocation(line: 85, column: 5, scope: !102)
!213 = !DILocation(line: 86, column: 1, scope: !102)
!214 = distinct !DISubprogram(name: "goodG2BSink", scope: !3, file: !3, line: 93, type: !63, scopeLine: 94, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!215 = !DILocalVariable(name: "data", scope: !214, file: !3, line: 95, type: !11)
!216 = !DILocation(line: 95, column: 15, scope: !214)
!217 = !DILocation(line: 95, column: 22, scope: !214)
!218 = !DILocalVariable(name: "i", scope: !219, file: !3, line: 97, type: !7)
!219 = distinct !DILexicalBlock(scope: !214, file: !3, line: 96, column: 5)
!220 = !DILocation(line: 97, column: 13, scope: !219)
!221 = !DILocalVariable(name: "n", scope: !219, file: !3, line: 97, type: !7)
!222 = !DILocation(line: 97, column: 16, scope: !219)
!223 = !DILocalVariable(name: "intVariable", scope: !219, file: !3, line: 97, type: !7)
!224 = !DILocation(line: 97, column: 19, scope: !219)
!225 = !DILocation(line: 98, column: 21, scope: !226)
!226 = distinct !DILexicalBlock(scope: !219, file: !3, line: 98, column: 13)
!227 = !DILocation(line: 98, column: 13, scope: !226)
!228 = !DILocation(line: 98, column: 38, scope: !226)
!229 = !DILocation(line: 98, column: 13, scope: !219)
!230 = !DILocation(line: 101, column: 25, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !3, line: 99, column: 9)
!232 = !DILocation(line: 102, column: 20, scope: !233)
!233 = distinct !DILexicalBlock(scope: !231, file: !3, line: 102, column: 13)
!234 = !DILocation(line: 102, column: 18, scope: !233)
!235 = !DILocation(line: 102, column: 25, scope: !236)
!236 = distinct !DILexicalBlock(scope: !233, file: !3, line: 102, column: 13)
!237 = !DILocation(line: 102, column: 29, scope: !236)
!238 = !DILocation(line: 102, column: 27, scope: !236)
!239 = !DILocation(line: 102, column: 13, scope: !233)
!240 = !DILocation(line: 105, column: 28, scope: !241)
!241 = distinct !DILexicalBlock(scope: !236, file: !3, line: 103, column: 13)
!242 = !DILocation(line: 106, column: 13, scope: !241)
!243 = !DILocation(line: 102, column: 33, scope: !236)
!244 = !DILocation(line: 102, column: 13, scope: !236)
!245 = distinct !{!245, !239, !246, !97}
!246 = !DILocation(line: 106, column: 13, scope: !233)
!247 = !DILocation(line: 107, column: 26, scope: !231)
!248 = !DILocation(line: 107, column: 13, scope: !231)
!249 = !DILocation(line: 108, column: 9, scope: !231)
!250 = !DILocation(line: 110, column: 1, scope: !214)
!251 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 112, type: !63, scopeLine: 113, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!252 = !DILocalVariable(name: "data", scope: !251, file: !3, line: 114, type: !11)
!253 = !DILocation(line: 114, column: 15, scope: !251)
!254 = !DILocalVariable(name: "dataBuffer", scope: !251, file: !3, line: 115, type: !106)
!255 = !DILocation(line: 115, column: 13, scope: !251)
!256 = !DILocation(line: 116, column: 12, scope: !251)
!257 = !DILocation(line: 116, column: 10, scope: !251)
!258 = !DILocation(line: 118, column: 12, scope: !251)
!259 = !DILocation(line: 118, column: 5, scope: !251)
!260 = !DILocation(line: 119, column: 68, scope: !251)
!261 = !DILocation(line: 119, column: 66, scope: !251)
!262 = !DILocation(line: 120, column: 5, scope: !251)
!263 = !DILocation(line: 121, column: 1, scope: !251)
!264 = distinct !DISubprogram(name: "goodB2GSink", scope: !3, file: !3, line: 124, type: !63, scopeLine: 125, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!265 = !DILocalVariable(name: "data", scope: !264, file: !3, line: 126, type: !11)
!266 = !DILocation(line: 126, column: 15, scope: !264)
!267 = !DILocation(line: 126, column: 22, scope: !264)
!268 = !DILocalVariable(name: "i", scope: !269, file: !3, line: 128, type: !7)
!269 = distinct !DILexicalBlock(scope: !264, file: !3, line: 127, column: 5)
!270 = !DILocation(line: 128, column: 13, scope: !269)
!271 = !DILocalVariable(name: "n", scope: !269, file: !3, line: 128, type: !7)
!272 = !DILocation(line: 128, column: 16, scope: !269)
!273 = !DILocalVariable(name: "intVariable", scope: !269, file: !3, line: 128, type: !7)
!274 = !DILocation(line: 128, column: 19, scope: !269)
!275 = !DILocation(line: 129, column: 21, scope: !276)
!276 = distinct !DILexicalBlock(scope: !269, file: !3, line: 129, column: 13)
!277 = !DILocation(line: 129, column: 13, scope: !276)
!278 = !DILocation(line: 129, column: 38, scope: !276)
!279 = !DILocation(line: 129, column: 13, scope: !269)
!280 = !DILocation(line: 132, column: 17, scope: !281)
!281 = distinct !DILexicalBlock(scope: !282, file: !3, line: 132, column: 17)
!282 = distinct !DILexicalBlock(scope: !276, file: !3, line: 130, column: 9)
!283 = !DILocation(line: 132, column: 19, scope: !281)
!284 = !DILocation(line: 132, column: 17, scope: !282)
!285 = !DILocation(line: 134, column: 29, scope: !286)
!286 = distinct !DILexicalBlock(scope: !281, file: !3, line: 133, column: 13)
!287 = !DILocation(line: 135, column: 24, scope: !288)
!288 = distinct !DILexicalBlock(scope: !286, file: !3, line: 135, column: 17)
!289 = !DILocation(line: 135, column: 22, scope: !288)
!290 = !DILocation(line: 135, column: 29, scope: !291)
!291 = distinct !DILexicalBlock(scope: !288, file: !3, line: 135, column: 17)
!292 = !DILocation(line: 135, column: 33, scope: !291)
!293 = !DILocation(line: 135, column: 31, scope: !291)
!294 = !DILocation(line: 135, column: 17, scope: !288)
!295 = !DILocation(line: 138, column: 32, scope: !296)
!296 = distinct !DILexicalBlock(scope: !291, file: !3, line: 136, column: 17)
!297 = !DILocation(line: 139, column: 17, scope: !296)
!298 = !DILocation(line: 135, column: 37, scope: !291)
!299 = !DILocation(line: 135, column: 17, scope: !291)
!300 = distinct !{!300, !294, !301, !97}
!301 = !DILocation(line: 139, column: 17, scope: !288)
!302 = !DILocation(line: 140, column: 30, scope: !286)
!303 = !DILocation(line: 140, column: 17, scope: !286)
!304 = !DILocation(line: 141, column: 13, scope: !286)
!305 = !DILocation(line: 142, column: 9, scope: !282)
!306 = !DILocation(line: 144, column: 1, scope: !264)
!307 = distinct !DISubprogram(name: "goodB2G", scope: !3, file: !3, line: 146, type: !63, scopeLine: 147, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!308 = !DILocalVariable(name: "data", scope: !307, file: !3, line: 148, type: !11)
!309 = !DILocation(line: 148, column: 15, scope: !307)
!310 = !DILocalVariable(name: "dataBuffer", scope: !307, file: !3, line: 149, type: !106)
!311 = !DILocation(line: 149, column: 13, scope: !307)
!312 = !DILocation(line: 150, column: 12, scope: !307)
!313 = !DILocation(line: 150, column: 10, scope: !307)
!314 = !DILocalVariable(name: "dataLen", scope: !315, file: !3, line: 153, type: !114)
!315 = distinct !DILexicalBlock(scope: !307, file: !3, line: 151, column: 5)
!316 = !DILocation(line: 153, column: 16, scope: !315)
!317 = !DILocation(line: 153, column: 33, scope: !315)
!318 = !DILocation(line: 153, column: 26, scope: !315)
!319 = !DILocalVariable(name: "pFile", scope: !315, file: !3, line: 154, type: !120)
!320 = !DILocation(line: 154, column: 16, scope: !315)
!321 = !DILocation(line: 156, column: 17, scope: !322)
!322 = distinct !DILexicalBlock(scope: !315, file: !3, line: 156, column: 13)
!323 = !DILocation(line: 156, column: 16, scope: !322)
!324 = !DILocation(line: 156, column: 25, scope: !322)
!325 = !DILocation(line: 156, column: 13, scope: !315)
!326 = !DILocation(line: 158, column: 21, scope: !327)
!327 = distinct !DILexicalBlock(scope: !322, file: !3, line: 157, column: 9)
!328 = !DILocation(line: 158, column: 19, scope: !327)
!329 = !DILocation(line: 159, column: 17, scope: !330)
!330 = distinct !DILexicalBlock(scope: !327, file: !3, line: 159, column: 17)
!331 = !DILocation(line: 159, column: 23, scope: !330)
!332 = !DILocation(line: 159, column: 17, scope: !327)
!333 = !DILocation(line: 162, column: 28, scope: !334)
!334 = distinct !DILexicalBlock(scope: !335, file: !3, line: 162, column: 21)
!335 = distinct !DILexicalBlock(scope: !330, file: !3, line: 160, column: 13)
!336 = !DILocation(line: 162, column: 33, scope: !334)
!337 = !DILocation(line: 162, column: 32, scope: !334)
!338 = !DILocation(line: 162, column: 52, scope: !334)
!339 = !DILocation(line: 162, column: 51, scope: !334)
!340 = !DILocation(line: 162, column: 42, scope: !334)
!341 = !DILocation(line: 162, column: 62, scope: !334)
!342 = !DILocation(line: 162, column: 21, scope: !334)
!343 = !DILocation(line: 162, column: 69, scope: !334)
!344 = !DILocation(line: 162, column: 21, scope: !335)
!345 = !DILocation(line: 164, column: 21, scope: !346)
!346 = distinct !DILexicalBlock(scope: !334, file: !3, line: 163, column: 17)
!347 = !DILocation(line: 166, column: 21, scope: !346)
!348 = !DILocation(line: 166, column: 26, scope: !346)
!349 = !DILocation(line: 166, column: 35, scope: !346)
!350 = !DILocation(line: 167, column: 17, scope: !346)
!351 = !DILocation(line: 168, column: 24, scope: !335)
!352 = !DILocation(line: 168, column: 17, scope: !335)
!353 = !DILocation(line: 169, column: 13, scope: !335)
!354 = !DILocation(line: 170, column: 9, scope: !327)
!355 = !DILocation(line: 172, column: 68, scope: !307)
!356 = !DILocation(line: 172, column: 66, scope: !307)
!357 = !DILocation(line: 173, column: 5, scope: !307)
!358 = !DILocation(line: 174, column: 1, scope: !307)
!359 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45_good", scope: !3, file: !3, line: 176, type: !63, scopeLine: 177, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!360 = !DILocation(line: 178, column: 5, scope: !359)
!361 = !DILocation(line: 179, column: 5, scope: !359)
!362 = !DILocation(line: 180, column: 1, scope: !359)
!363 = distinct !DISubprogram(name: "printLine", scope: !19, file: !19, line: 11, type: !364, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !56}
!366 = !DILocalVariable(name: "line", arg: 1, scope: !363, file: !19, line: 11, type: !56)
!367 = !DILocation(line: 11, column: 25, scope: !363)
!368 = !DILocation(line: 13, column: 1, scope: !363)
!369 = !DILocation(line: 14, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !363, file: !19, line: 14, column: 8)
!371 = !DILocation(line: 14, column: 13, scope: !370)
!372 = !DILocation(line: 14, column: 8, scope: !363)
!373 = !DILocation(line: 16, column: 24, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !19, line: 15, column: 5)
!375 = !DILocation(line: 16, column: 9, scope: !374)
!376 = !DILocation(line: 17, column: 5, scope: !374)
!377 = !DILocation(line: 18, column: 5, scope: !363)
!378 = !DILocation(line: 19, column: 1, scope: !363)
!379 = distinct !DISubprogram(name: "printSinkLine", scope: !19, file: !19, line: 20, type: !364, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!380 = !DILocalVariable(name: "line", arg: 1, scope: !379, file: !19, line: 20, type: !56)
!381 = !DILocation(line: 20, column: 29, scope: !379)
!382 = !DILocation(line: 22, column: 8, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !19, line: 22, column: 8)
!384 = !DILocation(line: 22, column: 13, scope: !383)
!385 = !DILocation(line: 22, column: 8, scope: !379)
!386 = !DILocation(line: 24, column: 24, scope: !387)
!387 = distinct !DILexicalBlock(scope: !383, file: !19, line: 23, column: 5)
!388 = !DILocation(line: 24, column: 9, scope: !387)
!389 = !DILocation(line: 25, column: 5, scope: !387)
!390 = !DILocation(line: 26, column: 1, scope: !379)
!391 = distinct !DISubprogram(name: "printWLine", scope: !19, file: !19, line: 27, type: !392, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !11}
!394 = !DILocalVariable(name: "line", arg: 1, scope: !391, file: !19, line: 27, type: !11)
!395 = !DILocation(line: 27, column: 29, scope: !391)
!396 = !DILocation(line: 29, column: 8, scope: !397)
!397 = distinct !DILexicalBlock(scope: !391, file: !19, line: 29, column: 8)
!398 = !DILocation(line: 29, column: 13, scope: !397)
!399 = !DILocation(line: 29, column: 8, scope: !391)
!400 = !DILocation(line: 31, column: 27, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !19, line: 30, column: 5)
!402 = !DILocation(line: 31, column: 9, scope: !401)
!403 = !DILocation(line: 32, column: 5, scope: !401)
!404 = !DILocation(line: 33, column: 1, scope: !391)
!405 = distinct !DISubprogram(name: "printIntLine", scope: !19, file: !19, line: 35, type: !406, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !7}
!408 = !DILocalVariable(name: "intNumber", arg: 1, scope: !405, file: !19, line: 35, type: !7)
!409 = !DILocation(line: 35, column: 24, scope: !405)
!410 = !DILocation(line: 37, column: 20, scope: !405)
!411 = !DILocation(line: 37, column: 5, scope: !405)
!412 = !DILocation(line: 38, column: 1, scope: !405)
!413 = distinct !DISubprogram(name: "printShortLine", scope: !19, file: !19, line: 40, type: !414, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !416}
!416 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!417 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !413, file: !19, line: 40, type: !416)
!418 = !DILocation(line: 40, column: 28, scope: !413)
!419 = !DILocation(line: 42, column: 21, scope: !413)
!420 = !DILocation(line: 42, column: 5, scope: !413)
!421 = !DILocation(line: 43, column: 1, scope: !413)
!422 = distinct !DISubprogram(name: "printFloatLine", scope: !19, file: !19, line: 45, type: !423, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !425}
!425 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!426 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !422, file: !19, line: 45, type: !425)
!427 = !DILocation(line: 45, column: 28, scope: !422)
!428 = !DILocation(line: 47, column: 20, scope: !422)
!429 = !DILocation(line: 47, column: 5, scope: !422)
!430 = !DILocation(line: 48, column: 1, scope: !422)
!431 = distinct !DISubprogram(name: "printLongLine", scope: !19, file: !19, line: 50, type: !432, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!432 = !DISubroutineType(types: !433)
!433 = !{null, !148}
!434 = !DILocalVariable(name: "longNumber", arg: 1, scope: !431, file: !19, line: 50, type: !148)
!435 = !DILocation(line: 50, column: 26, scope: !431)
!436 = !DILocation(line: 52, column: 21, scope: !431)
!437 = !DILocation(line: 52, column: 5, scope: !431)
!438 = !DILocation(line: 53, column: 1, scope: !431)
!439 = distinct !DISubprogram(name: "printLongLongLine", scope: !19, file: !19, line: 55, type: !440, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !442}
!442 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !443, line: 27, baseType: !444)
!443 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !147, line: 44, baseType: !148)
!445 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !439, file: !19, line: 55, type: !442)
!446 = !DILocation(line: 55, column: 33, scope: !439)
!447 = !DILocation(line: 57, column: 29, scope: !439)
!448 = !DILocation(line: 57, column: 5, scope: !439)
!449 = !DILocation(line: 58, column: 1, scope: !439)
!450 = distinct !DISubprogram(name: "printSizeTLine", scope: !19, file: !19, line: 60, type: !451, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !114}
!453 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !450, file: !19, line: 60, type: !114)
!454 = !DILocation(line: 60, column: 29, scope: !450)
!455 = !DILocation(line: 62, column: 21, scope: !450)
!456 = !DILocation(line: 62, column: 5, scope: !450)
!457 = !DILocation(line: 63, column: 1, scope: !450)
!458 = distinct !DISubprogram(name: "printHexCharLine", scope: !19, file: !19, line: 65, type: !459, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!459 = !DISubroutineType(types: !460)
!460 = !{null, !57}
!461 = !DILocalVariable(name: "charHex", arg: 1, scope: !458, file: !19, line: 65, type: !57)
!462 = !DILocation(line: 65, column: 29, scope: !458)
!463 = !DILocation(line: 67, column: 22, scope: !458)
!464 = !DILocation(line: 67, column: 5, scope: !458)
!465 = !DILocation(line: 68, column: 1, scope: !458)
!466 = distinct !DISubprogram(name: "printWcharLine", scope: !19, file: !19, line: 70, type: !467, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !12}
!469 = !DILocalVariable(name: "wideChar", arg: 1, scope: !466, file: !19, line: 70, type: !12)
!470 = !DILocation(line: 70, column: 29, scope: !466)
!471 = !DILocalVariable(name: "s", scope: !466, file: !19, line: 74, type: !472)
!472 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, elements: !473)
!473 = !{!474}
!474 = !DISubrange(count: 2)
!475 = !DILocation(line: 74, column: 13, scope: !466)
!476 = !DILocation(line: 75, column: 16, scope: !466)
!477 = !DILocation(line: 75, column: 9, scope: !466)
!478 = !DILocation(line: 75, column: 14, scope: !466)
!479 = !DILocation(line: 76, column: 9, scope: !466)
!480 = !DILocation(line: 76, column: 14, scope: !466)
!481 = !DILocation(line: 77, column: 21, scope: !466)
!482 = !DILocation(line: 77, column: 5, scope: !466)
!483 = !DILocation(line: 78, column: 1, scope: !466)
!484 = distinct !DISubprogram(name: "printUnsignedLine", scope: !19, file: !19, line: 80, type: !485, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !23}
!487 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !484, file: !19, line: 80, type: !23)
!488 = !DILocation(line: 80, column: 33, scope: !484)
!489 = !DILocation(line: 82, column: 20, scope: !484)
!490 = !DILocation(line: 82, column: 5, scope: !484)
!491 = !DILocation(line: 83, column: 1, scope: !484)
!492 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !19, file: !19, line: 85, type: !493, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!493 = !DISubroutineType(types: !494)
!494 = !{null, !39}
!495 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !492, file: !19, line: 85, type: !39)
!496 = !DILocation(line: 85, column: 45, scope: !492)
!497 = !DILocation(line: 87, column: 22, scope: !492)
!498 = !DILocation(line: 87, column: 5, scope: !492)
!499 = !DILocation(line: 88, column: 1, scope: !492)
!500 = distinct !DISubprogram(name: "printDoubleLine", scope: !19, file: !19, line: 90, type: !501, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !503}
!503 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!504 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !500, file: !19, line: 90, type: !503)
!505 = !DILocation(line: 90, column: 29, scope: !500)
!506 = !DILocation(line: 92, column: 20, scope: !500)
!507 = !DILocation(line: 92, column: 5, scope: !500)
!508 = !DILocation(line: 93, column: 1, scope: !500)
!509 = distinct !DISubprogram(name: "printStructLine", scope: !19, file: !19, line: 95, type: !510, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !514, line: 100, baseType: !515)
!514 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_342/source_code")
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !514, line: 96, size: 64, elements: !516)
!516 = !{!517, !518}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !515, file: !514, line: 98, baseType: !7, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !515, file: !514, line: 99, baseType: !7, size: 32, offset: 32)
!519 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !509, file: !19, line: 95, type: !512)
!520 = !DILocation(line: 95, column: 40, scope: !509)
!521 = !DILocation(line: 97, column: 26, scope: !509)
!522 = !DILocation(line: 97, column: 47, scope: !509)
!523 = !DILocation(line: 97, column: 55, scope: !509)
!524 = !DILocation(line: 97, column: 76, scope: !509)
!525 = !DILocation(line: 97, column: 5, scope: !509)
!526 = !DILocation(line: 98, column: 1, scope: !509)
!527 = distinct !DISubprogram(name: "printBytesLine", scope: !19, file: !19, line: 100, type: !528, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!528 = !DISubroutineType(types: !529)
!529 = !{null, !530, !114}
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !39, size: 64)
!531 = !DILocalVariable(name: "bytes", arg: 1, scope: !527, file: !19, line: 100, type: !530)
!532 = !DILocation(line: 100, column: 38, scope: !527)
!533 = !DILocalVariable(name: "numBytes", arg: 2, scope: !527, file: !19, line: 100, type: !114)
!534 = !DILocation(line: 100, column: 52, scope: !527)
!535 = !DILocalVariable(name: "i", scope: !527, file: !19, line: 102, type: !114)
!536 = !DILocation(line: 102, column: 12, scope: !527)
!537 = !DILocation(line: 103, column: 12, scope: !538)
!538 = distinct !DILexicalBlock(scope: !527, file: !19, line: 103, column: 5)
!539 = !DILocation(line: 103, column: 10, scope: !538)
!540 = !DILocation(line: 103, column: 17, scope: !541)
!541 = distinct !DILexicalBlock(scope: !538, file: !19, line: 103, column: 5)
!542 = !DILocation(line: 103, column: 21, scope: !541)
!543 = !DILocation(line: 103, column: 19, scope: !541)
!544 = !DILocation(line: 103, column: 5, scope: !538)
!545 = !DILocation(line: 105, column: 24, scope: !546)
!546 = distinct !DILexicalBlock(scope: !541, file: !19, line: 104, column: 5)
!547 = !DILocation(line: 105, column: 30, scope: !546)
!548 = !DILocation(line: 105, column: 9, scope: !546)
!549 = !DILocation(line: 106, column: 5, scope: !546)
!550 = !DILocation(line: 103, column: 31, scope: !541)
!551 = !DILocation(line: 103, column: 5, scope: !541)
!552 = distinct !{!552, !544, !553, !97}
!553 = !DILocation(line: 106, column: 5, scope: !538)
!554 = !DILocation(line: 107, column: 5, scope: !527)
!555 = !DILocation(line: 108, column: 1, scope: !527)
!556 = distinct !DISubprogram(name: "decodeHexChars", scope: !19, file: !19, line: 113, type: !557, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !18, retainedNodes: !4)
!557 = !DISubroutineType(types: !558)
!558 = !{!114, !530, !114, !56}
!559 = !DILocalVariable(name: "bytes", arg: 1, scope: !556, file: !19, line: 113, type: !530)
!560 = !DILocation(line: 113, column: 39, scope: !556)
!561 = !DILocalVariable(name: "numBytes", arg: 2, scope: !556, file: !19, line: 113, type: !114)
!562 = !DILocation(line: 113, column: 53, scope: !556)
!563 = !DILocalVariable(name: "hex", arg: 3, scope: !556, file: !19, line: 113, type: !56)
!564 = !DILocation(line: 113, column: 71, scope: !556)
!565 = !DILocalVariable(name: "numWritten", scope: !556, file: !19, line: 115, type: !114)
!566 = !DILocation(line: 115, column: 12, scope: !556)
!567 = !DILocation(line: 121, column: 5, scope: !556)
!568 = !DILocation(line: 121, column: 12, scope: !556)
!569 = !DILocation(line: 121, column: 25, scope: !556)
!570 = !DILocation(line: 121, column: 23, scope: !556)
!571 = !DILocation(line: 121, column: 34, scope: !556)
!572 = !DILocation(line: 121, column: 37, scope: !556)
!573 = !DILocation(line: 121, column: 67, scope: !556)
!574 = !DILocation(line: 121, column: 70, scope: !556)
!575 = !DILocation(line: 0, scope: !556)
!576 = !DILocalVariable(name: "byte", scope: !577, file: !19, line: 123, type: !7)
!577 = distinct !DILexicalBlock(scope: !556, file: !19, line: 122, column: 5)
