; ModuleID = 'CWE606_Unchecked_Loop_Condition__wchar_t_file_45.c'
source_filename = "CWE606_Unchecked_Loop_Condition__wchar_t_file_45.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@CWE606_Unchecked_Loop_Condition__wchar_t_file_45_badData = dso_local global i32* null, align 8, !dbg !0
@.str = private unnamed_addr constant [3 x i32] [i32 37, i32 100, i32 0], align 4
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fgetws() failed\00", align 1
@CWE606_Unchecked_Loop_Condition__wchar_t_file_45_goodG2BData = dso_local global i32* null, align 8, !dbg !9
@.str.4 = private unnamed_addr constant [3 x i32] [i32 49, i32 53, i32 0], align 4
@CWE606_Unchecked_Loop_Condition__wchar_t_file_45_goodB2GData = dso_local global i32* null, align 8, !dbg !14

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badSink() #0 !dbg !20 {
entry:
  %data = alloca i32*, align 8

!1 = distinct !DIGlobalVariable(name: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45_badData", scope: !2, file: !3, line: 33, type: !11, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_342/source_code")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !14}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45_goodG2BData", scope: !2, file: !3, line: 34, type: !11, isLocal: false, isDefinition: true)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !13, line: 74, baseType: !7)
!13 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!14 = !DIGlobalVariableExpression(var: !15, expr: !DIExpression())
!15 = distinct !DIGlobalVariable(name: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45_goodB2GData", scope: !2, file: !3, line: 35, type: !11, isLocal: false, isDefinition: true)
!16 = !{i32 7, !"Dwarf Version", i32 4}
!17 = !{i32 2, !"Debug Info Version", i32 3}
!18 = !{i32 1, !"wchar_size", i32 4}
!19 = !{!"clang version 12.0.0"}
!20 = distinct !DISubprogram(name: "badSink", scope: !3, file: !3, line: 39, type: !21, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !DILocalVariable(name: "data", scope: !20, file: !3, line: 41, type: !11)
!24 = !DILocation(line: 41, column: 15, scope: !20)
!25 = !DILocation(line: 41, column: 22, scope: !20)
!26 = !DILocalVariable(name: "i", scope: !27, file: !3, line: 43, type: !7)
!27 = distinct !DILexicalBlock(scope: !20, file: !3, line: 42, column: 5)
!28 = !DILocation(line: 43, column: 13, scope: !27)
!29 = !DILocalVariable(name: "n", scope: !27, file: !3, line: 43, type: !7)
!30 = !DILocation(line: 43, column: 16, scope: !27)
!31 = !DILocalVariable(name: "intVariable", scope: !27, file: !3, line: 43, type: !7)
!32 = !DILocation(line: 43, column: 19, scope: !27)
!33 = !DILocation(line: 44, column: 21, scope: !34)
!34 = distinct !DILexicalBlock(scope: !27, file: !3, line: 44, column: 13)
!35 = !DILocation(line: 44, column: 13, scope: !34)
!36 = !DILocation(line: 44, column: 38, scope: !34)
!37 = !DILocation(line: 44, column: 13, scope: !27)
!38 = !DILocation(line: 47, column: 25, scope: !39)
!39 = distinct !DILexicalBlock(scope: !34, file: !3, line: 45, column: 9)
!40 = !DILocation(line: 48, column: 20, scope: !41)
!41 = distinct !DILexicalBlock(scope: !39, file: !3, line: 48, column: 13)
!42 = !DILocation(line: 48, column: 18, scope: !41)
!43 = !DILocation(line: 48, column: 25, scope: !44)
!44 = distinct !DILexicalBlock(scope: !41, file: !3, line: 48, column: 13)
!45 = !DILocation(line: 48, column: 29, scope: !44)
!46 = !DILocation(line: 48, column: 27, scope: !44)
!47 = !DILocation(line: 48, column: 13, scope: !41)
!48 = !DILocation(line: 51, column: 28, scope: !49)
!49 = distinct !DILexicalBlock(scope: !44, file: !3, line: 49, column: 13)
!50 = !DILocation(line: 52, column: 13, scope: !49)
!51 = !DILocation(line: 48, column: 33, scope: !44)
!52 = !DILocation(line: 48, column: 13, scope: !44)
!53 = distinct !{!53, !47, !54, !55}
!54 = !DILocation(line: 52, column: 13, scope: !41)
!55 = !{!"llvm.loop.mustprogress"}
!56 = !DILocation(line: 53, column: 26, scope: !39)
!57 = !DILocation(line: 53, column: 13, scope: !39)
!58 = !DILocation(line: 54, column: 9, scope: !39)
!59 = !DILocation(line: 56, column: 1, scope: !20)
!60 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__wchar_t_file_45_bad", scope: !3, file: !3, line: 58, type: !21, scopeLine: 59, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!61 = !DILocalVariable(name: "data", scope: !60, file: !3, line: 60, type: !11)
!62 = !DILocation(line: 60, column: 15, scope: !60)
!63 = !DILocalVariable(name: "dataBuffer", scope: !60, file: !3, line: 61, type: !64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 3200, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 100)
!67 = !DILocation(line: 61, column: 13, scope: !60)
!68 = !DILocation(line: 62, column: 12, scope: !60)
!69 = !DILocation(line: 62, column: 10, scope: !60)
!70 = !DILocalVariable(name: "dataLen", scope: !71, file: !3, line: 65, type: !72)
!71 = distinct !DILexicalBlock(scope: !60, file: !3, line: 63, column: 5)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !13, line: 46, baseType: !73)
!73 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!74 = !DILocation(line: 65, column: 16, scope: !71)
!75 = !DILocation(line: 65, column: 33, scope: !71)
!76 = !DILocation(line: 65, column: 26, scope: !71)
!77 = !DILocalVariable(name: "pFile", scope: !71, file: !3, line: 66, type: !78)
!78 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !80, line: 7, baseType: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !82, line: 49, size: 1728, elements: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!83 = !{!84, !85, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !111, !113, !117, !120, !122, !125, !128, !129, !130, !131, !132}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !81, file: !82, line: 51, baseType: !7, size: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !81, file: !82, line: 54, baseType: !86, size: 64, offset: 64)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !81, file: !82, line: 55, baseType: !86, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !81, file: !82, line: 56, baseType: !86, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !81, file: !82, line: 57, baseType: !86, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !81, file: !82, line: 58, baseType: !86, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !81, file: !82, line: 59, baseType: !86, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !81, file: !82, line: 60, baseType: !86, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !81, file: !82, line: 61, baseType: !86, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !81, file: !82, line: 64, baseType: !86, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !81, file: !82, line: 65, baseType: !86, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !81, file: !82, line: 66, baseType: !86, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !81, file: !82, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !82, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !81, file: !82, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !81, file: !82, line: 72, baseType: !7, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !81, file: !82, line: 73, baseType: !7, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !81, file: !82, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !81, file: !82, line: 77, baseType: !110, size: 16, offset: 1024)
!110 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !81, file: !82, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !81, file: !82, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !81, file: !82, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !82, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !81, file: !82, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !81, file: !82, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !82, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !81, file: !82, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !82, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !81, file: !82, line: 93, baseType: !102, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !81, file: !82, line: 94, baseType: !6, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !81, file: !82, line: 95, baseType: !72, size: 64, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !81, file: !82, line: 96, baseType: !7, size: 32, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !81, file: !82, line: 98, baseType: !133, size: 160, offset: 1568)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 160, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 20)
!136 = !DILocation(line: 66, column: 16, scope: !71)
!137 = !DILocation(line: 68, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !71, file: !3, line: 68, column: 13)
!139 = !DILocation(line: 68, column: 16, scope: !138)
!140 = !DILocation(line: 68, column: 25, scope: !138)
!141 = !DILocation(line: 68, column: 13, scope: !71)
!142 = !DILocation(line: 70, column: 21, scope: !143)
!143 = distinct !DILexicalBlock(scope: !138, file: !3, line: 69, column: 9)
!144 = !DILocation(line: 70, column: 19, scope: !143)
!145 = !DILocation(line: 71, column: 17, scope: !146)
!146 = distinct !DILexicalBlock(scope: !143, file: !3, line: 71, column: 17)
!147 = !DILocation(line: 71, column: 23, scope: !146)
!148 = !DILocation(line: 71, column: 17, scope: !143)
!149 = !DILocation(line: 74, column: 28, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !3, line: 74, column: 21)
!151 = distinct !DILexicalBlock(scope: !146, file: !3, line: 72, column: 13)
!152 = !DILocation(line: 74, column: 33, scope: !150)
!153 = !DILocation(line: 74, column: 32, scope: !150)
!154 = !DILocation(line: 74, column: 52, scope: !150)
!155 = !DILocation(line: 74, column: 51, scope: !150)
!156 = !DILocation(line: 74, column: 42, scope: !150)
!157 = !DILocation(line: 74, column: 62, scope: !150)
!158 = !DILocation(line: 74, column: 21, scope: !150)
!159 = !DILocation(line: 74, column: 69, scope: !150)
!160 = !DILocation(line: 74, column: 21, scope: !151)
!161 = !DILocation(line: 76, column: 21, scope: !162)
!162 = distinct !DILexicalBlock(scope: !150, file: !3, line: 75, column: 17)
!163 = !DILocation(line: 78, column: 21, scope: !162)
!164 = !DILocation(line: 78, column: 26, scope: !162)
!165 = !DILocation(line: 78, column: 35, scope: !162)
!166 = !DILocation(line: 79, column: 17, scope: !162)
!167 = !DILocation(line: 80, column: 24, scope: !151)
!168 = !DILocation(line: 80, column: 17, scope: !151)
!169 = !DILocation(line: 81, column: 13, scope: !151)
!170 = !DILocation(line: 82, column: 9, scope: !143)
!171 = !DILocation(line: 84, column: 64, scope: !60)
!172 = !DILocation(line: 84, column: 62, scope: !60)
!173 = !DILocation(line: 85, column: 5, scope: !60)
!174 = !DILocation(line: 86, column: 1, scope: !60)
!175 = distinct !DISubprogram(name: "goodG2BSink", scope: !3, file: !3, line: 93, type: !21, scopeLine: 94, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!176 = !DILocalVariable(name: "data", scope: !175, file: !3, line: 95, type: !11)
!177 = !DILocation(line: 95, column: 15, scope: !175)
!178 = !DILocation(line: 95, column: 22, scope: !175)
!179 = !DILocalVariable(name: "i", scope: !180, file: !3, line: 97, type: !7)
!180 = distinct !DILexicalBlock(scope: !175, file: !3, line: 96, column: 5)
!181 = !DILocation(line: 97, column: 13, scope: !180)
!182 = !DILocalVariable(name: "n", scope: !180, file: !3, line: 97, type: !7)
!183 = !DILocation(line: 97, column: 16, scope: !180)
!184 = !DILocalVariable(name: "intVariable", scope: !180, file: !3, line: 97, type: !7)
!185 = !DILocation(line: 97, column: 19, scope: !180)
!186 = !DILocation(line: 98, column: 21, scope: !187)
!187 = distinct !DILexicalBlock(scope: !180, file: !3, line: 98, column: 13)
!188 = !DILocation(line: 98, column: 13, scope: !187)
!189 = !DILocation(line: 98, column: 38, scope: !187)
!190 = !DILocation(line: 98, column: 13, scope: !180)
!191 = !DILocation(line: 101, column: 25, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !3, line: 99, column: 9)
!193 = !DILocation(line: 102, column: 20, scope: !194)
!194 = distinct !DILexicalBlock(scope: !192, file: !3, line: 102, column: 13)
!195 = !DILocation(line: 102, column: 18, scope: !194)
!196 = !DILocation(line: 102, column: 25, scope: !197)
