; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.25 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_994/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_994/source_code")
!50 = distinct !DICompileUnit(language: DW_LANG_C99, file: !51, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!51 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54c.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_994/source_code")
!52 = distinct !DICompileUnit(language: DW_LANG_C99, file: !53, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!53 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54d.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_994/source_code")
!54 = distinct !DICompileUnit(language: DW_LANG_C99, file: !55, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!55 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54e.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_994/source_code")
!56 = !{!"clang version 12.0.0"}
!57 = !{i32 7, !"Dwarf Version", i32 4}
!58 = !{i32 2, !"Debug Info Version", i32 3}
!59 = !{i32 1, !"wchar_size", i32 4}
!60 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54_bad", scope: !45, file: !45, line: 35, type: !61, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!61 = !DISubroutineType(types: !62)
!62 = !{null}
!63 = !DILocalVariable(name: "data", scope: !60, file: !45, line: 37, type: !42)
!64 = !DILocation(line: 37, column: 12, scope: !60)
!65 = !DILocalVariable(name: "dataBuffer", scope: !60, file: !45, line: 38, type: !66)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !67)
!67 = !{!68}
!68 = !DISubrange(count: 100)
!69 = !DILocation(line: 38, column: 10, scope: !60)
!70 = !DILocation(line: 39, column: 12, scope: !60)
!71 = !DILocation(line: 39, column: 10, scope: !60)
!72 = !DILocalVariable(name: "dataLen", scope: !73, file: !45, line: 42, type: !74)
!73 = distinct !DILexicalBlock(scope: !60, file: !45, line: 40, column: 5)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !75, line: 46, baseType: !76)
!75 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!76 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!77 = !DILocation(line: 42, column: 16, scope: !73)
!78 = !DILocation(line: 42, column: 33, scope: !73)
!79 = !DILocation(line: 42, column: 26, scope: !73)
!80 = !DILocalVariable(name: "pFile", scope: !73, file: !45, line: 43, type: !81)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !83, line: 7, baseType: !84)
!83 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !85, line: 49, size: 1728, elements: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!86 = !{!87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !102, !104, !105, !106, !110, !111, !113, !117, !120, !122, !125, !128, !129, !130, !131, !132}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !84, file: !85, line: 51, baseType: !23, size: 32)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !84, file: !85, line: 54, baseType: !42, size: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !84, file: !85, line: 55, baseType: !42, size: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !84, file: !85, line: 56, baseType: !42, size: 64, offset: 192)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !84, file: !85, line: 57, baseType: !42, size: 64, offset: 256)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !84, file: !85, line: 58, baseType: !42, size: 64, offset: 320)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !84, file: !85, line: 59, baseType: !42, size: 64, offset: 384)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !84, file: !85, line: 60, baseType: !42, size: 64, offset: 448)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !84, file: !85, line: 61, baseType: !42, size: 64, offset: 512)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !84, file: !85, line: 64, baseType: !42, size: 64, offset: 576)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !84, file: !85, line: 65, baseType: !42, size: 64, offset: 640)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !84, file: !85, line: 66, baseType: !42, size: 64, offset: 704)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !84, file: !85, line: 68, baseType: !100, size: 64, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !85, line: 36, flags: DIFlagFwdDecl)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !84, file: !85, line: 70, baseType: !103, size: 64, offset: 832)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !84, file: !85, line: 72, baseType: !23, size: 32, offset: 896)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !84, file: !85, line: 73, baseType: !23, size: 32, offset: 928)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !84, file: !85, line: 74, baseType: !107, size: 64, offset: 960)
!107 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !108, line: 152, baseType: !109)
!108 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!109 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !84, file: !85, line: 77, baseType: !24, size: 16, offset: 1024)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !84, file: !85, line: 78, baseType: !112, size: 8, offset: 1040)
!112 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !84, file: !85, line: 79, baseType: !114, size: 8, offset: 1048)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 1)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !84, file: !85, line: 81, baseType: !118, size: 64, offset: 1088)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !85, line: 43, baseType: null)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !84, file: !85, line: 89, baseType: !121, size: 64, offset: 1152)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !108, line: 153, baseType: !109)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !84, file: !85, line: 91, baseType: !123, size: 64, offset: 1216)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !124, size: 64)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !85, line: 37, flags: DIFlagFwdDecl)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !84, file: !85, line: 92, baseType: !126, size: 64, offset: 1280)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !85, line: 38, flags: DIFlagFwdDecl)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !84, file: !85, line: 93, baseType: !103, size: 64, offset: 1344)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !84, file: !85, line: 94, baseType: !22, size: 64, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !84, file: !85, line: 95, baseType: !74, size: 64, offset: 1472)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !84, file: !85, line: 96, baseType: !23, size: 32, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !84, file: !85, line: 98, baseType: !133, size: 160, offset: 1568)
!133 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !134)
!134 = !{!135}
!135 = !DISubrange(count: 20)
!136 = !DILocation(line: 43, column: 16, scope: !73)
!137 = !DILocation(line: 45, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !73, file: !45, line: 45, column: 13)
!139 = !DILocation(line: 45, column: 16, scope: !138)
!140 = !DILocation(line: 45, column: 25, scope: !138)
!141 = !DILocation(line: 45, column: 13, scope: !73)
!142 = !DILocation(line: 47, column: 21, scope: !143)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 46, column: 9)
!144 = !DILocation(line: 47, column: 19, scope: !143)
!145 = !DILocation(line: 48, column: 17, scope: !146)
!146 = distinct !DILexicalBlock(scope: !143, file: !45, line: 48, column: 17)
!147 = !DILocation(line: 48, column: 23, scope: !146)
!148 = !DILocation(line: 48, column: 17, scope: !143)
!149 = !DILocation(line: 51, column: 27, scope: !150)
!150 = distinct !DILexicalBlock(scope: !151, file: !45, line: 51, column: 21)
!151 = distinct !DILexicalBlock(scope: !146, file: !45, line: 49, column: 13)
!152 = !DILocation(line: 51, column: 32, scope: !150)
!153 = !DILocation(line: 51, column: 31, scope: !150)
!154 = !DILocation(line: 51, column: 51, scope: !150)
!155 = !DILocation(line: 51, column: 50, scope: !150)
!156 = !DILocation(line: 51, column: 41, scope: !150)
!157 = !DILocation(line: 51, column: 61, scope: !150)
!158 = !DILocation(line: 51, column: 21, scope: !150)
!159 = !DILocation(line: 51, column: 68, scope: !150)
!160 = !DILocation(line: 51, column: 21, scope: !151)
!161 = !DILocation(line: 53, column: 21, scope: !162)
!162 = distinct !DILexicalBlock(scope: !150, file: !45, line: 52, column: 17)
!163 = !DILocation(line: 55, column: 21, scope: !162)
!164 = !DILocation(line: 55, column: 26, scope: !162)
!165 = !DILocation(line: 55, column: 35, scope: !162)
!166 = !DILocation(line: 56, column: 17, scope: !162)
!167 = !DILocation(line: 57, column: 24, scope: !151)
!168 = !DILocation(line: 57, column: 17, scope: !151)
!169 = !DILocation(line: 58, column: 13, scope: !151)
!170 = !DILocation(line: 59, column: 9, scope: !143)
!171 = !DILocation(line: 61, column: 70, scope: !60)
!172 = !DILocation(line: 61, column: 5, scope: !60)
!173 = !DILocation(line: 62, column: 1, scope: !60)
!174 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 70, type: !61, scopeLine: 71, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!175 = !DILocalVariable(name: "data", scope: !174, file: !45, line: 72, type: !42)
!176 = !DILocation(line: 72, column: 12, scope: !174)
!177 = !DILocalVariable(name: "dataBuffer", scope: !174, file: !45, line: 73, type: !66)
!178 = !DILocation(line: 73, column: 10, scope: !174)
!179 = !DILocation(line: 74, column: 12, scope: !174)
!180 = !DILocation(line: 74, column: 10, scope: !174)
!181 = !DILocation(line: 76, column: 12, scope: !174)
!182 = !DILocation(line: 76, column: 5, scope: !174)
!183 = !DILocation(line: 77, column: 74, scope: !174)
!184 = !DILocation(line: 77, column: 5, scope: !174)
!185 = !DILocation(line: 78, column: 1, scope: !174)
!186 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 82, type: !61, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!187 = !DILocalVariable(name: "data", scope: !186, file: !45, line: 84, type: !42)
!188 = !DILocation(line: 84, column: 12, scope: !186)
!189 = !DILocalVariable(name: "dataBuffer", scope: !186, file: !45, line: 85, type: !66)
!190 = !DILocation(line: 85, column: 10, scope: !186)
!191 = !DILocation(line: 86, column: 12, scope: !186)
!192 = !DILocation(line: 86, column: 10, scope: !186)
!193 = !DILocalVariable(name: "dataLen", scope: !194, file: !45, line: 89, type: !74)
!194 = distinct !DILexicalBlock(scope: !186, file: !45, line: 87, column: 5)
!195 = !DILocation(line: 89, column: 16, scope: !194)
!196 = !DILocation(line: 89, column: 33, scope: !194)
!197 = !DILocation(line: 89, column: 26, scope: !194)
!198 = !DILocalVariable(name: "pFile", scope: !194, file: !45, line: 90, type: !81)
!199 = !DILocation(line: 90, column: 16, scope: !194)
!200 = !DILocation(line: 92, column: 17, scope: !201)
!201 = distinct !DILexicalBlock(scope: !194, file: !45, line: 92, column: 13)
!202 = !DILocation(line: 92, column: 16, scope: !201)
!203 = !DILocation(line: 92, column: 25, scope: !201)
!204 = !DILocation(line: 92, column: 13, scope: !194)
!205 = !DILocation(line: 94, column: 21, scope: !206)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 93, column: 9)
!207 = !DILocation(line: 94, column: 19, scope: !206)
!208 = !DILocation(line: 95, column: 17, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !45, line: 95, column: 17)
!210 = !DILocation(line: 95, column: 23, scope: !209)
!211 = !DILocation(line: 95, column: 17, scope: !206)
!212 = !DILocation(line: 98, column: 27, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !45, line: 98, column: 21)
!214 = distinct !DILexicalBlock(scope: !209, file: !45, line: 96, column: 13)
!215 = !DILocation(line: 98, column: 32, scope: !213)
!216 = !DILocation(line: 98, column: 31, scope: !213)
!217 = !DILocation(line: 98, column: 51, scope: !213)
!218 = !DILocation(line: 98, column: 50, scope: !213)
!219 = !DILocation(line: 98, column: 41, scope: !213)
!220 = !DILocation(line: 98, column: 61, scope: !213)
!221 = !DILocation(line: 98, column: 21, scope: !213)
!222 = !DILocation(line: 98, column: 68, scope: !213)
!223 = !DILocation(line: 98, column: 21, scope: !214)
!224 = !DILocation(line: 100, column: 21, scope: !225)
!225 = distinct !DILexicalBlock(scope: !213, file: !45, line: 99, column: 17)
!226 = !DILocation(line: 102, column: 21, scope: !225)
!227 = !DILocation(line: 102, column: 26, scope: !225)
!228 = !DILocation(line: 102, column: 35, scope: !225)
!229 = !DILocation(line: 103, column: 17, scope: !225)
!230 = !DILocation(line: 104, column: 24, scope: !214)
!231 = !DILocation(line: 104, column: 17, scope: !214)
!232 = !DILocation(line: 105, column: 13, scope: !214)
!233 = !DILocation(line: 106, column: 9, scope: !206)
!234 = !DILocation(line: 108, column: 74, scope: !186)
!235 = !DILocation(line: 108, column: 5, scope: !186)
!236 = !DILocation(line: 109, column: 1, scope: !186)
!237 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54_good", scope: !45, file: !45, line: 111, type: !61, scopeLine: 112, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!238 = !DILocation(line: 113, column: 5, scope: !237)
!239 = !DILocation(line: 114, column: 5, scope: !237)
!240 = !DILocation(line: 115, column: 1, scope: !237)
!241 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54b_badSink", scope: !49, file: !49, line: 35, type: !242, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!242 = !DISubroutineType(types: !243)
!243 = !{null, !42}
!244 = !DILocalVariable(name: "data", arg: 1, scope: !241, file: !49, line: 35, type: !42)
!245 = !DILocation(line: 35, column: 78, scope: !241)
!246 = !DILocation(line: 37, column: 70, scope: !241)
!247 = !DILocation(line: 37, column: 5, scope: !241)
!248 = !DILocation(line: 38, column: 1, scope: !241)
!249 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54b_goodG2BSink", scope: !49, file: !49, line: 47, type: !242, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!250 = !DILocalVariable(name: "data", arg: 1, scope: !249, file: !49, line: 47, type: !42)
!251 = !DILocation(line: 47, column: 82, scope: !249)
!252 = !DILocation(line: 49, column: 74, scope: !249)
!253 = !DILocation(line: 49, column: 5, scope: !249)
!254 = !DILocation(line: 50, column: 1, scope: !249)
!255 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54b_goodB2GSink", scope: !49, file: !49, line: 55, type: !242, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!256 = !DILocalVariable(name: "data", arg: 1, scope: !255, file: !49, line: 55, type: !42)
!257 = !DILocation(line: 55, column: 82, scope: !255)
!258 = !DILocation(line: 57, column: 74, scope: !255)
!259 = !DILocation(line: 57, column: 5, scope: !255)
!260 = !DILocation(line: 58, column: 1, scope: !255)
!261 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54c_badSink", scope: !51, file: !51, line: 35, type: !242, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!262 = !DILocalVariable(name: "data", arg: 1, scope: !261, file: !51, line: 35, type: !42)
!263 = !DILocation(line: 35, column: 78, scope: !261)
!264 = !DILocation(line: 37, column: 70, scope: !261)
!265 = !DILocation(line: 37, column: 5, scope: !261)
!266 = !DILocation(line: 38, column: 1, scope: !261)
!267 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54c_goodG2BSink", scope: !51, file: !51, line: 47, type: !242, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!268 = !DILocalVariable(name: "data", arg: 1, scope: !267, file: !51, line: 47, type: !42)
!269 = !DILocation(line: 47, column: 82, scope: !267)
!270 = !DILocation(line: 49, column: 74, scope: !267)
!271 = !DILocation(line: 49, column: 5, scope: !267)
!272 = !DILocation(line: 50, column: 1, scope: !267)
!273 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54c_goodB2GSink", scope: !51, file: !51, line: 55, type: !242, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !50, retainedNodes: !46)
!274 = !DILocalVariable(name: "data", arg: 1, scope: !273, file: !51, line: 55, type: !42)
!275 = !DILocation(line: 55, column: 82, scope: !273)
!276 = !DILocation(line: 57, column: 74, scope: !273)
!277 = !DILocation(line: 57, column: 5, scope: !273)
!278 = !DILocation(line: 58, column: 1, scope: !273)
!279 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54d_badSink", scope: !53, file: !53, line: 35, type: !242, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!280 = !DILocalVariable(name: "data", arg: 1, scope: !279, file: !53, line: 35, type: !42)
!281 = !DILocation(line: 35, column: 78, scope: !279)
!282 = !DILocation(line: 37, column: 70, scope: !279)
!283 = !DILocation(line: 37, column: 5, scope: !279)
!284 = !DILocation(line: 38, column: 1, scope: !279)
!285 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54d_goodG2BSink", scope: !53, file: !53, line: 47, type: !242, scopeLine: 48, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!286 = !DILocalVariable(name: "data", arg: 1, scope: !285, file: !53, line: 47, type: !42)
!287 = !DILocation(line: 47, column: 82, scope: !285)
!288 = !DILocation(line: 49, column: 74, scope: !285)
!289 = !DILocation(line: 49, column: 5, scope: !285)
!290 = !DILocation(line: 50, column: 1, scope: !285)
!291 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54d_goodB2GSink", scope: !53, file: !53, line: 55, type: !242, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !52, retainedNodes: !46)
!292 = !DILocalVariable(name: "data", arg: 1, scope: !291, file: !53, line: 55, type: !42)
!293 = !DILocation(line: 55, column: 82, scope: !291)
!294 = !DILocation(line: 57, column: 74, scope: !291)
!295 = !DILocation(line: 57, column: 5, scope: !291)
!296 = !DILocation(line: 58, column: 1, scope: !291)
!297 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54e_badSink", scope: !55, file: !55, line: 32, type: !242, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !46)
!298 = !DILocalVariable(name: "data", arg: 1, scope: !297, file: !55, line: 32, type: !42)
!299 = !DILocation(line: 32, column: 78, scope: !297)
!300 = !DILocation(line: 35, column: 13, scope: !297)
!301 = !DILocation(line: 35, column: 21, scope: !297)
!302 = !DILocation(line: 35, column: 5, scope: !297)
!303 = !DILocation(line: 36, column: 1, scope: !297)
!304 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54e_goodG2BSink", scope: !55, file: !55, line: 43, type: !242, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !46)
!305 = !DILocalVariable(name: "data", arg: 1, scope: !304, file: !55, line: 43, type: !42)
!306 = !DILocation(line: 43, column: 82, scope: !304)
!307 = !DILocation(line: 46, column: 13, scope: !304)
!308 = !DILocation(line: 46, column: 21, scope: !304)
!309 = !DILocation(line: 46, column: 5, scope: !304)
!310 = !DILocation(line: 47, column: 1, scope: !304)
!311 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_54e_goodB2GSink", scope: !55, file: !55, line: 50, type: !242, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !54, retainedNodes: !46)
!312 = !DILocalVariable(name: "data", arg: 1, scope: !311, file: !55, line: 50, type: !42)
!313 = !DILocation(line: 50, column: 82, scope: !311)
!314 = !DILocation(line: 53, column: 13, scope: !311)
!315 = !DILocation(line: 53, column: 29, scope: !311)
!316 = !DILocation(line: 53, column: 5, scope: !311)
!317 = !DILocation(line: 54, column: 1, scope: !311)
!318 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !242, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!319 = !DILocalVariable(name: "line", arg: 1, scope: !318, file: !3, line: 11, type: !42)
!320 = !DILocation(line: 11, column: 25, scope: !318)
!321 = !DILocation(line: 13, column: 1, scope: !318)
!322 = !DILocation(line: 14, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !318, file: !3, line: 14, column: 8)
!324 = !DILocation(line: 14, column: 13, scope: !323)
!325 = !DILocation(line: 14, column: 8, scope: !318)
!326 = !DILocation(line: 16, column: 24, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !3, line: 15, column: 5)
!328 = !DILocation(line: 16, column: 9, scope: !327)
!329 = !DILocation(line: 17, column: 5, scope: !327)
!330 = !DILocation(line: 18, column: 5, scope: !318)
!331 = !DILocation(line: 19, column: 1, scope: !318)
!332 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !242, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!333 = !DILocalVariable(name: "line", arg: 1, scope: !332, file: !3, line: 20, type: !42)
!334 = !DILocation(line: 20, column: 29, scope: !332)
!335 = !DILocation(line: 22, column: 8, scope: !336)
!336 = distinct !DILexicalBlock(scope: !332, file: !3, line: 22, column: 8)
!337 = !DILocation(line: 22, column: 13, scope: !336)
!338 = !DILocation(line: 22, column: 8, scope: !332)
!339 = !DILocation(line: 24, column: 24, scope: !340)
!340 = distinct !DILexicalBlock(scope: !336, file: !3, line: 23, column: 5)
!341 = !DILocation(line: 24, column: 9, scope: !340)
!342 = !DILocation(line: 25, column: 5, scope: !340)
!343 = !DILocation(line: 26, column: 1, scope: !332)
!344 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !345, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!345 = !DISubroutineType(types: !346)
!346 = !{null, !347}
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !75, line: 74, baseType: !23)
!349 = !DILocalVariable(name: "line", arg: 1, scope: !344, file: !3, line: 27, type: !347)
!350 = !DILocation(line: 27, column: 29, scope: !344)
!351 = !DILocation(line: 29, column: 8, scope: !352)
!352 = distinct !DILexicalBlock(scope: !344, file: !3, line: 29, column: 8)
!353 = !DILocation(line: 29, column: 13, scope: !352)
!354 = !DILocation(line: 29, column: 8, scope: !344)
!355 = !DILocation(line: 31, column: 27, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 30, column: 5)
!357 = !DILocation(line: 31, column: 9, scope: !356)
!358 = !DILocation(line: 32, column: 5, scope: !356)
!359 = !DILocation(line: 33, column: 1, scope: !344)
!360 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !361, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!361 = !DISubroutineType(types: !362)
!362 = !{null, !23}
!363 = !DILocalVariable(name: "intNumber", arg: 1, scope: !360, file: !3, line: 35, type: !23)
!364 = !DILocation(line: 35, column: 24, scope: !360)
!365 = !DILocation(line: 37, column: 20, scope: !360)
!366 = !DILocation(line: 37, column: 5, scope: !360)
!367 = !DILocation(line: 38, column: 1, scope: !360)
!368 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !369, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !371}
!371 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!372 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !368, file: !3, line: 40, type: !371)
!373 = !DILocation(line: 40, column: 28, scope: !368)
!374 = !DILocation(line: 42, column: 21, scope: !368)
!375 = !DILocation(line: 42, column: 5, scope: !368)
!376 = !DILocation(line: 43, column: 1, scope: !368)
!377 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !378, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !380}
!380 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!381 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !377, file: !3, line: 45, type: !380)
!382 = !DILocation(line: 45, column: 28, scope: !377)
!383 = !DILocation(line: 47, column: 20, scope: !377)
!384 = !DILocation(line: 47, column: 5, scope: !377)
!385 = !DILocation(line: 48, column: 1, scope: !377)
!386 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !387, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !109}
!389 = !DILocalVariable(name: "longNumber", arg: 1, scope: !386, file: !3, line: 50, type: !109)
!390 = !DILocation(line: 50, column: 26, scope: !386)
!391 = !DILocation(line: 52, column: 21, scope: !386)
!392 = !DILocation(line: 52, column: 5, scope: !386)
!393 = !DILocation(line: 53, column: 1, scope: !386)
!394 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !395, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !397}
!397 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !398, line: 27, baseType: !399)
!398 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !108, line: 44, baseType: !109)
!400 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !394, file: !3, line: 55, type: !397)
!401 = !DILocation(line: 55, column: 33, scope: !394)
!402 = !DILocation(line: 57, column: 29, scope: !394)
!403 = !DILocation(line: 57, column: 5, scope: !394)
!404 = !DILocation(line: 58, column: 1, scope: !394)
!405 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !406, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !74}
!408 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !405, file: !3, line: 60, type: !74)
!409 = !DILocation(line: 60, column: 29, scope: !405)
!410 = !DILocation(line: 62, column: 21, scope: !405)
!411 = !DILocation(line: 62, column: 5, scope: !405)
!412 = !DILocation(line: 63, column: 1, scope: !405)
!413 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !414, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !43}
!416 = !DILocalVariable(name: "charHex", arg: 1, scope: !413, file: !3, line: 65, type: !43)
!417 = !DILocation(line: 65, column: 29, scope: !413)
!418 = !DILocation(line: 67, column: 22, scope: !413)
!419 = !DILocation(line: 67, column: 5, scope: !413)
!420 = !DILocation(line: 68, column: 1, scope: !413)
!421 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !422, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !348}
!424 = !DILocalVariable(name: "wideChar", arg: 1, scope: !421, file: !3, line: 70, type: !348)
!425 = !DILocation(line: 70, column: 29, scope: !421)
!426 = !DILocalVariable(name: "s", scope: !421, file: !3, line: 74, type: !427)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !348, size: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 2)
!430 = !DILocation(line: 74, column: 13, scope: !421)
!431 = !DILocation(line: 75, column: 16, scope: !421)
!432 = !DILocation(line: 75, column: 9, scope: !421)
!433 = !DILocation(line: 75, column: 14, scope: !421)
!434 = !DILocation(line: 76, column: 9, scope: !421)
!435 = !DILocation(line: 76, column: 14, scope: !421)
!436 = !DILocation(line: 77, column: 21, scope: !421)
!437 = !DILocation(line: 77, column: 5, scope: !421)
!438 = !DILocation(line: 78, column: 1, scope: !421)
!439 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !440, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !7}
!442 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !439, file: !3, line: 80, type: !7)
!443 = !DILocation(line: 80, column: 33, scope: !439)
!444 = !DILocation(line: 82, column: 20, scope: !439)
!445 = !DILocation(line: 82, column: 5, scope: !439)
!446 = !DILocation(line: 83, column: 1, scope: !439)
!447 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !448, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !25}
!450 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !447, file: !3, line: 85, type: !25)
!451 = !DILocation(line: 85, column: 45, scope: !447)
!452 = !DILocation(line: 87, column: 22, scope: !447)
!453 = !DILocation(line: 87, column: 5, scope: !447)
!454 = !DILocation(line: 88, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !456, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !458}
!458 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!459 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !455, file: !3, line: 90, type: !458)
!460 = !DILocation(line: 90, column: 29, scope: !455)
!461 = !DILocation(line: 92, column: 20, scope: !455)
!462 = !DILocation(line: 92, column: 5, scope: !455)
!463 = !DILocation(line: 93, column: 1, scope: !455)
!464 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !465, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !467}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !468, size: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !469, line: 100, baseType: !470)
!469 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_079_994/source_code")
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !469, line: 96, size: 64, elements: !471)
!471 = !{!472, !473}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !470, file: !469, line: 98, baseType: !23, size: 32)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !470, file: !469, line: 99, baseType: !23, size: 32, offset: 32)
!474 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !464, file: !3, line: 95, type: !467)
!475 = !DILocation(line: 95, column: 40, scope: !464)
!476 = !DILocation(line: 97, column: 26, scope: !464)
!477 = !DILocation(line: 97, column: 47, scope: !464)
!478 = !DILocation(line: 97, column: 55, scope: !464)
!479 = !DILocation(line: 97, column: 76, scope: !464)
!480 = !DILocation(line: 97, column: 5, scope: !464)
!481 = !DILocation(line: 98, column: 1, scope: !464)
!482 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !483, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !485, !74}
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!486 = !DILocalVariable(name: "bytes", arg: 1, scope: !482, file: !3, line: 100, type: !485)
!487 = !DILocation(line: 100, column: 38, scope: !482)
!488 = !DILocalVariable(name: "numBytes", arg: 2, scope: !482, file: !3, line: 100, type: !74)
!489 = !DILocation(line: 100, column: 52, scope: !482)
!490 = !DILocalVariable(name: "i", scope: !482, file: !3, line: 102, type: !74)
!491 = !DILocation(line: 102, column: 12, scope: !482)
!492 = !DILocation(line: 103, column: 12, scope: !493)
!493 = distinct !DILexicalBlock(scope: !482, file: !3, line: 103, column: 5)
!494 = !DILocation(line: 103, column: 10, scope: !493)
!495 = !DILocation(line: 103, column: 17, scope: !496)
!496 = distinct !DILexicalBlock(scope: !493, file: !3, line: 103, column: 5)
!497 = !DILocation(line: 103, column: 21, scope: !496)
!498 = !DILocation(line: 103, column: 19, scope: !496)
!499 = !DILocation(line: 103, column: 5, scope: !493)
!500 = !DILocation(line: 105, column: 24, scope: !501)
!501 = distinct !DILexicalBlock(scope: !496, file: !3, line: 104, column: 5)
!502 = !DILocation(line: 105, column: 30, scope: !501)
!503 = !DILocation(line: 105, column: 9, scope: !501)
!504 = !DILocation(line: 106, column: 5, scope: !501)
!505 = !DILocation(line: 103, column: 31, scope: !496)
!506 = !DILocation(line: 103, column: 5, scope: !496)
!507 = distinct !{!507, !499, !508, !509}
!508 = !DILocation(line: 106, column: 5, scope: !493)
!509 = !{!"llvm.loop.mustprogress"}
!510 = !DILocation(line: 107, column: 5, scope: !482)
!511 = !DILocation(line: 108, column: 1, scope: !482)
!512 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !513, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!513 = !DISubroutineType(types: !514)
!514 = !{!74, !485, !74, !42}
!515 = !DILocalVariable(name: "bytes", arg: 1, scope: !512, file: !3, line: 113, type: !485)
!516 = !DILocation(line: 113, column: 39, scope: !512)
!517 = !DILocalVariable(name: "numBytes", arg: 2, scope: !512, file: !3, line: 113, type: !74)
!518 = !DILocation(line: 113, column: 53, scope: !512)
!519 = !DILocalVariable(name: "hex", arg: 3, scope: !512, file: !3, line: 113, type: !42)
!520 = !DILocation(line: 113, column: 71, scope: !512)
!521 = !DILocalVariable(name: "numWritten", scope: !512, file: !3, line: 115, type: !74)
!522 = !DILocation(line: 115, column: 12, scope: !512)
!523 = !DILocation(line: 121, column: 5, scope: !512)
!524 = !DILocation(line: 121, column: 12, scope: !512)
!525 = !DILocation(line: 121, column: 25, scope: !512)
!526 = !DILocation(line: 121, column: 23, scope: !512)
!527 = !DILocation(line: 121, column: 34, scope: !512)
!528 = !DILocation(line: 121, column: 37, scope: !512)
!529 = !DILocation(line: 121, column: 67, scope: !512)
!530 = !DILocation(line: 121, column: 70, scope: !512)
!531 = !DILocation(line: 0, scope: !512)
!532 = !DILocalVariable(name: "byte", scope: !533, file: !3, line: 123, type: !23)
!533 = distinct !DILexicalBlock(scope: !512, file: !3, line: 122, column: 5)
