; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_09.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_082/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_09_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocation(line: 40, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 40, column: 8)
!66 = !DILocation(line: 40, column: 8, scope: !52)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 44, type: !70)
!68 = distinct !DILexicalBlock(scope: !69, file: !45, line: 42, column: 9)
!69 = distinct !DILexicalBlock(scope: !65, file: !45, line: 41, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 44, column: 20, scope: !68)
!74 = !DILocation(line: 44, column: 37, scope: !68)
!75 = !DILocation(line: 44, column: 30, scope: !68)
!76 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 45, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !23, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !42, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !42, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !42, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !42, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !42, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !42, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !42, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !42, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !42, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !42, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !42, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !23, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !23, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !24, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !22, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !23, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 45, column: 20, scope: !68)
!133 = !DILocation(line: 47, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !68, file: !45, line: 47, column: 17)
!135 = !DILocation(line: 47, column: 20, scope: !134)
!136 = !DILocation(line: 47, column: 29, scope: !134)
!137 = !DILocation(line: 47, column: 17, scope: !68)
!138 = !DILocation(line: 49, column: 25, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !45, line: 48, column: 13)
!140 = !DILocation(line: 49, column: 23, scope: !139)
!141 = !DILocation(line: 50, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !45, line: 50, column: 21)
!143 = !DILocation(line: 50, column: 27, scope: !142)
!144 = !DILocation(line: 50, column: 21, scope: !139)
!145 = !DILocation(line: 53, column: 31, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !45, line: 53, column: 25)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 51, column: 17)
!148 = !DILocation(line: 53, column: 36, scope: !146)
!149 = !DILocation(line: 53, column: 35, scope: !146)
!150 = !DILocation(line: 53, column: 55, scope: !146)
!151 = !DILocation(line: 53, column: 54, scope: !146)
!152 = !DILocation(line: 53, column: 45, scope: !146)
!153 = !DILocation(line: 53, column: 65, scope: !146)
!154 = !DILocation(line: 53, column: 25, scope: !146)
!155 = !DILocation(line: 53, column: 72, scope: !146)
!156 = !DILocation(line: 53, column: 25, scope: !147)
!157 = !DILocation(line: 55, column: 25, scope: !158)
!158 = distinct !DILexicalBlock(scope: !146, file: !45, line: 54, column: 21)
!159 = !DILocation(line: 57, column: 25, scope: !158)
!160 = !DILocation(line: 57, column: 30, scope: !158)
!161 = !DILocation(line: 57, column: 39, scope: !158)
!162 = !DILocation(line: 58, column: 21, scope: !158)
!163 = !DILocation(line: 59, column: 28, scope: !147)
!164 = !DILocation(line: 59, column: 21, scope: !147)
!165 = !DILocation(line: 60, column: 17, scope: !147)
!166 = !DILocation(line: 61, column: 13, scope: !139)
!167 = !DILocation(line: 63, column: 5, scope: !69)
!168 = !DILocation(line: 64, column: 8, scope: !169)
!169 = distinct !DILexicalBlock(scope: !52, file: !45, line: 64, column: 8)
!170 = !DILocation(line: 64, column: 8, scope: !52)
!171 = !DILocalVariable(name: "i", scope: !172, file: !45, line: 67, type: !23)
!172 = distinct !DILexicalBlock(scope: !173, file: !45, line: 66, column: 9)
!173 = distinct !DILexicalBlock(scope: !169, file: !45, line: 65, column: 5)
!174 = !DILocation(line: 67, column: 17, scope: !172)
!175 = !DILocalVariable(name: "n", scope: !172, file: !45, line: 67, type: !23)
!176 = !DILocation(line: 67, column: 20, scope: !172)
!177 = !DILocalVariable(name: "intVariable", scope: !172, file: !45, line: 67, type: !23)
!178 = !DILocation(line: 67, column: 23, scope: !172)
!179 = !DILocation(line: 68, column: 24, scope: !180)
!180 = distinct !DILexicalBlock(scope: !172, file: !45, line: 68, column: 17)
!181 = !DILocation(line: 68, column: 17, scope: !180)
!182 = !DILocation(line: 68, column: 40, scope: !180)
!183 = !DILocation(line: 68, column: 17, scope: !172)
!184 = !DILocation(line: 71, column: 29, scope: !185)
!185 = distinct !DILexicalBlock(scope: !180, file: !45, line: 69, column: 13)
!186 = !DILocation(line: 72, column: 24, scope: !187)
!187 = distinct !DILexicalBlock(scope: !185, file: !45, line: 72, column: 17)
!188 = !DILocation(line: 72, column: 22, scope: !187)
!189 = !DILocation(line: 72, column: 29, scope: !190)
!190 = distinct !DILexicalBlock(scope: !187, file: !45, line: 72, column: 17)
!191 = !DILocation(line: 72, column: 33, scope: !190)
!192 = !DILocation(line: 72, column: 31, scope: !190)
!193 = !DILocation(line: 72, column: 17, scope: !187)
!194 = !DILocation(line: 75, column: 32, scope: !195)
!195 = distinct !DILexicalBlock(scope: !190, file: !45, line: 73, column: 17)
!196 = !DILocation(line: 76, column: 17, scope: !195)
!197 = !DILocation(line: 72, column: 37, scope: !190)
!198 = !DILocation(line: 72, column: 17, scope: !190)
!199 = distinct !{!199, !193, !200, !201}
!200 = !DILocation(line: 76, column: 17, scope: !187)
!201 = !{!"llvm.loop.mustprogress"}
!202 = !DILocation(line: 77, column: 30, scope: !185)
!203 = !DILocation(line: 77, column: 17, scope: !185)
!204 = !DILocation(line: 78, column: 13, scope: !185)
!205 = !DILocation(line: 80, column: 5, scope: !173)
!206 = !DILocation(line: 81, column: 1, scope: !52)
!207 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 88, type: !53, scopeLine: 89, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!208 = !DILocalVariable(name: "data", scope: !207, file: !45, line: 90, type: !42)
!209 = !DILocation(line: 90, column: 12, scope: !207)
!210 = !DILocalVariable(name: "dataBuffer", scope: !207, file: !45, line: 91, type: !58)
!211 = !DILocation(line: 91, column: 10, scope: !207)
!212 = !DILocation(line: 92, column: 12, scope: !207)
!213 = !DILocation(line: 92, column: 10, scope: !207)
!214 = !DILocation(line: 93, column: 8, scope: !215)
!215 = distinct !DILexicalBlock(scope: !207, file: !45, line: 93, column: 8)
!216 = !DILocation(line: 93, column: 8, scope: !207)
!217 = !DILocalVariable(name: "dataLen", scope: !218, file: !45, line: 97, type: !70)
!218 = distinct !DILexicalBlock(scope: !219, file: !45, line: 95, column: 9)
!219 = distinct !DILexicalBlock(scope: !215, file: !45, line: 94, column: 5)
!220 = !DILocation(line: 97, column: 20, scope: !218)
!221 = !DILocation(line: 97, column: 37, scope: !218)
!222 = !DILocation(line: 97, column: 30, scope: !218)
!223 = !DILocalVariable(name: "pFile", scope: !218, file: !45, line: 98, type: !77)
!224 = !DILocation(line: 98, column: 20, scope: !218)
!225 = !DILocation(line: 100, column: 21, scope: !226)
!226 = distinct !DILexicalBlock(scope: !218, file: !45, line: 100, column: 17)
!227 = !DILocation(line: 100, column: 20, scope: !226)
!228 = !DILocation(line: 100, column: 29, scope: !226)
!229 = !DILocation(line: 100, column: 17, scope: !218)
!230 = !DILocation(line: 102, column: 25, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !45, line: 101, column: 13)
!232 = !DILocation(line: 102, column: 23, scope: !231)
!233 = !DILocation(line: 103, column: 21, scope: !234)
!234 = distinct !DILexicalBlock(scope: !231, file: !45, line: 103, column: 21)
!235 = !DILocation(line: 103, column: 27, scope: !234)
!236 = !DILocation(line: 103, column: 21, scope: !231)
!237 = !DILocation(line: 106, column: 31, scope: !238)
!238 = distinct !DILexicalBlock(scope: !239, file: !45, line: 106, column: 25)
!239 = distinct !DILexicalBlock(scope: !234, file: !45, line: 104, column: 17)
!240 = !DILocation(line: 106, column: 36, scope: !238)
!241 = !DILocation(line: 106, column: 35, scope: !238)
!242 = !DILocation(line: 106, column: 55, scope: !238)
!243 = !DILocation(line: 106, column: 54, scope: !238)
!244 = !DILocation(line: 106, column: 45, scope: !238)
!245 = !DILocation(line: 106, column: 65, scope: !238)
!246 = !DILocation(line: 106, column: 25, scope: !238)
!247 = !DILocation(line: 106, column: 72, scope: !238)
!248 = !DILocation(line: 106, column: 25, scope: !239)
!249 = !DILocation(line: 108, column: 25, scope: !250)
!250 = distinct !DILexicalBlock(scope: !238, file: !45, line: 107, column: 21)
!251 = !DILocation(line: 110, column: 25, scope: !250)
!252 = !DILocation(line: 110, column: 30, scope: !250)
!253 = !DILocation(line: 110, column: 39, scope: !250)
!254 = !DILocation(line: 111, column: 21, scope: !250)
!255 = !DILocation(line: 112, column: 28, scope: !239)
!256 = !DILocation(line: 112, column: 21, scope: !239)
!257 = !DILocation(line: 113, column: 17, scope: !239)
!258 = !DILocation(line: 114, column: 13, scope: !231)
!259 = !DILocation(line: 116, column: 5, scope: !219)
!260 = !DILocation(line: 117, column: 8, scope: !261)
!261 = distinct !DILexicalBlock(scope: !207, file: !45, line: 117, column: 8)
!262 = !DILocation(line: 117, column: 8, scope: !207)
!263 = !DILocation(line: 120, column: 9, scope: !264)
!264 = distinct !DILexicalBlock(scope: !261, file: !45, line: 118, column: 5)
!265 = !DILocation(line: 121, column: 5, scope: !264)
!266 = !DILocalVariable(name: "i", scope: !267, file: !45, line: 125, type: !23)
!267 = distinct !DILexicalBlock(scope: !268, file: !45, line: 124, column: 9)
!268 = distinct !DILexicalBlock(scope: !261, file: !45, line: 123, column: 5)
!269 = !DILocation(line: 125, column: 17, scope: !267)
!270 = !DILocalVariable(name: "n", scope: !267, file: !45, line: 125, type: !23)
!271 = !DILocation(line: 125, column: 20, scope: !267)
!272 = !DILocalVariable(name: "intVariable", scope: !267, file: !45, line: 125, type: !23)
!273 = !DILocation(line: 125, column: 23, scope: !267)
!274 = !DILocation(line: 126, column: 24, scope: !275)
!275 = distinct !DILexicalBlock(scope: !267, file: !45, line: 126, column: 17)
!276 = !DILocation(line: 126, column: 17, scope: !275)
!277 = !DILocation(line: 126, column: 40, scope: !275)
!278 = !DILocation(line: 126, column: 17, scope: !267)
!279 = !DILocation(line: 129, column: 21, scope: !280)
!280 = distinct !DILexicalBlock(scope: !281, file: !45, line: 129, column: 21)
!281 = distinct !DILexicalBlock(scope: !275, file: !45, line: 127, column: 13)
!282 = !DILocation(line: 129, column: 23, scope: !280)
!283 = !DILocation(line: 129, column: 21, scope: !281)
!284 = !DILocation(line: 131, column: 33, scope: !285)
!285 = distinct !DILexicalBlock(scope: !280, file: !45, line: 130, column: 17)
!286 = !DILocation(line: 132, column: 28, scope: !287)
!287 = distinct !DILexicalBlock(scope: !285, file: !45, line: 132, column: 21)
!288 = !DILocation(line: 132, column: 26, scope: !287)
!289 = !DILocation(line: 132, column: 33, scope: !290)
!290 = distinct !DILexicalBlock(scope: !287, file: !45, line: 132, column: 21)
!291 = !DILocation(line: 132, column: 37, scope: !290)
!292 = !DILocation(line: 132, column: 35, scope: !290)
!293 = !DILocation(line: 132, column: 21, scope: !287)
!294 = !DILocation(line: 135, column: 36, scope: !295)
!295 = distinct !DILexicalBlock(scope: !290, file: !45, line: 133, column: 21)
!296 = !DILocation(line: 136, column: 21, scope: !295)
!297 = !DILocation(line: 132, column: 41, scope: !290)
!298 = !DILocation(line: 132, column: 21, scope: !290)
!299 = distinct !{!299, !293, !300, !201}
!300 = !DILocation(line: 136, column: 21, scope: !287)
!301 = !DILocation(line: 137, column: 34, scope: !285)
!302 = !DILocation(line: 137, column: 21, scope: !285)
!303 = !DILocation(line: 138, column: 17, scope: !285)
!304 = !DILocation(line: 139, column: 13, scope: !281)
!305 = !DILocation(line: 142, column: 1, scope: !207)
!306 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 145, type: !53, scopeLine: 146, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!307 = !DILocalVariable(name: "data", scope: !306, file: !45, line: 147, type: !42)
!308 = !DILocation(line: 147, column: 12, scope: !306)
!309 = !DILocalVariable(name: "dataBuffer", scope: !306, file: !45, line: 148, type: !58)
!310 = !DILocation(line: 148, column: 10, scope: !306)
!311 = !DILocation(line: 149, column: 12, scope: !306)
!312 = !DILocation(line: 149, column: 10, scope: !306)
!313 = !DILocation(line: 150, column: 8, scope: !314)
!314 = distinct !DILexicalBlock(scope: !306, file: !45, line: 150, column: 8)
!315 = !DILocation(line: 150, column: 8, scope: !306)
!316 = !DILocalVariable(name: "dataLen", scope: !317, file: !45, line: 154, type: !70)
!317 = distinct !DILexicalBlock(scope: !318, file: !45, line: 152, column: 9)
!318 = distinct !DILexicalBlock(scope: !314, file: !45, line: 151, column: 5)
!319 = !DILocation(line: 154, column: 20, scope: !317)
!320 = !DILocation(line: 154, column: 37, scope: !317)
!321 = !DILocation(line: 154, column: 30, scope: !317)
!322 = !DILocalVariable(name: "pFile", scope: !317, file: !45, line: 155, type: !77)
!323 = !DILocation(line: 155, column: 20, scope: !317)
!324 = !DILocation(line: 157, column: 21, scope: !325)
!325 = distinct !DILexicalBlock(scope: !317, file: !45, line: 157, column: 17)
!326 = !DILocation(line: 157, column: 20, scope: !325)
!327 = !DILocation(line: 157, column: 29, scope: !325)
!328 = !DILocation(line: 157, column: 17, scope: !317)
!329 = !DILocation(line: 159, column: 25, scope: !330)
!330 = distinct !DILexicalBlock(scope: !325, file: !45, line: 158, column: 13)
!331 = !DILocation(line: 159, column: 23, scope: !330)
!332 = !DILocation(line: 160, column: 21, scope: !333)
!333 = distinct !DILexicalBlock(scope: !330, file: !45, line: 160, column: 21)
!334 = !DILocation(line: 160, column: 27, scope: !333)
!335 = !DILocation(line: 160, column: 21, scope: !330)
!336 = !DILocation(line: 163, column: 31, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !45, line: 163, column: 25)
!338 = distinct !DILexicalBlock(scope: !333, file: !45, line: 161, column: 17)
!339 = !DILocation(line: 163, column: 36, scope: !337)
!340 = !DILocation(line: 163, column: 35, scope: !337)
!341 = !DILocation(line: 163, column: 55, scope: !337)
!342 = !DILocation(line: 163, column: 54, scope: !337)
!343 = !DILocation(line: 163, column: 45, scope: !337)
!344 = !DILocation(line: 163, column: 65, scope: !337)
!345 = !DILocation(line: 163, column: 25, scope: !337)
!346 = !DILocation(line: 163, column: 72, scope: !337)
!347 = !DILocation(line: 163, column: 25, scope: !338)
!348 = !DILocation(line: 165, column: 25, scope: !349)
!349 = distinct !DILexicalBlock(scope: !337, file: !45, line: 164, column: 21)
!350 = !DILocation(line: 167, column: 25, scope: !349)
!351 = !DILocation(line: 167, column: 30, scope: !349)
!352 = !DILocation(line: 167, column: 39, scope: !349)
!353 = !DILocation(line: 168, column: 21, scope: !349)
!354 = !DILocation(line: 169, column: 28, scope: !338)
!355 = !DILocation(line: 169, column: 21, scope: !338)
!356 = !DILocation(line: 170, column: 17, scope: !338)
!357 = !DILocation(line: 171, column: 13, scope: !330)
!358 = !DILocation(line: 173, column: 5, scope: !318)
!359 = !DILocation(line: 174, column: 8, scope: !360)
!360 = distinct !DILexicalBlock(scope: !306, file: !45, line: 174, column: 8)
!361 = !DILocation(line: 174, column: 8, scope: !306)
!362 = !DILocalVariable(name: "i", scope: !363, file: !45, line: 177, type: !23)
!363 = distinct !DILexicalBlock(scope: !364, file: !45, line: 176, column: 9)
!364 = distinct !DILexicalBlock(scope: !360, file: !45, line: 175, column: 5)
!365 = !DILocation(line: 177, column: 17, scope: !363)
!366 = !DILocalVariable(name: "n", scope: !363, file: !45, line: 177, type: !23)
!367 = !DILocation(line: 177, column: 20, scope: !363)
!368 = !DILocalVariable(name: "intVariable", scope: !363, file: !45, line: 177, type: !23)
!369 = !DILocation(line: 177, column: 23, scope: !363)
!370 = !DILocation(line: 178, column: 24, scope: !371)
!371 = distinct !DILexicalBlock(scope: !363, file: !45, line: 178, column: 17)
!372 = !DILocation(line: 178, column: 17, scope: !371)
!373 = !DILocation(line: 178, column: 40, scope: !371)
!374 = !DILocation(line: 178, column: 17, scope: !363)
!375 = !DILocation(line: 181, column: 21, scope: !376)
!376 = distinct !DILexicalBlock(scope: !377, file: !45, line: 181, column: 21)
!377 = distinct !DILexicalBlock(scope: !371, file: !45, line: 179, column: 13)
!378 = !DILocation(line: 181, column: 23, scope: !376)
!379 = !DILocation(line: 181, column: 21, scope: !377)
!380 = !DILocation(line: 183, column: 33, scope: !381)
!381 = distinct !DILexicalBlock(scope: !376, file: !45, line: 182, column: 17)
!382 = !DILocation(line: 184, column: 28, scope: !383)
!383 = distinct !DILexicalBlock(scope: !381, file: !45, line: 184, column: 21)
!384 = !DILocation(line: 184, column: 26, scope: !383)
!385 = !DILocation(line: 184, column: 33, scope: !386)
!386 = distinct !DILexicalBlock(scope: !383, file: !45, line: 184, column: 21)
!387 = !DILocation(line: 184, column: 37, scope: !386)
!388 = !DILocation(line: 184, column: 35, scope: !386)
!389 = !DILocation(line: 184, column: 21, scope: !383)
!390 = !DILocation(line: 187, column: 36, scope: !391)
!391 = distinct !DILexicalBlock(scope: !386, file: !45, line: 185, column: 21)
!392 = !DILocation(line: 188, column: 21, scope: !391)
!393 = !DILocation(line: 184, column: 41, scope: !386)
!394 = !DILocation(line: 184, column: 21, scope: !386)
!395 = distinct !{!395, !389, !396, !201}
!396 = !DILocation(line: 188, column: 21, scope: !383)
!397 = !DILocation(line: 189, column: 34, scope: !381)
!398 = !DILocation(line: 189, column: 21, scope: !381)
!399 = !DILocation(line: 190, column: 17, scope: !381)
!400 = !DILocation(line: 191, column: 13, scope: !377)
!401 = !DILocation(line: 193, column: 5, scope: !364)
!402 = !DILocation(line: 194, column: 1, scope: !306)
!403 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 197, type: !53, scopeLine: 198, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!404 = !DILocalVariable(name: "data", scope: !403, file: !45, line: 199, type: !42)
!405 = !DILocation(line: 199, column: 12, scope: !403)
!406 = !DILocalVariable(name: "dataBuffer", scope: !403, file: !45, line: 200, type: !58)
!407 = !DILocation(line: 200, column: 10, scope: !403)
!408 = !DILocation(line: 201, column: 12, scope: !403)
!409 = !DILocation(line: 201, column: 10, scope: !403)
!410 = !DILocation(line: 202, column: 8, scope: !411)
!411 = distinct !DILexicalBlock(scope: !403, file: !45, line: 202, column: 8)
!412 = !DILocation(line: 202, column: 8, scope: !403)
!413 = !DILocation(line: 205, column: 9, scope: !414)
!414 = distinct !DILexicalBlock(scope: !411, file: !45, line: 203, column: 5)
!415 = !DILocation(line: 206, column: 5, scope: !414)
!416 = !DILocation(line: 210, column: 16, scope: !417)
!417 = distinct !DILexicalBlock(scope: !411, file: !45, line: 208, column: 5)
!418 = !DILocation(line: 210, column: 9, scope: !417)
!419 = !DILocation(line: 212, column: 8, scope: !420)
!420 = distinct !DILexicalBlock(scope: !403, file: !45, line: 212, column: 8)
!421 = !DILocation(line: 212, column: 8, scope: !403)
!422 = !DILocalVariable(name: "i", scope: !423, file: !45, line: 215, type: !23)
!423 = distinct !DILexicalBlock(scope: !424, file: !45, line: 214, column: 9)
!424 = distinct !DILexicalBlock(scope: !420, file: !45, line: 213, column: 5)
!425 = !DILocation(line: 215, column: 17, scope: !423)
!426 = !DILocalVariable(name: "n", scope: !423, file: !45, line: 215, type: !23)
!427 = !DILocation(line: 215, column: 20, scope: !423)
!428 = !DILocalVariable(name: "intVariable", scope: !423, file: !45, line: 215, type: !23)
!429 = !DILocation(line: 215, column: 23, scope: !423)
!430 = !DILocation(line: 216, column: 24, scope: !431)
!431 = distinct !DILexicalBlock(scope: !423, file: !45, line: 216, column: 17)
!432 = !DILocation(line: 216, column: 17, scope: !431)
!433 = !DILocation(line: 216, column: 40, scope: !431)
!434 = !DILocation(line: 216, column: 17, scope: !423)
!435 = !DILocation(line: 219, column: 29, scope: !436)
!436 = distinct !DILexicalBlock(scope: !431, file: !45, line: 217, column: 13)
!437 = !DILocation(line: 220, column: 24, scope: !438)
!438 = distinct !DILexicalBlock(scope: !436, file: !45, line: 220, column: 17)
!439 = !DILocation(line: 220, column: 22, scope: !438)
!440 = !DILocation(line: 220, column: 29, scope: !441)
!441 = distinct !DILexicalBlock(scope: !438, file: !45, line: 220, column: 17)
!442 = !DILocation(line: 220, column: 33, scope: !441)
!443 = !DILocation(line: 220, column: 31, scope: !441)
!444 = !DILocation(line: 220, column: 17, scope: !438)
!445 = !DILocation(line: 223, column: 32, scope: !446)
!446 = distinct !DILexicalBlock(scope: !441, file: !45, line: 221, column: 17)
!447 = !DILocation(line: 224, column: 17, scope: !446)
!448 = !DILocation(line: 220, column: 37, scope: !441)
!449 = !DILocation(line: 220, column: 17, scope: !441)
!450 = distinct !{!450, !444, !451, !201}
!451 = !DILocation(line: 224, column: 17, scope: !438)
!452 = !DILocation(line: 225, column: 30, scope: !436)
!453 = !DILocation(line: 225, column: 17, scope: !436)
!454 = !DILocation(line: 226, column: 13, scope: !436)
!455 = !DILocation(line: 228, column: 5, scope: !424)
!456 = !DILocation(line: 229, column: 1, scope: !403)
!457 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 232, type: !53, scopeLine: 233, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!458 = !DILocalVariable(name: "data", scope: !457, file: !45, line: 234, type: !42)
!459 = !DILocation(line: 234, column: 12, scope: !457)
!460 = !DILocalVariable(name: "dataBuffer", scope: !457, file: !45, line: 235, type: !58)
!461 = !DILocation(line: 235, column: 10, scope: !457)
!462 = !DILocation(line: 236, column: 12, scope: !457)
!463 = !DILocation(line: 236, column: 10, scope: !457)
!464 = !DILocation(line: 237, column: 8, scope: !465)
!465 = distinct !DILexicalBlock(scope: !457, file: !45, line: 237, column: 8)
!466 = !DILocation(line: 237, column: 8, scope: !457)
!467 = !DILocation(line: 240, column: 16, scope: !468)
!468 = distinct !DILexicalBlock(scope: !465, file: !45, line: 238, column: 5)
!469 = !DILocation(line: 240, column: 9, scope: !468)
!470 = !DILocation(line: 241, column: 5, scope: !468)
!471 = !DILocation(line: 242, column: 8, scope: !472)
!472 = distinct !DILexicalBlock(scope: !457, file: !45, line: 242, column: 8)
!473 = !DILocation(line: 242, column: 8, scope: !457)
!474 = !DILocalVariable(name: "i", scope: !475, file: !45, line: 245, type: !23)
!475 = distinct !DILexicalBlock(scope: !476, file: !45, line: 244, column: 9)
!476 = distinct !DILexicalBlock(scope: !472, file: !45, line: 243, column: 5)
!477 = !DILocation(line: 245, column: 17, scope: !475)
!478 = !DILocalVariable(name: "n", scope: !475, file: !45, line: 245, type: !23)
!479 = !DILocation(line: 245, column: 20, scope: !475)
!480 = !DILocalVariable(name: "intVariable", scope: !475, file: !45, line: 245, type: !23)
!481 = !DILocation(line: 245, column: 23, scope: !475)
!482 = !DILocation(line: 246, column: 24, scope: !483)
!483 = distinct !DILexicalBlock(scope: !475, file: !45, line: 246, column: 17)
!484 = !DILocation(line: 246, column: 17, scope: !483)
!485 = !DILocation(line: 246, column: 40, scope: !483)
!486 = !DILocation(line: 246, column: 17, scope: !475)
!487 = !DILocation(line: 249, column: 29, scope: !488)
!488 = distinct !DILexicalBlock(scope: !483, file: !45, line: 247, column: 13)
!489 = !DILocation(line: 250, column: 24, scope: !490)
!490 = distinct !DILexicalBlock(scope: !488, file: !45, line: 250, column: 17)
!491 = !DILocation(line: 250, column: 22, scope: !490)
!492 = !DILocation(line: 250, column: 29, scope: !493)
!493 = distinct !DILexicalBlock(scope: !490, file: !45, line: 250, column: 17)
!494 = !DILocation(line: 250, column: 33, scope: !493)
!495 = !DILocation(line: 250, column: 31, scope: !493)
!496 = !DILocation(line: 250, column: 17, scope: !490)
!497 = !DILocation(line: 253, column: 32, scope: !498)
!498 = distinct !DILexicalBlock(scope: !493, file: !45, line: 251, column: 17)
!499 = !DILocation(line: 254, column: 17, scope: !498)
!500 = !DILocation(line: 250, column: 37, scope: !493)
!501 = !DILocation(line: 250, column: 17, scope: !493)
!502 = distinct !{!502, !496, !503, !201}
!503 = !DILocation(line: 254, column: 17, scope: !490)
!504 = !DILocation(line: 255, column: 30, scope: !488)
!505 = !DILocation(line: 255, column: 17, scope: !488)
!506 = !DILocation(line: 256, column: 13, scope: !488)
!507 = !DILocation(line: 258, column: 5, scope: !476)
!508 = !DILocation(line: 259, column: 1, scope: !457)
!509 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_09_good", scope: !45, file: !45, line: 261, type: !53, scopeLine: 262, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!510 = !DILocation(line: 263, column: 5, scope: !509)
!511 = !DILocation(line: 264, column: 5, scope: !509)
!512 = !DILocation(line: 265, column: 5, scope: !509)
!513 = !DILocation(line: 266, column: 5, scope: !509)
!514 = !DILocation(line: 267, column: 1, scope: !509)
!515 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !516, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !42}
!518 = !DILocalVariable(name: "line", arg: 1, scope: !515, file: !3, line: 11, type: !42)
!519 = !DILocation(line: 11, column: 25, scope: !515)
!520 = !DILocation(line: 13, column: 1, scope: !515)
!521 = !DILocation(line: 14, column: 8, scope: !522)
!522 = distinct !DILexicalBlock(scope: !515, file: !3, line: 14, column: 8)
!523 = !DILocation(line: 14, column: 13, scope: !522)
!524 = !DILocation(line: 14, column: 8, scope: !515)
!525 = !DILocation(line: 16, column: 24, scope: !526)
!526 = distinct !DILexicalBlock(scope: !522, file: !3, line: 15, column: 5)
!527 = !DILocation(line: 16, column: 9, scope: !526)
!528 = !DILocation(line: 17, column: 5, scope: !526)
!529 = !DILocation(line: 18, column: 5, scope: !515)
!530 = !DILocation(line: 19, column: 1, scope: !515)
!531 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !516, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!532 = !DILocalVariable(name: "line", arg: 1, scope: !531, file: !3, line: 20, type: !42)
!533 = !DILocation(line: 20, column: 29, scope: !531)
!534 = !DILocation(line: 22, column: 8, scope: !535)
!535 = distinct !DILexicalBlock(scope: !531, file: !3, line: 22, column: 8)
!536 = !DILocation(line: 22, column: 13, scope: !535)
!537 = !DILocation(line: 22, column: 8, scope: !531)
!538 = !DILocation(line: 24, column: 24, scope: !539)
!539 = distinct !DILexicalBlock(scope: !535, file: !3, line: 23, column: 5)
!540 = !DILocation(line: 24, column: 9, scope: !539)
!541 = !DILocation(line: 25, column: 5, scope: !539)
!542 = !DILocation(line: 26, column: 1, scope: !531)
!543 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !544, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !546}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !547, size: 64)
!547 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !71, line: 74, baseType: !23)
!548 = !DILocalVariable(name: "line", arg: 1, scope: !543, file: !3, line: 27, type: !546)
!549 = !DILocation(line: 27, column: 29, scope: !543)
!550 = !DILocation(line: 29, column: 8, scope: !551)
!551 = distinct !DILexicalBlock(scope: !543, file: !3, line: 29, column: 8)
!552 = !DILocation(line: 29, column: 13, scope: !551)
!553 = !DILocation(line: 29, column: 8, scope: !543)
!554 = !DILocation(line: 31, column: 27, scope: !555)
!555 = distinct !DILexicalBlock(scope: !551, file: !3, line: 30, column: 5)
!556 = !DILocation(line: 31, column: 9, scope: !555)
!557 = !DILocation(line: 32, column: 5, scope: !555)
!558 = !DILocation(line: 33, column: 1, scope: !543)
!559 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !560, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !23}
!562 = !DILocalVariable(name: "intNumber", arg: 1, scope: !559, file: !3, line: 35, type: !23)
!563 = !DILocation(line: 35, column: 24, scope: !559)
!564 = !DILocation(line: 37, column: 20, scope: !559)
!565 = !DILocation(line: 37, column: 5, scope: !559)
!566 = !DILocation(line: 38, column: 1, scope: !559)
!567 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !568, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!568 = !DISubroutineType(types: !569)
!569 = !{null, !570}
!570 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!571 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !567, file: !3, line: 40, type: !570)
!572 = !DILocation(line: 40, column: 28, scope: !567)
!573 = !DILocation(line: 42, column: 21, scope: !567)
!574 = !DILocation(line: 42, column: 5, scope: !567)
!575 = !DILocation(line: 43, column: 1, scope: !567)
!576 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !577, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579}
!579 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!580 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !576, file: !3, line: 45, type: !579)
!581 = !DILocation(line: 45, column: 28, scope: !576)
!582 = !DILocation(line: 47, column: 20, scope: !576)
!583 = !DILocation(line: 47, column: 5, scope: !576)
!584 = !DILocation(line: 48, column: 1, scope: !576)
!585 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !586, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!586 = !DISubroutineType(types: !587)
!587 = !{null, !105}
!588 = !DILocalVariable(name: "longNumber", arg: 1, scope: !585, file: !3, line: 50, type: !105)
!589 = !DILocation(line: 50, column: 26, scope: !585)
!590 = !DILocation(line: 52, column: 21, scope: !585)
!591 = !DILocation(line: 52, column: 5, scope: !585)
!592 = !DILocation(line: 53, column: 1, scope: !585)
!593 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !594, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !596}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !597, line: 27, baseType: !598)
!597 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!598 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 44, baseType: !105)
!599 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !593, file: !3, line: 55, type: !596)
!600 = !DILocation(line: 55, column: 33, scope: !593)
!601 = !DILocation(line: 57, column: 29, scope: !593)
!602 = !DILocation(line: 57, column: 5, scope: !593)
!603 = !DILocation(line: 58, column: 1, scope: !593)
!604 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !605, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !70}
!607 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !604, file: !3, line: 60, type: !70)
!608 = !DILocation(line: 60, column: 29, scope: !604)
!609 = !DILocation(line: 62, column: 21, scope: !604)
!610 = !DILocation(line: 62, column: 5, scope: !604)
!611 = !DILocation(line: 63, column: 1, scope: !604)
!612 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !613, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !43}
!615 = !DILocalVariable(name: "charHex", arg: 1, scope: !612, file: !3, line: 65, type: !43)
!616 = !DILocation(line: 65, column: 29, scope: !612)
!617 = !DILocation(line: 67, column: 22, scope: !612)
!618 = !DILocation(line: 67, column: 5, scope: !612)
!619 = !DILocation(line: 68, column: 1, scope: !612)
!620 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !621, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !547}
!623 = !DILocalVariable(name: "wideChar", arg: 1, scope: !620, file: !3, line: 70, type: !547)
!624 = !DILocation(line: 70, column: 29, scope: !620)
!625 = !DILocalVariable(name: "s", scope: !620, file: !3, line: 74, type: !626)
!626 = !DICompositeType(tag: DW_TAG_array_type, baseType: !547, size: 64, elements: !627)
!627 = !{!628}
!628 = !DISubrange(count: 2)
!629 = !DILocation(line: 74, column: 13, scope: !620)
!630 = !DILocation(line: 75, column: 16, scope: !620)
!631 = !DILocation(line: 75, column: 9, scope: !620)
!632 = !DILocation(line: 75, column: 14, scope: !620)
!633 = !DILocation(line: 76, column: 9, scope: !620)
!634 = !DILocation(line: 76, column: 14, scope: !620)
!635 = !DILocation(line: 77, column: 21, scope: !620)
!636 = !DILocation(line: 77, column: 5, scope: !620)
!637 = !DILocation(line: 78, column: 1, scope: !620)
!638 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !639, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!639 = !DISubroutineType(types: !640)
!640 = !{null, !7}
!641 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !638, file: !3, line: 80, type: !7)
!642 = !DILocation(line: 80, column: 33, scope: !638)
!643 = !DILocation(line: 82, column: 20, scope: !638)
!644 = !DILocation(line: 82, column: 5, scope: !638)
!645 = !DILocation(line: 83, column: 1, scope: !638)
!646 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !647, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!647 = !DISubroutineType(types: !648)
!648 = !{null, !25}
!649 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !646, file: !3, line: 85, type: !25)
!650 = !DILocation(line: 85, column: 45, scope: !646)
!651 = !DILocation(line: 87, column: 22, scope: !646)
!652 = !DILocation(line: 87, column: 5, scope: !646)
!653 = !DILocation(line: 88, column: 1, scope: !646)
!654 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !655, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!655 = !DISubroutineType(types: !656)
!656 = !{null, !657}
!657 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!658 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !654, file: !3, line: 90, type: !657)
!659 = !DILocation(line: 90, column: 29, scope: !654)
!660 = !DILocation(line: 92, column: 20, scope: !654)
!661 = !DILocation(line: 92, column: 5, scope: !654)
!662 = !DILocation(line: 93, column: 1, scope: !654)
!663 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !664, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!664 = !DISubroutineType(types: !665)
!665 = !{null, !666}
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !668, line: 100, baseType: !669)
!668 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_082/source_code")
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !668, line: 96, size: 64, elements: !670)
!670 = !{!671, !672}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !669, file: !668, line: 98, baseType: !23, size: 32)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !669, file: !668, line: 99, baseType: !23, size: 32, offset: 32)
!673 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !663, file: !3, line: 95, type: !666)
!674 = !DILocation(line: 95, column: 40, scope: !663)
!675 = !DILocation(line: 97, column: 26, scope: !663)
!676 = !DILocation(line: 97, column: 47, scope: !663)
!677 = !DILocation(line: 97, column: 55, scope: !663)
!678 = !DILocation(line: 97, column: 76, scope: !663)
!679 = !DILocation(line: 97, column: 5, scope: !663)
!680 = !DILocation(line: 98, column: 1, scope: !663)
!681 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !682, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!682 = !DISubroutineType(types: !683)
!683 = !{null, !684, !70}
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!685 = !DILocalVariable(name: "bytes", arg: 1, scope: !681, file: !3, line: 100, type: !684)
!686 = !DILocation(line: 100, column: 38, scope: !681)
!687 = !DILocalVariable(name: "numBytes", arg: 2, scope: !681, file: !3, line: 100, type: !70)
!688 = !DILocation(line: 100, column: 52, scope: !681)
!689 = !DILocalVariable(name: "i", scope: !681, file: !3, line: 102, type: !70)
!690 = !DILocation(line: 102, column: 12, scope: !681)
!691 = !DILocation(line: 103, column: 12, scope: !692)
!692 = distinct !DILexicalBlock(scope: !681, file: !3, line: 103, column: 5)
!693 = !DILocation(line: 103, column: 10, scope: !692)
!694 = !DILocation(line: 103, column: 17, scope: !695)
!695 = distinct !DILexicalBlock(scope: !692, file: !3, line: 103, column: 5)
!696 = !DILocation(line: 103, column: 21, scope: !695)
!697 = !DILocation(line: 103, column: 19, scope: !695)
!698 = !DILocation(line: 103, column: 5, scope: !692)
!699 = !DILocation(line: 105, column: 24, scope: !700)
!700 = distinct !DILexicalBlock(scope: !695, file: !3, line: 104, column: 5)
!701 = !DILocation(line: 105, column: 30, scope: !700)
!702 = !DILocation(line: 105, column: 9, scope: !700)
!703 = !DILocation(line: 106, column: 5, scope: !700)
!704 = !DILocation(line: 103, column: 31, scope: !695)
!705 = !DILocation(line: 103, column: 5, scope: !695)
!706 = distinct !{!706, !698, !707, !201}
!707 = !DILocation(line: 106, column: 5, scope: !692)
!708 = !DILocation(line: 107, column: 5, scope: !681)
!709 = !DILocation(line: 108, column: 1, scope: !681)
!710 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !711, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!711 = !DISubroutineType(types: !712)
!712 = !{!70, !684, !70, !42}
!713 = !DILocalVariable(name: "bytes", arg: 1, scope: !710, file: !3, line: 113, type: !684)
!714 = !DILocation(line: 113, column: 39, scope: !710)
!715 = !DILocalVariable(name: "numBytes", arg: 2, scope: !710, file: !3, line: 113, type: !70)
!716 = !DILocation(line: 113, column: 53, scope: !710)
!717 = !DILocalVariable(name: "hex", arg: 3, scope: !710, file: !3, line: 113, type: !42)
!718 = !DILocation(line: 113, column: 71, scope: !710)
!719 = !DILocalVariable(name: "numWritten", scope: !710, file: !3, line: 115, type: !70)
!720 = !DILocation(line: 115, column: 12, scope: !710)
!721 = !DILocation(line: 121, column: 5, scope: !710)
!722 = !DILocation(line: 121, column: 12, scope: !710)
!723 = !DILocation(line: 121, column: 25, scope: !710)
!724 = !DILocation(line: 121, column: 23, scope: !710)
!725 = !DILocation(line: 121, column: 34, scope: !710)
!726 = !DILocation(line: 121, column: 37, scope: !710)
!727 = !DILocation(line: 121, column: 67, scope: !710)
!728 = !DILocation(line: 121, column: 70, scope: !710)
!729 = !DILocation(line: 0, scope: !710)
!730 = !DILocalVariable(name: "byte", scope: !731, file: !3, line: 123, type: !23)
!731 = distinct !DILexicalBlock(scope: !710, file: !3, line: 122, column: 5)
!732 = !DILocation(line: 123, column: 13, scope: !731)
