; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@badStatic = dso_local global i32 0, align 4, !dbg !0
@goodB2G1Static = dso_local global i32 0, align 4, !dbg !9
@goodB2G2Static = dso_local global i32 0, align 4, !dbg !11
@goodG2BStatic = dso_local global i32 0, align 4, !dbg !13
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.4 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !15
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !40
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !42

!47 = distinct !DIGlobalVariable(name: "globalFalse", scope: !17, file: !18, line: 182, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalFive", scope: !17, file: !18, line: 183, type: !7, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "globalArgc", scope: !17, file: !18, line: 214, type: !7, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "globalArgv", scope: !17, file: !18, line: 215, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!"clang version 12.0.0"}
!58 = !{i32 7, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = distinct !DISubprogram(name: "badSink", scope: !3, file: !3, line: 38, type: !62, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !55}
!64 = !DILocalVariable(name: "data", arg: 1, scope: !61, file: !3, line: 38, type: !55)
!65 = !DILocation(line: 38, column: 21, scope: !61)
!66 = !DILocation(line: 40, column: 8, scope: !67)
!67 = distinct !DILexicalBlock(scope: !61, file: !3, line: 40, column: 8)
!68 = !DILocation(line: 40, column: 8, scope: !61)
!69 = !DILocalVariable(name: "i", scope: !70, file: !3, line: 43, type: !7)
!70 = distinct !DILexicalBlock(scope: !71, file: !3, line: 42, column: 9)
!71 = distinct !DILexicalBlock(scope: !67, file: !3, line: 41, column: 5)
!72 = !DILocation(line: 43, column: 17, scope: !70)
!73 = !DILocalVariable(name: "n", scope: !70, file: !3, line: 43, type: !7)
!74 = !DILocation(line: 43, column: 20, scope: !70)
!75 = !DILocalVariable(name: "intVariable", scope: !70, file: !3, line: 43, type: !7)
!76 = !DILocation(line: 43, column: 23, scope: !70)
!77 = !DILocation(line: 44, column: 24, scope: !78)
!78 = distinct !DILexicalBlock(scope: !70, file: !3, line: 44, column: 17)
!79 = !DILocation(line: 44, column: 17, scope: !78)
!80 = !DILocation(line: 44, column: 40, scope: !78)
!81 = !DILocation(line: 44, column: 17, scope: !70)
!82 = !DILocation(line: 47, column: 29, scope: !83)
!83 = distinct !DILexicalBlock(scope: !78, file: !3, line: 45, column: 13)
!84 = !DILocation(line: 48, column: 24, scope: !85)
!85 = distinct !DILexicalBlock(scope: !83, file: !3, line: 48, column: 17)
!86 = !DILocation(line: 48, column: 22, scope: !85)
!87 = !DILocation(line: 48, column: 29, scope: !88)
!88 = distinct !DILexicalBlock(scope: !85, file: !3, line: 48, column: 17)
!89 = !DILocation(line: 48, column: 33, scope: !88)
!90 = !DILocation(line: 48, column: 31, scope: !88)
!91 = !DILocation(line: 48, column: 17, scope: !85)
!92 = !DILocation(line: 51, column: 32, scope: !93)
!93 = distinct !DILexicalBlock(scope: !88, file: !3, line: 49, column: 17)
!94 = !DILocation(line: 52, column: 17, scope: !93)
!95 = !DILocation(line: 48, column: 37, scope: !88)
!96 = !DILocation(line: 48, column: 17, scope: !88)
!97 = distinct !{!97, !91, !98, !99}
!98 = !DILocation(line: 52, column: 17, scope: !85)
!99 = !{!"llvm.loop.mustprogress"}
!100 = !DILocation(line: 53, column: 30, scope: !83)
!101 = !DILocation(line: 53, column: 17, scope: !83)
!102 = !DILocation(line: 54, column: 13, scope: !83)
!103 = !DILocation(line: 56, column: 5, scope: !71)
!104 = !DILocation(line: 57, column: 1, scope: !61)
!105 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_21_bad", scope: !3, file: !3, line: 59, type: !106, scopeLine: 60, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!106 = !DISubroutineType(types: !107)
!107 = !{null}
!108 = !DILocalVariable(name: "data", scope: !105, file: !3, line: 61, type: !55)
!109 = !DILocation(line: 61, column: 12, scope: !105)
!110 = !DILocalVariable(name: "dataBuffer", scope: !105, file: !3, line: 62, type: !111)
!111 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 800, elements: !112)
!112 = !{!113}
!113 = !DISubrange(count: 100)
!114 = !DILocation(line: 62, column: 10, scope: !105)
!115 = !DILocation(line: 63, column: 12, scope: !105)
!116 = !DILocation(line: 63, column: 10, scope: !105)
!117 = !DILocalVariable(name: "dataLen", scope: !118, file: !3, line: 66, type: !119)
!118 = distinct !DILexicalBlock(scope: !105, file: !3, line: 64, column: 5)
!119 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !120, line: 46, baseType: !121)
!120 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!121 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!122 = !DILocation(line: 66, column: 16, scope: !118)
!123 = !DILocation(line: 66, column: 33, scope: !118)
!124 = !DILocation(line: 66, column: 26, scope: !118)
!125 = !DILocalVariable(name: "pFile", scope: !118, file: !3, line: 67, type: !126)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !128, line: 7, baseType: !129)
!128 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !130, line: 49, size: 1728, elements: !131)
!130 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!131 = !{!132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !147, !149, !150, !151, !155, !156, !158, !162, !165, !167, !170, !173, !174, !175, !176, !177}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !129, file: !130, line: 51, baseType: !7, size: 32)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !129, file: !130, line: 54, baseType: !55, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !129, file: !130, line: 55, baseType: !55, size: 64, offset: 128)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !129, file: !130, line: 56, baseType: !55, size: 64, offset: 192)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !129, file: !130, line: 57, baseType: !55, size: 64, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !129, file: !130, line: 58, baseType: !55, size: 64, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !129, file: !130, line: 59, baseType: !55, size: 64, offset: 384)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !129, file: !130, line: 60, baseType: !55, size: 64, offset: 448)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !129, file: !130, line: 61, baseType: !55, size: 64, offset: 512)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !129, file: !130, line: 64, baseType: !55, size: 64, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !129, file: !130, line: 65, baseType: !55, size: 64, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !129, file: !130, line: 66, baseType: !55, size: 64, offset: 704)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !129, file: !130, line: 68, baseType: !145, size: 64, offset: 768)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !130, line: 36, flags: DIFlagFwdDecl)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !129, file: !130, line: 70, baseType: !148, size: 64, offset: 832)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !129, file: !130, line: 72, baseType: !7, size: 32, offset: 896)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !129, file: !130, line: 73, baseType: !7, size: 32, offset: 928)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !129, file: !130, line: 74, baseType: !152, size: 64, offset: 960)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !153, line: 152, baseType: !154)
!153 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!154 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !129, file: !130, line: 77, baseType: !37, size: 16, offset: 1024)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !129, file: !130, line: 78, baseType: !157, size: 8, offset: 1040)
!157 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !129, file: !130, line: 79, baseType: !159, size: 8, offset: 1048)
!159 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !160)
!160 = !{!161}
!161 = !DISubrange(count: 1)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !129, file: !130, line: 81, baseType: !163, size: 64, offset: 1088)
!163 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !164, size: 64)
!164 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !130, line: 43, baseType: null)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !129, file: !130, line: 89, baseType: !166, size: 64, offset: 1152)
!166 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !153, line: 153, baseType: !154)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !129, file: !130, line: 91, baseType: !168, size: 64, offset: 1216)
!168 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !169, size: 64)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !130, line: 37, flags: DIFlagFwdDecl)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !129, file: !130, line: 92, baseType: !171, size: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !172, size: 64)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !130, line: 38, flags: DIFlagFwdDecl)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !129, file: !130, line: 93, baseType: !148, size: 64, offset: 1344)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !129, file: !130, line: 94, baseType: !6, size: 64, offset: 1408)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !129, file: !130, line: 95, baseType: !119, size: 64, offset: 1472)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !129, file: !130, line: 96, baseType: !7, size: 32, offset: 1536)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !129, file: !130, line: 98, baseType: !178, size: 160, offset: 1568)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 20)
!181 = !DILocation(line: 67, column: 16, scope: !118)
!182 = !DILocation(line: 69, column: 17, scope: !183)
!183 = distinct !DILexicalBlock(scope: !118, file: !3, line: 69, column: 13)
!184 = !DILocation(line: 69, column: 16, scope: !183)
!185 = !DILocation(line: 69, column: 25, scope: !183)
!186 = !DILocation(line: 69, column: 13, scope: !118)
!187 = !DILocation(line: 71, column: 21, scope: !188)
!188 = distinct !DILexicalBlock(scope: !183, file: !3, line: 70, column: 9)
!189 = !DILocation(line: 71, column: 19, scope: !188)
!190 = !DILocation(line: 72, column: 17, scope: !191)
!191 = distinct !DILexicalBlock(scope: !188, file: !3, line: 72, column: 17)
!192 = !DILocation(line: 72, column: 23, scope: !191)
!193 = !DILocation(line: 72, column: 17, scope: !188)
!194 = !DILocation(line: 75, column: 27, scope: !195)
!195 = distinct !DILexicalBlock(scope: !196, file: !3, line: 75, column: 21)
!196 = distinct !DILexicalBlock(scope: !191, file: !3, line: 73, column: 13)
!197 = !DILocation(line: 75, column: 32, scope: !195)
!198 = !DILocation(line: 75, column: 31, scope: !195)
!199 = !DILocation(line: 75, column: 51, scope: !195)
!200 = !DILocation(line: 75, column: 50, scope: !195)
!201 = !DILocation(line: 75, column: 41, scope: !195)
!202 = !DILocation(line: 75, column: 61, scope: !195)
!203 = !DILocation(line: 75, column: 21, scope: !195)
!204 = !DILocation(line: 75, column: 68, scope: !195)
!205 = !DILocation(line: 75, column: 21, scope: !196)
!206 = !DILocation(line: 77, column: 21, scope: !207)
!207 = distinct !DILexicalBlock(scope: !195, file: !3, line: 76, column: 17)
!208 = !DILocation(line: 79, column: 21, scope: !207)
!209 = !DILocation(line: 79, column: 26, scope: !207)
!210 = !DILocation(line: 79, column: 35, scope: !207)
!211 = !DILocation(line: 80, column: 17, scope: !207)
!212 = !DILocation(line: 81, column: 24, scope: !196)
!213 = !DILocation(line: 81, column: 17, scope: !196)
!214 = !DILocation(line: 82, column: 13, scope: !196)
!215 = !DILocation(line: 83, column: 9, scope: !188)
!216 = !DILocation(line: 85, column: 15, scope: !105)
!217 = !DILocation(line: 86, column: 13, scope: !105)
!218 = !DILocation(line: 86, column: 5, scope: !105)
!219 = !DILocation(line: 87, column: 1, scope: !105)
!220 = distinct !DISubprogram(name: "goodB2G1Sink", scope: !3, file: !3, line: 99, type: !62, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!221 = !DILocalVariable(name: "data", arg: 1, scope: !220, file: !3, line: 99, type: !55)
!222 = !DILocation(line: 99, column: 26, scope: !220)
!223 = !DILocation(line: 101, column: 8, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 101, column: 8)
!225 = !DILocation(line: 101, column: 8, scope: !220)
!226 = !DILocation(line: 104, column: 9, scope: !227)
!227 = distinct !DILexicalBlock(scope: !224, file: !3, line: 102, column: 5)
!228 = !DILocation(line: 105, column: 5, scope: !227)
!229 = !DILocalVariable(name: "i", scope: !230, file: !3, line: 109, type: !7)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 108, column: 9)
!231 = distinct !DILexicalBlock(scope: !224, file: !3, line: 107, column: 5)
!232 = !DILocation(line: 109, column: 17, scope: !230)
!233 = !DILocalVariable(name: "n", scope: !230, file: !3, line: 109, type: !7)
!234 = !DILocation(line: 109, column: 20, scope: !230)
!235 = !DILocalVariable(name: "intVariable", scope: !230, file: !3, line: 109, type: !7)
!236 = !DILocation(line: 109, column: 23, scope: !230)
!237 = !DILocation(line: 110, column: 24, scope: !238)
!238 = distinct !DILexicalBlock(scope: !230, file: !3, line: 110, column: 17)
!239 = !DILocation(line: 110, column: 17, scope: !238)
!240 = !DILocation(line: 110, column: 40, scope: !238)
!241 = !DILocation(line: 110, column: 17, scope: !230)
!242 = !DILocation(line: 113, column: 21, scope: !243)
!243 = distinct !DILexicalBlock(scope: !244, file: !3, line: 113, column: 21)
!244 = distinct !DILexicalBlock(scope: !238, file: !3, line: 111, column: 13)
!245 = !DILocation(line: 113, column: 23, scope: !243)
!246 = !DILocation(line: 113, column: 21, scope: !244)
!247 = !DILocation(line: 115, column: 33, scope: !248)
!248 = distinct !DILexicalBlock(scope: !243, file: !3, line: 114, column: 17)
!249 = !DILocation(line: 116, column: 28, scope: !250)
!250 = distinct !DILexicalBlock(scope: !248, file: !3, line: 116, column: 21)
!251 = !DILocation(line: 116, column: 26, scope: !250)
!252 = !DILocation(line: 116, column: 33, scope: !253)
!253 = distinct !DILexicalBlock(scope: !250, file: !3, line: 116, column: 21)
!254 = !DILocation(line: 116, column: 37, scope: !253)
!255 = !DILocation(line: 116, column: 35, scope: !253)
!256 = !DILocation(line: 116, column: 21, scope: !250)
!257 = !DILocation(line: 119, column: 36, scope: !258)
!258 = distinct !DILexicalBlock(scope: !253, file: !3, line: 117, column: 21)
!259 = !DILocation(line: 120, column: 21, scope: !258)
!260 = !DILocation(line: 116, column: 41, scope: !253)
!261 = !DILocation(line: 116, column: 21, scope: !253)
!262 = distinct !{!262, !256, !263, !99}
!263 = !DILocation(line: 120, column: 21, scope: !250)
!264 = !DILocation(line: 121, column: 34, scope: !248)
!265 = !DILocation(line: 121, column: 21, scope: !248)
!266 = !DILocation(line: 122, column: 17, scope: !248)
!267 = !DILocation(line: 123, column: 13, scope: !244)
!268 = !DILocation(line: 126, column: 1, scope: !220)
!269 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 128, type: !106, scopeLine: 129, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!270 = !DILocalVariable(name: "data", scope: !269, file: !3, line: 130, type: !55)
!271 = !DILocation(line: 130, column: 12, scope: !269)
!272 = !DILocalVariable(name: "dataBuffer", scope: !269, file: !3, line: 131, type: !111)
!273 = !DILocation(line: 131, column: 10, scope: !269)
!274 = !DILocation(line: 132, column: 12, scope: !269)
!275 = !DILocation(line: 132, column: 10, scope: !269)
!276 = !DILocalVariable(name: "dataLen", scope: !277, file: !3, line: 135, type: !119)
!277 = distinct !DILexicalBlock(scope: !269, file: !3, line: 133, column: 5)
!278 = !DILocation(line: 135, column: 16, scope: !277)
!279 = !DILocation(line: 135, column: 33, scope: !277)
!280 = !DILocation(line: 135, column: 26, scope: !277)
!281 = !DILocalVariable(name: "pFile", scope: !277, file: !3, line: 136, type: !126)
!282 = !DILocation(line: 136, column: 16, scope: !277)
!283 = !DILocation(line: 138, column: 17, scope: !284)
!284 = distinct !DILexicalBlock(scope: !277, file: !3, line: 138, column: 13)
!285 = !DILocation(line: 138, column: 16, scope: !284)
!286 = !DILocation(line: 138, column: 25, scope: !284)
!287 = !DILocation(line: 138, column: 13, scope: !277)
!288 = !DILocation(line: 140, column: 21, scope: !289)
!289 = distinct !DILexicalBlock(scope: !284, file: !3, line: 139, column: 9)
!290 = !DILocation(line: 140, column: 19, scope: !289)
!291 = !DILocation(line: 141, column: 17, scope: !292)
!292 = distinct !DILexicalBlock(scope: !289, file: !3, line: 141, column: 17)
!293 = !DILocation(line: 141, column: 23, scope: !292)
!294 = !DILocation(line: 141, column: 17, scope: !289)
!295 = !DILocation(line: 144, column: 27, scope: !296)
!296 = distinct !DILexicalBlock(scope: !297, file: !3, line: 144, column: 21)
!297 = distinct !DILexicalBlock(scope: !292, file: !3, line: 142, column: 13)
!298 = !DILocation(line: 144, column: 32, scope: !296)
!299 = !DILocation(line: 144, column: 31, scope: !296)
!300 = !DILocation(line: 144, column: 51, scope: !296)
!301 = !DILocation(line: 144, column: 50, scope: !296)
!302 = !DILocation(line: 144, column: 41, scope: !296)
!303 = !DILocation(line: 144, column: 61, scope: !296)
!304 = !DILocation(line: 144, column: 21, scope: !296)
!305 = !DILocation(line: 144, column: 68, scope: !296)
!306 = !DILocation(line: 144, column: 21, scope: !297)
!307 = !DILocation(line: 146, column: 21, scope: !308)
!308 = distinct !DILexicalBlock(scope: !296, file: !3, line: 145, column: 17)
!309 = !DILocation(line: 148, column: 21, scope: !308)
!310 = !DILocation(line: 148, column: 26, scope: !308)
!311 = !DILocation(line: 148, column: 35, scope: !308)
!312 = !DILocation(line: 149, column: 17, scope: !308)
!313 = !DILocation(line: 150, column: 24, scope: !297)
!314 = !DILocation(line: 150, column: 17, scope: !297)
!315 = !DILocation(line: 151, column: 13, scope: !297)
!316 = !DILocation(line: 152, column: 9, scope: !289)
!317 = !DILocation(line: 154, column: 20, scope: !269)
!318 = !DILocation(line: 155, column: 18, scope: !269)
!319 = !DILocation(line: 155, column: 5, scope: !269)
!320 = !DILocation(line: 156, column: 1, scope: !269)
!321 = distinct !DISubprogram(name: "goodB2G2Sink", scope: !3, file: !3, line: 159, type: !62, scopeLine: 160, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!322 = !DILocalVariable(name: "data", arg: 1, scope: !321, file: !3, line: 159, type: !55)
!323 = !DILocation(line: 159, column: 26, scope: !321)
!324 = !DILocation(line: 161, column: 8, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !3, line: 161, column: 8)
!326 = !DILocation(line: 161, column: 8, scope: !321)
!327 = !DILocalVariable(name: "i", scope: !328, file: !3, line: 164, type: !7)
!328 = distinct !DILexicalBlock(scope: !329, file: !3, line: 163, column: 9)
!329 = distinct !DILexicalBlock(scope: !325, file: !3, line: 162, column: 5)
!330 = !DILocation(line: 164, column: 17, scope: !328)
!331 = !DILocalVariable(name: "n", scope: !328, file: !3, line: 164, type: !7)
!332 = !DILocation(line: 164, column: 20, scope: !328)
!333 = !DILocalVariable(name: "intVariable", scope: !328, file: !3, line: 164, type: !7)
!334 = !DILocation(line: 164, column: 23, scope: !328)
!335 = !DILocation(line: 165, column: 24, scope: !336)
!336 = distinct !DILexicalBlock(scope: !328, file: !3, line: 165, column: 17)
!337 = !DILocation(line: 165, column: 17, scope: !336)
!338 = !DILocation(line: 165, column: 40, scope: !336)
!339 = !DILocation(line: 165, column: 17, scope: !328)
!340 = !DILocation(line: 168, column: 21, scope: !341)
!341 = distinct !DILexicalBlock(scope: !342, file: !3, line: 168, column: 21)
!342 = distinct !DILexicalBlock(scope: !336, file: !3, line: 166, column: 13)
!343 = !DILocation(line: 168, column: 23, scope: !341)
!344 = !DILocation(line: 168, column: 21, scope: !342)
!345 = !DILocation(line: 170, column: 33, scope: !346)
!346 = distinct !DILexicalBlock(scope: !341, file: !3, line: 169, column: 17)
!347 = !DILocation(line: 171, column: 28, scope: !348)
!348 = distinct !DILexicalBlock(scope: !346, file: !3, line: 171, column: 21)
!349 = !DILocation(line: 171, column: 26, scope: !348)
!350 = !DILocation(line: 171, column: 33, scope: !351)
!351 = distinct !DILexicalBlock(scope: !348, file: !3, line: 171, column: 21)
!352 = !DILocation(line: 171, column: 37, scope: !351)
!353 = !DILocation(line: 171, column: 35, scope: !351)
!354 = !DILocation(line: 171, column: 21, scope: !348)
!355 = !DILocation(line: 174, column: 36, scope: !356)
!356 = distinct !DILexicalBlock(scope: !351, file: !3, line: 172, column: 21)
!357 = !DILocation(line: 175, column: 21, scope: !356)
!358 = !DILocation(line: 171, column: 41, scope: !351)
!359 = !DILocation(line: 171, column: 21, scope: !351)
!360 = distinct !{!360, !354, !361, !99}
!361 = !DILocation(line: 175, column: 21, scope: !348)
!362 = !DILocation(line: 176, column: 34, scope: !346)
!363 = !DILocation(line: 176, column: 21, scope: !346)
!364 = !DILocation(line: 177, column: 17, scope: !346)
!365 = !DILocation(line: 178, column: 13, scope: !342)
!366 = !DILocation(line: 180, column: 5, scope: !329)
!367 = !DILocation(line: 181, column: 1, scope: !321)
!368 = distinct !DISubprogram(name: "goodB2G2", scope: !3, file: !3, line: 183, type: !106, scopeLine: 184, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!369 = !DILocalVariable(name: "data", scope: !368, file: !3, line: 185, type: !55)
!370 = !DILocation(line: 185, column: 12, scope: !368)
!371 = !DILocalVariable(name: "dataBuffer", scope: !368, file: !3, line: 186, type: !111)
!372 = !DILocation(line: 186, column: 10, scope: !368)
!373 = !DILocation(line: 187, column: 12, scope: !368)
!374 = !DILocation(line: 187, column: 10, scope: !368)
!375 = !DILocalVariable(name: "dataLen", scope: !376, file: !3, line: 190, type: !119)
!376 = distinct !DILexicalBlock(scope: !368, file: !3, line: 188, column: 5)
!377 = !DILocation(line: 190, column: 16, scope: !376)
!378 = !DILocation(line: 190, column: 33, scope: !376)
!379 = !DILocation(line: 190, column: 26, scope: !376)
!380 = !DILocalVariable(name: "pFile", scope: !376, file: !3, line: 191, type: !126)
!381 = !DILocation(line: 191, column: 16, scope: !376)
!382 = !DILocation(line: 193, column: 17, scope: !383)
!383 = distinct !DILexicalBlock(scope: !376, file: !3, line: 193, column: 13)
!384 = !DILocation(line: 193, column: 16, scope: !383)
!385 = !DILocation(line: 193, column: 25, scope: !383)
!386 = !DILocation(line: 193, column: 13, scope: !376)
!387 = !DILocation(line: 195, column: 21, scope: !388)
!388 = distinct !DILexicalBlock(scope: !383, file: !3, line: 194, column: 9)
!389 = !DILocation(line: 195, column: 19, scope: !388)
!390 = !DILocation(line: 196, column: 17, scope: !391)
!391 = distinct !DILexicalBlock(scope: !388, file: !3, line: 196, column: 17)
!392 = !DILocation(line: 196, column: 23, scope: !391)
!393 = !DILocation(line: 196, column: 17, scope: !388)
!394 = !DILocation(line: 199, column: 27, scope: !395)
!395 = distinct !DILexicalBlock(scope: !396, file: !3, line: 199, column: 21)
!396 = distinct !DILexicalBlock(scope: !391, file: !3, line: 197, column: 13)
!397 = !DILocation(line: 199, column: 32, scope: !395)
!398 = !DILocation(line: 199, column: 31, scope: !395)
!399 = !DILocation(line: 199, column: 51, scope: !395)
!400 = !DILocation(line: 199, column: 50, scope: !395)
!401 = !DILocation(line: 199, column: 41, scope: !395)
!402 = !DILocation(line: 199, column: 61, scope: !395)
!403 = !DILocation(line: 199, column: 21, scope: !395)
!404 = !DILocation(line: 199, column: 68, scope: !395)
!405 = !DILocation(line: 199, column: 21, scope: !396)
!406 = !DILocation(line: 201, column: 21, scope: !407)
!407 = distinct !DILexicalBlock(scope: !395, file: !3, line: 200, column: 17)
!408 = !DILocation(line: 203, column: 21, scope: !407)
!409 = !DILocation(line: 203, column: 26, scope: !407)
!410 = !DILocation(line: 203, column: 35, scope: !407)
!411 = !DILocation(line: 204, column: 17, scope: !407)
!412 = !DILocation(line: 205, column: 24, scope: !396)
!413 = !DILocation(line: 205, column: 17, scope: !396)
!414 = !DILocation(line: 206, column: 13, scope: !396)
!415 = !DILocation(line: 207, column: 9, scope: !388)
!416 = !DILocation(line: 209, column: 20, scope: !368)
!417 = !DILocation(line: 210, column: 18, scope: !368)
!418 = !DILocation(line: 210, column: 5, scope: !368)
!419 = !DILocation(line: 211, column: 1, scope: !368)
!420 = distinct !DISubprogram(name: "goodG2BSink", scope: !3, file: !3, line: 214, type: !62, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!421 = !DILocalVariable(name: "data", arg: 1, scope: !420, file: !3, line: 214, type: !55)
!422 = !DILocation(line: 214, column: 25, scope: !420)
!423 = !DILocation(line: 216, column: 8, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !3, line: 216, column: 8)
!425 = !DILocation(line: 216, column: 8, scope: !420)
!426 = !DILocalVariable(name: "i", scope: !427, file: !3, line: 219, type: !7)
!427 = distinct !DILexicalBlock(scope: !428, file: !3, line: 218, column: 9)
!428 = distinct !DILexicalBlock(scope: !424, file: !3, line: 217, column: 5)
!429 = !DILocation(line: 219, column: 17, scope: !427)
!430 = !DILocalVariable(name: "n", scope: !427, file: !3, line: 219, type: !7)
!431 = !DILocation(line: 219, column: 20, scope: !427)
!432 = !DILocalVariable(name: "intVariable", scope: !427, file: !3, line: 219, type: !7)
!433 = !DILocation(line: 219, column: 23, scope: !427)
!434 = !DILocation(line: 220, column: 24, scope: !435)
!435 = distinct !DILexicalBlock(scope: !427, file: !3, line: 220, column: 17)
!436 = !DILocation(line: 220, column: 17, scope: !435)
!437 = !DILocation(line: 220, column: 40, scope: !435)
!438 = !DILocation(line: 220, column: 17, scope: !427)
!439 = !DILocation(line: 223, column: 29, scope: !440)
!440 = distinct !DILexicalBlock(scope: !435, file: !3, line: 221, column: 13)
!441 = !DILocation(line: 224, column: 24, scope: !442)
!442 = distinct !DILexicalBlock(scope: !440, file: !3, line: 224, column: 17)
!443 = !DILocation(line: 224, column: 22, scope: !442)
!444 = !DILocation(line: 224, column: 29, scope: !445)
!445 = distinct !DILexicalBlock(scope: !442, file: !3, line: 224, column: 17)
!446 = !DILocation(line: 224, column: 33, scope: !445)
!447 = !DILocation(line: 224, column: 31, scope: !445)
!448 = !DILocation(line: 224, column: 17, scope: !442)
!449 = !DILocation(line: 227, column: 32, scope: !450)
!450 = distinct !DILexicalBlock(scope: !445, file: !3, line: 225, column: 17)
!451 = !DILocation(line: 228, column: 17, scope: !450)
!452 = !DILocation(line: 224, column: 37, scope: !445)
!453 = !DILocation(line: 224, column: 17, scope: !445)
!454 = distinct !{!454, !448, !455, !99}
!455 = !DILocation(line: 228, column: 17, scope: !442)
!456 = !DILocation(line: 229, column: 30, scope: !440)
!457 = !DILocation(line: 229, column: 17, scope: !440)
!458 = !DILocation(line: 230, column: 13, scope: !440)
!459 = !DILocation(line: 232, column: 5, scope: !428)
!460 = !DILocation(line: 233, column: 1, scope: !420)
!461 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 235, type: !106, scopeLine: 236, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!462 = !DILocalVariable(name: "data", scope: !461, file: !3, line: 237, type: !55)
!463 = !DILocation(line: 237, column: 12, scope: !461)
!464 = !DILocalVariable(name: "dataBuffer", scope: !461, file: !3, line: 238, type: !111)
!465 = !DILocation(line: 238, column: 10, scope: !461)
!466 = !DILocation(line: 239, column: 12, scope: !461)
!467 = !DILocation(line: 239, column: 10, scope: !461)
!468 = !DILocation(line: 241, column: 12, scope: !461)
!469 = !DILocation(line: 241, column: 5, scope: !461)
!470 = !DILocation(line: 242, column: 19, scope: !461)
!471 = !DILocation(line: 243, column: 17, scope: !461)
!472 = !DILocation(line: 243, column: 5, scope: !461)
!473 = !DILocation(line: 244, column: 1, scope: !461)
!474 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_21_good", scope: !3, file: !3, line: 246, type: !106, scopeLine: 247, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!475 = !DILocation(line: 248, column: 5, scope: !474)
!476 = !DILocation(line: 249, column: 5, scope: !474)
!477 = !DILocation(line: 250, column: 5, scope: !474)
!478 = !DILocation(line: 251, column: 1, scope: !474)
!479 = distinct !DISubprogram(name: "printLine", scope: !18, file: !18, line: 11, type: !62, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!480 = !DILocalVariable(name: "line", arg: 1, scope: !479, file: !18, line: 11, type: !55)
!481 = !DILocation(line: 11, column: 25, scope: !479)
!482 = !DILocation(line: 13, column: 1, scope: !479)
!483 = !DILocation(line: 14, column: 8, scope: !484)
!484 = distinct !DILexicalBlock(scope: !479, file: !18, line: 14, column: 8)
!485 = !DILocation(line: 14, column: 13, scope: !484)
!486 = !DILocation(line: 14, column: 8, scope: !479)
!487 = !DILocation(line: 16, column: 24, scope: !488)
!488 = distinct !DILexicalBlock(scope: !484, file: !18, line: 15, column: 5)
!489 = !DILocation(line: 16, column: 9, scope: !488)
!490 = !DILocation(line: 17, column: 5, scope: !488)
!491 = !DILocation(line: 18, column: 5, scope: !479)
!492 = !DILocation(line: 19, column: 1, scope: !479)
!493 = distinct !DISubprogram(name: "printSinkLine", scope: !18, file: !18, line: 20, type: !62, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!494 = !DILocalVariable(name: "line", arg: 1, scope: !493, file: !18, line: 20, type: !55)
!495 = !DILocation(line: 20, column: 29, scope: !493)
!496 = !DILocation(line: 22, column: 8, scope: !497)
!497 = distinct !DILexicalBlock(scope: !493, file: !18, line: 22, column: 8)
!498 = !DILocation(line: 22, column: 13, scope: !497)
!499 = !DILocation(line: 22, column: 8, scope: !493)
!500 = !DILocation(line: 24, column: 24, scope: !501)
!501 = distinct !DILexicalBlock(scope: !497, file: !18, line: 23, column: 5)
!502 = !DILocation(line: 24, column: 9, scope: !501)
!503 = !DILocation(line: 25, column: 5, scope: !501)
!504 = !DILocation(line: 26, column: 1, scope: !493)
!505 = distinct !DISubprogram(name: "printWLine", scope: !18, file: !18, line: 27, type: !506, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !120, line: 74, baseType: !7)
!510 = !DILocalVariable(name: "line", arg: 1, scope: !505, file: !18, line: 27, type: !508)
!511 = !DILocation(line: 27, column: 29, scope: !505)
!512 = !DILocation(line: 29, column: 8, scope: !513)
!513 = distinct !DILexicalBlock(scope: !505, file: !18, line: 29, column: 8)
!514 = !DILocation(line: 29, column: 13, scope: !513)
!515 = !DILocation(line: 29, column: 8, scope: !505)
!516 = !DILocation(line: 31, column: 27, scope: !517)
!517 = distinct !DILexicalBlock(scope: !513, file: !18, line: 30, column: 5)
!518 = !DILocation(line: 31, column: 9, scope: !517)
!519 = !DILocation(line: 32, column: 5, scope: !517)
!520 = !DILocation(line: 33, column: 1, scope: !505)
!521 = distinct !DISubprogram(name: "printIntLine", scope: !18, file: !18, line: 35, type: !522, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!522 = !DISubroutineType(types: !523)
!523 = !{null, !7}
!524 = !DILocalVariable(name: "intNumber", arg: 1, scope: !521, file: !18, line: 35, type: !7)
!525 = !DILocation(line: 35, column: 24, scope: !521)
!526 = !DILocation(line: 37, column: 20, scope: !521)
!527 = !DILocation(line: 37, column: 5, scope: !521)
!528 = !DILocation(line: 38, column: 1, scope: !521)
!529 = distinct !DISubprogram(name: "printShortLine", scope: !18, file: !18, line: 40, type: !530, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532}
!532 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!533 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !529, file: !18, line: 40, type: !532)
!534 = !DILocation(line: 40, column: 28, scope: !529)
!535 = !DILocation(line: 42, column: 21, scope: !529)
!536 = !DILocation(line: 42, column: 5, scope: !529)
!537 = !DILocation(line: 43, column: 1, scope: !529)
!538 = distinct !DISubprogram(name: "printFloatLine", scope: !18, file: !18, line: 45, type: !539, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!539 = !DISubroutineType(types: !540)
!540 = !{null, !541}
!541 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!542 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !538, file: !18, line: 45, type: !541)
!543 = !DILocation(line: 45, column: 28, scope: !538)
!544 = !DILocation(line: 47, column: 20, scope: !538)
!545 = !DILocation(line: 47, column: 5, scope: !538)
!546 = !DILocation(line: 48, column: 1, scope: !538)
!547 = distinct !DISubprogram(name: "printLongLine", scope: !18, file: !18, line: 50, type: !548, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!548 = !DISubroutineType(types: !549)
!549 = !{null, !154}
!550 = !DILocalVariable(name: "longNumber", arg: 1, scope: !547, file: !18, line: 50, type: !154)
!551 = !DILocation(line: 50, column: 26, scope: !547)
!552 = !DILocation(line: 52, column: 21, scope: !547)
!553 = !DILocation(line: 52, column: 5, scope: !547)
!554 = !DILocation(line: 53, column: 1, scope: !547)
!555 = distinct !DISubprogram(name: "printLongLongLine", scope: !18, file: !18, line: 55, type: !556, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!556 = !DISubroutineType(types: !557)
!557 = !{null, !558}
!558 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !559, line: 27, baseType: !560)
!559 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !153, line: 44, baseType: !154)
!561 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !555, file: !18, line: 55, type: !558)
!562 = !DILocation(line: 55, column: 33, scope: !555)
!563 = !DILocation(line: 57, column: 29, scope: !555)
!564 = !DILocation(line: 57, column: 5, scope: !555)
!565 = !DILocation(line: 58, column: 1, scope: !555)
!566 = distinct !DISubprogram(name: "printSizeTLine", scope: !18, file: !18, line: 60, type: !567, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !119}
!569 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !566, file: !18, line: 60, type: !119)
!570 = !DILocation(line: 60, column: 29, scope: !566)
!571 = !DILocation(line: 62, column: 21, scope: !566)
!572 = !DILocation(line: 62, column: 5, scope: !566)
!573 = !DILocation(line: 63, column: 1, scope: !566)
!574 = distinct !DISubprogram(name: "printHexCharLine", scope: !18, file: !18, line: 65, type: !575, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!575 = !DISubroutineType(types: !576)
!576 = !{null, !56}
!577 = !DILocalVariable(name: "charHex", arg: 1, scope: !574, file: !18, line: 65, type: !56)
!578 = !DILocation(line: 65, column: 29, scope: !574)
!579 = !DILocation(line: 67, column: 22, scope: !574)
!580 = !DILocation(line: 67, column: 5, scope: !574)
!581 = !DILocation(line: 68, column: 1, scope: !574)
!582 = distinct !DISubprogram(name: "printWcharLine", scope: !18, file: !18, line: 70, type: !583, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!583 = !DISubroutineType(types: !584)
!584 = !{null, !509}
!585 = !DILocalVariable(name: "wideChar", arg: 1, scope: !582, file: !18, line: 70, type: !509)
!586 = !DILocation(line: 70, column: 29, scope: !582)
!587 = !DILocalVariable(name: "s", scope: !582, file: !18, line: 74, type: !588)
!588 = !DICompositeType(tag: DW_TAG_array_type, baseType: !509, size: 64, elements: !589)
!589 = !{!590}
!590 = !DISubrange(count: 2)
!591 = !DILocation(line: 74, column: 13, scope: !582)
!592 = !DILocation(line: 75, column: 16, scope: !582)
!593 = !DILocation(line: 75, column: 9, scope: !582)
!594 = !DILocation(line: 75, column: 14, scope: !582)
!595 = !DILocation(line: 76, column: 9, scope: !582)
!596 = !DILocation(line: 76, column: 14, scope: !582)
!597 = !DILocation(line: 77, column: 21, scope: !582)
!598 = !DILocation(line: 77, column: 5, scope: !582)
!599 = !DILocation(line: 78, column: 1, scope: !582)
!600 = distinct !DISubprogram(name: "printUnsignedLine", scope: !18, file: !18, line: 80, type: !601, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !22}
!603 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !600, file: !18, line: 80, type: !22)
!604 = !DILocation(line: 80, column: 33, scope: !600)
!605 = !DILocation(line: 82, column: 20, scope: !600)
!606 = !DILocation(line: 82, column: 5, scope: !600)
!607 = !DILocation(line: 83, column: 1, scope: !600)
!608 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !18, file: !18, line: 85, type: !609, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!609 = !DISubroutineType(types: !610)
!610 = !{null, !38}
!611 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !608, file: !18, line: 85, type: !38)
!612 = !DILocation(line: 85, column: 45, scope: !608)
!613 = !DILocation(line: 87, column: 22, scope: !608)
!614 = !DILocation(line: 87, column: 5, scope: !608)
!615 = !DILocation(line: 88, column: 1, scope: !608)
!616 = distinct !DISubprogram(name: "printDoubleLine", scope: !18, file: !18, line: 90, type: !617, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!617 = !DISubroutineType(types: !618)
!618 = !{null, !619}
!619 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!620 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !616, file: !18, line: 90, type: !619)
!621 = !DILocation(line: 90, column: 29, scope: !616)
!622 = !DILocation(line: 92, column: 20, scope: !616)
!623 = !DILocation(line: 92, column: 5, scope: !616)
!624 = !DILocation(line: 93, column: 1, scope: !616)
!625 = distinct !DISubprogram(name: "printStructLine", scope: !18, file: !18, line: 95, type: !626, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !628}
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !629, size: 64)
!629 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !630, line: 100, baseType: !631)
!630 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_092/source_code")
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !630, line: 96, size: 64, elements: !632)
!632 = !{!633, !634}
!633 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !631, file: !630, line: 98, baseType: !7, size: 32)
!634 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !631, file: !630, line: 99, baseType: !7, size: 32, offset: 32)
!635 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !625, file: !18, line: 95, type: !628)
!636 = !DILocation(line: 95, column: 40, scope: !625)
!637 = !DILocation(line: 97, column: 26, scope: !625)
!638 = !DILocation(line: 97, column: 47, scope: !625)
!639 = !DILocation(line: 97, column: 55, scope: !625)
!640 = !DILocation(line: 97, column: 76, scope: !625)
!641 = !DILocation(line: 97, column: 5, scope: !625)
!642 = !DILocation(line: 98, column: 1, scope: !625)
!643 = distinct !DISubprogram(name: "printBytesLine", scope: !18, file: !18, line: 100, type: !644, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!644 = !DISubroutineType(types: !645)
!645 = !{null, !646, !119}
!646 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!647 = !DILocalVariable(name: "bytes", arg: 1, scope: !643, file: !18, line: 100, type: !646)
!648 = !DILocation(line: 100, column: 38, scope: !643)
!649 = !DILocalVariable(name: "numBytes", arg: 2, scope: !643, file: !18, line: 100, type: !119)
!650 = !DILocation(line: 100, column: 52, scope: !643)
!651 = !DILocalVariable(name: "i", scope: !643, file: !18, line: 102, type: !119)
!652 = !DILocation(line: 102, column: 12, scope: !643)
!653 = !DILocation(line: 103, column: 12, scope: !654)
!654 = distinct !DILexicalBlock(scope: !643, file: !18, line: 103, column: 5)
!655 = !DILocation(line: 103, column: 10, scope: !654)
!656 = !DILocation(line: 103, column: 17, scope: !657)
!657 = distinct !DILexicalBlock(scope: !654, file: !18, line: 103, column: 5)
!658 = !DILocation(line: 103, column: 21, scope: !657)
!659 = !DILocation(line: 103, column: 19, scope: !657)
!660 = !DILocation(line: 103, column: 5, scope: !654)
!661 = !DILocation(line: 105, column: 24, scope: !662)
!662 = distinct !DILexicalBlock(scope: !657, file: !18, line: 104, column: 5)
!663 = !DILocation(line: 105, column: 30, scope: !662)
!664 = !DILocation(line: 105, column: 9, scope: !662)
!665 = !DILocation(line: 106, column: 5, scope: !662)
!666 = !DILocation(line: 103, column: 31, scope: !657)
!667 = !DILocation(line: 103, column: 5, scope: !657)
!668 = distinct !{!668, !660, !669, !99}
!669 = !DILocation(line: 106, column: 5, scope: !654)
!670 = !DILocation(line: 107, column: 5, scope: !643)
!671 = !DILocation(line: 108, column: 1, scope: !643)
!672 = distinct !DISubprogram(name: "decodeHexChars", scope: !18, file: !18, line: 113, type: !673, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!673 = !DISubroutineType(types: !674)
!674 = !{!119, !646, !119, !55}
!675 = !DILocalVariable(name: "bytes", arg: 1, scope: !672, file: !18, line: 113, type: !646)
!676 = !DILocation(line: 113, column: 39, scope: !672)
!677 = !DILocalVariable(name: "numBytes", arg: 2, scope: !672, file: !18, line: 113, type: !119)
!678 = !DILocation(line: 113, column: 53, scope: !672)
!679 = !DILocalVariable(name: "hex", arg: 3, scope: !672, file: !18, line: 113, type: !55)
!680 = !DILocation(line: 113, column: 71, scope: !672)
!681 = !DILocalVariable(name: "numWritten", scope: !672, file: !18, line: 115, type: !119)
!682 = !DILocation(line: 115, column: 12, scope: !672)
!683 = !DILocation(line: 121, column: 5, scope: !672)
!684 = !DILocation(line: 121, column: 12, scope: !672)
!685 = !DILocation(line: 121, column: 25, scope: !672)
!686 = !DILocation(line: 121, column: 23, scope: !672)
!687 = !DILocation(line: 121, column: 34, scope: !672)
!688 = !DILocation(line: 121, column: 37, scope: !672)
!689 = !DILocation(line: 121, column: 67, scope: !672)
!690 = !DILocation(line: 121, column: 70, scope: !672)
!691 = !DILocation(line: 0, scope: !672)
!692 = !DILocalVariable(name: "byte", scope: !693, file: !18, line: 123, type: !7)
!693 = distinct !DILexicalBlock(scope: !672, file: !18, line: 122, column: 5)
