; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_21.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_21.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@badStatic = dso_local global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@goodB2G1Static = dso_local global i32 0, align 4, !dbg !9
@goodB2G2Static = dso_local global i32 0, align 4, !dbg !11
@goodG2BStatic = dso_local global i32 0, align 4, !dbg !13
@.str.4 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.5 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badSink(i8* %data) #0 !dbg !19 {
entry:
  %data.addr = alloca i8*, align 8
  %i = alloca i32, align 4

!3 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_21.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_092/source_code")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !11, !13}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "goodB2G1Static", scope: !2, file: !3, line: 94, type: !7, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "goodB2G2Static", scope: !2, file: !3, line: 95, type: !7, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "goodG2BStatic", scope: !2, file: !3, line: 96, type: !7, isLocal: false, isDefinition: true)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 12.0.0"}
!19 = distinct !DISubprogram(name: "badSink", scope: !3, file: !3, line: 38, type: !20, scopeLine: 39, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DILocalVariable(name: "data", arg: 1, scope: !19, file: !3, line: 38, type: !22)
!25 = !DILocation(line: 38, column: 21, scope: !19)
!26 = !DILocation(line: 40, column: 8, scope: !27)
!27 = distinct !DILexicalBlock(scope: !19, file: !3, line: 40, column: 8)
!28 = !DILocation(line: 40, column: 8, scope: !19)
!29 = !DILocalVariable(name: "i", scope: !30, file: !3, line: 43, type: !7)
!30 = distinct !DILexicalBlock(scope: !31, file: !3, line: 42, column: 9)
!31 = distinct !DILexicalBlock(scope: !27, file: !3, line: 41, column: 5)
!32 = !DILocation(line: 43, column: 17, scope: !30)
!33 = !DILocalVariable(name: "n", scope: !30, file: !3, line: 43, type: !7)
!34 = !DILocation(line: 43, column: 20, scope: !30)
!35 = !DILocalVariable(name: "intVariable", scope: !30, file: !3, line: 43, type: !7)
!36 = !DILocation(line: 43, column: 23, scope: !30)
!37 = !DILocation(line: 44, column: 24, scope: !38)
!38 = distinct !DILexicalBlock(scope: !30, file: !3, line: 44, column: 17)
!39 = !DILocation(line: 44, column: 17, scope: !38)
!40 = !DILocation(line: 44, column: 40, scope: !38)
!41 = !DILocation(line: 44, column: 17, scope: !30)
!42 = !DILocation(line: 47, column: 29, scope: !43)
!43 = distinct !DILexicalBlock(scope: !38, file: !3, line: 45, column: 13)
!44 = !DILocation(line: 48, column: 24, scope: !45)
!45 = distinct !DILexicalBlock(scope: !43, file: !3, line: 48, column: 17)
!46 = !DILocation(line: 48, column: 22, scope: !45)
!47 = !DILocation(line: 48, column: 29, scope: !48)
!48 = distinct !DILexicalBlock(scope: !45, file: !3, line: 48, column: 17)
!49 = !DILocation(line: 48, column: 33, scope: !48)
!50 = !DILocation(line: 48, column: 31, scope: !48)
!51 = !DILocation(line: 48, column: 17, scope: !45)
!52 = !DILocation(line: 51, column: 32, scope: !53)
!53 = distinct !DILexicalBlock(scope: !48, file: !3, line: 49, column: 17)
!54 = !DILocation(line: 52, column: 17, scope: !53)
!55 = !DILocation(line: 48, column: 37, scope: !48)
!56 = !DILocation(line: 48, column: 17, scope: !48)
!57 = distinct !{!57, !51, !58, !59}
!58 = !DILocation(line: 52, column: 17, scope: !45)
!59 = !{!"llvm.loop.mustprogress"}
!60 = !DILocation(line: 53, column: 30, scope: !43)
!61 = !DILocation(line: 53, column: 17, scope: !43)
!62 = !DILocation(line: 54, column: 13, scope: !43)
!63 = !DILocation(line: 56, column: 5, scope: !31)
!64 = !DILocation(line: 57, column: 1, scope: !19)
!65 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_21_bad", scope: !3, file: !3, line: 59, type: !66, scopeLine: 60, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!66 = !DISubroutineType(types: !67)
!67 = !{null}
!68 = !DILocalVariable(name: "data", scope: !65, file: !3, line: 61, type: !22)
!69 = !DILocation(line: 61, column: 12, scope: !65)
!70 = !DILocalVariable(name: "dataBuffer", scope: !65, file: !3, line: 62, type: !71)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 800, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 100)
!74 = !DILocation(line: 62, column: 10, scope: !65)
!75 = !DILocation(line: 63, column: 12, scope: !65)
!76 = !DILocation(line: 63, column: 10, scope: !65)
!77 = !DILocalVariable(name: "dataLen", scope: !78, file: !3, line: 66, type: !79)
!78 = distinct !DILexicalBlock(scope: !65, file: !3, line: 64, column: 5)
!79 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !80, line: 46, baseType: !81)
!80 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!81 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!82 = !DILocation(line: 66, column: 16, scope: !78)
!83 = !DILocation(line: 66, column: 33, scope: !78)
!84 = !DILocation(line: 66, column: 26, scope: !78)
!85 = !DILocalVariable(name: "pFile", scope: !78, file: !3, line: 67, type: !86)
!86 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !87, size: 64)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !88, line: 7, baseType: !89)
!88 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!89 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !90, line: 49, size: 1728, elements: !91)
!90 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!91 = !{!92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !107, !109, !110, !111, !115, !117, !119, !123, !126, !128, !131, !134, !135, !136, !137, !138}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !89, file: !90, line: 51, baseType: !7, size: 32)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !89, file: !90, line: 54, baseType: !22, size: 64, offset: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !89, file: !90, line: 55, baseType: !22, size: 64, offset: 128)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !89, file: !90, line: 56, baseType: !22, size: 64, offset: 192)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !89, file: !90, line: 57, baseType: !22, size: 64, offset: 256)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !89, file: !90, line: 58, baseType: !22, size: 64, offset: 320)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !89, file: !90, line: 59, baseType: !22, size: 64, offset: 384)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !89, file: !90, line: 60, baseType: !22, size: 64, offset: 448)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !89, file: !90, line: 61, baseType: !22, size: 64, offset: 512)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !89, file: !90, line: 64, baseType: !22, size: 64, offset: 576)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !89, file: !90, line: 65, baseType: !22, size: 64, offset: 640)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !89, file: !90, line: 66, baseType: !22, size: 64, offset: 704)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !89, file: !90, line: 68, baseType: !105, size: 64, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !90, line: 36, flags: DIFlagFwdDecl)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !89, file: !90, line: 70, baseType: !108, size: 64, offset: 832)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !89, file: !90, line: 72, baseType: !7, size: 32, offset: 896)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !89, file: !90, line: 73, baseType: !7, size: 32, offset: 928)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !89, file: !90, line: 74, baseType: !112, size: 64, offset: 960)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !113, line: 152, baseType: !114)
!113 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!114 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !89, file: !90, line: 77, baseType: !116, size: 16, offset: 1024)
!116 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !89, file: !90, line: 78, baseType: !118, size: 8, offset: 1040)
!118 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !89, file: !90, line: 79, baseType: !120, size: 8, offset: 1048)
!120 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !121)
!121 = !{!122}
!122 = !DISubrange(count: 1)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !89, file: !90, line: 81, baseType: !124, size: 64, offset: 1088)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !90, line: 43, baseType: null)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !89, file: !90, line: 89, baseType: !127, size: 64, offset: 1152)
!127 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !113, line: 153, baseType: !114)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !89, file: !90, line: 91, baseType: !129, size: 64, offset: 1216)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !90, line: 37, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !89, file: !90, line: 92, baseType: !132, size: 64, offset: 1280)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !133, size: 64)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !90, line: 38, flags: DIFlagFwdDecl)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !89, file: !90, line: 93, baseType: !108, size: 64, offset: 1344)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !89, file: !90, line: 94, baseType: !6, size: 64, offset: 1408)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !89, file: !90, line: 95, baseType: !79, size: 64, offset: 1472)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !89, file: !90, line: 96, baseType: !7, size: 32, offset: 1536)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !89, file: !90, line: 98, baseType: !139, size: 160, offset: 1568)
!139 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !140)
!140 = !{!141}
!141 = !DISubrange(count: 20)
!142 = !DILocation(line: 67, column: 16, scope: !78)
!143 = !DILocation(line: 69, column: 17, scope: !144)
!144 = distinct !DILexicalBlock(scope: !78, file: !3, line: 69, column: 13)
!145 = !DILocation(line: 69, column: 16, scope: !144)
!146 = !DILocation(line: 69, column: 25, scope: !144)
!147 = !DILocation(line: 69, column: 13, scope: !78)
!148 = !DILocation(line: 71, column: 21, scope: !149)
!149 = distinct !DILexicalBlock(scope: !144, file: !3, line: 70, column: 9)
!150 = !DILocation(line: 71, column: 19, scope: !149)
!151 = !DILocation(line: 72, column: 17, scope: !152)
!152 = distinct !DILexicalBlock(scope: !149, file: !3, line: 72, column: 17)
!153 = !DILocation(line: 72, column: 23, scope: !152)
!154 = !DILocation(line: 72, column: 17, scope: !149)
!155 = !DILocation(line: 75, column: 27, scope: !156)
!156 = distinct !DILexicalBlock(scope: !157, file: !3, line: 75, column: 21)
!157 = distinct !DILexicalBlock(scope: !152, file: !3, line: 73, column: 13)
!158 = !DILocation(line: 75, column: 32, scope: !156)
!159 = !DILocation(line: 75, column: 31, scope: !156)
!160 = !DILocation(line: 75, column: 51, scope: !156)
!161 = !DILocation(line: 75, column: 50, scope: !156)
!162 = !DILocation(line: 75, column: 41, scope: !156)
!163 = !DILocation(line: 75, column: 61, scope: !156)
!164 = !DILocation(line: 75, column: 21, scope: !156)
!165 = !DILocation(line: 75, column: 68, scope: !156)
!166 = !DILocation(line: 75, column: 21, scope: !157)
!167 = !DILocation(line: 77, column: 21, scope: !168)
!168 = distinct !DILexicalBlock(scope: !156, file: !3, line: 76, column: 17)
!169 = !DILocation(line: 79, column: 21, scope: !168)
!170 = !DILocation(line: 79, column: 26, scope: !168)
!171 = !DILocation(line: 79, column: 35, scope: !168)
!172 = !DILocation(line: 80, column: 17, scope: !168)
!173 = !DILocation(line: 81, column: 24, scope: !157)
!174 = !DILocation(line: 81, column: 17, scope: !157)
!175 = !DILocation(line: 82, column: 13, scope: !157)
!176 = !DILocation(line: 83, column: 9, scope: !149)
!177 = !DILocation(line: 85, column: 15, scope: !65)
!178 = !DILocation(line: 86, column: 13, scope: !65)
!179 = !DILocation(line: 86, column: 5, scope: !65)
!180 = !DILocation(line: 87, column: 1, scope: !65)
!181 = distinct !DISubprogram(name: "goodB2G1Sink", scope: !3, file: !3, line: 99, type: !20, scopeLine: 100, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!182 = !DILocalVariable(name: "data", arg: 1, scope: !181, file: !3, line: 99, type: !22)
!183 = !DILocation(line: 99, column: 26, scope: !181)
!184 = !DILocation(line: 101, column: 8, scope: !185)
!185 = distinct !DILexicalBlock(scope: !181, file: !3, line: 101, column: 8)
!186 = !DILocation(line: 101, column: 8, scope: !181)
!187 = !DILocation(line: 104, column: 9, scope: !188)
!188 = distinct !DILexicalBlock(scope: !185, file: !3, line: 102, column: 5)
!189 = !DILocation(line: 105, column: 5, scope: !188)
!190 = !DILocalVariable(name: "i", scope: !191, file: !3, line: 109, type: !7)
!191 = distinct !DILexicalBlock(scope: !192, file: !3, line: 108, column: 9)
!192 = distinct !DILexicalBlock(scope: !185, file: !3, line: 107, column: 5)
!193 = !DILocation(line: 109, column: 17, scope: !191)
!194 = !DILocalVariable(name: "n", scope: !191, file: !3, line: 109, type: !7)
!195 = !DILocation(line: 109, column: 20, scope: !191)
!196 = !DILocalVariable(name: "intVariable", scope: !191, file: !3, line: 109, type: !7)
!197 = !DILocation(line: 109, column: 23, scope: !191)
!198 = !DILocation(line: 110, column: 24, scope: !199)
!199 = distinct !DILexicalBlock(scope: !191, file: !3, line: 110, column: 17)
!200 = !DILocation(line: 110, column: 17, scope: !199)
!201 = !DILocation(line: 110, column: 40, scope: !199)
