; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_074/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_01.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_074/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_01_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 42, type: !66)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 40, column: 5)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DILocation(line: 42, column: 16, scope: !65)
!70 = !DILocation(line: 42, column: 33, scope: !65)
!71 = !DILocation(line: 42, column: 26, scope: !65)
!72 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 43, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !102, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 51, baseType: !23, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 54, baseType: !42, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 55, baseType: !42, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 56, baseType: !42, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 57, baseType: !42, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 58, baseType: !42, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 59, baseType: !42, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 60, baseType: !42, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 61, baseType: !42, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 64, baseType: !42, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 65, baseType: !42, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 66, baseType: !42, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 72, baseType: !23, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 73, baseType: !23, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 77, baseType: !24, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 153, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !76, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !77, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !76, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !77, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !76, file: !77, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !76, file: !77, line: 94, baseType: !22, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 95, baseType: !66, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 96, baseType: !23, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocation(line: 43, column: 16, scope: !65)
!129 = !DILocation(line: 45, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !65, file: !45, line: 45, column: 13)
!131 = !DILocation(line: 45, column: 16, scope: !130)
!132 = !DILocation(line: 45, column: 25, scope: !130)
!133 = !DILocation(line: 45, column: 13, scope: !65)
!134 = !DILocation(line: 47, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !45, line: 46, column: 9)
!136 = !DILocation(line: 47, column: 19, scope: !135)
!137 = !DILocation(line: 48, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !45, line: 48, column: 17)
!139 = !DILocation(line: 48, column: 23, scope: !138)
!140 = !DILocation(line: 48, column: 17, scope: !135)
!141 = !DILocation(line: 51, column: 27, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !45, line: 51, column: 21)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 49, column: 13)
!144 = !DILocation(line: 51, column: 32, scope: !142)
!145 = !DILocation(line: 51, column: 31, scope: !142)
!146 = !DILocation(line: 51, column: 51, scope: !142)
!147 = !DILocation(line: 51, column: 50, scope: !142)
!148 = !DILocation(line: 51, column: 41, scope: !142)
!149 = !DILocation(line: 51, column: 61, scope: !142)
!150 = !DILocation(line: 51, column: 21, scope: !142)
!151 = !DILocation(line: 51, column: 68, scope: !142)
!152 = !DILocation(line: 51, column: 21, scope: !143)
!153 = !DILocation(line: 53, column: 21, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !45, line: 52, column: 17)
!155 = !DILocation(line: 55, column: 21, scope: !154)
!156 = !DILocation(line: 55, column: 26, scope: !154)
!157 = !DILocation(line: 55, column: 35, scope: !154)
!158 = !DILocation(line: 56, column: 17, scope: !154)
!159 = !DILocation(line: 57, column: 24, scope: !143)
!160 = !DILocation(line: 57, column: 17, scope: !143)
!161 = !DILocation(line: 58, column: 13, scope: !143)
!162 = !DILocation(line: 59, column: 9, scope: !135)
!163 = !DILocalVariable(name: "i", scope: !164, file: !45, line: 62, type: !23)
!164 = distinct !DILexicalBlock(scope: !52, file: !45, line: 61, column: 5)
!165 = !DILocation(line: 62, column: 13, scope: !164)
!166 = !DILocalVariable(name: "n", scope: !164, file: !45, line: 62, type: !23)
!167 = !DILocation(line: 62, column: 16, scope: !164)
!168 = !DILocalVariable(name: "intVariable", scope: !164, file: !45, line: 62, type: !23)
!169 = !DILocation(line: 62, column: 19, scope: !164)
!170 = !DILocation(line: 63, column: 20, scope: !171)
!171 = distinct !DILexicalBlock(scope: !164, file: !45, line: 63, column: 13)
!172 = !DILocation(line: 63, column: 13, scope: !171)
!173 = !DILocation(line: 63, column: 36, scope: !171)
!174 = !DILocation(line: 63, column: 13, scope: !164)
!175 = !DILocation(line: 66, column: 25, scope: !176)
!176 = distinct !DILexicalBlock(scope: !171, file: !45, line: 64, column: 9)
!177 = !DILocation(line: 67, column: 20, scope: !178)
!178 = distinct !DILexicalBlock(scope: !176, file: !45, line: 67, column: 13)
!179 = !DILocation(line: 67, column: 18, scope: !178)
!180 = !DILocation(line: 67, column: 25, scope: !181)
!181 = distinct !DILexicalBlock(scope: !178, file: !45, line: 67, column: 13)
!182 = !DILocation(line: 67, column: 29, scope: !181)
!183 = !DILocation(line: 67, column: 27, scope: !181)
!184 = !DILocation(line: 67, column: 13, scope: !178)
!185 = !DILocation(line: 70, column: 28, scope: !186)
!186 = distinct !DILexicalBlock(scope: !181, file: !45, line: 68, column: 13)
!187 = !DILocation(line: 71, column: 13, scope: !186)
!188 = !DILocation(line: 67, column: 33, scope: !181)
!189 = !DILocation(line: 67, column: 13, scope: !181)
!190 = distinct !{!190, !184, !191, !192}
!191 = !DILocation(line: 71, column: 13, scope: !178)
!192 = !{!"llvm.loop.mustprogress"}
!193 = !DILocation(line: 72, column: 26, scope: !176)
!194 = !DILocation(line: 72, column: 13, scope: !176)
!195 = !DILocation(line: 73, column: 9, scope: !176)
!196 = !DILocation(line: 75, column: 1, scope: !52)
!197 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 82, type: !53, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!198 = !DILocalVariable(name: "data", scope: !197, file: !45, line: 84, type: !42)
!199 = !DILocation(line: 84, column: 12, scope: !197)
!200 = !DILocalVariable(name: "dataBuffer", scope: !197, file: !45, line: 85, type: !58)
!201 = !DILocation(line: 85, column: 10, scope: !197)
!202 = !DILocation(line: 86, column: 12, scope: !197)
!203 = !DILocation(line: 86, column: 10, scope: !197)
!204 = !DILocation(line: 88, column: 12, scope: !197)
!205 = !DILocation(line: 88, column: 5, scope: !197)
!206 = !DILocalVariable(name: "i", scope: !207, file: !45, line: 90, type: !23)
!207 = distinct !DILexicalBlock(scope: !197, file: !45, line: 89, column: 5)
!208 = !DILocation(line: 90, column: 13, scope: !207)
!209 = !DILocalVariable(name: "n", scope: !207, file: !45, line: 90, type: !23)
!210 = !DILocation(line: 90, column: 16, scope: !207)
!211 = !DILocalVariable(name: "intVariable", scope: !207, file: !45, line: 90, type: !23)
!212 = !DILocation(line: 90, column: 19, scope: !207)
!213 = !DILocation(line: 91, column: 20, scope: !214)
!214 = distinct !DILexicalBlock(scope: !207, file: !45, line: 91, column: 13)
!215 = !DILocation(line: 91, column: 13, scope: !214)
!216 = !DILocation(line: 91, column: 36, scope: !214)
!217 = !DILocation(line: 91, column: 13, scope: !207)
!218 = !DILocation(line: 94, column: 25, scope: !219)
!219 = distinct !DILexicalBlock(scope: !214, file: !45, line: 92, column: 9)
!220 = !DILocation(line: 95, column: 20, scope: !221)
!221 = distinct !DILexicalBlock(scope: !219, file: !45, line: 95, column: 13)
!222 = !DILocation(line: 95, column: 18, scope: !221)
!223 = !DILocation(line: 95, column: 25, scope: !224)
!224 = distinct !DILexicalBlock(scope: !221, file: !45, line: 95, column: 13)
!225 = !DILocation(line: 95, column: 29, scope: !224)
!226 = !DILocation(line: 95, column: 27, scope: !224)
!227 = !DILocation(line: 95, column: 13, scope: !221)
!228 = !DILocation(line: 98, column: 28, scope: !229)
!229 = distinct !DILexicalBlock(scope: !224, file: !45, line: 96, column: 13)
!230 = !DILocation(line: 99, column: 13, scope: !229)
!231 = !DILocation(line: 95, column: 33, scope: !224)
!232 = !DILocation(line: 95, column: 13, scope: !224)
!233 = distinct !{!233, !227, !234, !192}
!234 = !DILocation(line: 99, column: 13, scope: !221)
!235 = !DILocation(line: 100, column: 26, scope: !219)
!236 = !DILocation(line: 100, column: 13, scope: !219)
!237 = !DILocation(line: 101, column: 9, scope: !219)
!238 = !DILocation(line: 103, column: 1, scope: !197)
!239 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 106, type: !53, scopeLine: 107, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!240 = !DILocalVariable(name: "data", scope: !239, file: !45, line: 108, type: !42)
!241 = !DILocation(line: 108, column: 12, scope: !239)
!242 = !DILocalVariable(name: "dataBuffer", scope: !239, file: !45, line: 109, type: !58)
!243 = !DILocation(line: 109, column: 10, scope: !239)
!244 = !DILocation(line: 110, column: 12, scope: !239)
!245 = !DILocation(line: 110, column: 10, scope: !239)
!246 = !DILocalVariable(name: "dataLen", scope: !247, file: !45, line: 113, type: !66)
!247 = distinct !DILexicalBlock(scope: !239, file: !45, line: 111, column: 5)
!248 = !DILocation(line: 113, column: 16, scope: !247)
!249 = !DILocation(line: 113, column: 33, scope: !247)
!250 = !DILocation(line: 113, column: 26, scope: !247)
!251 = !DILocalVariable(name: "pFile", scope: !247, file: !45, line: 114, type: !73)
!252 = !DILocation(line: 114, column: 16, scope: !247)
!253 = !DILocation(line: 116, column: 17, scope: !254)
!254 = distinct !DILexicalBlock(scope: !247, file: !45, line: 116, column: 13)
!255 = !DILocation(line: 116, column: 16, scope: !254)
!256 = !DILocation(line: 116, column: 25, scope: !254)
!257 = !DILocation(line: 116, column: 13, scope: !247)
!258 = !DILocation(line: 118, column: 21, scope: !259)
!259 = distinct !DILexicalBlock(scope: !254, file: !45, line: 117, column: 9)
!260 = !DILocation(line: 118, column: 19, scope: !259)
!261 = !DILocation(line: 119, column: 17, scope: !262)
!262 = distinct !DILexicalBlock(scope: !259, file: !45, line: 119, column: 17)
!263 = !DILocation(line: 119, column: 23, scope: !262)
!264 = !DILocation(line: 119, column: 17, scope: !259)
!265 = !DILocation(line: 122, column: 27, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !45, line: 122, column: 21)
!267 = distinct !DILexicalBlock(scope: !262, file: !45, line: 120, column: 13)
!268 = !DILocation(line: 122, column: 32, scope: !266)
!269 = !DILocation(line: 122, column: 31, scope: !266)
!270 = !DILocation(line: 122, column: 51, scope: !266)
!271 = !DILocation(line: 122, column: 50, scope: !266)
!272 = !DILocation(line: 122, column: 41, scope: !266)
!273 = !DILocation(line: 122, column: 61, scope: !266)
!274 = !DILocation(line: 122, column: 21, scope: !266)
!275 = !DILocation(line: 122, column: 68, scope: !266)
!276 = !DILocation(line: 122, column: 21, scope: !267)
!277 = !DILocation(line: 124, column: 21, scope: !278)
!278 = distinct !DILexicalBlock(scope: !266, file: !45, line: 123, column: 17)
!279 = !DILocation(line: 126, column: 21, scope: !278)
!280 = !DILocation(line: 126, column: 26, scope: !278)
!281 = !DILocation(line: 126, column: 35, scope: !278)
!282 = !DILocation(line: 127, column: 17, scope: !278)
!283 = !DILocation(line: 128, column: 24, scope: !267)
!284 = !DILocation(line: 128, column: 17, scope: !267)
!285 = !DILocation(line: 129, column: 13, scope: !267)
!286 = !DILocation(line: 130, column: 9, scope: !259)
!287 = !DILocalVariable(name: "i", scope: !288, file: !45, line: 133, type: !23)
!288 = distinct !DILexicalBlock(scope: !239, file: !45, line: 132, column: 5)
!289 = !DILocation(line: 133, column: 13, scope: !288)
!290 = !DILocalVariable(name: "n", scope: !288, file: !45, line: 133, type: !23)
!291 = !DILocation(line: 133, column: 16, scope: !288)
!292 = !DILocalVariable(name: "intVariable", scope: !288, file: !45, line: 133, type: !23)
!293 = !DILocation(line: 133, column: 19, scope: !288)
!294 = !DILocation(line: 134, column: 20, scope: !295)
!295 = distinct !DILexicalBlock(scope: !288, file: !45, line: 134, column: 13)
!296 = !DILocation(line: 134, column: 13, scope: !295)
!297 = !DILocation(line: 134, column: 36, scope: !295)
!298 = !DILocation(line: 134, column: 13, scope: !288)
!299 = !DILocation(line: 137, column: 17, scope: !300)
!300 = distinct !DILexicalBlock(scope: !301, file: !45, line: 137, column: 17)
!301 = distinct !DILexicalBlock(scope: !295, file: !45, line: 135, column: 9)
!302 = !DILocation(line: 137, column: 19, scope: !300)
!303 = !DILocation(line: 137, column: 17, scope: !301)
!304 = !DILocation(line: 139, column: 29, scope: !305)
!305 = distinct !DILexicalBlock(scope: !300, file: !45, line: 138, column: 13)
!306 = !DILocation(line: 140, column: 24, scope: !307)
!307 = distinct !DILexicalBlock(scope: !305, file: !45, line: 140, column: 17)
!308 = !DILocation(line: 140, column: 22, scope: !307)
!309 = !DILocation(line: 140, column: 29, scope: !310)
!310 = distinct !DILexicalBlock(scope: !307, file: !45, line: 140, column: 17)
!311 = !DILocation(line: 140, column: 33, scope: !310)
!312 = !DILocation(line: 140, column: 31, scope: !310)
!313 = !DILocation(line: 140, column: 17, scope: !307)
!314 = !DILocation(line: 143, column: 32, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !45, line: 141, column: 17)
!316 = !DILocation(line: 144, column: 17, scope: !315)
!317 = !DILocation(line: 140, column: 37, scope: !310)
!318 = !DILocation(line: 140, column: 17, scope: !310)
!319 = distinct !{!319, !313, !320, !192}
!320 = !DILocation(line: 144, column: 17, scope: !307)
!321 = !DILocation(line: 145, column: 30, scope: !305)
!322 = !DILocation(line: 145, column: 17, scope: !305)
!323 = !DILocation(line: 146, column: 13, scope: !305)
!324 = !DILocation(line: 147, column: 9, scope: !301)
!325 = !DILocation(line: 149, column: 1, scope: !239)
!326 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_01_good", scope: !45, file: !45, line: 151, type: !53, scopeLine: 152, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!327 = !DILocation(line: 153, column: 5, scope: !326)
!328 = !DILocation(line: 154, column: 5, scope: !326)
!329 = !DILocation(line: 155, column: 1, scope: !326)
!330 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !331, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!331 = !DISubroutineType(types: !332)
!332 = !{null, !42}
!333 = !DILocalVariable(name: "line", arg: 1, scope: !330, file: !3, line: 11, type: !42)
!334 = !DILocation(line: 11, column: 25, scope: !330)
!335 = !DILocation(line: 13, column: 1, scope: !330)
!336 = !DILocation(line: 14, column: 8, scope: !337)
!337 = distinct !DILexicalBlock(scope: !330, file: !3, line: 14, column: 8)
!338 = !DILocation(line: 14, column: 13, scope: !337)
!339 = !DILocation(line: 14, column: 8, scope: !330)
!340 = !DILocation(line: 16, column: 24, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !3, line: 15, column: 5)
!342 = !DILocation(line: 16, column: 9, scope: !341)
!343 = !DILocation(line: 17, column: 5, scope: !341)
!344 = !DILocation(line: 18, column: 5, scope: !330)
!345 = !DILocation(line: 19, column: 1, scope: !330)
!346 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !331, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!347 = !DILocalVariable(name: "line", arg: 1, scope: !346, file: !3, line: 20, type: !42)
!348 = !DILocation(line: 20, column: 29, scope: !346)
!349 = !DILocation(line: 22, column: 8, scope: !350)
!350 = distinct !DILexicalBlock(scope: !346, file: !3, line: 22, column: 8)
!351 = !DILocation(line: 22, column: 13, scope: !350)
!352 = !DILocation(line: 22, column: 8, scope: !346)
!353 = !DILocation(line: 24, column: 24, scope: !354)
!354 = distinct !DILexicalBlock(scope: !350, file: !3, line: 23, column: 5)
!355 = !DILocation(line: 24, column: 9, scope: !354)
!356 = !DILocation(line: 25, column: 5, scope: !354)
!357 = !DILocation(line: 26, column: 1, scope: !346)
!358 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !359, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !361}
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !362, size: 64)
!362 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !67, line: 74, baseType: !23)
!363 = !DILocalVariable(name: "line", arg: 1, scope: !358, file: !3, line: 27, type: !361)
!364 = !DILocation(line: 27, column: 29, scope: !358)
!365 = !DILocation(line: 29, column: 8, scope: !366)
!366 = distinct !DILexicalBlock(scope: !358, file: !3, line: 29, column: 8)
!367 = !DILocation(line: 29, column: 13, scope: !366)
!368 = !DILocation(line: 29, column: 8, scope: !358)
!369 = !DILocation(line: 31, column: 27, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !3, line: 30, column: 5)
!371 = !DILocation(line: 31, column: 9, scope: !370)
!372 = !DILocation(line: 32, column: 5, scope: !370)
!373 = !DILocation(line: 33, column: 1, scope: !358)
!374 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !375, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !23}
!377 = !DILocalVariable(name: "intNumber", arg: 1, scope: !374, file: !3, line: 35, type: !23)
!378 = !DILocation(line: 35, column: 24, scope: !374)
!379 = !DILocation(line: 37, column: 20, scope: !374)
!380 = !DILocation(line: 37, column: 5, scope: !374)
!381 = !DILocation(line: 38, column: 1, scope: !374)
!382 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !383, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !385}
!385 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!386 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !382, file: !3, line: 40, type: !385)
!387 = !DILocation(line: 40, column: 28, scope: !382)
!388 = !DILocation(line: 42, column: 21, scope: !382)
!389 = !DILocation(line: 42, column: 5, scope: !382)
!390 = !DILocation(line: 43, column: 1, scope: !382)
!391 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !392, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394}
!394 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!395 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !391, file: !3, line: 45, type: !394)
!396 = !DILocation(line: 45, column: 28, scope: !391)
!397 = !DILocation(line: 47, column: 20, scope: !391)
!398 = !DILocation(line: 47, column: 5, scope: !391)
!399 = !DILocation(line: 48, column: 1, scope: !391)
!400 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !401, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !101}
!403 = !DILocalVariable(name: "longNumber", arg: 1, scope: !400, file: !3, line: 50, type: !101)
!404 = !DILocation(line: 50, column: 26, scope: !400)
!405 = !DILocation(line: 52, column: 21, scope: !400)
!406 = !DILocation(line: 52, column: 5, scope: !400)
!407 = !DILocation(line: 53, column: 1, scope: !400)
!408 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !409, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !411}
!411 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !412, line: 27, baseType: !413)
!412 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !100, line: 44, baseType: !101)
!414 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !408, file: !3, line: 55, type: !411)
!415 = !DILocation(line: 55, column: 33, scope: !408)
!416 = !DILocation(line: 57, column: 29, scope: !408)
!417 = !DILocation(line: 57, column: 5, scope: !408)
!418 = !DILocation(line: 58, column: 1, scope: !408)
!419 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !420, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !66}
!422 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !419, file: !3, line: 60, type: !66)
!423 = !DILocation(line: 60, column: 29, scope: !419)
!424 = !DILocation(line: 62, column: 21, scope: !419)
!425 = !DILocation(line: 62, column: 5, scope: !419)
!426 = !DILocation(line: 63, column: 1, scope: !419)
!427 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !428, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !43}
!430 = !DILocalVariable(name: "charHex", arg: 1, scope: !427, file: !3, line: 65, type: !43)
!431 = !DILocation(line: 65, column: 29, scope: !427)
!432 = !DILocation(line: 67, column: 22, scope: !427)
!433 = !DILocation(line: 67, column: 5, scope: !427)
!434 = !DILocation(line: 68, column: 1, scope: !427)
!435 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !436, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !362}
!438 = !DILocalVariable(name: "wideChar", arg: 1, scope: !435, file: !3, line: 70, type: !362)
!439 = !DILocation(line: 70, column: 29, scope: !435)
!440 = !DILocalVariable(name: "s", scope: !435, file: !3, line: 74, type: !441)
!441 = !DICompositeType(tag: DW_TAG_array_type, baseType: !362, size: 64, elements: !442)
!442 = !{!443}
!443 = !DISubrange(count: 2)
!444 = !DILocation(line: 74, column: 13, scope: !435)
!445 = !DILocation(line: 75, column: 16, scope: !435)
!446 = !DILocation(line: 75, column: 9, scope: !435)
!447 = !DILocation(line: 75, column: 14, scope: !435)
!448 = !DILocation(line: 76, column: 9, scope: !435)
!449 = !DILocation(line: 76, column: 14, scope: !435)
!450 = !DILocation(line: 77, column: 21, scope: !435)
!451 = !DILocation(line: 77, column: 5, scope: !435)
!452 = !DILocation(line: 78, column: 1, scope: !435)
!453 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !454, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !7}
!456 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !453, file: !3, line: 80, type: !7)
!457 = !DILocation(line: 80, column: 33, scope: !453)
!458 = !DILocation(line: 82, column: 20, scope: !453)
!459 = !DILocation(line: 82, column: 5, scope: !453)
!460 = !DILocation(line: 83, column: 1, scope: !453)
!461 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !462, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !25}
!464 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !461, file: !3, line: 85, type: !25)
!465 = !DILocation(line: 85, column: 45, scope: !461)
!466 = !DILocation(line: 87, column: 22, scope: !461)
!467 = !DILocation(line: 87, column: 5, scope: !461)
!468 = !DILocation(line: 88, column: 1, scope: !461)
!469 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !470, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !472}
!472 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!473 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !469, file: !3, line: 90, type: !472)
!474 = !DILocation(line: 90, column: 29, scope: !469)
!475 = !DILocation(line: 92, column: 20, scope: !469)
!476 = !DILocation(line: 92, column: 5, scope: !469)
!477 = !DILocation(line: 93, column: 1, scope: !469)
!478 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !479, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!479 = !DISubroutineType(types: !480)
!480 = !{null, !481}
!481 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !482, size: 64)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !483, line: 100, baseType: !484)
!483 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_074/source_code")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !483, line: 96, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !484, file: !483, line: 98, baseType: !23, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !484, file: !483, line: 99, baseType: !23, size: 32, offset: 32)
!488 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !478, file: !3, line: 95, type: !481)
!489 = !DILocation(line: 95, column: 40, scope: !478)
!490 = !DILocation(line: 97, column: 26, scope: !478)
!491 = !DILocation(line: 97, column: 47, scope: !478)
!492 = !DILocation(line: 97, column: 55, scope: !478)
!493 = !DILocation(line: 97, column: 76, scope: !478)
!494 = !DILocation(line: 97, column: 5, scope: !478)
!495 = !DILocation(line: 98, column: 1, scope: !478)
!496 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !497, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499, !66}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!500 = !DILocalVariable(name: "bytes", arg: 1, scope: !496, file: !3, line: 100, type: !499)
!501 = !DILocation(line: 100, column: 38, scope: !496)
!502 = !DILocalVariable(name: "numBytes", arg: 2, scope: !496, file: !3, line: 100, type: !66)
!503 = !DILocation(line: 100, column: 52, scope: !496)
!504 = !DILocalVariable(name: "i", scope: !496, file: !3, line: 102, type: !66)
!505 = !DILocation(line: 102, column: 12, scope: !496)
!506 = !DILocation(line: 103, column: 12, scope: !507)
!507 = distinct !DILexicalBlock(scope: !496, file: !3, line: 103, column: 5)
!508 = !DILocation(line: 103, column: 10, scope: !507)
!509 = !DILocation(line: 103, column: 17, scope: !510)
!510 = distinct !DILexicalBlock(scope: !507, file: !3, line: 103, column: 5)
!511 = !DILocation(line: 103, column: 21, scope: !510)
!512 = !DILocation(line: 103, column: 19, scope: !510)
!513 = !DILocation(line: 103, column: 5, scope: !507)
!514 = !DILocation(line: 105, column: 24, scope: !515)
!515 = distinct !DILexicalBlock(scope: !510, file: !3, line: 104, column: 5)
!516 = !DILocation(line: 105, column: 30, scope: !515)
!517 = !DILocation(line: 105, column: 9, scope: !515)
!518 = !DILocation(line: 106, column: 5, scope: !515)
!519 = !DILocation(line: 103, column: 31, scope: !510)
!520 = !DILocation(line: 103, column: 5, scope: !510)
!521 = distinct !{!521, !513, !522, !192}
!522 = !DILocation(line: 106, column: 5, scope: !507)
!523 = !DILocation(line: 107, column: 5, scope: !496)
!524 = !DILocation(line: 108, column: 1, scope: !496)
!525 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !526, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!526 = !DISubroutineType(types: !527)
!527 = !{!66, !499, !66, !42}
!528 = !DILocalVariable(name: "bytes", arg: 1, scope: !525, file: !3, line: 113, type: !499)
!529 = !DILocation(line: 113, column: 39, scope: !525)
!530 = !DILocalVariable(name: "numBytes", arg: 2, scope: !525, file: !3, line: 113, type: !66)
!531 = !DILocation(line: 113, column: 53, scope: !525)
!532 = !DILocalVariable(name: "hex", arg: 3, scope: !525, file: !3, line: 113, type: !42)
!533 = !DILocation(line: 113, column: 71, scope: !525)
!534 = !DILocalVariable(name: "numWritten", scope: !525, file: !3, line: 115, type: !66)
!535 = !DILocation(line: 115, column: 12, scope: !525)
!536 = !DILocation(line: 121, column: 5, scope: !525)
!537 = !DILocation(line: 121, column: 12, scope: !525)
!538 = !DILocation(line: 121, column: 25, scope: !525)
!539 = !DILocation(line: 121, column: 23, scope: !525)
!540 = !DILocation(line: 121, column: 34, scope: !525)
!541 = !DILocation(line: 121, column: 37, scope: !525)
!542 = !DILocation(line: 121, column: 67, scope: !525)
!543 = !DILocation(line: 121, column: 70, scope: !525)
!544 = !DILocation(line: 0, scope: !525)
!545 = !DILocalVariable(name: "byte", scope: !546, file: !3, line: 123, type: !23)
!546 = distinct !DILexicalBlock(scope: !525, file: !3, line: 122, column: 5)
!547 = !DILocation(line: 123, column: 13, scope: !546)
