; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_17.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_090/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_17_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "i", scope: !52, file: !45, line: 37, type: !23)
!56 = !DILocation(line: 37, column: 9, scope: !52)
!57 = !DILocalVariable(name: "j", scope: !52, file: !45, line: 37, type: !23)
!58 = !DILocation(line: 37, column: 11, scope: !52)
!59 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 38, type: !42)
!60 = !DILocation(line: 38, column: 12, scope: !52)
!61 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 39, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DILocation(line: 39, column: 10, scope: !52)
!66 = !DILocation(line: 40, column: 12, scope: !52)
!67 = !DILocation(line: 40, column: 10, scope: !52)
!68 = !DILocation(line: 41, column: 11, scope: !69)
!69 = distinct !DILexicalBlock(scope: !52, file: !45, line: 41, column: 5)
!70 = !DILocation(line: 41, column: 9, scope: !69)
!71 = !DILocation(line: 41, column: 16, scope: !72)
!72 = distinct !DILexicalBlock(scope: !69, file: !45, line: 41, column: 5)
!73 = !DILocation(line: 41, column: 18, scope: !72)
!74 = !DILocation(line: 41, column: 5, scope: !69)
!75 = !DILocalVariable(name: "dataLen", scope: !76, file: !45, line: 45, type: !78)
!76 = distinct !DILexicalBlock(scope: !77, file: !45, line: 43, column: 9)
!77 = distinct !DILexicalBlock(scope: !72, file: !45, line: 42, column: 5)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DILocation(line: 45, column: 20, scope: !76)
!82 = !DILocation(line: 45, column: 37, scope: !76)
!83 = !DILocation(line: 45, column: 30, scope: !76)
!84 = !DILocalVariable(name: "pFile", scope: !76, file: !45, line: 46, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !106, !108, !109, !110, !114, !115, !117, !121, !124, !126, !129, !132, !133, !134, !135, !136}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !88, file: !89, line: 51, baseType: !23, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !88, file: !89, line: 54, baseType: !42, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !88, file: !89, line: 55, baseType: !42, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !88, file: !89, line: 56, baseType: !42, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !88, file: !89, line: 57, baseType: !42, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !88, file: !89, line: 58, baseType: !42, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !88, file: !89, line: 59, baseType: !42, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !88, file: !89, line: 60, baseType: !42, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !88, file: !89, line: 61, baseType: !42, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !88, file: !89, line: 64, baseType: !42, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !88, file: !89, line: 65, baseType: !42, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !88, file: !89, line: 66, baseType: !42, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !88, file: !89, line: 68, baseType: !104, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !89, line: 36, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !88, file: !89, line: 70, baseType: !107, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !88, file: !89, line: 72, baseType: !23, size: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !88, file: !89, line: 73, baseType: !23, size: 32, offset: 928)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !88, file: !89, line: 74, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !112, line: 152, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!113 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !88, file: !89, line: 77, baseType: !24, size: 16, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !88, file: !89, line: 78, baseType: !116, size: 8, offset: 1040)
!116 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !88, file: !89, line: 79, baseType: !118, size: 8, offset: 1048)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !88, file: !89, line: 81, baseType: !122, size: 64, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !89, line: 43, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !88, file: !89, line: 89, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !112, line: 153, baseType: !113)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !88, file: !89, line: 91, baseType: !127, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !89, line: 37, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !88, file: !89, line: 92, baseType: !130, size: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !89, line: 38, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !88, file: !89, line: 93, baseType: !107, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !88, file: !89, line: 94, baseType: !22, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !88, file: !89, line: 95, baseType: !78, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !88, file: !89, line: 96, baseType: !23, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !88, file: !89, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocation(line: 46, column: 20, scope: !76)
!141 = !DILocation(line: 48, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !76, file: !45, line: 48, column: 17)
!143 = !DILocation(line: 48, column: 20, scope: !142)
!144 = !DILocation(line: 48, column: 29, scope: !142)
!145 = !DILocation(line: 48, column: 17, scope: !76)
!146 = !DILocation(line: 50, column: 25, scope: !147)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 49, column: 13)
!148 = !DILocation(line: 50, column: 23, scope: !147)
!149 = !DILocation(line: 51, column: 21, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !45, line: 51, column: 21)
!151 = !DILocation(line: 51, column: 27, scope: !150)
!152 = !DILocation(line: 51, column: 21, scope: !147)
!153 = !DILocation(line: 54, column: 31, scope: !154)
!154 = distinct !DILexicalBlock(scope: !155, file: !45, line: 54, column: 25)
!155 = distinct !DILexicalBlock(scope: !150, file: !45, line: 52, column: 17)
!156 = !DILocation(line: 54, column: 36, scope: !154)
!157 = !DILocation(line: 54, column: 35, scope: !154)
!158 = !DILocation(line: 54, column: 55, scope: !154)
!159 = !DILocation(line: 54, column: 54, scope: !154)
!160 = !DILocation(line: 54, column: 45, scope: !154)
!161 = !DILocation(line: 54, column: 65, scope: !154)
!162 = !DILocation(line: 54, column: 25, scope: !154)
!163 = !DILocation(line: 54, column: 72, scope: !154)
!164 = !DILocation(line: 54, column: 25, scope: !155)
!165 = !DILocation(line: 56, column: 25, scope: !166)
!166 = distinct !DILexicalBlock(scope: !154, file: !45, line: 55, column: 21)
!167 = !DILocation(line: 58, column: 25, scope: !166)
!168 = !DILocation(line: 58, column: 30, scope: !166)
!169 = !DILocation(line: 58, column: 39, scope: !166)
!170 = !DILocation(line: 59, column: 21, scope: !166)
!171 = !DILocation(line: 60, column: 28, scope: !155)
!172 = !DILocation(line: 60, column: 21, scope: !155)
!173 = !DILocation(line: 61, column: 17, scope: !155)
!174 = !DILocation(line: 62, column: 13, scope: !147)
!175 = !DILocation(line: 64, column: 5, scope: !77)
!176 = !DILocation(line: 41, column: 24, scope: !72)
!177 = !DILocation(line: 41, column: 5, scope: !72)
!178 = distinct !{!178, !74, !179, !180}
!179 = !DILocation(line: 64, column: 5, scope: !69)
!180 = !{!"llvm.loop.mustprogress"}
!181 = !DILocation(line: 65, column: 11, scope: !182)
!182 = distinct !DILexicalBlock(scope: !52, file: !45, line: 65, column: 5)
!183 = !DILocation(line: 65, column: 9, scope: !182)
!184 = !DILocation(line: 65, column: 16, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !45, line: 65, column: 5)
!186 = !DILocation(line: 65, column: 18, scope: !185)
!187 = !DILocation(line: 65, column: 5, scope: !182)
!188 = !DILocalVariable(name: "i", scope: !189, file: !45, line: 68, type: !23)
!189 = distinct !DILexicalBlock(scope: !190, file: !45, line: 67, column: 9)
!190 = distinct !DILexicalBlock(scope: !185, file: !45, line: 66, column: 5)
!191 = !DILocation(line: 68, column: 17, scope: !189)
!192 = !DILocalVariable(name: "n", scope: !189, file: !45, line: 68, type: !23)
!193 = !DILocation(line: 68, column: 20, scope: !189)
!194 = !DILocalVariable(name: "intVariable", scope: !189, file: !45, line: 68, type: !23)
!195 = !DILocation(line: 68, column: 23, scope: !189)
!196 = !DILocation(line: 69, column: 24, scope: !197)
!197 = distinct !DILexicalBlock(scope: !189, file: !45, line: 69, column: 17)
!198 = !DILocation(line: 69, column: 17, scope: !197)
!199 = !DILocation(line: 69, column: 40, scope: !197)
!200 = !DILocation(line: 69, column: 17, scope: !189)
!201 = !DILocation(line: 72, column: 29, scope: !202)
!202 = distinct !DILexicalBlock(scope: !197, file: !45, line: 70, column: 13)
!203 = !DILocation(line: 73, column: 24, scope: !204)
!204 = distinct !DILexicalBlock(scope: !202, file: !45, line: 73, column: 17)
!205 = !DILocation(line: 73, column: 22, scope: !204)
!206 = !DILocation(line: 73, column: 29, scope: !207)
!207 = distinct !DILexicalBlock(scope: !204, file: !45, line: 73, column: 17)
!208 = !DILocation(line: 73, column: 33, scope: !207)
!209 = !DILocation(line: 73, column: 31, scope: !207)
!210 = !DILocation(line: 73, column: 17, scope: !204)
!211 = !DILocation(line: 76, column: 32, scope: !212)
!212 = distinct !DILexicalBlock(scope: !207, file: !45, line: 74, column: 17)
!213 = !DILocation(line: 77, column: 17, scope: !212)
!214 = !DILocation(line: 73, column: 37, scope: !207)
!215 = !DILocation(line: 73, column: 17, scope: !207)
!216 = distinct !{!216, !210, !217, !180}
!217 = !DILocation(line: 77, column: 17, scope: !204)
!218 = !DILocation(line: 78, column: 30, scope: !202)
!219 = !DILocation(line: 78, column: 17, scope: !202)
!220 = !DILocation(line: 79, column: 13, scope: !202)
!221 = !DILocation(line: 81, column: 5, scope: !190)
!222 = !DILocation(line: 65, column: 24, scope: !185)
!223 = !DILocation(line: 65, column: 5, scope: !185)
!224 = distinct !{!224, !187, !225, !180}
!225 = !DILocation(line: 81, column: 5, scope: !182)
!226 = !DILocation(line: 82, column: 1, scope: !52)
!227 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 89, type: !53, scopeLine: 90, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!228 = !DILocalVariable(name: "i", scope: !227, file: !45, line: 91, type: !23)
!229 = !DILocation(line: 91, column: 9, scope: !227)
!230 = !DILocalVariable(name: "k", scope: !227, file: !45, line: 91, type: !23)
!231 = !DILocation(line: 91, column: 11, scope: !227)
!232 = !DILocalVariable(name: "data", scope: !227, file: !45, line: 92, type: !42)
!233 = !DILocation(line: 92, column: 12, scope: !227)
!234 = !DILocalVariable(name: "dataBuffer", scope: !227, file: !45, line: 93, type: !62)
!235 = !DILocation(line: 93, column: 10, scope: !227)
!236 = !DILocation(line: 94, column: 12, scope: !227)
!237 = !DILocation(line: 94, column: 10, scope: !227)
!238 = !DILocation(line: 95, column: 11, scope: !239)
!239 = distinct !DILexicalBlock(scope: !227, file: !45, line: 95, column: 5)
!240 = !DILocation(line: 95, column: 9, scope: !239)
!241 = !DILocation(line: 95, column: 16, scope: !242)
!242 = distinct !DILexicalBlock(scope: !239, file: !45, line: 95, column: 5)
!243 = !DILocation(line: 95, column: 18, scope: !242)
!244 = !DILocation(line: 95, column: 5, scope: !239)
!245 = !DILocalVariable(name: "dataLen", scope: !246, file: !45, line: 99, type: !78)
!246 = distinct !DILexicalBlock(scope: !247, file: !45, line: 97, column: 9)
!247 = distinct !DILexicalBlock(scope: !242, file: !45, line: 96, column: 5)
!248 = !DILocation(line: 99, column: 20, scope: !246)
!249 = !DILocation(line: 99, column: 37, scope: !246)
!250 = !DILocation(line: 99, column: 30, scope: !246)
!251 = !DILocalVariable(name: "pFile", scope: !246, file: !45, line: 100, type: !85)
!252 = !DILocation(line: 100, column: 20, scope: !246)
!253 = !DILocation(line: 102, column: 21, scope: !254)
!254 = distinct !DILexicalBlock(scope: !246, file: !45, line: 102, column: 17)
!255 = !DILocation(line: 102, column: 20, scope: !254)
!256 = !DILocation(line: 102, column: 29, scope: !254)
!257 = !DILocation(line: 102, column: 17, scope: !246)
!258 = !DILocation(line: 104, column: 25, scope: !259)
!259 = distinct !DILexicalBlock(scope: !254, file: !45, line: 103, column: 13)
!260 = !DILocation(line: 104, column: 23, scope: !259)
!261 = !DILocation(line: 105, column: 21, scope: !262)
!262 = distinct !DILexicalBlock(scope: !259, file: !45, line: 105, column: 21)
!263 = !DILocation(line: 105, column: 27, scope: !262)
!264 = !DILocation(line: 105, column: 21, scope: !259)
!265 = !DILocation(line: 108, column: 31, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !45, line: 108, column: 25)
!267 = distinct !DILexicalBlock(scope: !262, file: !45, line: 106, column: 17)
!268 = !DILocation(line: 108, column: 36, scope: !266)
!269 = !DILocation(line: 108, column: 35, scope: !266)
!270 = !DILocation(line: 108, column: 55, scope: !266)
!271 = !DILocation(line: 108, column: 54, scope: !266)
!272 = !DILocation(line: 108, column: 45, scope: !266)
!273 = !DILocation(line: 108, column: 65, scope: !266)
!274 = !DILocation(line: 108, column: 25, scope: !266)
!275 = !DILocation(line: 108, column: 72, scope: !266)
!276 = !DILocation(line: 108, column: 25, scope: !267)
!277 = !DILocation(line: 110, column: 25, scope: !278)
!278 = distinct !DILexicalBlock(scope: !266, file: !45, line: 109, column: 21)
!279 = !DILocation(line: 112, column: 25, scope: !278)
!280 = !DILocation(line: 112, column: 30, scope: !278)
!281 = !DILocation(line: 112, column: 39, scope: !278)
!282 = !DILocation(line: 113, column: 21, scope: !278)
!283 = !DILocation(line: 114, column: 28, scope: !267)
!284 = !DILocation(line: 114, column: 21, scope: !267)
!285 = !DILocation(line: 115, column: 17, scope: !267)
!286 = !DILocation(line: 116, column: 13, scope: !259)
!287 = !DILocation(line: 118, column: 5, scope: !247)
!288 = !DILocation(line: 95, column: 24, scope: !242)
!289 = !DILocation(line: 95, column: 5, scope: !242)
!290 = distinct !{!290, !244, !291, !180}
!291 = !DILocation(line: 118, column: 5, scope: !239)
!292 = !DILocation(line: 119, column: 11, scope: !293)
!293 = distinct !DILexicalBlock(scope: !227, file: !45, line: 119, column: 5)
!294 = !DILocation(line: 119, column: 9, scope: !293)
!295 = !DILocation(line: 119, column: 16, scope: !296)
!296 = distinct !DILexicalBlock(scope: !293, file: !45, line: 119, column: 5)
!297 = !DILocation(line: 119, column: 18, scope: !296)
!298 = !DILocation(line: 119, column: 5, scope: !293)
!299 = !DILocalVariable(name: "i", scope: !300, file: !45, line: 122, type: !23)
!300 = distinct !DILexicalBlock(scope: !301, file: !45, line: 121, column: 9)
!301 = distinct !DILexicalBlock(scope: !296, file: !45, line: 120, column: 5)
!302 = !DILocation(line: 122, column: 17, scope: !300)
!303 = !DILocalVariable(name: "n", scope: !300, file: !45, line: 122, type: !23)
!304 = !DILocation(line: 122, column: 20, scope: !300)
!305 = !DILocalVariable(name: "intVariable", scope: !300, file: !45, line: 122, type: !23)
!306 = !DILocation(line: 122, column: 23, scope: !300)
!307 = !DILocation(line: 123, column: 24, scope: !308)
!308 = distinct !DILexicalBlock(scope: !300, file: !45, line: 123, column: 17)
!309 = !DILocation(line: 123, column: 17, scope: !308)
!310 = !DILocation(line: 123, column: 40, scope: !308)
!311 = !DILocation(line: 123, column: 17, scope: !300)
!312 = !DILocation(line: 126, column: 21, scope: !313)
!313 = distinct !DILexicalBlock(scope: !314, file: !45, line: 126, column: 21)
!314 = distinct !DILexicalBlock(scope: !308, file: !45, line: 124, column: 13)
!315 = !DILocation(line: 126, column: 23, scope: !313)
!316 = !DILocation(line: 126, column: 21, scope: !314)
!317 = !DILocation(line: 128, column: 33, scope: !318)
!318 = distinct !DILexicalBlock(scope: !313, file: !45, line: 127, column: 17)
!319 = !DILocation(line: 129, column: 28, scope: !320)
!320 = distinct !DILexicalBlock(scope: !318, file: !45, line: 129, column: 21)
!321 = !DILocation(line: 129, column: 26, scope: !320)
!322 = !DILocation(line: 129, column: 33, scope: !323)
!323 = distinct !DILexicalBlock(scope: !320, file: !45, line: 129, column: 21)
!324 = !DILocation(line: 129, column: 37, scope: !323)
!325 = !DILocation(line: 129, column: 35, scope: !323)
!326 = !DILocation(line: 129, column: 21, scope: !320)
!327 = !DILocation(line: 132, column: 36, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !45, line: 130, column: 21)
!329 = !DILocation(line: 133, column: 21, scope: !328)
!330 = !DILocation(line: 129, column: 41, scope: !323)
!331 = !DILocation(line: 129, column: 21, scope: !323)
!332 = distinct !{!332, !326, !333, !180}
!333 = !DILocation(line: 133, column: 21, scope: !320)
!334 = !DILocation(line: 134, column: 34, scope: !318)
!335 = !DILocation(line: 134, column: 21, scope: !318)
!336 = !DILocation(line: 135, column: 17, scope: !318)
!337 = !DILocation(line: 136, column: 13, scope: !314)
!338 = !DILocation(line: 138, column: 5, scope: !301)
!339 = !DILocation(line: 119, column: 24, scope: !296)
!340 = !DILocation(line: 119, column: 5, scope: !296)
!341 = distinct !{!341, !298, !342, !180}
!342 = !DILocation(line: 138, column: 5, scope: !293)
!343 = !DILocation(line: 139, column: 1, scope: !227)
!344 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 142, type: !53, scopeLine: 143, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!345 = !DILocalVariable(name: "h", scope: !344, file: !45, line: 144, type: !23)
!346 = !DILocation(line: 144, column: 9, scope: !344)
!347 = !DILocalVariable(name: "j", scope: !344, file: !45, line: 144, type: !23)
!348 = !DILocation(line: 144, column: 11, scope: !344)
!349 = !DILocalVariable(name: "data", scope: !344, file: !45, line: 145, type: !42)
!350 = !DILocation(line: 145, column: 12, scope: !344)
!351 = !DILocalVariable(name: "dataBuffer", scope: !344, file: !45, line: 146, type: !62)
!352 = !DILocation(line: 146, column: 10, scope: !344)
!353 = !DILocation(line: 147, column: 12, scope: !344)
!354 = !DILocation(line: 147, column: 10, scope: !344)
!355 = !DILocation(line: 148, column: 11, scope: !356)
!356 = distinct !DILexicalBlock(scope: !344, file: !45, line: 148, column: 5)
!357 = !DILocation(line: 148, column: 9, scope: !356)
!358 = !DILocation(line: 148, column: 16, scope: !359)
!359 = distinct !DILexicalBlock(scope: !356, file: !45, line: 148, column: 5)
!360 = !DILocation(line: 148, column: 18, scope: !359)
!361 = !DILocation(line: 148, column: 5, scope: !356)
!362 = !DILocation(line: 151, column: 16, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !45, line: 149, column: 5)
!364 = !DILocation(line: 151, column: 9, scope: !363)
!365 = !DILocation(line: 152, column: 5, scope: !363)
!366 = !DILocation(line: 148, column: 24, scope: !359)
!367 = !DILocation(line: 148, column: 5, scope: !359)
!368 = distinct !{!368, !361, !369, !180}
!369 = !DILocation(line: 152, column: 5, scope: !356)
!370 = !DILocation(line: 153, column: 11, scope: !371)
!371 = distinct !DILexicalBlock(scope: !344, file: !45, line: 153, column: 5)
!372 = !DILocation(line: 153, column: 9, scope: !371)
!373 = !DILocation(line: 153, column: 16, scope: !374)
!374 = distinct !DILexicalBlock(scope: !371, file: !45, line: 153, column: 5)
!375 = !DILocation(line: 153, column: 18, scope: !374)
!376 = !DILocation(line: 153, column: 5, scope: !371)
!377 = !DILocalVariable(name: "i", scope: !378, file: !45, line: 156, type: !23)
!378 = distinct !DILexicalBlock(scope: !379, file: !45, line: 155, column: 9)
!379 = distinct !DILexicalBlock(scope: !374, file: !45, line: 154, column: 5)
!380 = !DILocation(line: 156, column: 17, scope: !378)
!381 = !DILocalVariable(name: "n", scope: !378, file: !45, line: 156, type: !23)
!382 = !DILocation(line: 156, column: 20, scope: !378)
!383 = !DILocalVariable(name: "intVariable", scope: !378, file: !45, line: 156, type: !23)
!384 = !DILocation(line: 156, column: 23, scope: !378)
!385 = !DILocation(line: 157, column: 24, scope: !386)
!386 = distinct !DILexicalBlock(scope: !378, file: !45, line: 157, column: 17)
!387 = !DILocation(line: 157, column: 17, scope: !386)
!388 = !DILocation(line: 157, column: 40, scope: !386)
!389 = !DILocation(line: 157, column: 17, scope: !378)
!390 = !DILocation(line: 160, column: 29, scope: !391)
!391 = distinct !DILexicalBlock(scope: !386, file: !45, line: 158, column: 13)
!392 = !DILocation(line: 161, column: 24, scope: !393)
!393 = distinct !DILexicalBlock(scope: !391, file: !45, line: 161, column: 17)
!394 = !DILocation(line: 161, column: 22, scope: !393)
!395 = !DILocation(line: 161, column: 29, scope: !396)
!396 = distinct !DILexicalBlock(scope: !393, file: !45, line: 161, column: 17)
!397 = !DILocation(line: 161, column: 33, scope: !396)
!398 = !DILocation(line: 161, column: 31, scope: !396)
!399 = !DILocation(line: 161, column: 17, scope: !393)
!400 = !DILocation(line: 164, column: 32, scope: !401)
!401 = distinct !DILexicalBlock(scope: !396, file: !45, line: 162, column: 17)
!402 = !DILocation(line: 165, column: 17, scope: !401)
!403 = !DILocation(line: 161, column: 37, scope: !396)
!404 = !DILocation(line: 161, column: 17, scope: !396)
!405 = distinct !{!405, !399, !406, !180}
!406 = !DILocation(line: 165, column: 17, scope: !393)
!407 = !DILocation(line: 166, column: 30, scope: !391)
!408 = !DILocation(line: 166, column: 17, scope: !391)
!409 = !DILocation(line: 167, column: 13, scope: !391)
!410 = !DILocation(line: 169, column: 5, scope: !379)
!411 = !DILocation(line: 153, column: 24, scope: !374)
!412 = !DILocation(line: 153, column: 5, scope: !374)
!413 = distinct !{!413, !376, !414, !180}
!414 = !DILocation(line: 169, column: 5, scope: !371)
!415 = !DILocation(line: 170, column: 1, scope: !344)
!416 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_17_good", scope: !45, file: !45, line: 172, type: !53, scopeLine: 173, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!417 = !DILocation(line: 174, column: 5, scope: !416)
!418 = !DILocation(line: 175, column: 5, scope: !416)
!419 = !DILocation(line: 176, column: 1, scope: !416)
!420 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !421, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !42}
!423 = !DILocalVariable(name: "line", arg: 1, scope: !420, file: !3, line: 11, type: !42)
!424 = !DILocation(line: 11, column: 25, scope: !420)
!425 = !DILocation(line: 13, column: 1, scope: !420)
!426 = !DILocation(line: 14, column: 8, scope: !427)
!427 = distinct !DILexicalBlock(scope: !420, file: !3, line: 14, column: 8)
!428 = !DILocation(line: 14, column: 13, scope: !427)
!429 = !DILocation(line: 14, column: 8, scope: !420)
!430 = !DILocation(line: 16, column: 24, scope: !431)
!431 = distinct !DILexicalBlock(scope: !427, file: !3, line: 15, column: 5)
!432 = !DILocation(line: 16, column: 9, scope: !431)
!433 = !DILocation(line: 17, column: 5, scope: !431)
!434 = !DILocation(line: 18, column: 5, scope: !420)
!435 = !DILocation(line: 19, column: 1, scope: !420)
!436 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !421, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!437 = !DILocalVariable(name: "line", arg: 1, scope: !436, file: !3, line: 20, type: !42)
!438 = !DILocation(line: 20, column: 29, scope: !436)
!439 = !DILocation(line: 22, column: 8, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !3, line: 22, column: 8)
!441 = !DILocation(line: 22, column: 13, scope: !440)
!442 = !DILocation(line: 22, column: 8, scope: !436)
!443 = !DILocation(line: 24, column: 24, scope: !444)
!444 = distinct !DILexicalBlock(scope: !440, file: !3, line: 23, column: 5)
!445 = !DILocation(line: 24, column: 9, scope: !444)
!446 = !DILocation(line: 25, column: 5, scope: !444)
!447 = !DILocation(line: 26, column: 1, scope: !436)
!448 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !449, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!449 = !DISubroutineType(types: !450)
!450 = !{null, !451}
!451 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !452, size: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !79, line: 74, baseType: !23)
!453 = !DILocalVariable(name: "line", arg: 1, scope: !448, file: !3, line: 27, type: !451)
!454 = !DILocation(line: 27, column: 29, scope: !448)
!455 = !DILocation(line: 29, column: 8, scope: !456)
!456 = distinct !DILexicalBlock(scope: !448, file: !3, line: 29, column: 8)
!457 = !DILocation(line: 29, column: 13, scope: !456)
!458 = !DILocation(line: 29, column: 8, scope: !448)
!459 = !DILocation(line: 31, column: 27, scope: !460)
!460 = distinct !DILexicalBlock(scope: !456, file: !3, line: 30, column: 5)
!461 = !DILocation(line: 31, column: 9, scope: !460)
!462 = !DILocation(line: 32, column: 5, scope: !460)
!463 = !DILocation(line: 33, column: 1, scope: !448)
!464 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !465, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !23}
!467 = !DILocalVariable(name: "intNumber", arg: 1, scope: !464, file: !3, line: 35, type: !23)
!468 = !DILocation(line: 35, column: 24, scope: !464)
!469 = !DILocation(line: 37, column: 20, scope: !464)
!470 = !DILocation(line: 37, column: 5, scope: !464)
!471 = !DILocation(line: 38, column: 1, scope: !464)
!472 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !473, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !475}
!475 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!476 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !472, file: !3, line: 40, type: !475)
!477 = !DILocation(line: 40, column: 28, scope: !472)
!478 = !DILocation(line: 42, column: 21, scope: !472)
!479 = !DILocation(line: 42, column: 5, scope: !472)
!480 = !DILocation(line: 43, column: 1, scope: !472)
!481 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !482, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !484}
!484 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!485 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !481, file: !3, line: 45, type: !484)
!486 = !DILocation(line: 45, column: 28, scope: !481)
!487 = !DILocation(line: 47, column: 20, scope: !481)
!488 = !DILocation(line: 47, column: 5, scope: !481)
!489 = !DILocation(line: 48, column: 1, scope: !481)
!490 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !491, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !113}
!493 = !DILocalVariable(name: "longNumber", arg: 1, scope: !490, file: !3, line: 50, type: !113)
!494 = !DILocation(line: 50, column: 26, scope: !490)
!495 = !DILocation(line: 52, column: 21, scope: !490)
!496 = !DILocation(line: 52, column: 5, scope: !490)
!497 = !DILocation(line: 53, column: 1, scope: !490)
!498 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !499, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501}
!501 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !502, line: 27, baseType: !503)
!502 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!503 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !112, line: 44, baseType: !113)
!504 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !498, file: !3, line: 55, type: !501)
!505 = !DILocation(line: 55, column: 33, scope: !498)
!506 = !DILocation(line: 57, column: 29, scope: !498)
!507 = !DILocation(line: 57, column: 5, scope: !498)
!508 = !DILocation(line: 58, column: 1, scope: !498)
!509 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !510, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !78}
!512 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !509, file: !3, line: 60, type: !78)
!513 = !DILocation(line: 60, column: 29, scope: !509)
!514 = !DILocation(line: 62, column: 21, scope: !509)
!515 = !DILocation(line: 62, column: 5, scope: !509)
!516 = !DILocation(line: 63, column: 1, scope: !509)
!517 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !518, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!518 = !DISubroutineType(types: !519)
!519 = !{null, !43}
!520 = !DILocalVariable(name: "charHex", arg: 1, scope: !517, file: !3, line: 65, type: !43)
!521 = !DILocation(line: 65, column: 29, scope: !517)
!522 = !DILocation(line: 67, column: 22, scope: !517)
!523 = !DILocation(line: 67, column: 5, scope: !517)
!524 = !DILocation(line: 68, column: 1, scope: !517)
!525 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !526, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !452}
!528 = !DILocalVariable(name: "wideChar", arg: 1, scope: !525, file: !3, line: 70, type: !452)
!529 = !DILocation(line: 70, column: 29, scope: !525)
!530 = !DILocalVariable(name: "s", scope: !525, file: !3, line: 74, type: !531)
!531 = !DICompositeType(tag: DW_TAG_array_type, baseType: !452, size: 64, elements: !532)
!532 = !{!533}
!533 = !DISubrange(count: 2)
!534 = !DILocation(line: 74, column: 13, scope: !525)
!535 = !DILocation(line: 75, column: 16, scope: !525)
!536 = !DILocation(line: 75, column: 9, scope: !525)
!537 = !DILocation(line: 75, column: 14, scope: !525)
!538 = !DILocation(line: 76, column: 9, scope: !525)
!539 = !DILocation(line: 76, column: 14, scope: !525)
!540 = !DILocation(line: 77, column: 21, scope: !525)
!541 = !DILocation(line: 77, column: 5, scope: !525)
!542 = !DILocation(line: 78, column: 1, scope: !525)
!543 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !544, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !7}
!546 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !543, file: !3, line: 80, type: !7)
!547 = !DILocation(line: 80, column: 33, scope: !543)
!548 = !DILocation(line: 82, column: 20, scope: !543)
!549 = !DILocation(line: 82, column: 5, scope: !543)
!550 = !DILocation(line: 83, column: 1, scope: !543)
!551 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !552, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !25}
!554 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !551, file: !3, line: 85, type: !25)
!555 = !DILocation(line: 85, column: 45, scope: !551)
!556 = !DILocation(line: 87, column: 22, scope: !551)
!557 = !DILocation(line: 87, column: 5, scope: !551)
!558 = !DILocation(line: 88, column: 1, scope: !551)
!559 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !560, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !562}
!562 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!563 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !559, file: !3, line: 90, type: !562)
!564 = !DILocation(line: 90, column: 29, scope: !559)
!565 = !DILocation(line: 92, column: 20, scope: !559)
!566 = !DILocation(line: 92, column: 5, scope: !559)
!567 = !DILocation(line: 93, column: 1, scope: !559)
!568 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !569, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!569 = !DISubroutineType(types: !570)
!570 = !{null, !571}
!571 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !572, size: 64)
!572 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !573, line: 100, baseType: !574)
!573 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_090/source_code")
!574 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !573, line: 96, size: 64, elements: !575)
!575 = !{!576, !577}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !574, file: !573, line: 98, baseType: !23, size: 32)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !574, file: !573, line: 99, baseType: !23, size: 32, offset: 32)
!578 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !568, file: !3, line: 95, type: !571)
!579 = !DILocation(line: 95, column: 40, scope: !568)
!580 = !DILocation(line: 97, column: 26, scope: !568)
!581 = !DILocation(line: 97, column: 47, scope: !568)
!582 = !DILocation(line: 97, column: 55, scope: !568)
!583 = !DILocation(line: 97, column: 76, scope: !568)
!584 = !DILocation(line: 97, column: 5, scope: !568)
!585 = !DILocation(line: 98, column: 1, scope: !568)
!586 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !587, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !589, !78}
!589 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!590 = !DILocalVariable(name: "bytes", arg: 1, scope: !586, file: !3, line: 100, type: !589)
!591 = !DILocation(line: 100, column: 38, scope: !586)
!592 = !DILocalVariable(name: "numBytes", arg: 2, scope: !586, file: !3, line: 100, type: !78)
!593 = !DILocation(line: 100, column: 52, scope: !586)
!594 = !DILocalVariable(name: "i", scope: !586, file: !3, line: 102, type: !78)
!595 = !DILocation(line: 102, column: 12, scope: !586)
!596 = !DILocation(line: 103, column: 12, scope: !597)
!597 = distinct !DILexicalBlock(scope: !586, file: !3, line: 103, column: 5)
!598 = !DILocation(line: 103, column: 10, scope: !597)
!599 = !DILocation(line: 103, column: 17, scope: !600)
!600 = distinct !DILexicalBlock(scope: !597, file: !3, line: 103, column: 5)
!601 = !DILocation(line: 103, column: 21, scope: !600)
!602 = !DILocation(line: 103, column: 19, scope: !600)
!603 = !DILocation(line: 103, column: 5, scope: !597)
!604 = !DILocation(line: 105, column: 24, scope: !605)
!605 = distinct !DILexicalBlock(scope: !600, file: !3, line: 104, column: 5)
!606 = !DILocation(line: 105, column: 30, scope: !605)
!607 = !DILocation(line: 105, column: 9, scope: !605)
!608 = !DILocation(line: 106, column: 5, scope: !605)
!609 = !DILocation(line: 103, column: 31, scope: !600)
!610 = !DILocation(line: 103, column: 5, scope: !600)
!611 = distinct !{!611, !603, !612, !180}
!612 = !DILocation(line: 106, column: 5, scope: !597)
!613 = !DILocation(line: 107, column: 5, scope: !586)
!614 = !DILocation(line: 108, column: 1, scope: !586)
!615 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !616, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!616 = !DISubroutineType(types: !617)
!617 = !{!78, !589, !78, !42}
!618 = !DILocalVariable(name: "bytes", arg: 1, scope: !615, file: !3, line: 113, type: !589)
!619 = !DILocation(line: 113, column: 39, scope: !615)
!620 = !DILocalVariable(name: "numBytes", arg: 2, scope: !615, file: !3, line: 113, type: !78)
!621 = !DILocation(line: 113, column: 53, scope: !615)
!622 = !DILocalVariable(name: "hex", arg: 3, scope: !615, file: !3, line: 113, type: !42)
!623 = !DILocation(line: 113, column: 71, scope: !615)
!624 = !DILocalVariable(name: "numWritten", scope: !615, file: !3, line: 115, type: !78)
!625 = !DILocation(line: 115, column: 12, scope: !615)
!626 = !DILocation(line: 121, column: 5, scope: !615)
!627 = !DILocation(line: 121, column: 12, scope: !615)
!628 = !DILocation(line: 121, column: 25, scope: !615)
!629 = !DILocation(line: 121, column: 23, scope: !615)
!630 = !DILocation(line: 121, column: 34, scope: !615)
!631 = !DILocation(line: 121, column: 37, scope: !615)
!632 = !DILocation(line: 121, column: 67, scope: !615)
!633 = !DILocation(line: 121, column: 70, scope: !615)
!634 = !DILocation(line: 0, scope: !615)
!635 = !DILocalVariable(name: "byte", scope: !636, file: !3, line: 123, type: !23)
!636 = distinct !DILexicalBlock(scope: !615, file: !3, line: 122, column: 5)
!637 = !DILocation(line: 123, column: 13, scope: !636)
