; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_17.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_17.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_17_bad() #0 !dbg !10 {
entry:
  %i = alloca i32, align 4
  %j = alloca i32, align 4
  %data = alloca i8*, align 8
  %dataBuffer = alloca [100 x i8], align 16
  %dataLen = alloca i64, align 8
  %pFile = alloca %struct._IO_FILE*, align 8
  %i17 = alloca i32, align 4
  %n = alloca i32, align 4
  %intVariable = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_17.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_090/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_17_bad", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null}
!13 = !DILocalVariable(name: "i", scope: !10, file: !1, line: 37, type: !5)
!14 = !DILocation(line: 37, column: 9, scope: !10)
!15 = !DILocalVariable(name: "j", scope: !10, file: !1, line: 37, type: !5)
!16 = !DILocation(line: 37, column: 11, scope: !10)
!17 = !DILocalVariable(name: "data", scope: !10, file: !1, line: 38, type: !18)
!18 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !19, size: 64)
!19 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!20 = !DILocation(line: 38, column: 12, scope: !10)
!21 = !DILocalVariable(name: "dataBuffer", scope: !10, file: !1, line: 39, type: !22)
!22 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 800, elements: !23)
!23 = !{!24}
!24 = !DISubrange(count: 100)
!25 = !DILocation(line: 39, column: 10, scope: !10)
!26 = !DILocation(line: 40, column: 12, scope: !10)
!27 = !DILocation(line: 40, column: 10, scope: !10)
!28 = !DILocation(line: 41, column: 11, scope: !29)
!29 = distinct !DILexicalBlock(scope: !10, file: !1, line: 41, column: 5)
!30 = !DILocation(line: 41, column: 9, scope: !29)
!31 = !DILocation(line: 41, column: 16, scope: !32)
!32 = distinct !DILexicalBlock(scope: !29, file: !1, line: 41, column: 5)
!33 = !DILocation(line: 41, column: 18, scope: !32)
!34 = !DILocation(line: 41, column: 5, scope: !29)
!35 = !DILocalVariable(name: "dataLen", scope: !36, file: !1, line: 45, type: !38)
!36 = distinct !DILexicalBlock(scope: !37, file: !1, line: 43, column: 9)
!37 = distinct !DILexicalBlock(scope: !32, file: !1, line: 42, column: 5)
!38 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !39, line: 46, baseType: !40)
!39 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!40 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!41 = !DILocation(line: 45, column: 20, scope: !36)
!42 = !DILocation(line: 45, column: 37, scope: !36)
!43 = !DILocation(line: 45, column: 30, scope: !36)
!44 = !DILocalVariable(name: "pFile", scope: !36, file: !1, line: 46, type: !45)
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !47, line: 7, baseType: !48)
!47 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !49, line: 49, size: 1728, elements: !50)
!49 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!50 = !{!51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !66, !68, !69, !70, !74, !76, !78, !82, !85, !87, !90, !93, !94, !95, !96, !97}
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !48, file: !49, line: 51, baseType: !5, size: 32)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !48, file: !49, line: 54, baseType: !18, size: 64, offset: 64)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !48, file: !49, line: 55, baseType: !18, size: 64, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !48, file: !49, line: 56, baseType: !18, size: 64, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !48, file: !49, line: 57, baseType: !18, size: 64, offset: 256)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !48, file: !49, line: 58, baseType: !18, size: 64, offset: 320)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !48, file: !49, line: 59, baseType: !18, size: 64, offset: 384)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !48, file: !49, line: 60, baseType: !18, size: 64, offset: 448)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !48, file: !49, line: 61, baseType: !18, size: 64, offset: 512)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !48, file: !49, line: 64, baseType: !18, size: 64, offset: 576)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !48, file: !49, line: 65, baseType: !18, size: 64, offset: 640)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !48, file: !49, line: 66, baseType: !18, size: 64, offset: 704)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !48, file: !49, line: 68, baseType: !64, size: 64, offset: 768)
!64 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !49, line: 36, flags: DIFlagFwdDecl)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !48, file: !49, line: 70, baseType: !67, size: 64, offset: 832)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !48, file: !49, line: 72, baseType: !5, size: 32, offset: 896)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !48, file: !49, line: 73, baseType: !5, size: 32, offset: 928)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !48, file: !49, line: 74, baseType: !71, size: 64, offset: 960)
!71 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !72, line: 152, baseType: !73)
!72 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!73 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !48, file: !49, line: 77, baseType: !75, size: 16, offset: 1024)
!75 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !48, file: !49, line: 78, baseType: !77, size: 8, offset: 1040)
!77 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !48, file: !49, line: 79, baseType: !79, size: 8, offset: 1048)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 8, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 1)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !48, file: !49, line: 81, baseType: !83, size: 64, offset: 1088)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !49, line: 43, baseType: null)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !48, file: !49, line: 89, baseType: !86, size: 64, offset: 1152)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !72, line: 153, baseType: !73)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !48, file: !49, line: 91, baseType: !88, size: 64, offset: 1216)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !49, line: 37, flags: DIFlagFwdDecl)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !48, file: !49, line: 92, baseType: !91, size: 64, offset: 1280)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !49, line: 38, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !48, file: !49, line: 93, baseType: !67, size: 64, offset: 1344)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !48, file: !49, line: 94, baseType: !4, size: 64, offset: 1408)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !48, file: !49, line: 95, baseType: !38, size: 64, offset: 1472)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !48, file: !49, line: 96, baseType: !5, size: 32, offset: 1536)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !48, file: !49, line: 98, baseType: !98, size: 160, offset: 1568)
!98 = !DICompositeType(tag: DW_TAG_array_type, baseType: !19, size: 160, elements: !99)
!99 = !{!100}
!100 = !DISubrange(count: 20)
!101 = !DILocation(line: 46, column: 20, scope: !36)
!102 = !DILocation(line: 48, column: 21, scope: !103)
!103 = distinct !DILexicalBlock(scope: !36, file: !1, line: 48, column: 17)
!104 = !DILocation(line: 48, column: 20, scope: !103)
!105 = !DILocation(line: 48, column: 29, scope: !103)
!106 = !DILocation(line: 48, column: 17, scope: !36)
!107 = !DILocation(line: 50, column: 25, scope: !108)
!108 = distinct !DILexicalBlock(scope: !103, file: !1, line: 49, column: 13)
!109 = !DILocation(line: 50, column: 23, scope: !108)
!110 = !DILocation(line: 51, column: 21, scope: !111)
!111 = distinct !DILexicalBlock(scope: !108, file: !1, line: 51, column: 21)
!112 = !DILocation(line: 51, column: 27, scope: !111)
!113 = !DILocation(line: 51, column: 21, scope: !108)
!114 = !DILocation(line: 54, column: 31, scope: !115)
!115 = distinct !DILexicalBlock(scope: !116, file: !1, line: 54, column: 25)
!116 = distinct !DILexicalBlock(scope: !111, file: !1, line: 52, column: 17)
!117 = !DILocation(line: 54, column: 36, scope: !115)
!118 = !DILocation(line: 54, column: 35, scope: !115)
!119 = !DILocation(line: 54, column: 55, scope: !115)
!120 = !DILocation(line: 54, column: 54, scope: !115)
!121 = !DILocation(line: 54, column: 45, scope: !115)
!122 = !DILocation(line: 54, column: 65, scope: !115)
!123 = !DILocation(line: 54, column: 25, scope: !115)
!124 = !DILocation(line: 54, column: 72, scope: !115)
!125 = !DILocation(line: 54, column: 25, scope: !116)
!126 = !DILocation(line: 56, column: 25, scope: !127)
!127 = distinct !DILexicalBlock(scope: !115, file: !1, line: 55, column: 21)
!128 = !DILocation(line: 58, column: 25, scope: !127)
!129 = !DILocation(line: 58, column: 30, scope: !127)
!130 = !DILocation(line: 58, column: 39, scope: !127)
!131 = !DILocation(line: 59, column: 21, scope: !127)
!132 = !DILocation(line: 60, column: 28, scope: !116)
!133 = !DILocation(line: 60, column: 21, scope: !116)
!134 = !DILocation(line: 61, column: 17, scope: !116)
!135 = !DILocation(line: 62, column: 13, scope: !108)
!136 = !DILocation(line: 64, column: 5, scope: !37)
!137 = !DILocation(line: 41, column: 24, scope: !32)
!138 = !DILocation(line: 41, column: 5, scope: !32)
!139 = distinct !{!139, !34, !140, !141}
!140 = !DILocation(line: 64, column: 5, scope: !29)
!141 = !{!"llvm.loop.mustprogress"}
!142 = !DILocation(line: 65, column: 11, scope: !143)
!143 = distinct !DILexicalBlock(scope: !10, file: !1, line: 65, column: 5)
!144 = !DILocation(line: 65, column: 9, scope: !143)
!145 = !DILocation(line: 65, column: 16, scope: !146)
!146 = distinct !DILexicalBlock(scope: !143, file: !1, line: 65, column: 5)
!147 = !DILocation(line: 65, column: 18, scope: !146)
!148 = !DILocation(line: 65, column: 5, scope: !143)
!149 = !DILocalVariable(name: "i", scope: !150, file: !1, line: 68, type: !5)
!150 = distinct !DILexicalBlock(scope: !151, file: !1, line: 67, column: 9)
!151 = distinct !DILexicalBlock(scope: !146, file: !1, line: 66, column: 5)
!152 = !DILocation(line: 68, column: 17, scope: !150)
!153 = !DILocalVariable(name: "n", scope: !150, file: !1, line: 68, type: !5)
!154 = !DILocation(line: 68, column: 20, scope: !150)
!155 = !DILocalVariable(name: "intVariable", scope: !150, file: !1, line: 68, type: !5)
!156 = !DILocation(line: 68, column: 23, scope: !150)
!157 = !DILocation(line: 69, column: 24, scope: !158)
!158 = distinct !DILexicalBlock(scope: !150, file: !1, line: 69, column: 17)
!159 = !DILocation(line: 69, column: 17, scope: !158)
!160 = !DILocation(line: 69, column: 40, scope: !158)
!161 = !DILocation(line: 69, column: 17, scope: !150)
!162 = !DILocation(line: 72, column: 29, scope: !163)
!163 = distinct !DILexicalBlock(scope: !158, file: !1, line: 70, column: 13)
