; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_18.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_027/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_18_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocation(line: 38, column: 5, scope: !52)
!65 = !DILabel(scope: !52, name: "source", file: !45, line: 39)
!66 = !DILocation(line: 39, column: 1, scope: !52)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 42, type: !69)
!68 = distinct !DILexicalBlock(scope: !52, file: !45, line: 40, column: 5)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DILocation(line: 42, column: 16, scope: !68)
!73 = !DILocation(line: 42, column: 33, scope: !68)
!74 = !DILocation(line: 42, column: 26, scope: !68)
!75 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 43, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !99, !100, !101, !105, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !23, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !42, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !42, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !42, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !42, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !42, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !42, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !42, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !42, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !42, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !42, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !42, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !23, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !23, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 152, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!104 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !24, size: 16, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 153, baseType: !104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !98, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !22, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !69, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !23, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocation(line: 43, column: 16, scope: !68)
!132 = !DILocation(line: 45, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !68, file: !45, line: 45, column: 13)
!134 = !DILocation(line: 45, column: 16, scope: !133)
!135 = !DILocation(line: 45, column: 25, scope: !133)
!136 = !DILocation(line: 45, column: 13, scope: !68)
!137 = !DILocation(line: 47, column: 21, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !45, line: 46, column: 9)
!139 = !DILocation(line: 47, column: 19, scope: !138)
!140 = !DILocation(line: 48, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !138, file: !45, line: 48, column: 17)
!142 = !DILocation(line: 48, column: 23, scope: !141)
!143 = !DILocation(line: 48, column: 17, scope: !138)
!144 = !DILocation(line: 51, column: 27, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !45, line: 51, column: 21)
!146 = distinct !DILexicalBlock(scope: !141, file: !45, line: 49, column: 13)
!147 = !DILocation(line: 51, column: 32, scope: !145)
!148 = !DILocation(line: 51, column: 31, scope: !145)
!149 = !DILocation(line: 51, column: 51, scope: !145)
!150 = !DILocation(line: 51, column: 50, scope: !145)
!151 = !DILocation(line: 51, column: 41, scope: !145)
!152 = !DILocation(line: 51, column: 61, scope: !145)
!153 = !DILocation(line: 51, column: 21, scope: !145)
!154 = !DILocation(line: 51, column: 68, scope: !145)
!155 = !DILocation(line: 51, column: 21, scope: !146)
!156 = !DILocation(line: 53, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !45, line: 52, column: 17)
!158 = !DILocation(line: 55, column: 21, scope: !157)
!159 = !DILocation(line: 55, column: 26, scope: !157)
!160 = !DILocation(line: 55, column: 35, scope: !157)
!161 = !DILocation(line: 56, column: 17, scope: !157)
!162 = !DILocation(line: 57, column: 24, scope: !146)
!163 = !DILocation(line: 57, column: 17, scope: !146)
!164 = !DILocation(line: 58, column: 13, scope: !146)
!165 = !DILocation(line: 59, column: 9, scope: !138)
!166 = !DILocation(line: 61, column: 5, scope: !52)
!167 = !DILabel(scope: !52, name: "sink", file: !45, line: 62)
!168 = !DILocation(line: 62, column: 1, scope: !52)
!169 = !DILocation(line: 64, column: 12, scope: !52)
!170 = !DILocation(line: 64, column: 5, scope: !52)
!171 = !DILocation(line: 65, column: 1, scope: !52)
!172 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 72, type: !53, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!173 = !DILocalVariable(name: "data", scope: !172, file: !45, line: 74, type: !42)
!174 = !DILocation(line: 74, column: 12, scope: !172)
!175 = !DILocalVariable(name: "dataBuffer", scope: !172, file: !45, line: 75, type: !58)
!176 = !DILocation(line: 75, column: 10, scope: !172)
!177 = !DILocation(line: 76, column: 12, scope: !172)
!178 = !DILocation(line: 76, column: 10, scope: !172)
!179 = !DILocation(line: 77, column: 5, scope: !172)
!180 = !DILabel(scope: !172, name: "source", file: !45, line: 78)
!181 = !DILocation(line: 78, column: 1, scope: !172)
!182 = !DILocalVariable(name: "dataLen", scope: !183, file: !45, line: 81, type: !69)
!183 = distinct !DILexicalBlock(scope: !172, file: !45, line: 79, column: 5)
!184 = !DILocation(line: 81, column: 16, scope: !183)
!185 = !DILocation(line: 81, column: 33, scope: !183)
!186 = !DILocation(line: 81, column: 26, scope: !183)
!187 = !DILocalVariable(name: "pFile", scope: !183, file: !45, line: 82, type: !76)
!188 = !DILocation(line: 82, column: 16, scope: !183)
!189 = !DILocation(line: 84, column: 17, scope: !190)
!190 = distinct !DILexicalBlock(scope: !183, file: !45, line: 84, column: 13)
!191 = !DILocation(line: 84, column: 16, scope: !190)
!192 = !DILocation(line: 84, column: 25, scope: !190)
!193 = !DILocation(line: 84, column: 13, scope: !183)
!194 = !DILocation(line: 86, column: 21, scope: !195)
!195 = distinct !DILexicalBlock(scope: !190, file: !45, line: 85, column: 9)
!196 = !DILocation(line: 86, column: 19, scope: !195)
!197 = !DILocation(line: 87, column: 17, scope: !198)
!198 = distinct !DILexicalBlock(scope: !195, file: !45, line: 87, column: 17)
!199 = !DILocation(line: 87, column: 23, scope: !198)
!200 = !DILocation(line: 87, column: 17, scope: !195)
!201 = !DILocation(line: 90, column: 27, scope: !202)
!202 = distinct !DILexicalBlock(scope: !203, file: !45, line: 90, column: 21)
!203 = distinct !DILexicalBlock(scope: !198, file: !45, line: 88, column: 13)
!204 = !DILocation(line: 90, column: 32, scope: !202)
!205 = !DILocation(line: 90, column: 31, scope: !202)
!206 = !DILocation(line: 90, column: 51, scope: !202)
!207 = !DILocation(line: 90, column: 50, scope: !202)
!208 = !DILocation(line: 90, column: 41, scope: !202)
!209 = !DILocation(line: 90, column: 61, scope: !202)
!210 = !DILocation(line: 90, column: 21, scope: !202)
!211 = !DILocation(line: 90, column: 68, scope: !202)
!212 = !DILocation(line: 90, column: 21, scope: !203)
!213 = !DILocation(line: 92, column: 21, scope: !214)
!214 = distinct !DILexicalBlock(scope: !202, file: !45, line: 91, column: 17)
!215 = !DILocation(line: 94, column: 21, scope: !214)
!216 = !DILocation(line: 94, column: 26, scope: !214)
!217 = !DILocation(line: 94, column: 35, scope: !214)
!218 = !DILocation(line: 95, column: 17, scope: !214)
!219 = !DILocation(line: 96, column: 24, scope: !203)
!220 = !DILocation(line: 96, column: 17, scope: !203)
!221 = !DILocation(line: 97, column: 13, scope: !203)
!222 = !DILocation(line: 98, column: 9, scope: !195)
!223 = !DILocation(line: 100, column: 5, scope: !172)
!224 = !DILabel(scope: !172, name: "sink", file: !45, line: 101)
!225 = !DILocation(line: 101, column: 1, scope: !172)
!226 = !DILocation(line: 103, column: 20, scope: !172)
!227 = !DILocation(line: 103, column: 5, scope: !172)
!228 = !DILocation(line: 104, column: 1, scope: !172)
!229 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 107, type: !53, scopeLine: 108, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!230 = !DILocalVariable(name: "data", scope: !229, file: !45, line: 109, type: !42)
!231 = !DILocation(line: 109, column: 12, scope: !229)
!232 = !DILocalVariable(name: "dataBuffer", scope: !229, file: !45, line: 110, type: !58)
!233 = !DILocation(line: 110, column: 10, scope: !229)
!234 = !DILocation(line: 111, column: 12, scope: !229)
!235 = !DILocation(line: 111, column: 10, scope: !229)
!236 = !DILocation(line: 112, column: 5, scope: !229)
!237 = !DILabel(scope: !229, name: "source", file: !45, line: 113)
!238 = !DILocation(line: 113, column: 1, scope: !229)
!239 = !DILocation(line: 115, column: 12, scope: !229)
!240 = !DILocation(line: 115, column: 5, scope: !229)
!241 = !DILocation(line: 116, column: 5, scope: !229)
!242 = !DILabel(scope: !229, name: "sink", file: !45, line: 117)
!243 = !DILocation(line: 117, column: 1, scope: !229)
!244 = !DILocation(line: 119, column: 12, scope: !229)
!245 = !DILocation(line: 119, column: 5, scope: !229)
!246 = !DILocation(line: 120, column: 1, scope: !229)
!247 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_18_good", scope: !45, file: !45, line: 122, type: !53, scopeLine: 123, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!248 = !DILocation(line: 124, column: 5, scope: !247)
!249 = !DILocation(line: 125, column: 5, scope: !247)
!250 = !DILocation(line: 126, column: 1, scope: !247)
!251 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !252, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!252 = !DISubroutineType(types: !253)
!253 = !{null, !42}
!254 = !DILocalVariable(name: "line", arg: 1, scope: !251, file: !3, line: 11, type: !42)
!255 = !DILocation(line: 11, column: 25, scope: !251)
!256 = !DILocation(line: 13, column: 1, scope: !251)
!257 = !DILocation(line: 14, column: 8, scope: !258)
!258 = distinct !DILexicalBlock(scope: !251, file: !3, line: 14, column: 8)
!259 = !DILocation(line: 14, column: 13, scope: !258)
!260 = !DILocation(line: 14, column: 8, scope: !251)
!261 = !DILocation(line: 16, column: 24, scope: !262)
!262 = distinct !DILexicalBlock(scope: !258, file: !3, line: 15, column: 5)
!263 = !DILocation(line: 16, column: 9, scope: !262)
!264 = !DILocation(line: 17, column: 5, scope: !262)
!265 = !DILocation(line: 18, column: 5, scope: !251)
!266 = !DILocation(line: 19, column: 1, scope: !251)
!267 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !252, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!268 = !DILocalVariable(name: "line", arg: 1, scope: !267, file: !3, line: 20, type: !42)
!269 = !DILocation(line: 20, column: 29, scope: !267)
!270 = !DILocation(line: 22, column: 8, scope: !271)
!271 = distinct !DILexicalBlock(scope: !267, file: !3, line: 22, column: 8)
!272 = !DILocation(line: 22, column: 13, scope: !271)
!273 = !DILocation(line: 22, column: 8, scope: !267)
!274 = !DILocation(line: 24, column: 24, scope: !275)
!275 = distinct !DILexicalBlock(scope: !271, file: !3, line: 23, column: 5)
!276 = !DILocation(line: 24, column: 9, scope: !275)
!277 = !DILocation(line: 25, column: 5, scope: !275)
!278 = !DILocation(line: 26, column: 1, scope: !267)
!279 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !280, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!280 = !DISubroutineType(types: !281)
!281 = !{null, !282}
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !70, line: 74, baseType: !23)
!284 = !DILocalVariable(name: "line", arg: 1, scope: !279, file: !3, line: 27, type: !282)
!285 = !DILocation(line: 27, column: 29, scope: !279)
!286 = !DILocation(line: 29, column: 8, scope: !287)
!287 = distinct !DILexicalBlock(scope: !279, file: !3, line: 29, column: 8)
!288 = !DILocation(line: 29, column: 13, scope: !287)
!289 = !DILocation(line: 29, column: 8, scope: !279)
!290 = !DILocation(line: 31, column: 27, scope: !291)
!291 = distinct !DILexicalBlock(scope: !287, file: !3, line: 30, column: 5)
!292 = !DILocation(line: 31, column: 9, scope: !291)
!293 = !DILocation(line: 32, column: 5, scope: !291)
!294 = !DILocation(line: 33, column: 1, scope: !279)
!295 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !296, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!296 = !DISubroutineType(types: !297)
!297 = !{null, !23}
!298 = !DILocalVariable(name: "intNumber", arg: 1, scope: !295, file: !3, line: 35, type: !23)
!299 = !DILocation(line: 35, column: 24, scope: !295)
!300 = !DILocation(line: 37, column: 20, scope: !295)
!301 = !DILocation(line: 37, column: 5, scope: !295)
!302 = !DILocation(line: 38, column: 1, scope: !295)
!303 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !304, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!304 = !DISubroutineType(types: !305)
!305 = !{null, !306}
!306 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!307 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !303, file: !3, line: 40, type: !306)
!308 = !DILocation(line: 40, column: 28, scope: !303)
!309 = !DILocation(line: 42, column: 21, scope: !303)
!310 = !DILocation(line: 42, column: 5, scope: !303)
!311 = !DILocation(line: 43, column: 1, scope: !303)
!312 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !313, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!313 = !DISubroutineType(types: !314)
!314 = !{null, !315}
!315 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!316 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !312, file: !3, line: 45, type: !315)
!317 = !DILocation(line: 45, column: 28, scope: !312)
!318 = !DILocation(line: 47, column: 20, scope: !312)
!319 = !DILocation(line: 47, column: 5, scope: !312)
!320 = !DILocation(line: 48, column: 1, scope: !312)
!321 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !322, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!322 = !DISubroutineType(types: !323)
!323 = !{null, !104}
!324 = !DILocalVariable(name: "longNumber", arg: 1, scope: !321, file: !3, line: 50, type: !104)
!325 = !DILocation(line: 50, column: 26, scope: !321)
!326 = !DILocation(line: 52, column: 21, scope: !321)
!327 = !DILocation(line: 52, column: 5, scope: !321)
!328 = !DILocation(line: 53, column: 1, scope: !321)
!329 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !330, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !332}
!332 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !333, line: 27, baseType: !334)
!333 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !103, line: 44, baseType: !104)
!335 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !329, file: !3, line: 55, type: !332)
!336 = !DILocation(line: 55, column: 33, scope: !329)
!337 = !DILocation(line: 57, column: 29, scope: !329)
!338 = !DILocation(line: 57, column: 5, scope: !329)
!339 = !DILocation(line: 58, column: 1, scope: !329)
!340 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !341, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !69}
!343 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !340, file: !3, line: 60, type: !69)
!344 = !DILocation(line: 60, column: 29, scope: !340)
!345 = !DILocation(line: 62, column: 21, scope: !340)
!346 = !DILocation(line: 62, column: 5, scope: !340)
!347 = !DILocation(line: 63, column: 1, scope: !340)
!348 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !349, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!349 = !DISubroutineType(types: !350)
!350 = !{null, !43}
!351 = !DILocalVariable(name: "charHex", arg: 1, scope: !348, file: !3, line: 65, type: !43)
!352 = !DILocation(line: 65, column: 29, scope: !348)
!353 = !DILocation(line: 67, column: 22, scope: !348)
!354 = !DILocation(line: 67, column: 5, scope: !348)
!355 = !DILocation(line: 68, column: 1, scope: !348)
!356 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !357, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !283}
!359 = !DILocalVariable(name: "wideChar", arg: 1, scope: !356, file: !3, line: 70, type: !283)
!360 = !DILocation(line: 70, column: 29, scope: !356)
!361 = !DILocalVariable(name: "s", scope: !356, file: !3, line: 74, type: !362)
!362 = !DICompositeType(tag: DW_TAG_array_type, baseType: !283, size: 64, elements: !363)
!363 = !{!364}
!364 = !DISubrange(count: 2)
!365 = !DILocation(line: 74, column: 13, scope: !356)
!366 = !DILocation(line: 75, column: 16, scope: !356)
!367 = !DILocation(line: 75, column: 9, scope: !356)
!368 = !DILocation(line: 75, column: 14, scope: !356)
!369 = !DILocation(line: 76, column: 9, scope: !356)
!370 = !DILocation(line: 76, column: 14, scope: !356)
!371 = !DILocation(line: 77, column: 21, scope: !356)
!372 = !DILocation(line: 77, column: 5, scope: !356)
!373 = !DILocation(line: 78, column: 1, scope: !356)
!374 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !375, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !7}
!377 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !374, file: !3, line: 80, type: !7)
!378 = !DILocation(line: 80, column: 33, scope: !374)
!379 = !DILocation(line: 82, column: 20, scope: !374)
!380 = !DILocation(line: 82, column: 5, scope: !374)
!381 = !DILocation(line: 83, column: 1, scope: !374)
!382 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !383, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !25}
!385 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !382, file: !3, line: 85, type: !25)
!386 = !DILocation(line: 85, column: 45, scope: !382)
!387 = !DILocation(line: 87, column: 22, scope: !382)
!388 = !DILocation(line: 87, column: 5, scope: !382)
!389 = !DILocation(line: 88, column: 1, scope: !382)
!390 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !391, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !393}
!393 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!394 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !390, file: !3, line: 90, type: !393)
!395 = !DILocation(line: 90, column: 29, scope: !390)
!396 = !DILocation(line: 92, column: 20, scope: !390)
!397 = !DILocation(line: 92, column: 5, scope: !390)
!398 = !DILocation(line: 93, column: 1, scope: !390)
!399 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !400, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!400 = !DISubroutineType(types: !401)
!401 = !{null, !402}
!402 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !403, size: 64)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !404, line: 100, baseType: !405)
!404 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_027/source_code")
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !404, line: 96, size: 64, elements: !406)
!406 = !{!407, !408}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !405, file: !404, line: 98, baseType: !23, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !405, file: !404, line: 99, baseType: !23, size: 32, offset: 32)
!409 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !399, file: !3, line: 95, type: !402)
!410 = !DILocation(line: 95, column: 40, scope: !399)
!411 = !DILocation(line: 97, column: 26, scope: !399)
!412 = !DILocation(line: 97, column: 47, scope: !399)
!413 = !DILocation(line: 97, column: 55, scope: !399)
!414 = !DILocation(line: 97, column: 76, scope: !399)
!415 = !DILocation(line: 97, column: 5, scope: !399)
!416 = !DILocation(line: 98, column: 1, scope: !399)
!417 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !418, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!418 = !DISubroutineType(types: !419)
!419 = !{null, !420, !69}
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!421 = !DILocalVariable(name: "bytes", arg: 1, scope: !417, file: !3, line: 100, type: !420)
!422 = !DILocation(line: 100, column: 38, scope: !417)
!423 = !DILocalVariable(name: "numBytes", arg: 2, scope: !417, file: !3, line: 100, type: !69)
!424 = !DILocation(line: 100, column: 52, scope: !417)
!425 = !DILocalVariable(name: "i", scope: !417, file: !3, line: 102, type: !69)
!426 = !DILocation(line: 102, column: 12, scope: !417)
!427 = !DILocation(line: 103, column: 12, scope: !428)
!428 = distinct !DILexicalBlock(scope: !417, file: !3, line: 103, column: 5)
!429 = !DILocation(line: 103, column: 10, scope: !428)
!430 = !DILocation(line: 103, column: 17, scope: !431)
!431 = distinct !DILexicalBlock(scope: !428, file: !3, line: 103, column: 5)
!432 = !DILocation(line: 103, column: 21, scope: !431)
!433 = !DILocation(line: 103, column: 19, scope: !431)
!434 = !DILocation(line: 103, column: 5, scope: !428)
!435 = !DILocation(line: 105, column: 24, scope: !436)
!436 = distinct !DILexicalBlock(scope: !431, file: !3, line: 104, column: 5)
!437 = !DILocation(line: 105, column: 30, scope: !436)
!438 = !DILocation(line: 105, column: 9, scope: !436)
!439 = !DILocation(line: 106, column: 5, scope: !436)
!440 = !DILocation(line: 103, column: 31, scope: !431)
!441 = !DILocation(line: 103, column: 5, scope: !431)
!442 = distinct !{!442, !434, !443, !444}
!443 = !DILocation(line: 106, column: 5, scope: !428)
!444 = !{!"llvm.loop.mustprogress"}
!445 = !DILocation(line: 107, column: 5, scope: !417)
!446 = !DILocation(line: 108, column: 1, scope: !417)
!447 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !448, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{!69, !420, !69, !42}
!450 = !DILocalVariable(name: "bytes", arg: 1, scope: !447, file: !3, line: 113, type: !420)
!451 = !DILocation(line: 113, column: 39, scope: !447)
!452 = !DILocalVariable(name: "numBytes", arg: 2, scope: !447, file: !3, line: 113, type: !69)
!453 = !DILocation(line: 113, column: 53, scope: !447)
!454 = !DILocalVariable(name: "hex", arg: 3, scope: !447, file: !3, line: 113, type: !42)
!455 = !DILocation(line: 113, column: 71, scope: !447)
!456 = !DILocalVariable(name: "numWritten", scope: !447, file: !3, line: 115, type: !69)
!457 = !DILocation(line: 115, column: 12, scope: !447)
!458 = !DILocation(line: 121, column: 5, scope: !447)
!459 = !DILocation(line: 121, column: 12, scope: !447)
!460 = !DILocation(line: 121, column: 25, scope: !447)
!461 = !DILocation(line: 121, column: 23, scope: !447)
!462 = !DILocation(line: 121, column: 34, scope: !447)
!463 = !DILocation(line: 121, column: 37, scope: !447)
!464 = !DILocation(line: 121, column: 67, scope: !447)
!465 = !DILocation(line: 121, column: 70, scope: !447)
!466 = !DILocation(line: 0, scope: !447)
!467 = !DILocalVariable(name: "byte", scope: !468, file: !3, line: 123, type: !23)
!468 = distinct !DILexicalBlock(scope: !447, file: !3, line: 122, column: 5)
