; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_64a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_110/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !50, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_64b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_110/source_code")
!50 = !{!41}
!51 = !{!"clang version 12.0.0"}
!52 = !{i32 7, !"Dwarf Version", i32 4}
!53 = !{i32 2, !"Debug Info Version", i32 3}
!54 = !{i32 1, !"wchar_size", i32 4}
!55 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_64_bad", scope: !45, file: !45, line: 37, type: !56, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!56 = !DISubroutineType(types: !57)
!57 = !{null}
!58 = !DILocalVariable(name: "data", scope: !55, file: !45, line: 39, type: !42)
!59 = !DILocation(line: 39, column: 12, scope: !55)
!60 = !DILocalVariable(name: "dataBuffer", scope: !55, file: !45, line: 40, type: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 100)
!64 = !DILocation(line: 40, column: 10, scope: !55)
!65 = !DILocation(line: 41, column: 12, scope: !55)
!66 = !DILocation(line: 41, column: 10, scope: !55)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 44, type: !69)
!68 = distinct !DILexicalBlock(scope: !55, file: !45, line: 42, column: 5)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DILocation(line: 44, column: 16, scope: !68)
!73 = !DILocation(line: 44, column: 33, scope: !68)
!74 = !DILocation(line: 44, column: 26, scope: !68)
!75 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 45, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !99, !100, !101, !105, !106, !108, !112, !115, !117, !120, !123, !124, !125, !126, !127}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !23, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !42, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !42, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !42, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !42, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !42, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !42, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !42, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !42, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !42, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !42, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !42, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !23, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !23, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 152, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!104 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !24, size: 16, offset: 1024)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !107, size: 8, offset: 1040)
!107 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !109, size: 8, offset: 1048)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 1)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !113, size: 64, offset: 1088)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !116, size: 64, offset: 1152)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 153, baseType: !104)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !118, size: 64, offset: 1216)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !121, size: 64, offset: 1280)
!121 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !122, size: 64)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !98, size: 64, offset: 1344)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !22, size: 64, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !69, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !23, size: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !128, size: 160, offset: 1568)
!128 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !129)
!129 = !{!130}
!130 = !DISubrange(count: 20)
!131 = !DILocation(line: 45, column: 16, scope: !68)
!132 = !DILocation(line: 47, column: 17, scope: !133)
!133 = distinct !DILexicalBlock(scope: !68, file: !45, line: 47, column: 13)
!134 = !DILocation(line: 47, column: 16, scope: !133)
!135 = !DILocation(line: 47, column: 25, scope: !133)
!136 = !DILocation(line: 47, column: 13, scope: !68)
!137 = !DILocation(line: 49, column: 21, scope: !138)
!138 = distinct !DILexicalBlock(scope: !133, file: !45, line: 48, column: 9)
!139 = !DILocation(line: 49, column: 19, scope: !138)
!140 = !DILocation(line: 50, column: 17, scope: !141)
!141 = distinct !DILexicalBlock(scope: !138, file: !45, line: 50, column: 17)
!142 = !DILocation(line: 50, column: 23, scope: !141)
!143 = !DILocation(line: 50, column: 17, scope: !138)
!144 = !DILocation(line: 53, column: 27, scope: !145)
!145 = distinct !DILexicalBlock(scope: !146, file: !45, line: 53, column: 21)
!146 = distinct !DILexicalBlock(scope: !141, file: !45, line: 51, column: 13)
!147 = !DILocation(line: 53, column: 32, scope: !145)
!148 = !DILocation(line: 53, column: 31, scope: !145)
!149 = !DILocation(line: 53, column: 51, scope: !145)
!150 = !DILocation(line: 53, column: 50, scope: !145)
!151 = !DILocation(line: 53, column: 41, scope: !145)
!152 = !DILocation(line: 53, column: 61, scope: !145)
!153 = !DILocation(line: 53, column: 21, scope: !145)
!154 = !DILocation(line: 53, column: 68, scope: !145)
!155 = !DILocation(line: 53, column: 21, scope: !146)
!156 = !DILocation(line: 55, column: 21, scope: !157)
!157 = distinct !DILexicalBlock(scope: !145, file: !45, line: 54, column: 17)
!158 = !DILocation(line: 57, column: 21, scope: !157)
!159 = !DILocation(line: 57, column: 26, scope: !157)
!160 = !DILocation(line: 57, column: 35, scope: !157)
!161 = !DILocation(line: 58, column: 17, scope: !157)
!162 = !DILocation(line: 59, column: 24, scope: !146)
!163 = !DILocation(line: 59, column: 17, scope: !146)
!164 = !DILocation(line: 60, column: 13, scope: !146)
!165 = !DILocation(line: 61, column: 9, scope: !138)
!166 = !DILocation(line: 63, column: 60, scope: !55)
!167 = !DILocation(line: 63, column: 5, scope: !55)
!168 = !DILocation(line: 64, column: 1, scope: !55)
!169 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 72, type: !56, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!170 = !DILocalVariable(name: "data", scope: !169, file: !45, line: 74, type: !42)
!171 = !DILocation(line: 74, column: 12, scope: !169)
!172 = !DILocalVariable(name: "dataBuffer", scope: !169, file: !45, line: 75, type: !61)
!173 = !DILocation(line: 75, column: 10, scope: !169)
!174 = !DILocation(line: 76, column: 12, scope: !169)
!175 = !DILocation(line: 76, column: 10, scope: !169)
!176 = !DILocation(line: 78, column: 12, scope: !169)
!177 = !DILocation(line: 78, column: 5, scope: !169)
!178 = !DILocation(line: 79, column: 64, scope: !169)
!179 = !DILocation(line: 79, column: 5, scope: !169)
!180 = !DILocation(line: 80, column: 1, scope: !169)
!181 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 84, type: !56, scopeLine: 85, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!182 = !DILocalVariable(name: "data", scope: !181, file: !45, line: 86, type: !42)
!183 = !DILocation(line: 86, column: 12, scope: !181)
!184 = !DILocalVariable(name: "dataBuffer", scope: !181, file: !45, line: 87, type: !61)
!185 = !DILocation(line: 87, column: 10, scope: !181)
!186 = !DILocation(line: 88, column: 12, scope: !181)
!187 = !DILocation(line: 88, column: 10, scope: !181)
!188 = !DILocalVariable(name: "dataLen", scope: !189, file: !45, line: 91, type: !69)
!189 = distinct !DILexicalBlock(scope: !181, file: !45, line: 89, column: 5)
!190 = !DILocation(line: 91, column: 16, scope: !189)
!191 = !DILocation(line: 91, column: 33, scope: !189)
!192 = !DILocation(line: 91, column: 26, scope: !189)
!193 = !DILocalVariable(name: "pFile", scope: !189, file: !45, line: 92, type: !76)
!194 = !DILocation(line: 92, column: 16, scope: !189)
!195 = !DILocation(line: 94, column: 17, scope: !196)
!196 = distinct !DILexicalBlock(scope: !189, file: !45, line: 94, column: 13)
!197 = !DILocation(line: 94, column: 16, scope: !196)
!198 = !DILocation(line: 94, column: 25, scope: !196)
!199 = !DILocation(line: 94, column: 13, scope: !189)
!200 = !DILocation(line: 96, column: 21, scope: !201)
!201 = distinct !DILexicalBlock(scope: !196, file: !45, line: 95, column: 9)
!202 = !DILocation(line: 96, column: 19, scope: !201)
!203 = !DILocation(line: 97, column: 17, scope: !204)
!204 = distinct !DILexicalBlock(scope: !201, file: !45, line: 97, column: 17)
!205 = !DILocation(line: 97, column: 23, scope: !204)
!206 = !DILocation(line: 97, column: 17, scope: !201)
!207 = !DILocation(line: 100, column: 27, scope: !208)
!208 = distinct !DILexicalBlock(scope: !209, file: !45, line: 100, column: 21)
!209 = distinct !DILexicalBlock(scope: !204, file: !45, line: 98, column: 13)
!210 = !DILocation(line: 100, column: 32, scope: !208)
!211 = !DILocation(line: 100, column: 31, scope: !208)
!212 = !DILocation(line: 100, column: 51, scope: !208)
!213 = !DILocation(line: 100, column: 50, scope: !208)
!214 = !DILocation(line: 100, column: 41, scope: !208)
!215 = !DILocation(line: 100, column: 61, scope: !208)
!216 = !DILocation(line: 100, column: 21, scope: !208)
!217 = !DILocation(line: 100, column: 68, scope: !208)
!218 = !DILocation(line: 100, column: 21, scope: !209)
!219 = !DILocation(line: 102, column: 21, scope: !220)
!220 = distinct !DILexicalBlock(scope: !208, file: !45, line: 101, column: 17)
!221 = !DILocation(line: 104, column: 21, scope: !220)
!222 = !DILocation(line: 104, column: 26, scope: !220)
!223 = !DILocation(line: 104, column: 35, scope: !220)
!224 = !DILocation(line: 105, column: 17, scope: !220)
!225 = !DILocation(line: 106, column: 24, scope: !209)
!226 = !DILocation(line: 106, column: 17, scope: !209)
!227 = !DILocation(line: 107, column: 13, scope: !209)
!228 = !DILocation(line: 108, column: 9, scope: !201)
!229 = !DILocation(line: 110, column: 64, scope: !181)
!230 = !DILocation(line: 110, column: 5, scope: !181)
!231 = !DILocation(line: 111, column: 1, scope: !181)
!232 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_64_good", scope: !45, file: !45, line: 113, type: !56, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!233 = !DILocation(line: 115, column: 5, scope: !232)
!234 = !DILocation(line: 116, column: 5, scope: !232)
!235 = !DILocation(line: 117, column: 1, scope: !232)
!236 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_64b_badSink", scope: !49, file: !49, line: 34, type: !237, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!237 = !DISubroutineType(types: !238)
!238 = !{null, !22}
!239 = !DILocalVariable(name: "dataVoidPtr", arg: 1, scope: !236, file: !49, line: 34, type: !22)
!240 = !DILocation(line: 34, column: 68, scope: !236)
!241 = !DILocalVariable(name: "dataPtr", scope: !236, file: !49, line: 37, type: !41)
!242 = !DILocation(line: 37, column: 14, scope: !236)
!243 = !DILocation(line: 37, column: 34, scope: !236)
!244 = !DILocation(line: 37, column: 24, scope: !236)
!245 = !DILocalVariable(name: "data", scope: !236, file: !49, line: 39, type: !42)
!246 = !DILocation(line: 39, column: 12, scope: !236)
!247 = !DILocation(line: 39, column: 21, scope: !236)
!248 = !DILocation(line: 39, column: 20, scope: !236)
!249 = !DILocalVariable(name: "i", scope: !250, file: !49, line: 41, type: !23)
!250 = distinct !DILexicalBlock(scope: !236, file: !49, line: 40, column: 5)
!251 = !DILocation(line: 41, column: 13, scope: !250)
!252 = !DILocalVariable(name: "n", scope: !250, file: !49, line: 41, type: !23)
!253 = !DILocation(line: 41, column: 16, scope: !250)
!254 = !DILocalVariable(name: "intVariable", scope: !250, file: !49, line: 41, type: !23)
!255 = !DILocation(line: 41, column: 19, scope: !250)
!256 = !DILocation(line: 42, column: 20, scope: !257)
!257 = distinct !DILexicalBlock(scope: !250, file: !49, line: 42, column: 13)
!258 = !DILocation(line: 42, column: 13, scope: !257)
!259 = !DILocation(line: 42, column: 36, scope: !257)
!260 = !DILocation(line: 42, column: 13, scope: !250)
!261 = !DILocation(line: 45, column: 25, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !49, line: 43, column: 9)
!263 = !DILocation(line: 46, column: 20, scope: !264)
!264 = distinct !DILexicalBlock(scope: !262, file: !49, line: 46, column: 13)
!265 = !DILocation(line: 46, column: 18, scope: !264)
!266 = !DILocation(line: 46, column: 25, scope: !267)
!267 = distinct !DILexicalBlock(scope: !264, file: !49, line: 46, column: 13)
!268 = !DILocation(line: 46, column: 29, scope: !267)
!269 = !DILocation(line: 46, column: 27, scope: !267)
!270 = !DILocation(line: 46, column: 13, scope: !264)
!271 = !DILocation(line: 49, column: 28, scope: !272)
!272 = distinct !DILexicalBlock(scope: !267, file: !49, line: 47, column: 13)
!273 = !DILocation(line: 50, column: 13, scope: !272)
!274 = !DILocation(line: 46, column: 33, scope: !267)
!275 = !DILocation(line: 46, column: 13, scope: !267)
!276 = distinct !{!276, !270, !277, !278}
!277 = !DILocation(line: 50, column: 13, scope: !264)
!278 = !{!"llvm.loop.mustprogress"}
!279 = !DILocation(line: 51, column: 26, scope: !262)
!280 = !DILocation(line: 51, column: 13, scope: !262)
!281 = !DILocation(line: 52, column: 9, scope: !262)
!282 = !DILocation(line: 54, column: 1, scope: !236)
!283 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_64b_goodG2BSink", scope: !49, file: !49, line: 61, type: !237, scopeLine: 62, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!284 = !DILocalVariable(name: "dataVoidPtr", arg: 1, scope: !283, file: !49, line: 61, type: !22)
!285 = !DILocation(line: 61, column: 72, scope: !283)
!286 = !DILocalVariable(name: "dataPtr", scope: !283, file: !49, line: 64, type: !41)
!287 = !DILocation(line: 64, column: 14, scope: !283)
!288 = !DILocation(line: 64, column: 34, scope: !283)
!289 = !DILocation(line: 64, column: 24, scope: !283)
!290 = !DILocalVariable(name: "data", scope: !283, file: !49, line: 66, type: !42)
!291 = !DILocation(line: 66, column: 12, scope: !283)
!292 = !DILocation(line: 66, column: 21, scope: !283)
!293 = !DILocation(line: 66, column: 20, scope: !283)
!294 = !DILocalVariable(name: "i", scope: !295, file: !49, line: 68, type: !23)
!295 = distinct !DILexicalBlock(scope: !283, file: !49, line: 67, column: 5)
!296 = !DILocation(line: 68, column: 13, scope: !295)
!297 = !DILocalVariable(name: "n", scope: !295, file: !49, line: 68, type: !23)
!298 = !DILocation(line: 68, column: 16, scope: !295)
!299 = !DILocalVariable(name: "intVariable", scope: !295, file: !49, line: 68, type: !23)
!300 = !DILocation(line: 68, column: 19, scope: !295)
!301 = !DILocation(line: 69, column: 20, scope: !302)
!302 = distinct !DILexicalBlock(scope: !295, file: !49, line: 69, column: 13)
!303 = !DILocation(line: 69, column: 13, scope: !302)
!304 = !DILocation(line: 69, column: 36, scope: !302)
!305 = !DILocation(line: 69, column: 13, scope: !295)
!306 = !DILocation(line: 72, column: 25, scope: !307)
!307 = distinct !DILexicalBlock(scope: !302, file: !49, line: 70, column: 9)
!308 = !DILocation(line: 73, column: 20, scope: !309)
!309 = distinct !DILexicalBlock(scope: !307, file: !49, line: 73, column: 13)
!310 = !DILocation(line: 73, column: 18, scope: !309)
!311 = !DILocation(line: 73, column: 25, scope: !312)
!312 = distinct !DILexicalBlock(scope: !309, file: !49, line: 73, column: 13)
!313 = !DILocation(line: 73, column: 29, scope: !312)
!314 = !DILocation(line: 73, column: 27, scope: !312)
!315 = !DILocation(line: 73, column: 13, scope: !309)
!316 = !DILocation(line: 76, column: 28, scope: !317)
!317 = distinct !DILexicalBlock(scope: !312, file: !49, line: 74, column: 13)
!318 = !DILocation(line: 77, column: 13, scope: !317)
!319 = !DILocation(line: 73, column: 33, scope: !312)
!320 = !DILocation(line: 73, column: 13, scope: !312)
!321 = distinct !{!321, !315, !322, !278}
!322 = !DILocation(line: 77, column: 13, scope: !309)
!323 = !DILocation(line: 78, column: 26, scope: !307)
!324 = !DILocation(line: 78, column: 13, scope: !307)
!325 = !DILocation(line: 79, column: 9, scope: !307)
!326 = !DILocation(line: 81, column: 1, scope: !283)
!327 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_64b_goodB2GSink", scope: !49, file: !49, line: 84, type: !237, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!328 = !DILocalVariable(name: "dataVoidPtr", arg: 1, scope: !327, file: !49, line: 84, type: !22)
!329 = !DILocation(line: 84, column: 72, scope: !327)
!330 = !DILocalVariable(name: "dataPtr", scope: !327, file: !49, line: 87, type: !41)
!331 = !DILocation(line: 87, column: 14, scope: !327)
!332 = !DILocation(line: 87, column: 34, scope: !327)
!333 = !DILocation(line: 87, column: 24, scope: !327)
!334 = !DILocalVariable(name: "data", scope: !327, file: !49, line: 89, type: !42)
!335 = !DILocation(line: 89, column: 12, scope: !327)
!336 = !DILocation(line: 89, column: 21, scope: !327)
!337 = !DILocation(line: 89, column: 20, scope: !327)
!338 = !DILocalVariable(name: "i", scope: !339, file: !49, line: 91, type: !23)
!339 = distinct !DILexicalBlock(scope: !327, file: !49, line: 90, column: 5)
!340 = !DILocation(line: 91, column: 13, scope: !339)
!341 = !DILocalVariable(name: "n", scope: !339, file: !49, line: 91, type: !23)
!342 = !DILocation(line: 91, column: 16, scope: !339)
!343 = !DILocalVariable(name: "intVariable", scope: !339, file: !49, line: 91, type: !23)
!344 = !DILocation(line: 91, column: 19, scope: !339)
!345 = !DILocation(line: 92, column: 20, scope: !346)
!346 = distinct !DILexicalBlock(scope: !339, file: !49, line: 92, column: 13)
!347 = !DILocation(line: 92, column: 13, scope: !346)
!348 = !DILocation(line: 92, column: 36, scope: !346)
!349 = !DILocation(line: 92, column: 13, scope: !339)
!350 = !DILocation(line: 95, column: 17, scope: !351)
!351 = distinct !DILexicalBlock(scope: !352, file: !49, line: 95, column: 17)
!352 = distinct !DILexicalBlock(scope: !346, file: !49, line: 93, column: 9)
!353 = !DILocation(line: 95, column: 19, scope: !351)
!354 = !DILocation(line: 95, column: 17, scope: !352)
!355 = !DILocation(line: 97, column: 29, scope: !356)
!356 = distinct !DILexicalBlock(scope: !351, file: !49, line: 96, column: 13)
!357 = !DILocation(line: 98, column: 24, scope: !358)
!358 = distinct !DILexicalBlock(scope: !356, file: !49, line: 98, column: 17)
!359 = !DILocation(line: 98, column: 22, scope: !358)
!360 = !DILocation(line: 98, column: 29, scope: !361)
!361 = distinct !DILexicalBlock(scope: !358, file: !49, line: 98, column: 17)
!362 = !DILocation(line: 98, column: 33, scope: !361)
!363 = !DILocation(line: 98, column: 31, scope: !361)
!364 = !DILocation(line: 98, column: 17, scope: !358)
!365 = !DILocation(line: 101, column: 32, scope: !366)
!366 = distinct !DILexicalBlock(scope: !361, file: !49, line: 99, column: 17)
!367 = !DILocation(line: 102, column: 17, scope: !366)
!368 = !DILocation(line: 98, column: 37, scope: !361)
!369 = !DILocation(line: 98, column: 17, scope: !361)
!370 = distinct !{!370, !364, !371, !278}
!371 = !DILocation(line: 102, column: 17, scope: !358)
!372 = !DILocation(line: 103, column: 30, scope: !356)
!373 = !DILocation(line: 103, column: 17, scope: !356)
!374 = !DILocation(line: 104, column: 13, scope: !356)
!375 = !DILocation(line: 105, column: 9, scope: !352)
!376 = !DILocation(line: 107, column: 1, scope: !327)
!377 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !378, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !42}
!380 = !DILocalVariable(name: "line", arg: 1, scope: !377, file: !3, line: 11, type: !42)
!381 = !DILocation(line: 11, column: 25, scope: !377)
!382 = !DILocation(line: 13, column: 1, scope: !377)
!383 = !DILocation(line: 14, column: 8, scope: !384)
!384 = distinct !DILexicalBlock(scope: !377, file: !3, line: 14, column: 8)
!385 = !DILocation(line: 14, column: 13, scope: !384)
!386 = !DILocation(line: 14, column: 8, scope: !377)
!387 = !DILocation(line: 16, column: 24, scope: !388)
!388 = distinct !DILexicalBlock(scope: !384, file: !3, line: 15, column: 5)
!389 = !DILocation(line: 16, column: 9, scope: !388)
!390 = !DILocation(line: 17, column: 5, scope: !388)
!391 = !DILocation(line: 18, column: 5, scope: !377)
!392 = !DILocation(line: 19, column: 1, scope: !377)
!393 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !378, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!394 = !DILocalVariable(name: "line", arg: 1, scope: !393, file: !3, line: 20, type: !42)
!395 = !DILocation(line: 20, column: 29, scope: !393)
!396 = !DILocation(line: 22, column: 8, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !3, line: 22, column: 8)
!398 = !DILocation(line: 22, column: 13, scope: !397)
!399 = !DILocation(line: 22, column: 8, scope: !393)
!400 = !DILocation(line: 24, column: 24, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 23, column: 5)
!402 = !DILocation(line: 24, column: 9, scope: !401)
!403 = !DILocation(line: 25, column: 5, scope: !401)
!404 = !DILocation(line: 26, column: 1, scope: !393)
!405 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !406, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!406 = !DISubroutineType(types: !407)
!407 = !{null, !408}
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !70, line: 74, baseType: !23)
!410 = !DILocalVariable(name: "line", arg: 1, scope: !405, file: !3, line: 27, type: !408)
!411 = !DILocation(line: 27, column: 29, scope: !405)
!412 = !DILocation(line: 29, column: 8, scope: !413)
!413 = distinct !DILexicalBlock(scope: !405, file: !3, line: 29, column: 8)
!414 = !DILocation(line: 29, column: 13, scope: !413)
!415 = !DILocation(line: 29, column: 8, scope: !405)
!416 = !DILocation(line: 31, column: 27, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !3, line: 30, column: 5)
!418 = !DILocation(line: 31, column: 9, scope: !417)
!419 = !DILocation(line: 32, column: 5, scope: !417)
!420 = !DILocation(line: 33, column: 1, scope: !405)
!421 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !422, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !23}
!424 = !DILocalVariable(name: "intNumber", arg: 1, scope: !421, file: !3, line: 35, type: !23)
!425 = !DILocation(line: 35, column: 24, scope: !421)
!426 = !DILocation(line: 37, column: 20, scope: !421)
!427 = !DILocation(line: 37, column: 5, scope: !421)
!428 = !DILocation(line: 38, column: 1, scope: !421)
!429 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !430, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !432}
!432 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!433 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !429, file: !3, line: 40, type: !432)
!434 = !DILocation(line: 40, column: 28, scope: !429)
!435 = !DILocation(line: 42, column: 21, scope: !429)
!436 = !DILocation(line: 42, column: 5, scope: !429)
!437 = !DILocation(line: 43, column: 1, scope: !429)
!438 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !439, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!439 = !DISubroutineType(types: !440)
!440 = !{null, !441}
!441 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!442 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !438, file: !3, line: 45, type: !441)
!443 = !DILocation(line: 45, column: 28, scope: !438)
!444 = !DILocation(line: 47, column: 20, scope: !438)
!445 = !DILocation(line: 47, column: 5, scope: !438)
!446 = !DILocation(line: 48, column: 1, scope: !438)
!447 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !448, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !104}
!450 = !DILocalVariable(name: "longNumber", arg: 1, scope: !447, file: !3, line: 50, type: !104)
!451 = !DILocation(line: 50, column: 26, scope: !447)
!452 = !DILocation(line: 52, column: 21, scope: !447)
!453 = !DILocation(line: 52, column: 5, scope: !447)
!454 = !DILocation(line: 53, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !456, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !458}
!458 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !459, line: 27, baseType: !460)
!459 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !103, line: 44, baseType: !104)
!461 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !455, file: !3, line: 55, type: !458)
!462 = !DILocation(line: 55, column: 33, scope: !455)
!463 = !DILocation(line: 57, column: 29, scope: !455)
!464 = !DILocation(line: 57, column: 5, scope: !455)
!465 = !DILocation(line: 58, column: 1, scope: !455)
!466 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !467, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !69}
!469 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !466, file: !3, line: 60, type: !69)
!470 = !DILocation(line: 60, column: 29, scope: !466)
!471 = !DILocation(line: 62, column: 21, scope: !466)
!472 = !DILocation(line: 62, column: 5, scope: !466)
!473 = !DILocation(line: 63, column: 1, scope: !466)
!474 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !475, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!475 = !DISubroutineType(types: !476)
!476 = !{null, !43}
!477 = !DILocalVariable(name: "charHex", arg: 1, scope: !474, file: !3, line: 65, type: !43)
!478 = !DILocation(line: 65, column: 29, scope: !474)
!479 = !DILocation(line: 67, column: 22, scope: !474)
!480 = !DILocation(line: 67, column: 5, scope: !474)
!481 = !DILocation(line: 68, column: 1, scope: !474)
!482 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !483, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!483 = !DISubroutineType(types: !484)
!484 = !{null, !409}
!485 = !DILocalVariable(name: "wideChar", arg: 1, scope: !482, file: !3, line: 70, type: !409)
!486 = !DILocation(line: 70, column: 29, scope: !482)
!487 = !DILocalVariable(name: "s", scope: !482, file: !3, line: 74, type: !488)
!488 = !DICompositeType(tag: DW_TAG_array_type, baseType: !409, size: 64, elements: !489)
!489 = !{!490}
!490 = !DISubrange(count: 2)
!491 = !DILocation(line: 74, column: 13, scope: !482)
!492 = !DILocation(line: 75, column: 16, scope: !482)
!493 = !DILocation(line: 75, column: 9, scope: !482)
!494 = !DILocation(line: 75, column: 14, scope: !482)
!495 = !DILocation(line: 76, column: 9, scope: !482)
!496 = !DILocation(line: 76, column: 14, scope: !482)
!497 = !DILocation(line: 77, column: 21, scope: !482)
!498 = !DILocation(line: 77, column: 5, scope: !482)
!499 = !DILocation(line: 78, column: 1, scope: !482)
!500 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !501, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !7}
!503 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !500, file: !3, line: 80, type: !7)
!504 = !DILocation(line: 80, column: 33, scope: !500)
!505 = !DILocation(line: 82, column: 20, scope: !500)
!506 = !DILocation(line: 82, column: 5, scope: !500)
!507 = !DILocation(line: 83, column: 1, scope: !500)
!508 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !509, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!509 = !DISubroutineType(types: !510)
!510 = !{null, !25}
!511 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !508, file: !3, line: 85, type: !25)
!512 = !DILocation(line: 85, column: 45, scope: !508)
!513 = !DILocation(line: 87, column: 22, scope: !508)
!514 = !DILocation(line: 87, column: 5, scope: !508)
!515 = !DILocation(line: 88, column: 1, scope: !508)
!516 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !517, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !519}
!519 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!520 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !516, file: !3, line: 90, type: !519)
!521 = !DILocation(line: 90, column: 29, scope: !516)
!522 = !DILocation(line: 92, column: 20, scope: !516)
!523 = !DILocation(line: 92, column: 5, scope: !516)
!524 = !DILocation(line: 93, column: 1, scope: !516)
!525 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !526, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !528}
!528 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !529, size: 64)
!529 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !530, line: 100, baseType: !531)
!530 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_110/source_code")
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !530, line: 96, size: 64, elements: !532)
!532 = !{!533, !534}
!533 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !531, file: !530, line: 98, baseType: !23, size: 32)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !531, file: !530, line: 99, baseType: !23, size: 32, offset: 32)
!535 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !525, file: !3, line: 95, type: !528)
!536 = !DILocation(line: 95, column: 40, scope: !525)
!537 = !DILocation(line: 97, column: 26, scope: !525)
!538 = !DILocation(line: 97, column: 47, scope: !525)
!539 = !DILocation(line: 97, column: 55, scope: !525)
!540 = !DILocation(line: 97, column: 76, scope: !525)
!541 = !DILocation(line: 97, column: 5, scope: !525)
!542 = !DILocation(line: 98, column: 1, scope: !525)
!543 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !544, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!544 = !DISubroutineType(types: !545)
!545 = !{null, !546, !69}
!546 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!547 = !DILocalVariable(name: "bytes", arg: 1, scope: !543, file: !3, line: 100, type: !546)
!548 = !DILocation(line: 100, column: 38, scope: !543)
!549 = !DILocalVariable(name: "numBytes", arg: 2, scope: !543, file: !3, line: 100, type: !69)
!550 = !DILocation(line: 100, column: 52, scope: !543)
!551 = !DILocalVariable(name: "i", scope: !543, file: !3, line: 102, type: !69)
!552 = !DILocation(line: 102, column: 12, scope: !543)
!553 = !DILocation(line: 103, column: 12, scope: !554)
!554 = distinct !DILexicalBlock(scope: !543, file: !3, line: 103, column: 5)
!555 = !DILocation(line: 103, column: 10, scope: !554)
!556 = !DILocation(line: 103, column: 17, scope: !557)
!557 = distinct !DILexicalBlock(scope: !554, file: !3, line: 103, column: 5)
!558 = !DILocation(line: 103, column: 21, scope: !557)
!559 = !DILocation(line: 103, column: 19, scope: !557)
!560 = !DILocation(line: 103, column: 5, scope: !554)
!561 = !DILocation(line: 105, column: 24, scope: !562)
!562 = distinct !DILexicalBlock(scope: !557, file: !3, line: 104, column: 5)
!563 = !DILocation(line: 105, column: 30, scope: !562)
!564 = !DILocation(line: 105, column: 9, scope: !562)
!565 = !DILocation(line: 106, column: 5, scope: !562)
!566 = !DILocation(line: 103, column: 31, scope: !557)
!567 = !DILocation(line: 103, column: 5, scope: !557)
!568 = distinct !{!568, !560, !569, !278}
!569 = !DILocation(line: 106, column: 5, scope: !554)
!570 = !DILocation(line: 107, column: 5, scope: !543)
!571 = !DILocation(line: 108, column: 1, scope: !543)
!572 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !573, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!573 = !DISubroutineType(types: !574)
!574 = !{!69, !546, !69, !42}
!575 = !DILocalVariable(name: "bytes", arg: 1, scope: !572, file: !3, line: 113, type: !546)
!576 = !DILocation(line: 113, column: 39, scope: !572)
!577 = !DILocalVariable(name: "numBytes", arg: 2, scope: !572, file: !3, line: 113, type: !69)
!578 = !DILocation(line: 113, column: 53, scope: !572)
!579 = !DILocalVariable(name: "hex", arg: 3, scope: !572, file: !3, line: 113, type: !42)
!580 = !DILocation(line: 113, column: 71, scope: !572)
!581 = !DILocalVariable(name: "numWritten", scope: !572, file: !3, line: 115, type: !69)
!582 = !DILocation(line: 115, column: 12, scope: !572)
!583 = !DILocation(line: 121, column: 5, scope: !572)
!584 = !DILocation(line: 121, column: 12, scope: !572)
!585 = !DILocation(line: 121, column: 25, scope: !572)
!586 = !DILocation(line: 121, column: 23, scope: !572)
!587 = !DILocation(line: 121, column: 34, scope: !572)
!588 = !DILocation(line: 121, column: 37, scope: !572)
!589 = !DILocation(line: 121, column: 67, scope: !572)
!590 = !DILocation(line: 121, column: 70, scope: !572)
!591 = !DILocation(line: 0, scope: !572)
!592 = !DILocalVariable(name: "byte", scope: !593, file: !3, line: 123, type: !23)
!593 = distinct !DILexicalBlock(scope: !572, file: !3, line: 122, column: 5)
!594 = !DILocation(line: 123, column: 13, scope: !593)
