; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_TRUE", scope: !2, file: !3, line: 174, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_178/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_41.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_178/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badVaSink", scope: !45, file: !45, line: 34, type: !53, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !42, null}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 34, type: !42)
!56 = !DILocation(line: 34, column: 23, scope: !52)
!57 = !DILocalVariable(name: "args", scope: !58, file: !45, line: 37, type: !59)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 36, column: 5)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !60, line: 52, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !62, line: 32, baseType: !63)
!62 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !45, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 192, elements: !71)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !65, file: !45, line: 37, baseType: !7, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !65, file: !45, line: 37, baseType: !7, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !65, file: !45, line: 37, baseType: !22, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !65, file: !45, line: 37, baseType: !22, size: 64, offset: 128)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DILocation(line: 37, column: 17, scope: !58)
!74 = !DILocation(line: 38, column: 9, scope: !58)
!75 = !DILocation(line: 40, column: 17, scope: !58)
!76 = !DILocation(line: 40, column: 23, scope: !58)
!77 = !DILocation(line: 40, column: 9, scope: !58)
!78 = !DILocation(line: 41, column: 9, scope: !58)
!79 = !DILocation(line: 43, column: 1, scope: !52)
!80 = distinct !DISubprogram(name: "badSink", scope: !45, file: !45, line: 45, type: !81, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!81 = !DISubroutineType(types: !82)
!82 = !{null, !42}
!83 = !DILocalVariable(name: "data", arg: 1, scope: !80, file: !45, line: 45, type: !42)
!84 = !DILocation(line: 45, column: 21, scope: !80)
!85 = !DILocation(line: 47, column: 15, scope: !80)
!86 = !DILocation(line: 47, column: 21, scope: !80)
!87 = !DILocation(line: 47, column: 5, scope: !80)
!88 = !DILocation(line: 48, column: 1, scope: !80)
!89 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_41_bad", scope: !45, file: !45, line: 50, type: !90, scopeLine: 51, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!90 = !DISubroutineType(types: !91)
!91 = !{null}
!92 = !DILocalVariable(name: "data", scope: !89, file: !45, line: 52, type: !42)
!93 = !DILocation(line: 52, column: 12, scope: !89)
!94 = !DILocalVariable(name: "dataBuffer", scope: !89, file: !45, line: 53, type: !95)
!95 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !96)
!96 = !{!97}
!97 = !DISubrange(count: 100)
!98 = !DILocation(line: 53, column: 10, scope: !89)
!99 = !DILocation(line: 54, column: 12, scope: !89)
!100 = !DILocation(line: 54, column: 10, scope: !89)
!101 = !DILocalVariable(name: "dataLen", scope: !102, file: !45, line: 57, type: !103)
!102 = distinct !DILexicalBlock(scope: !89, file: !45, line: 55, column: 5)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DILocation(line: 57, column: 16, scope: !102)
!107 = !DILocation(line: 57, column: 33, scope: !102)
!108 = !DILocation(line: 57, column: 26, scope: !102)
!109 = !DILocalVariable(name: "pFile", scope: !102, file: !45, line: 58, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !112, line: 7, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !114, line: 49, size: 1728, elements: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !131, !133, !134, !135, !139, !140, !142, !144, !147, !149, !152, !155, !156, !157, !158, !159}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !113, file: !114, line: 51, baseType: !23, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !113, file: !114, line: 54, baseType: !42, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !113, file: !114, line: 55, baseType: !42, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !113, file: !114, line: 56, baseType: !42, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !113, file: !114, line: 57, baseType: !42, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !113, file: !114, line: 58, baseType: !42, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !113, file: !114, line: 59, baseType: !42, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !113, file: !114, line: 60, baseType: !42, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !113, file: !114, line: 61, baseType: !42, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !113, file: !114, line: 64, baseType: !42, size: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !113, file: !114, line: 65, baseType: !42, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !113, file: !114, line: 66, baseType: !42, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !113, file: !114, line: 68, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !114, line: 36, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !113, file: !114, line: 70, baseType: !132, size: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !113, file: !114, line: 72, baseType: !23, size: 32, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !113, file: !114, line: 73, baseType: !23, size: 32, offset: 928)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !113, file: !114, line: 74, baseType: !136, size: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !137, line: 152, baseType: !138)
!137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!138 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !113, file: !114, line: 77, baseType: !24, size: 16, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !113, file: !114, line: 78, baseType: !141, size: 8, offset: 1040)
!141 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !113, file: !114, line: 79, baseType: !143, size: 8, offset: 1048)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !71)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !113, file: !114, line: 81, baseType: !145, size: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !114, line: 43, baseType: null)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !113, file: !114, line: 89, baseType: !148, size: 64, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !137, line: 153, baseType: !138)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !113, file: !114, line: 91, baseType: !150, size: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !114, line: 37, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !113, file: !114, line: 92, baseType: !153, size: 64, offset: 1280)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !114, line: 38, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !113, file: !114, line: 93, baseType: !132, size: 64, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !113, file: !114, line: 94, baseType: !22, size: 64, offset: 1408)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !113, file: !114, line: 95, baseType: !103, size: 64, offset: 1472)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !113, file: !114, line: 96, baseType: !23, size: 32, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !113, file: !114, line: 98, baseType: !160, size: 160, offset: 1568)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 20)
!163 = !DILocation(line: 58, column: 16, scope: !102)
!164 = !DILocation(line: 60, column: 17, scope: !165)
!165 = distinct !DILexicalBlock(scope: !102, file: !45, line: 60, column: 13)
!166 = !DILocation(line: 60, column: 16, scope: !165)
!167 = !DILocation(line: 60, column: 25, scope: !165)
!168 = !DILocation(line: 60, column: 13, scope: !102)
!169 = !DILocation(line: 62, column: 21, scope: !170)
!170 = distinct !DILexicalBlock(scope: !165, file: !45, line: 61, column: 9)
!171 = !DILocation(line: 62, column: 19, scope: !170)
!172 = !DILocation(line: 63, column: 17, scope: !173)
!173 = distinct !DILexicalBlock(scope: !170, file: !45, line: 63, column: 17)
!174 = !DILocation(line: 63, column: 23, scope: !173)
!175 = !DILocation(line: 63, column: 17, scope: !170)
!176 = !DILocation(line: 66, column: 27, scope: !177)
!177 = distinct !DILexicalBlock(scope: !178, file: !45, line: 66, column: 21)
!178 = distinct !DILexicalBlock(scope: !173, file: !45, line: 64, column: 13)
!179 = !DILocation(line: 66, column: 32, scope: !177)
!180 = !DILocation(line: 66, column: 31, scope: !177)
!181 = !DILocation(line: 66, column: 51, scope: !177)
!182 = !DILocation(line: 66, column: 50, scope: !177)
!183 = !DILocation(line: 66, column: 41, scope: !177)
!184 = !DILocation(line: 66, column: 61, scope: !177)
!185 = !DILocation(line: 66, column: 21, scope: !177)
!186 = !DILocation(line: 66, column: 68, scope: !177)
!187 = !DILocation(line: 66, column: 21, scope: !178)
!188 = !DILocation(line: 68, column: 21, scope: !189)
!189 = distinct !DILexicalBlock(scope: !177, file: !45, line: 67, column: 17)
!190 = !DILocation(line: 70, column: 21, scope: !189)
!191 = !DILocation(line: 70, column: 26, scope: !189)
!192 = !DILocation(line: 70, column: 35, scope: !189)
!193 = !DILocation(line: 71, column: 17, scope: !189)
!194 = !DILocation(line: 72, column: 24, scope: !178)
!195 = !DILocation(line: 72, column: 17, scope: !178)
!196 = !DILocation(line: 73, column: 13, scope: !178)
!197 = !DILocation(line: 74, column: 9, scope: !170)
!198 = !DILocation(line: 76, column: 13, scope: !89)
!199 = !DILocation(line: 76, column: 5, scope: !89)
!200 = !DILocation(line: 77, column: 1, scope: !89)
!201 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !45, file: !45, line: 84, type: !53, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!202 = !DILocalVariable(name: "data", arg: 1, scope: !201, file: !45, line: 84, type: !42)
!203 = !DILocation(line: 84, column: 27, scope: !201)
!204 = !DILocalVariable(name: "args", scope: !205, file: !45, line: 87, type: !59)
!205 = distinct !DILexicalBlock(scope: !201, file: !45, line: 86, column: 5)
!206 = !DILocation(line: 87, column: 17, scope: !205)
!207 = !DILocation(line: 88, column: 9, scope: !205)
!208 = !DILocation(line: 90, column: 17, scope: !205)
!209 = !DILocation(line: 90, column: 23, scope: !205)
!210 = !DILocation(line: 90, column: 9, scope: !205)
!211 = !DILocation(line: 91, column: 9, scope: !205)
!212 = !DILocation(line: 93, column: 1, scope: !201)
!213 = distinct !DISubprogram(name: "goodG2BSink", scope: !45, file: !45, line: 95, type: !81, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!214 = !DILocalVariable(name: "data", arg: 1, scope: !213, file: !45, line: 95, type: !42)
!215 = !DILocation(line: 95, column: 25, scope: !213)
!216 = !DILocation(line: 97, column: 19, scope: !213)
!217 = !DILocation(line: 97, column: 25, scope: !213)
!218 = !DILocation(line: 97, column: 5, scope: !213)
!219 = !DILocation(line: 98, column: 1, scope: !213)
!220 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 100, type: !90, scopeLine: 101, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!221 = !DILocalVariable(name: "data", scope: !220, file: !45, line: 102, type: !42)
!222 = !DILocation(line: 102, column: 12, scope: !220)
!223 = !DILocalVariable(name: "dataBuffer", scope: !220, file: !45, line: 103, type: !95)
!224 = !DILocation(line: 103, column: 10, scope: !220)
!225 = !DILocation(line: 104, column: 12, scope: !220)
!226 = !DILocation(line: 104, column: 10, scope: !220)
!227 = !DILocation(line: 106, column: 12, scope: !220)
!228 = !DILocation(line: 106, column: 5, scope: !220)
!229 = !DILocation(line: 107, column: 17, scope: !220)
!230 = !DILocation(line: 107, column: 5, scope: !220)
!231 = !DILocation(line: 108, column: 1, scope: !220)
!232 = distinct !DISubprogram(name: "goodB2GVaSink", scope: !45, file: !45, line: 111, type: !53, scopeLine: 112, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!233 = !DILocalVariable(name: "data", arg: 1, scope: !232, file: !45, line: 111, type: !42)
!234 = !DILocation(line: 111, column: 27, scope: !232)
!235 = !DILocalVariable(name: "args", scope: !236, file: !45, line: 114, type: !59)
!236 = distinct !DILexicalBlock(scope: !232, file: !45, line: 113, column: 5)
!237 = !DILocation(line: 114, column: 17, scope: !236)
!238 = !DILocation(line: 115, column: 9, scope: !236)
!239 = !DILocation(line: 117, column: 23, scope: !236)
!240 = !DILocation(line: 117, column: 9, scope: !236)
!241 = !DILocation(line: 118, column: 9, scope: !236)
!242 = !DILocation(line: 120, column: 1, scope: !232)
!243 = distinct !DISubprogram(name: "goodB2GSink", scope: !45, file: !45, line: 122, type: !81, scopeLine: 123, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!244 = !DILocalVariable(name: "data", arg: 1, scope: !243, file: !45, line: 122, type: !42)
!245 = !DILocation(line: 122, column: 25, scope: !243)
!246 = !DILocation(line: 124, column: 19, scope: !243)
!247 = !DILocation(line: 124, column: 25, scope: !243)
!248 = !DILocation(line: 124, column: 5, scope: !243)
!249 = !DILocation(line: 125, column: 1, scope: !243)
!250 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 127, type: !90, scopeLine: 128, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!251 = !DILocalVariable(name: "data", scope: !250, file: !45, line: 129, type: !42)
!252 = !DILocation(line: 129, column: 12, scope: !250)
!253 = !DILocalVariable(name: "dataBuffer", scope: !250, file: !45, line: 130, type: !95)
!254 = !DILocation(line: 130, column: 10, scope: !250)
!255 = !DILocation(line: 131, column: 12, scope: !250)
!256 = !DILocation(line: 131, column: 10, scope: !250)
!257 = !DILocalVariable(name: "dataLen", scope: !258, file: !45, line: 134, type: !103)
!258 = distinct !DILexicalBlock(scope: !250, file: !45, line: 132, column: 5)
!259 = !DILocation(line: 134, column: 16, scope: !258)
!260 = !DILocation(line: 134, column: 33, scope: !258)
!261 = !DILocation(line: 134, column: 26, scope: !258)
!262 = !DILocalVariable(name: "pFile", scope: !258, file: !45, line: 135, type: !110)
!263 = !DILocation(line: 135, column: 16, scope: !258)
!264 = !DILocation(line: 137, column: 17, scope: !265)
!265 = distinct !DILexicalBlock(scope: !258, file: !45, line: 137, column: 13)
!266 = !DILocation(line: 137, column: 16, scope: !265)
!267 = !DILocation(line: 137, column: 25, scope: !265)
!268 = !DILocation(line: 137, column: 13, scope: !258)
!269 = !DILocation(line: 139, column: 21, scope: !270)
!270 = distinct !DILexicalBlock(scope: !265, file: !45, line: 138, column: 9)
!271 = !DILocation(line: 139, column: 19, scope: !270)
!272 = !DILocation(line: 140, column: 17, scope: !273)
!273 = distinct !DILexicalBlock(scope: !270, file: !45, line: 140, column: 17)
!274 = !DILocation(line: 140, column: 23, scope: !273)
!275 = !DILocation(line: 140, column: 17, scope: !270)
!276 = !DILocation(line: 143, column: 27, scope: !277)
!277 = distinct !DILexicalBlock(scope: !278, file: !45, line: 143, column: 21)
!278 = distinct !DILexicalBlock(scope: !273, file: !45, line: 141, column: 13)
!279 = !DILocation(line: 143, column: 32, scope: !277)
!280 = !DILocation(line: 143, column: 31, scope: !277)
!281 = !DILocation(line: 143, column: 51, scope: !277)
!282 = !DILocation(line: 143, column: 50, scope: !277)
!283 = !DILocation(line: 143, column: 41, scope: !277)
!284 = !DILocation(line: 143, column: 61, scope: !277)
!285 = !DILocation(line: 143, column: 21, scope: !277)
!286 = !DILocation(line: 143, column: 68, scope: !277)
!287 = !DILocation(line: 143, column: 21, scope: !278)
!288 = !DILocation(line: 145, column: 21, scope: !289)
!289 = distinct !DILexicalBlock(scope: !277, file: !45, line: 144, column: 17)
!290 = !DILocation(line: 147, column: 21, scope: !289)
!291 = !DILocation(line: 147, column: 26, scope: !289)
!292 = !DILocation(line: 147, column: 35, scope: !289)
!293 = !DILocation(line: 148, column: 17, scope: !289)
!294 = !DILocation(line: 149, column: 24, scope: !278)
!295 = !DILocation(line: 149, column: 17, scope: !278)
!296 = !DILocation(line: 150, column: 13, scope: !278)
!297 = !DILocation(line: 151, column: 9, scope: !270)
!298 = !DILocation(line: 153, column: 17, scope: !250)
!299 = !DILocation(line: 153, column: 5, scope: !250)
!300 = !DILocation(line: 154, column: 1, scope: !250)
!301 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_41_good", scope: !45, file: !45, line: 156, type: !90, scopeLine: 157, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!302 = !DILocation(line: 158, column: 5, scope: !301)
!303 = !DILocation(line: 159, column: 5, scope: !301)
!304 = !DILocation(line: 160, column: 1, scope: !301)
!305 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !81, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!306 = !DILocalVariable(name: "line", arg: 1, scope: !305, file: !3, line: 11, type: !42)
!307 = !DILocation(line: 11, column: 25, scope: !305)
!308 = !DILocation(line: 13, column: 1, scope: !305)
!309 = !DILocation(line: 14, column: 8, scope: !310)
!310 = distinct !DILexicalBlock(scope: !305, file: !3, line: 14, column: 8)
!311 = !DILocation(line: 14, column: 13, scope: !310)
!312 = !DILocation(line: 14, column: 8, scope: !305)
!313 = !DILocation(line: 16, column: 24, scope: !314)
!314 = distinct !DILexicalBlock(scope: !310, file: !3, line: 15, column: 5)
!315 = !DILocation(line: 16, column: 9, scope: !314)
!316 = !DILocation(line: 17, column: 5, scope: !314)
!317 = !DILocation(line: 18, column: 5, scope: !305)
!318 = !DILocation(line: 19, column: 1, scope: !305)
!319 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !81, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!320 = !DILocalVariable(name: "line", arg: 1, scope: !319, file: !3, line: 20, type: !42)
!321 = !DILocation(line: 20, column: 29, scope: !319)
!322 = !DILocation(line: 22, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !3, line: 22, column: 8)
!324 = !DILocation(line: 22, column: 13, scope: !323)
!325 = !DILocation(line: 22, column: 8, scope: !319)
!326 = !DILocation(line: 24, column: 24, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !3, line: 23, column: 5)
!328 = !DILocation(line: 24, column: 9, scope: !327)
!329 = !DILocation(line: 25, column: 5, scope: !327)
!330 = !DILocation(line: 26, column: 1, scope: !319)
!331 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !332, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!332 = !DISubroutineType(types: !333)
!333 = !{null, !334}
!334 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !335, size: 64)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !104, line: 74, baseType: !23)
!336 = !DILocalVariable(name: "line", arg: 1, scope: !331, file: !3, line: 27, type: !334)
!337 = !DILocation(line: 27, column: 29, scope: !331)
!338 = !DILocation(line: 29, column: 8, scope: !339)
!339 = distinct !DILexicalBlock(scope: !331, file: !3, line: 29, column: 8)
!340 = !DILocation(line: 29, column: 13, scope: !339)
!341 = !DILocation(line: 29, column: 8, scope: !331)
!342 = !DILocation(line: 31, column: 27, scope: !343)
!343 = distinct !DILexicalBlock(scope: !339, file: !3, line: 30, column: 5)
!344 = !DILocation(line: 31, column: 9, scope: !343)
!345 = !DILocation(line: 32, column: 5, scope: !343)
!346 = !DILocation(line: 33, column: 1, scope: !331)
!347 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !348, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!348 = !DISubroutineType(types: !349)
!349 = !{null, !23}
!350 = !DILocalVariable(name: "intNumber", arg: 1, scope: !347, file: !3, line: 35, type: !23)
!351 = !DILocation(line: 35, column: 24, scope: !347)
!352 = !DILocation(line: 37, column: 20, scope: !347)
!353 = !DILocation(line: 37, column: 5, scope: !347)
!354 = !DILocation(line: 38, column: 1, scope: !347)
!355 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !356, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !358}
!358 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!359 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !355, file: !3, line: 40, type: !358)
!360 = !DILocation(line: 40, column: 28, scope: !355)
!361 = !DILocation(line: 42, column: 21, scope: !355)
!362 = !DILocation(line: 42, column: 5, scope: !355)
!363 = !DILocation(line: 43, column: 1, scope: !355)
!364 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !365, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367}
!367 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!368 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !364, file: !3, line: 45, type: !367)
!369 = !DILocation(line: 45, column: 28, scope: !364)
!370 = !DILocation(line: 47, column: 20, scope: !364)
!371 = !DILocation(line: 47, column: 5, scope: !364)
!372 = !DILocation(line: 48, column: 1, scope: !364)
!373 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !374, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!374 = !DISubroutineType(types: !375)
!375 = !{null, !138}
!376 = !DILocalVariable(name: "longNumber", arg: 1, scope: !373, file: !3, line: 50, type: !138)
!377 = !DILocation(line: 50, column: 26, scope: !373)
!378 = !DILocation(line: 52, column: 21, scope: !373)
!379 = !DILocation(line: 52, column: 5, scope: !373)
!380 = !DILocation(line: 53, column: 1, scope: !373)
!381 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !382, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !384}
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !385, line: 27, baseType: !386)
!385 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!386 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !137, line: 44, baseType: !138)
!387 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !381, file: !3, line: 55, type: !384)
!388 = !DILocation(line: 55, column: 33, scope: !381)
!389 = !DILocation(line: 57, column: 29, scope: !381)
!390 = !DILocation(line: 57, column: 5, scope: !381)
!391 = !DILocation(line: 58, column: 1, scope: !381)
!392 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !393, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !103}
!395 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !392, file: !3, line: 60, type: !103)
!396 = !DILocation(line: 60, column: 29, scope: !392)
!397 = !DILocation(line: 62, column: 21, scope: !392)
!398 = !DILocation(line: 62, column: 5, scope: !392)
!399 = !DILocation(line: 63, column: 1, scope: !392)
!400 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !401, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !43}
!403 = !DILocalVariable(name: "charHex", arg: 1, scope: !400, file: !3, line: 65, type: !43)
!404 = !DILocation(line: 65, column: 29, scope: !400)
!405 = !DILocation(line: 67, column: 22, scope: !400)
!406 = !DILocation(line: 67, column: 5, scope: !400)
!407 = !DILocation(line: 68, column: 1, scope: !400)
!408 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !409, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !335}
!411 = !DILocalVariable(name: "wideChar", arg: 1, scope: !408, file: !3, line: 70, type: !335)
!412 = !DILocation(line: 70, column: 29, scope: !408)
!413 = !DILocalVariable(name: "s", scope: !408, file: !3, line: 74, type: !414)
!414 = !DICompositeType(tag: DW_TAG_array_type, baseType: !335, size: 64, elements: !415)
!415 = !{!416}
!416 = !DISubrange(count: 2)
!417 = !DILocation(line: 74, column: 13, scope: !408)
!418 = !DILocation(line: 75, column: 16, scope: !408)
!419 = !DILocation(line: 75, column: 9, scope: !408)
!420 = !DILocation(line: 75, column: 14, scope: !408)
!421 = !DILocation(line: 76, column: 9, scope: !408)
!422 = !DILocation(line: 76, column: 14, scope: !408)
!423 = !DILocation(line: 77, column: 21, scope: !408)
!424 = !DILocation(line: 77, column: 5, scope: !408)
!425 = !DILocation(line: 78, column: 1, scope: !408)
!426 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !427, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !7}
!429 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !426, file: !3, line: 80, type: !7)
!430 = !DILocation(line: 80, column: 33, scope: !426)
!431 = !DILocation(line: 82, column: 20, scope: !426)
!432 = !DILocation(line: 82, column: 5, scope: !426)
!433 = !DILocation(line: 83, column: 1, scope: !426)
!434 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !435, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !25}
!437 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !434, file: !3, line: 85, type: !25)
!438 = !DILocation(line: 85, column: 45, scope: !434)
!439 = !DILocation(line: 87, column: 22, scope: !434)
!440 = !DILocation(line: 87, column: 5, scope: !434)
!441 = !DILocation(line: 88, column: 1, scope: !434)
!442 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !443, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !445}
!445 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!446 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !442, file: !3, line: 90, type: !445)
!447 = !DILocation(line: 90, column: 29, scope: !442)
!448 = !DILocation(line: 92, column: 20, scope: !442)
!449 = !DILocation(line: 92, column: 5, scope: !442)
!450 = !DILocation(line: 93, column: 1, scope: !442)
!451 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !452, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !454}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !455, size: 64)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !456, line: 100, baseType: !457)
!456 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_178/source_code")
!457 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !456, line: 96, size: 64, elements: !458)
!458 = !{!459, !460}
!459 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !457, file: !456, line: 98, baseType: !23, size: 32)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !457, file: !456, line: 99, baseType: !23, size: 32, offset: 32)
!461 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !451, file: !3, line: 95, type: !454)
!462 = !DILocation(line: 95, column: 40, scope: !451)
!463 = !DILocation(line: 97, column: 26, scope: !451)
!464 = !DILocation(line: 97, column: 47, scope: !451)
!465 = !DILocation(line: 97, column: 55, scope: !451)
!466 = !DILocation(line: 97, column: 76, scope: !451)
!467 = !DILocation(line: 97, column: 5, scope: !451)
!468 = !DILocation(line: 98, column: 1, scope: !451)
!469 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !470, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!470 = !DISubroutineType(types: !471)
!471 = !{null, !472, !103}
!472 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!473 = !DILocalVariable(name: "bytes", arg: 1, scope: !469, file: !3, line: 100, type: !472)
!474 = !DILocation(line: 100, column: 38, scope: !469)
!475 = !DILocalVariable(name: "numBytes", arg: 2, scope: !469, file: !3, line: 100, type: !103)
!476 = !DILocation(line: 100, column: 52, scope: !469)
!477 = !DILocalVariable(name: "i", scope: !469, file: !3, line: 102, type: !103)
!478 = !DILocation(line: 102, column: 12, scope: !469)
!479 = !DILocation(line: 103, column: 12, scope: !480)
!480 = distinct !DILexicalBlock(scope: !469, file: !3, line: 103, column: 5)
!481 = !DILocation(line: 103, column: 10, scope: !480)
!482 = !DILocation(line: 103, column: 17, scope: !483)
!483 = distinct !DILexicalBlock(scope: !480, file: !3, line: 103, column: 5)
!484 = !DILocation(line: 103, column: 21, scope: !483)
!485 = !DILocation(line: 103, column: 19, scope: !483)
!486 = !DILocation(line: 103, column: 5, scope: !480)
!487 = !DILocation(line: 105, column: 24, scope: !488)
!488 = distinct !DILexicalBlock(scope: !483, file: !3, line: 104, column: 5)
!489 = !DILocation(line: 105, column: 30, scope: !488)
!490 = !DILocation(line: 105, column: 9, scope: !488)
!491 = !DILocation(line: 106, column: 5, scope: !488)
!492 = !DILocation(line: 103, column: 31, scope: !483)
!493 = !DILocation(line: 103, column: 5, scope: !483)
!494 = distinct !{!494, !486, !495, !496}
!495 = !DILocation(line: 106, column: 5, scope: !480)
!496 = !{!"llvm.loop.mustprogress"}
!497 = !DILocation(line: 107, column: 5, scope: !469)
!498 = !DILocation(line: 108, column: 1, scope: !469)
!499 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !500, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!500 = !DISubroutineType(types: !501)
!501 = !{!103, !472, !103, !42}
!502 = !DILocalVariable(name: "bytes", arg: 1, scope: !499, file: !3, line: 113, type: !472)
!503 = !DILocation(line: 113, column: 39, scope: !499)
!504 = !DILocalVariable(name: "numBytes", arg: 2, scope: !499, file: !3, line: 113, type: !103)
!505 = !DILocation(line: 113, column: 53, scope: !499)
!506 = !DILocalVariable(name: "hex", arg: 3, scope: !499, file: !3, line: 113, type: !42)
!507 = !DILocation(line: 113, column: 71, scope: !499)
!508 = !DILocalVariable(name: "numWritten", scope: !499, file: !3, line: 115, type: !103)
!509 = !DILocation(line: 115, column: 12, scope: !499)
!510 = !DILocation(line: 121, column: 5, scope: !499)
!511 = !DILocation(line: 121, column: 12, scope: !499)
!512 = !DILocation(line: 121, column: 25, scope: !499)
!513 = !DILocation(line: 121, column: 23, scope: !499)
!514 = !DILocation(line: 121, column: 34, scope: !499)
!515 = !DILocation(line: 121, column: 37, scope: !499)
!516 = !DILocation(line: 121, column: 67, scope: !499)
!517 = !DILocation(line: 121, column: 70, scope: !499)
!518 = !DILocation(line: 0, scope: !499)
!519 = !DILocalVariable(name: "byte", scope: !520, file: !3, line: 123, type: !23)
!520 = distinct !DILexicalBlock(scope: !499, file: !3, line: 122, column: 5)
