; ModuleID = 'CWE134_Uncontrolled_Format_String__char_file_vprintf_41.c'
source_filename = "CWE134_Uncontrolled_Format_String__char_file_vprintf_41.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badVaSink(i8* %data, ...) #0 !dbg !10 {
entry:
  %data.addr = alloca i8*, align 8
  %args = alloca [1 x %struct.__va_list_tag], align 16
  store i8* %data, i8** %data.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !15, metadata !DIExpression()), !dbg !16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_41.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_178/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "badVaSink", scope: !1, file: !1, line: 34, type: !11, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13, null}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DILocalVariable(name: "data", arg: 1, scope: !10, file: !1, line: 34, type: !13)
!16 = !DILocation(line: 34, column: 23, scope: !10)
!17 = !DILocalVariable(name: "args", scope: !18, file: !1, line: 37, type: !19)
!18 = distinct !DILexicalBlock(scope: !10, file: !1, line: 36, column: 5)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !20, line: 52, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !22, line: 32, baseType: !23)
!22 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, elements: !32)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !26)
!26 = !{!27, !29, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !25, file: !1, line: 37, baseType: !28, size: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !25, file: !1, line: 37, baseType: !28, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !25, file: !1, line: 37, baseType: !4, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !25, file: !1, line: 37, baseType: !4, size: 64, offset: 128)
!32 = !{!33}
!33 = !DISubrange(count: 1)
!34 = !DILocation(line: 37, column: 17, scope: !18)
!35 = !DILocation(line: 38, column: 9, scope: !18)
!36 = !DILocation(line: 40, column: 17, scope: !18)
!37 = !DILocation(line: 40, column: 23, scope: !18)
!38 = !DILocation(line: 40, column: 9, scope: !18)
!39 = !DILocation(line: 41, column: 9, scope: !18)
!40 = !DILocation(line: 43, column: 1, scope: !10)
!41 = distinct !DISubprogram(name: "badSink", scope: !1, file: !1, line: 45, type: !42, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{null, !13}
!44 = !DILocalVariable(name: "data", arg: 1, scope: !41, file: !1, line: 45, type: !13)
!45 = !DILocation(line: 45, column: 21, scope: !41)
!46 = !DILocation(line: 47, column: 15, scope: !41)
!47 = !DILocation(line: 47, column: 21, scope: !41)
!48 = !DILocation(line: 47, column: 5, scope: !41)
!49 = !DILocation(line: 48, column: 1, scope: !41)
!50 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_41_bad", scope: !1, file: !1, line: 50, type: !51, scopeLine: 51, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!51 = !DISubroutineType(types: !52)
!52 = !{null}
!53 = !DILocalVariable(name: "data", scope: !50, file: !1, line: 52, type: !13)
!54 = !DILocation(line: 52, column: 12, scope: !50)
!55 = !DILocalVariable(name: "dataBuffer", scope: !50, file: !1, line: 53, type: !56)
!56 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 800, elements: !57)
!57 = !{!58}
!58 = !DISubrange(count: 100)
!59 = !DILocation(line: 53, column: 10, scope: !50)
!60 = !DILocation(line: 54, column: 12, scope: !50)
!61 = !DILocation(line: 54, column: 10, scope: !50)
!62 = !DILocalVariable(name: "dataLen", scope: !63, file: !1, line: 57, type: !64)
!63 = distinct !DILexicalBlock(scope: !50, file: !1, line: 55, column: 5)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !65, line: 46, baseType: !66)
!65 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!66 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!67 = !DILocation(line: 57, column: 16, scope: !63)
!68 = !DILocation(line: 57, column: 33, scope: !63)
!69 = !DILocation(line: 57, column: 26, scope: !63)
!70 = !DILocalVariable(name: "pFile", scope: !63, file: !1, line: 58, type: !71)
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !73, line: 7, baseType: !74)
!73 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !75, line: 49, size: 1728, elements: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!76 = !{!77, !78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !92, !94, !95, !96, !100, !102, !104, !106, !109, !111, !114, !117, !118, !119, !120, !121}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !74, file: !75, line: 51, baseType: !5, size: 32)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !74, file: !75, line: 54, baseType: !13, size: 64, offset: 64)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !74, file: !75, line: 55, baseType: !13, size: 64, offset: 128)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !74, file: !75, line: 56, baseType: !13, size: 64, offset: 192)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !74, file: !75, line: 57, baseType: !13, size: 64, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !74, file: !75, line: 58, baseType: !13, size: 64, offset: 320)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !74, file: !75, line: 59, baseType: !13, size: 64, offset: 384)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !74, file: !75, line: 60, baseType: !13, size: 64, offset: 448)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !74, file: !75, line: 61, baseType: !13, size: 64, offset: 512)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !74, file: !75, line: 64, baseType: !13, size: 64, offset: 576)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !74, file: !75, line: 65, baseType: !13, size: 64, offset: 640)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !74, file: !75, line: 66, baseType: !13, size: 64, offset: 704)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !74, file: !75, line: 68, baseType: !90, size: 64, offset: 768)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !75, line: 36, flags: DIFlagFwdDecl)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !74, file: !75, line: 70, baseType: !93, size: 64, offset: 832)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !74, file: !75, line: 72, baseType: !5, size: 32, offset: 896)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !74, file: !75, line: 73, baseType: !5, size: 32, offset: 928)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !74, file: !75, line: 74, baseType: !97, size: 64, offset: 960)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !98, line: 152, baseType: !99)
!98 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!99 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !74, file: !75, line: 77, baseType: !101, size: 16, offset: 1024)
!101 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !74, file: !75, line: 78, baseType: !103, size: 8, offset: 1040)
!103 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !74, file: !75, line: 79, baseType: !105, size: 8, offset: 1048)
!105 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !32)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !74, file: !75, line: 81, baseType: !107, size: 64, offset: 1088)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !75, line: 43, baseType: null)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !74, file: !75, line: 89, baseType: !110, size: 64, offset: 1152)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !98, line: 153, baseType: !99)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !74, file: !75, line: 91, baseType: !112, size: 64, offset: 1216)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !75, line: 37, flags: DIFlagFwdDecl)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !74, file: !75, line: 92, baseType: !115, size: 64, offset: 1280)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !75, line: 38, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !74, file: !75, line: 93, baseType: !93, size: 64, offset: 1344)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !74, file: !75, line: 94, baseType: !4, size: 64, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !74, file: !75, line: 95, baseType: !64, size: 64, offset: 1472)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !74, file: !75, line: 96, baseType: !5, size: 32, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !74, file: !75, line: 98, baseType: !122, size: 160, offset: 1568)
!122 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !123)
!123 = !{!124}
!124 = !DISubrange(count: 20)
!125 = !DILocation(line: 58, column: 16, scope: !63)
!126 = !DILocation(line: 60, column: 17, scope: !127)
!127 = distinct !DILexicalBlock(scope: !63, file: !1, line: 60, column: 13)
!128 = !DILocation(line: 60, column: 16, scope: !127)
!129 = !DILocation(line: 60, column: 25, scope: !127)
!130 = !DILocation(line: 60, column: 13, scope: !63)
!131 = !DILocation(line: 62, column: 21, scope: !132)
!132 = distinct !DILexicalBlock(scope: !127, file: !1, line: 61, column: 9)
!133 = !DILocation(line: 62, column: 19, scope: !132)
!134 = !DILocation(line: 63, column: 17, scope: !135)
!135 = distinct !DILexicalBlock(scope: !132, file: !1, line: 63, column: 17)
!136 = !DILocation(line: 63, column: 23, scope: !135)
!137 = !DILocation(line: 63, column: 17, scope: !132)
!138 = !DILocation(line: 66, column: 27, scope: !139)
!139 = distinct !DILexicalBlock(scope: !140, file: !1, line: 66, column: 21)
!140 = distinct !DILexicalBlock(scope: !135, file: !1, line: 64, column: 13)
!141 = !DILocation(line: 66, column: 32, scope: !139)
!142 = !DILocation(line: 66, column: 31, scope: !139)
!143 = !DILocation(line: 66, column: 51, scope: !139)
!144 = !DILocation(line: 66, column: 50, scope: !139)
!145 = !DILocation(line: 66, column: 41, scope: !139)
!146 = !DILocation(line: 66, column: 61, scope: !139)
!147 = !DILocation(line: 66, column: 21, scope: !139)
!148 = !DILocation(line: 66, column: 68, scope: !139)
!149 = !DILocation(line: 66, column: 21, scope: !140)
!150 = !DILocation(line: 68, column: 21, scope: !151)
!151 = distinct !DILexicalBlock(scope: !139, file: !1, line: 67, column: 17)
!152 = !DILocation(line: 70, column: 21, scope: !151)
!153 = !DILocation(line: 70, column: 26, scope: !151)
!154 = !DILocation(line: 70, column: 35, scope: !151)
!155 = !DILocation(line: 71, column: 17, scope: !151)
!156 = !DILocation(line: 72, column: 24, scope: !140)
!157 = !DILocation(line: 72, column: 17, scope: !140)
!158 = !DILocation(line: 73, column: 13, scope: !140)
!159 = !DILocation(line: 74, column: 9, scope: !132)
!160 = !DILocation(line: 76, column: 13, scope: !50)
!161 = !DILocation(line: 76, column: 5, scope: !50)
!162 = !DILocation(line: 77, column: 1, scope: !50)
!163 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !1, file: !1, line: 84, type: !11, scopeLine: 85, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!164 = !DILocalVariable(name: "data", arg: 1, scope: !163, file: !1, line: 84, type: !13)
!165 = !DILocation(line: 84, column: 27, scope: !163)
!166 = !DILocalVariable(name: "args", scope: !167, file: !1, line: 87, type: !19)
!167 = distinct !DILexicalBlock(scope: !163, file: !1, line: 86, column: 5)
!168 = !DILocation(line: 87, column: 17, scope: !167)
!169 = !DILocation(line: 88, column: 9, scope: !167)
!170 = !DILocation(line: 90, column: 17, scope: !167)
!171 = !DILocation(line: 90, column: 23, scope: !167)
!172 = !DILocation(line: 90, column: 9, scope: !167)
!173 = !DILocation(line: 91, column: 9, scope: !167)
!174 = !DILocation(line: 93, column: 1, scope: !163)
!175 = distinct !DISubprogram(name: "goodG2BSink", scope: !1, file: !1, line: 95, type: !42, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!176 = !DILocalVariable(name: "data", arg: 1, scope: !175, file: !1, line: 95, type: !13)
!177 = !DILocation(line: 95, column: 25, scope: !175)
!178 = !DILocation(line: 97, column: 19, scope: !175)
!179 = !DILocation(line: 97, column: 25, scope: !175)
!180 = !DILocation(line: 97, column: 5, scope: !175)
!181 = !DILocation(line: 98, column: 1, scope: !175)
