; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_088/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_15.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_088/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_15_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 45, type: !66)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 43, column: 5)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DILocation(line: 45, column: 16, scope: !65)
!70 = !DILocation(line: 45, column: 33, scope: !65)
!71 = !DILocation(line: 45, column: 26, scope: !65)
!72 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 46, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !102, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 51, baseType: !23, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 54, baseType: !42, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 55, baseType: !42, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 56, baseType: !42, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 57, baseType: !42, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 58, baseType: !42, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 59, baseType: !42, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 60, baseType: !42, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 61, baseType: !42, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 64, baseType: !42, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 65, baseType: !42, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 66, baseType: !42, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 72, baseType: !23, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 73, baseType: !23, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 77, baseType: !24, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 153, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !76, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !77, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !76, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !77, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !76, file: !77, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !76, file: !77, line: 94, baseType: !22, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 95, baseType: !66, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 96, baseType: !23, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocation(line: 46, column: 16, scope: !65)
!129 = !DILocation(line: 48, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !65, file: !45, line: 48, column: 13)
!131 = !DILocation(line: 48, column: 16, scope: !130)
!132 = !DILocation(line: 48, column: 25, scope: !130)
!133 = !DILocation(line: 48, column: 13, scope: !65)
!134 = !DILocation(line: 50, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !45, line: 49, column: 9)
!136 = !DILocation(line: 50, column: 19, scope: !135)
!137 = !DILocation(line: 51, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !45, line: 51, column: 17)
!139 = !DILocation(line: 51, column: 23, scope: !138)
!140 = !DILocation(line: 51, column: 17, scope: !135)
!141 = !DILocation(line: 54, column: 27, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !45, line: 54, column: 21)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 52, column: 13)
!144 = !DILocation(line: 54, column: 32, scope: !142)
!145 = !DILocation(line: 54, column: 31, scope: !142)
!146 = !DILocation(line: 54, column: 51, scope: !142)
!147 = !DILocation(line: 54, column: 50, scope: !142)
!148 = !DILocation(line: 54, column: 41, scope: !142)
!149 = !DILocation(line: 54, column: 61, scope: !142)
!150 = !DILocation(line: 54, column: 21, scope: !142)
!151 = !DILocation(line: 54, column: 68, scope: !142)
!152 = !DILocation(line: 54, column: 21, scope: !143)
!153 = !DILocation(line: 56, column: 21, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !45, line: 55, column: 17)
!155 = !DILocation(line: 58, column: 21, scope: !154)
!156 = !DILocation(line: 58, column: 26, scope: !154)
!157 = !DILocation(line: 58, column: 35, scope: !154)
!158 = !DILocation(line: 59, column: 17, scope: !154)
!159 = !DILocation(line: 60, column: 24, scope: !143)
!160 = !DILocation(line: 60, column: 17, scope: !143)
!161 = !DILocation(line: 61, column: 13, scope: !143)
!162 = !DILocation(line: 62, column: 9, scope: !135)
!163 = !DILocalVariable(name: "i", scope: !164, file: !45, line: 74, type: !23)
!164 = distinct !DILexicalBlock(scope: !52, file: !45, line: 73, column: 5)
!165 = !DILocation(line: 74, column: 13, scope: !164)
!166 = !DILocalVariable(name: "n", scope: !164, file: !45, line: 74, type: !23)
!167 = !DILocation(line: 74, column: 16, scope: !164)
!168 = !DILocalVariable(name: "intVariable", scope: !164, file: !45, line: 74, type: !23)
!169 = !DILocation(line: 74, column: 19, scope: !164)
!170 = !DILocation(line: 75, column: 20, scope: !171)
!171 = distinct !DILexicalBlock(scope: !164, file: !45, line: 75, column: 13)
!172 = !DILocation(line: 75, column: 13, scope: !171)
!173 = !DILocation(line: 75, column: 36, scope: !171)
!174 = !DILocation(line: 75, column: 13, scope: !164)
!175 = !DILocation(line: 78, column: 25, scope: !176)
!176 = distinct !DILexicalBlock(scope: !171, file: !45, line: 76, column: 9)
!177 = !DILocation(line: 79, column: 20, scope: !178)
!178 = distinct !DILexicalBlock(scope: !176, file: !45, line: 79, column: 13)
!179 = !DILocation(line: 79, column: 18, scope: !178)
!180 = !DILocation(line: 79, column: 25, scope: !181)
!181 = distinct !DILexicalBlock(scope: !178, file: !45, line: 79, column: 13)
!182 = !DILocation(line: 79, column: 29, scope: !181)
!183 = !DILocation(line: 79, column: 27, scope: !181)
!184 = !DILocation(line: 79, column: 13, scope: !178)
!185 = !DILocation(line: 82, column: 28, scope: !186)
!186 = distinct !DILexicalBlock(scope: !181, file: !45, line: 80, column: 13)
!187 = !DILocation(line: 83, column: 13, scope: !186)
!188 = !DILocation(line: 79, column: 33, scope: !181)
!189 = !DILocation(line: 79, column: 13, scope: !181)
!190 = distinct !{!190, !184, !191, !192}
!191 = !DILocation(line: 83, column: 13, scope: !178)
!192 = !{!"llvm.loop.mustprogress"}
!193 = !DILocation(line: 84, column: 26, scope: !176)
!194 = !DILocation(line: 84, column: 13, scope: !176)
!195 = !DILocation(line: 85, column: 9, scope: !176)
!196 = !DILocation(line: 93, column: 1, scope: !52)
!197 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 100, type: !53, scopeLine: 101, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!198 = !DILocalVariable(name: "data", scope: !197, file: !45, line: 102, type: !42)
!199 = !DILocation(line: 102, column: 12, scope: !197)
!200 = !DILocalVariable(name: "dataBuffer", scope: !197, file: !45, line: 103, type: !58)
!201 = !DILocation(line: 103, column: 10, scope: !197)
!202 = !DILocation(line: 104, column: 12, scope: !197)
!203 = !DILocation(line: 104, column: 10, scope: !197)
!204 = !DILocalVariable(name: "dataLen", scope: !205, file: !45, line: 110, type: !66)
!205 = distinct !DILexicalBlock(scope: !197, file: !45, line: 108, column: 5)
!206 = !DILocation(line: 110, column: 16, scope: !205)
!207 = !DILocation(line: 110, column: 33, scope: !205)
!208 = !DILocation(line: 110, column: 26, scope: !205)
!209 = !DILocalVariable(name: "pFile", scope: !205, file: !45, line: 111, type: !73)
!210 = !DILocation(line: 111, column: 16, scope: !205)
!211 = !DILocation(line: 113, column: 17, scope: !212)
!212 = distinct !DILexicalBlock(scope: !205, file: !45, line: 113, column: 13)
!213 = !DILocation(line: 113, column: 16, scope: !212)
!214 = !DILocation(line: 113, column: 25, scope: !212)
!215 = !DILocation(line: 113, column: 13, scope: !205)
!216 = !DILocation(line: 115, column: 21, scope: !217)
!217 = distinct !DILexicalBlock(scope: !212, file: !45, line: 114, column: 9)
!218 = !DILocation(line: 115, column: 19, scope: !217)
!219 = !DILocation(line: 116, column: 17, scope: !220)
!220 = distinct !DILexicalBlock(scope: !217, file: !45, line: 116, column: 17)
!221 = !DILocation(line: 116, column: 23, scope: !220)
!222 = !DILocation(line: 116, column: 17, scope: !217)
!223 = !DILocation(line: 119, column: 27, scope: !224)
!224 = distinct !DILexicalBlock(scope: !225, file: !45, line: 119, column: 21)
!225 = distinct !DILexicalBlock(scope: !220, file: !45, line: 117, column: 13)
!226 = !DILocation(line: 119, column: 32, scope: !224)
!227 = !DILocation(line: 119, column: 31, scope: !224)
!228 = !DILocation(line: 119, column: 51, scope: !224)
!229 = !DILocation(line: 119, column: 50, scope: !224)
!230 = !DILocation(line: 119, column: 41, scope: !224)
!231 = !DILocation(line: 119, column: 61, scope: !224)
!232 = !DILocation(line: 119, column: 21, scope: !224)
!233 = !DILocation(line: 119, column: 68, scope: !224)
!234 = !DILocation(line: 119, column: 21, scope: !225)
!235 = !DILocation(line: 121, column: 21, scope: !236)
!236 = distinct !DILexicalBlock(scope: !224, file: !45, line: 120, column: 17)
!237 = !DILocation(line: 123, column: 21, scope: !236)
!238 = !DILocation(line: 123, column: 26, scope: !236)
!239 = !DILocation(line: 123, column: 35, scope: !236)
!240 = !DILocation(line: 124, column: 17, scope: !236)
!241 = !DILocation(line: 125, column: 24, scope: !225)
!242 = !DILocation(line: 125, column: 17, scope: !225)
!243 = !DILocation(line: 126, column: 13, scope: !225)
!244 = !DILocation(line: 127, column: 9, scope: !217)
!245 = !DILocalVariable(name: "i", scope: !246, file: !45, line: 143, type: !23)
!246 = distinct !DILexicalBlock(scope: !197, file: !45, line: 142, column: 5)
!247 = !DILocation(line: 143, column: 13, scope: !246)
!248 = !DILocalVariable(name: "n", scope: !246, file: !45, line: 143, type: !23)
!249 = !DILocation(line: 143, column: 16, scope: !246)
!250 = !DILocalVariable(name: "intVariable", scope: !246, file: !45, line: 143, type: !23)
!251 = !DILocation(line: 143, column: 19, scope: !246)
!252 = !DILocation(line: 144, column: 20, scope: !253)
!253 = distinct !DILexicalBlock(scope: !246, file: !45, line: 144, column: 13)
!254 = !DILocation(line: 144, column: 13, scope: !253)
!255 = !DILocation(line: 144, column: 36, scope: !253)
!256 = !DILocation(line: 144, column: 13, scope: !246)
!257 = !DILocation(line: 147, column: 17, scope: !258)
!258 = distinct !DILexicalBlock(scope: !259, file: !45, line: 147, column: 17)
!259 = distinct !DILexicalBlock(scope: !253, file: !45, line: 145, column: 9)
!260 = !DILocation(line: 147, column: 19, scope: !258)
!261 = !DILocation(line: 147, column: 17, scope: !259)
!262 = !DILocation(line: 149, column: 29, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !45, line: 148, column: 13)
!264 = !DILocation(line: 150, column: 24, scope: !265)
!265 = distinct !DILexicalBlock(scope: !263, file: !45, line: 150, column: 17)
!266 = !DILocation(line: 150, column: 22, scope: !265)
!267 = !DILocation(line: 150, column: 29, scope: !268)
!268 = distinct !DILexicalBlock(scope: !265, file: !45, line: 150, column: 17)
!269 = !DILocation(line: 150, column: 33, scope: !268)
!270 = !DILocation(line: 150, column: 31, scope: !268)
!271 = !DILocation(line: 150, column: 17, scope: !265)
!272 = !DILocation(line: 153, column: 32, scope: !273)
!273 = distinct !DILexicalBlock(scope: !268, file: !45, line: 151, column: 17)
!274 = !DILocation(line: 154, column: 17, scope: !273)
!275 = !DILocation(line: 150, column: 37, scope: !268)
!276 = !DILocation(line: 150, column: 17, scope: !268)
!277 = distinct !{!277, !271, !278, !192}
!278 = !DILocation(line: 154, column: 17, scope: !265)
!279 = !DILocation(line: 155, column: 30, scope: !263)
!280 = !DILocation(line: 155, column: 17, scope: !263)
!281 = !DILocation(line: 156, column: 13, scope: !263)
!282 = !DILocation(line: 157, column: 9, scope: !259)
!283 = !DILocation(line: 161, column: 1, scope: !197)
!284 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 164, type: !53, scopeLine: 165, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!285 = !DILocalVariable(name: "data", scope: !284, file: !45, line: 166, type: !42)
!286 = !DILocation(line: 166, column: 12, scope: !284)
!287 = !DILocalVariable(name: "dataBuffer", scope: !284, file: !45, line: 167, type: !58)
!288 = !DILocation(line: 167, column: 10, scope: !284)
!289 = !DILocation(line: 168, column: 12, scope: !284)
!290 = !DILocation(line: 168, column: 10, scope: !284)
!291 = !DILocalVariable(name: "dataLen", scope: !292, file: !45, line: 174, type: !66)
!292 = distinct !DILexicalBlock(scope: !284, file: !45, line: 172, column: 5)
!293 = !DILocation(line: 174, column: 16, scope: !292)
!294 = !DILocation(line: 174, column: 33, scope: !292)
!295 = !DILocation(line: 174, column: 26, scope: !292)
!296 = !DILocalVariable(name: "pFile", scope: !292, file: !45, line: 175, type: !73)
!297 = !DILocation(line: 175, column: 16, scope: !292)
!298 = !DILocation(line: 177, column: 17, scope: !299)
!299 = distinct !DILexicalBlock(scope: !292, file: !45, line: 177, column: 13)
!300 = !DILocation(line: 177, column: 16, scope: !299)
!301 = !DILocation(line: 177, column: 25, scope: !299)
!302 = !DILocation(line: 177, column: 13, scope: !292)
!303 = !DILocation(line: 179, column: 21, scope: !304)
!304 = distinct !DILexicalBlock(scope: !299, file: !45, line: 178, column: 9)
!305 = !DILocation(line: 179, column: 19, scope: !304)
!306 = !DILocation(line: 180, column: 17, scope: !307)
!307 = distinct !DILexicalBlock(scope: !304, file: !45, line: 180, column: 17)
!308 = !DILocation(line: 180, column: 23, scope: !307)
!309 = !DILocation(line: 180, column: 17, scope: !304)
!310 = !DILocation(line: 183, column: 27, scope: !311)
!311 = distinct !DILexicalBlock(scope: !312, file: !45, line: 183, column: 21)
!312 = distinct !DILexicalBlock(scope: !307, file: !45, line: 181, column: 13)
!313 = !DILocation(line: 183, column: 32, scope: !311)
!314 = !DILocation(line: 183, column: 31, scope: !311)
!315 = !DILocation(line: 183, column: 51, scope: !311)
!316 = !DILocation(line: 183, column: 50, scope: !311)
!317 = !DILocation(line: 183, column: 41, scope: !311)
!318 = !DILocation(line: 183, column: 61, scope: !311)
!319 = !DILocation(line: 183, column: 21, scope: !311)
!320 = !DILocation(line: 183, column: 68, scope: !311)
!321 = !DILocation(line: 183, column: 21, scope: !312)
!322 = !DILocation(line: 185, column: 21, scope: !323)
!323 = distinct !DILexicalBlock(scope: !311, file: !45, line: 184, column: 17)
!324 = !DILocation(line: 187, column: 21, scope: !323)
!325 = !DILocation(line: 187, column: 26, scope: !323)
!326 = !DILocation(line: 187, column: 35, scope: !323)
!327 = !DILocation(line: 188, column: 17, scope: !323)
!328 = !DILocation(line: 189, column: 24, scope: !312)
!329 = !DILocation(line: 189, column: 17, scope: !312)
!330 = !DILocation(line: 190, column: 13, scope: !312)
!331 = !DILocation(line: 191, column: 9, scope: !304)
!332 = !DILocalVariable(name: "i", scope: !333, file: !45, line: 203, type: !23)
!333 = distinct !DILexicalBlock(scope: !284, file: !45, line: 202, column: 5)
!334 = !DILocation(line: 203, column: 13, scope: !333)
!335 = !DILocalVariable(name: "n", scope: !333, file: !45, line: 203, type: !23)
!336 = !DILocation(line: 203, column: 16, scope: !333)
!337 = !DILocalVariable(name: "intVariable", scope: !333, file: !45, line: 203, type: !23)
!338 = !DILocation(line: 203, column: 19, scope: !333)
!339 = !DILocation(line: 204, column: 20, scope: !340)
!340 = distinct !DILexicalBlock(scope: !333, file: !45, line: 204, column: 13)
!341 = !DILocation(line: 204, column: 13, scope: !340)
!342 = !DILocation(line: 204, column: 36, scope: !340)
!343 = !DILocation(line: 204, column: 13, scope: !333)
!344 = !DILocation(line: 207, column: 17, scope: !345)
!345 = distinct !DILexicalBlock(scope: !346, file: !45, line: 207, column: 17)
!346 = distinct !DILexicalBlock(scope: !340, file: !45, line: 205, column: 9)
!347 = !DILocation(line: 207, column: 19, scope: !345)
!348 = !DILocation(line: 207, column: 17, scope: !346)
!349 = !DILocation(line: 209, column: 29, scope: !350)
!350 = distinct !DILexicalBlock(scope: !345, file: !45, line: 208, column: 13)
!351 = !DILocation(line: 210, column: 24, scope: !352)
!352 = distinct !DILexicalBlock(scope: !350, file: !45, line: 210, column: 17)
!353 = !DILocation(line: 210, column: 22, scope: !352)
!354 = !DILocation(line: 210, column: 29, scope: !355)
!355 = distinct !DILexicalBlock(scope: !352, file: !45, line: 210, column: 17)
!356 = !DILocation(line: 210, column: 33, scope: !355)
!357 = !DILocation(line: 210, column: 31, scope: !355)
!358 = !DILocation(line: 210, column: 17, scope: !352)
!359 = !DILocation(line: 213, column: 32, scope: !360)
!360 = distinct !DILexicalBlock(scope: !355, file: !45, line: 211, column: 17)
!361 = !DILocation(line: 214, column: 17, scope: !360)
!362 = !DILocation(line: 210, column: 37, scope: !355)
!363 = !DILocation(line: 210, column: 17, scope: !355)
!364 = distinct !{!364, !358, !365, !192}
!365 = !DILocation(line: 214, column: 17, scope: !352)
!366 = !DILocation(line: 215, column: 30, scope: !350)
!367 = !DILocation(line: 215, column: 17, scope: !350)
!368 = !DILocation(line: 216, column: 13, scope: !350)
!369 = !DILocation(line: 217, column: 9, scope: !346)
!370 = !DILocation(line: 225, column: 1, scope: !284)
!371 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 228, type: !53, scopeLine: 229, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!372 = !DILocalVariable(name: "data", scope: !371, file: !45, line: 230, type: !42)
!373 = !DILocation(line: 230, column: 12, scope: !371)
!374 = !DILocalVariable(name: "dataBuffer", scope: !371, file: !45, line: 231, type: !58)
!375 = !DILocation(line: 231, column: 10, scope: !371)
!376 = !DILocation(line: 232, column: 12, scope: !371)
!377 = !DILocation(line: 232, column: 10, scope: !371)
!378 = !DILocation(line: 241, column: 16, scope: !371)
!379 = !DILocation(line: 241, column: 9, scope: !371)
!380 = !DILocalVariable(name: "i", scope: !381, file: !45, line: 248, type: !23)
!381 = distinct !DILexicalBlock(scope: !371, file: !45, line: 247, column: 5)
!382 = !DILocation(line: 248, column: 13, scope: !381)
!383 = !DILocalVariable(name: "n", scope: !381, file: !45, line: 248, type: !23)
!384 = !DILocation(line: 248, column: 16, scope: !381)
!385 = !DILocalVariable(name: "intVariable", scope: !381, file: !45, line: 248, type: !23)
!386 = !DILocation(line: 248, column: 19, scope: !381)
!387 = !DILocation(line: 249, column: 20, scope: !388)
!388 = distinct !DILexicalBlock(scope: !381, file: !45, line: 249, column: 13)
!389 = !DILocation(line: 249, column: 13, scope: !388)
!390 = !DILocation(line: 249, column: 36, scope: !388)
!391 = !DILocation(line: 249, column: 13, scope: !381)
!392 = !DILocation(line: 252, column: 25, scope: !393)
!393 = distinct !DILexicalBlock(scope: !388, file: !45, line: 250, column: 9)
!394 = !DILocation(line: 253, column: 20, scope: !395)
!395 = distinct !DILexicalBlock(scope: !393, file: !45, line: 253, column: 13)
!396 = !DILocation(line: 253, column: 18, scope: !395)
!397 = !DILocation(line: 253, column: 25, scope: !398)
!398 = distinct !DILexicalBlock(scope: !395, file: !45, line: 253, column: 13)
!399 = !DILocation(line: 253, column: 29, scope: !398)
!400 = !DILocation(line: 253, column: 27, scope: !398)
!401 = !DILocation(line: 253, column: 13, scope: !395)
!402 = !DILocation(line: 256, column: 28, scope: !403)
!403 = distinct !DILexicalBlock(scope: !398, file: !45, line: 254, column: 13)
!404 = !DILocation(line: 257, column: 13, scope: !403)
!405 = !DILocation(line: 253, column: 33, scope: !398)
!406 = !DILocation(line: 253, column: 13, scope: !398)
!407 = distinct !{!407, !401, !408, !192}
!408 = !DILocation(line: 257, column: 13, scope: !395)
!409 = !DILocation(line: 258, column: 26, scope: !393)
!410 = !DILocation(line: 258, column: 13, scope: !393)
!411 = !DILocation(line: 259, column: 9, scope: !393)
!412 = !DILocation(line: 267, column: 1, scope: !371)
!413 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 270, type: !53, scopeLine: 271, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!414 = !DILocalVariable(name: "data", scope: !413, file: !45, line: 272, type: !42)
!415 = !DILocation(line: 272, column: 12, scope: !413)
!416 = !DILocalVariable(name: "dataBuffer", scope: !413, file: !45, line: 273, type: !58)
!417 = !DILocation(line: 273, column: 10, scope: !413)
!418 = !DILocation(line: 274, column: 12, scope: !413)
!419 = !DILocation(line: 274, column: 10, scope: !413)
!420 = !DILocation(line: 279, column: 16, scope: !413)
!421 = !DILocation(line: 279, column: 9, scope: !413)
!422 = !DILocalVariable(name: "i", scope: !423, file: !45, line: 290, type: !23)
!423 = distinct !DILexicalBlock(scope: !413, file: !45, line: 289, column: 5)
!424 = !DILocation(line: 290, column: 13, scope: !423)
!425 = !DILocalVariable(name: "n", scope: !423, file: !45, line: 290, type: !23)
!426 = !DILocation(line: 290, column: 16, scope: !423)
!427 = !DILocalVariable(name: "intVariable", scope: !423, file: !45, line: 290, type: !23)
!428 = !DILocation(line: 290, column: 19, scope: !423)
!429 = !DILocation(line: 291, column: 20, scope: !430)
!430 = distinct !DILexicalBlock(scope: !423, file: !45, line: 291, column: 13)
!431 = !DILocation(line: 291, column: 13, scope: !430)
!432 = !DILocation(line: 291, column: 36, scope: !430)
!433 = !DILocation(line: 291, column: 13, scope: !423)
!434 = !DILocation(line: 294, column: 25, scope: !435)
!435 = distinct !DILexicalBlock(scope: !430, file: !45, line: 292, column: 9)
!436 = !DILocation(line: 295, column: 20, scope: !437)
!437 = distinct !DILexicalBlock(scope: !435, file: !45, line: 295, column: 13)
!438 = !DILocation(line: 295, column: 18, scope: !437)
!439 = !DILocation(line: 295, column: 25, scope: !440)
!440 = distinct !DILexicalBlock(scope: !437, file: !45, line: 295, column: 13)
!441 = !DILocation(line: 295, column: 29, scope: !440)
!442 = !DILocation(line: 295, column: 27, scope: !440)
!443 = !DILocation(line: 295, column: 13, scope: !437)
!444 = !DILocation(line: 298, column: 28, scope: !445)
!445 = distinct !DILexicalBlock(scope: !440, file: !45, line: 296, column: 13)
!446 = !DILocation(line: 299, column: 13, scope: !445)
!447 = !DILocation(line: 295, column: 33, scope: !440)
!448 = !DILocation(line: 295, column: 13, scope: !440)
!449 = distinct !{!449, !443, !450, !192}
!450 = !DILocation(line: 299, column: 13, scope: !437)
!451 = !DILocation(line: 300, column: 26, scope: !435)
!452 = !DILocation(line: 300, column: 13, scope: !435)
!453 = !DILocation(line: 301, column: 9, scope: !435)
!454 = !DILocation(line: 309, column: 1, scope: !413)
!455 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_15_good", scope: !45, file: !45, line: 311, type: !53, scopeLine: 312, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!456 = !DILocation(line: 313, column: 5, scope: !455)
!457 = !DILocation(line: 314, column: 5, scope: !455)
!458 = !DILocation(line: 315, column: 5, scope: !455)
!459 = !DILocation(line: 316, column: 5, scope: !455)
!460 = !DILocation(line: 317, column: 1, scope: !455)
!461 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !462, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!462 = !DISubroutineType(types: !463)
!463 = !{null, !42}
!464 = !DILocalVariable(name: "line", arg: 1, scope: !461, file: !3, line: 11, type: !42)
!465 = !DILocation(line: 11, column: 25, scope: !461)
!466 = !DILocation(line: 13, column: 1, scope: !461)
!467 = !DILocation(line: 14, column: 8, scope: !468)
!468 = distinct !DILexicalBlock(scope: !461, file: !3, line: 14, column: 8)
!469 = !DILocation(line: 14, column: 13, scope: !468)
!470 = !DILocation(line: 14, column: 8, scope: !461)
!471 = !DILocation(line: 16, column: 24, scope: !472)
!472 = distinct !DILexicalBlock(scope: !468, file: !3, line: 15, column: 5)
!473 = !DILocation(line: 16, column: 9, scope: !472)
!474 = !DILocation(line: 17, column: 5, scope: !472)
!475 = !DILocation(line: 18, column: 5, scope: !461)
!476 = !DILocation(line: 19, column: 1, scope: !461)
!477 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !462, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!478 = !DILocalVariable(name: "line", arg: 1, scope: !477, file: !3, line: 20, type: !42)
!479 = !DILocation(line: 20, column: 29, scope: !477)
!480 = !DILocation(line: 22, column: 8, scope: !481)
!481 = distinct !DILexicalBlock(scope: !477, file: !3, line: 22, column: 8)
!482 = !DILocation(line: 22, column: 13, scope: !481)
!483 = !DILocation(line: 22, column: 8, scope: !477)
!484 = !DILocation(line: 24, column: 24, scope: !485)
!485 = distinct !DILexicalBlock(scope: !481, file: !3, line: 23, column: 5)
!486 = !DILocation(line: 24, column: 9, scope: !485)
!487 = !DILocation(line: 25, column: 5, scope: !485)
!488 = !DILocation(line: 26, column: 1, scope: !477)
!489 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !490, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !493, size: 64)
!493 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !67, line: 74, baseType: !23)
!494 = !DILocalVariable(name: "line", arg: 1, scope: !489, file: !3, line: 27, type: !492)
!495 = !DILocation(line: 27, column: 29, scope: !489)
!496 = !DILocation(line: 29, column: 8, scope: !497)
!497 = distinct !DILexicalBlock(scope: !489, file: !3, line: 29, column: 8)
!498 = !DILocation(line: 29, column: 13, scope: !497)
!499 = !DILocation(line: 29, column: 8, scope: !489)
!500 = !DILocation(line: 31, column: 27, scope: !501)
!501 = distinct !DILexicalBlock(scope: !497, file: !3, line: 30, column: 5)
!502 = !DILocation(line: 31, column: 9, scope: !501)
!503 = !DILocation(line: 32, column: 5, scope: !501)
!504 = !DILocation(line: 33, column: 1, scope: !489)
!505 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !506, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !23}
!508 = !DILocalVariable(name: "intNumber", arg: 1, scope: !505, file: !3, line: 35, type: !23)
!509 = !DILocation(line: 35, column: 24, scope: !505)
!510 = !DILocation(line: 37, column: 20, scope: !505)
!511 = !DILocation(line: 37, column: 5, scope: !505)
!512 = !DILocation(line: 38, column: 1, scope: !505)
!513 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !514, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!514 = !DISubroutineType(types: !515)
!515 = !{null, !516}
!516 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!517 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !513, file: !3, line: 40, type: !516)
!518 = !DILocation(line: 40, column: 28, scope: !513)
!519 = !DILocation(line: 42, column: 21, scope: !513)
!520 = !DILocation(line: 42, column: 5, scope: !513)
!521 = !DILocation(line: 43, column: 1, scope: !513)
!522 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !523, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!523 = !DISubroutineType(types: !524)
!524 = !{null, !525}
!525 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!526 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !522, file: !3, line: 45, type: !525)
!527 = !DILocation(line: 45, column: 28, scope: !522)
!528 = !DILocation(line: 47, column: 20, scope: !522)
!529 = !DILocation(line: 47, column: 5, scope: !522)
!530 = !DILocation(line: 48, column: 1, scope: !522)
!531 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !532, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!532 = !DISubroutineType(types: !533)
!533 = !{null, !101}
!534 = !DILocalVariable(name: "longNumber", arg: 1, scope: !531, file: !3, line: 50, type: !101)
!535 = !DILocation(line: 50, column: 26, scope: !531)
!536 = !DILocation(line: 52, column: 21, scope: !531)
!537 = !DILocation(line: 52, column: 5, scope: !531)
!538 = !DILocation(line: 53, column: 1, scope: !531)
!539 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !540, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!540 = !DISubroutineType(types: !541)
!541 = !{null, !542}
!542 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !543, line: 27, baseType: !544)
!543 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!544 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !100, line: 44, baseType: !101)
!545 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !539, file: !3, line: 55, type: !542)
!546 = !DILocation(line: 55, column: 33, scope: !539)
!547 = !DILocation(line: 57, column: 29, scope: !539)
!548 = !DILocation(line: 57, column: 5, scope: !539)
!549 = !DILocation(line: 58, column: 1, scope: !539)
!550 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !551, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !66}
!553 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !550, file: !3, line: 60, type: !66)
!554 = !DILocation(line: 60, column: 29, scope: !550)
!555 = !DILocation(line: 62, column: 21, scope: !550)
!556 = !DILocation(line: 62, column: 5, scope: !550)
!557 = !DILocation(line: 63, column: 1, scope: !550)
!558 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !559, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!559 = !DISubroutineType(types: !560)
!560 = !{null, !43}
!561 = !DILocalVariable(name: "charHex", arg: 1, scope: !558, file: !3, line: 65, type: !43)
!562 = !DILocation(line: 65, column: 29, scope: !558)
!563 = !DILocation(line: 67, column: 22, scope: !558)
!564 = !DILocation(line: 67, column: 5, scope: !558)
!565 = !DILocation(line: 68, column: 1, scope: !558)
!566 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !567, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!567 = !DISubroutineType(types: !568)
!568 = !{null, !493}
!569 = !DILocalVariable(name: "wideChar", arg: 1, scope: !566, file: !3, line: 70, type: !493)
!570 = !DILocation(line: 70, column: 29, scope: !566)
!571 = !DILocalVariable(name: "s", scope: !566, file: !3, line: 74, type: !572)
!572 = !DICompositeType(tag: DW_TAG_array_type, baseType: !493, size: 64, elements: !573)
!573 = !{!574}
!574 = !DISubrange(count: 2)
!575 = !DILocation(line: 74, column: 13, scope: !566)
!576 = !DILocation(line: 75, column: 16, scope: !566)
!577 = !DILocation(line: 75, column: 9, scope: !566)
!578 = !DILocation(line: 75, column: 14, scope: !566)
!579 = !DILocation(line: 76, column: 9, scope: !566)
!580 = !DILocation(line: 76, column: 14, scope: !566)
!581 = !DILocation(line: 77, column: 21, scope: !566)
!582 = !DILocation(line: 77, column: 5, scope: !566)
!583 = !DILocation(line: 78, column: 1, scope: !566)
!584 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !585, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!585 = !DISubroutineType(types: !586)
!586 = !{null, !7}
!587 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !584, file: !3, line: 80, type: !7)
!588 = !DILocation(line: 80, column: 33, scope: !584)
!589 = !DILocation(line: 82, column: 20, scope: !584)
!590 = !DILocation(line: 82, column: 5, scope: !584)
!591 = !DILocation(line: 83, column: 1, scope: !584)
!592 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !593, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!593 = !DISubroutineType(types: !594)
!594 = !{null, !25}
!595 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !592, file: !3, line: 85, type: !25)
!596 = !DILocation(line: 85, column: 45, scope: !592)
!597 = !DILocation(line: 87, column: 22, scope: !592)
!598 = !DILocation(line: 87, column: 5, scope: !592)
!599 = !DILocation(line: 88, column: 1, scope: !592)
!600 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !601, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!601 = !DISubroutineType(types: !602)
!602 = !{null, !603}
!603 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!604 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !600, file: !3, line: 90, type: !603)
!605 = !DILocation(line: 90, column: 29, scope: !600)
!606 = !DILocation(line: 92, column: 20, scope: !600)
!607 = !DILocation(line: 92, column: 5, scope: !600)
!608 = !DILocation(line: 93, column: 1, scope: !600)
!609 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !610, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!610 = !DISubroutineType(types: !611)
!611 = !{null, !612}
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !614, line: 100, baseType: !615)
!614 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_088/source_code")
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !614, line: 96, size: 64, elements: !616)
!616 = !{!617, !618}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !615, file: !614, line: 98, baseType: !23, size: 32)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !615, file: !614, line: 99, baseType: !23, size: 32, offset: 32)
!619 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !609, file: !3, line: 95, type: !612)
!620 = !DILocation(line: 95, column: 40, scope: !609)
!621 = !DILocation(line: 97, column: 26, scope: !609)
!622 = !DILocation(line: 97, column: 47, scope: !609)
!623 = !DILocation(line: 97, column: 55, scope: !609)
!624 = !DILocation(line: 97, column: 76, scope: !609)
!625 = !DILocation(line: 97, column: 5, scope: !609)
!626 = !DILocation(line: 98, column: 1, scope: !609)
!627 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !628, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!628 = !DISubroutineType(types: !629)
!629 = !{null, !630, !66}
!630 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!631 = !DILocalVariable(name: "bytes", arg: 1, scope: !627, file: !3, line: 100, type: !630)
!632 = !DILocation(line: 100, column: 38, scope: !627)
!633 = !DILocalVariable(name: "numBytes", arg: 2, scope: !627, file: !3, line: 100, type: !66)
!634 = !DILocation(line: 100, column: 52, scope: !627)
!635 = !DILocalVariable(name: "i", scope: !627, file: !3, line: 102, type: !66)
!636 = !DILocation(line: 102, column: 12, scope: !627)
!637 = !DILocation(line: 103, column: 12, scope: !638)
!638 = distinct !DILexicalBlock(scope: !627, file: !3, line: 103, column: 5)
!639 = !DILocation(line: 103, column: 10, scope: !638)
!640 = !DILocation(line: 103, column: 17, scope: !641)
!641 = distinct !DILexicalBlock(scope: !638, file: !3, line: 103, column: 5)
!642 = !DILocation(line: 103, column: 21, scope: !641)
!643 = !DILocation(line: 103, column: 19, scope: !641)
!644 = !DILocation(line: 103, column: 5, scope: !638)
!645 = !DILocation(line: 105, column: 24, scope: !646)
!646 = distinct !DILexicalBlock(scope: !641, file: !3, line: 104, column: 5)
!647 = !DILocation(line: 105, column: 30, scope: !646)
!648 = !DILocation(line: 105, column: 9, scope: !646)
!649 = !DILocation(line: 106, column: 5, scope: !646)
!650 = !DILocation(line: 103, column: 31, scope: !641)
!651 = !DILocation(line: 103, column: 5, scope: !641)
!652 = distinct !{!652, !644, !653, !192}
!653 = !DILocation(line: 106, column: 5, scope: !638)
!654 = !DILocation(line: 107, column: 5, scope: !627)
!655 = !DILocation(line: 108, column: 1, scope: !627)
!656 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !657, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!657 = !DISubroutineType(types: !658)
!658 = !{!66, !630, !66, !42}
!659 = !DILocalVariable(name: "bytes", arg: 1, scope: !656, file: !3, line: 113, type: !630)
!660 = !DILocation(line: 113, column: 39, scope: !656)
!661 = !DILocalVariable(name: "numBytes", arg: 2, scope: !656, file: !3, line: 113, type: !66)
!662 = !DILocation(line: 113, column: 53, scope: !656)
!663 = !DILocalVariable(name: "hex", arg: 3, scope: !656, file: !3, line: 113, type: !42)
!664 = !DILocation(line: 113, column: 71, scope: !656)
!665 = !DILocalVariable(name: "numWritten", scope: !656, file: !3, line: 115, type: !66)
!666 = !DILocation(line: 115, column: 12, scope: !656)
!667 = !DILocation(line: 121, column: 5, scope: !656)
!668 = !DILocation(line: 121, column: 12, scope: !656)
!669 = !DILocation(line: 121, column: 25, scope: !656)
!670 = !DILocation(line: 121, column: 23, scope: !656)
!671 = !DILocation(line: 121, column: 34, scope: !656)
!672 = !DILocation(line: 121, column: 37, scope: !656)
!673 = !DILocation(line: 121, column: 67, scope: !656)
!674 = !DILocation(line: 121, column: 70, scope: !656)
!675 = !DILocation(line: 0, scope: !656)
!676 = !DILocalVariable(name: "byte", scope: !677, file: !3, line: 123, type: !23)
!677 = distinct !DILexicalBlock(scope: !656, file: !3, line: 122, column: 5)
!678 = !DILocation(line: 123, column: 13, scope: !677)
