; ModuleID = 'CWE134_Uncontrolled_Format_String__char_file_vprintf_31.c'
source_filename = "CWE134_Uncontrolled_Format_String__char_file_vprintf_31.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badVaSink(i8* %data, ...) #0 !dbg !10 {
entry:
  %data.addr = alloca i8*, align 8
  %args = alloca [1 x %struct.__va_list_tag], align 16
  store i8* %data, i8** %data.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !15, metadata !DIExpression()), !dbg !16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_31.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_174/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "badVaSink", scope: !1, file: !1, line: 34, type: !11, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13, null}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DILocalVariable(name: "data", arg: 1, scope: !10, file: !1, line: 34, type: !13)
!16 = !DILocation(line: 34, column: 23, scope: !10)
!17 = !DILocalVariable(name: "args", scope: !18, file: !1, line: 37, type: !19)
!18 = distinct !DILexicalBlock(scope: !10, file: !1, line: 36, column: 5)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !20, line: 52, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !22, line: 32, baseType: !23)
!22 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, elements: !32)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !26)
!26 = !{!27, !29, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !25, file: !1, line: 37, baseType: !28, size: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !25, file: !1, line: 37, baseType: !28, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !25, file: !1, line: 37, baseType: !4, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !25, file: !1, line: 37, baseType: !4, size: 64, offset: 128)
!32 = !{!33}
!33 = !DISubrange(count: 1)
!34 = !DILocation(line: 37, column: 17, scope: !18)
!35 = !DILocation(line: 38, column: 9, scope: !18)
!36 = !DILocation(line: 40, column: 17, scope: !18)
!37 = !DILocation(line: 40, column: 23, scope: !18)
!38 = !DILocation(line: 40, column: 9, scope: !18)
!39 = !DILocation(line: 41, column: 9, scope: !18)
!40 = !DILocation(line: 43, column: 1, scope: !10)
!41 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_31_bad", scope: !1, file: !1, line: 45, type: !42, scopeLine: 46, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{null}
!44 = !DILocalVariable(name: "data", scope: !41, file: !1, line: 47, type: !13)
!45 = !DILocation(line: 47, column: 12, scope: !41)
!46 = !DILocalVariable(name: "dataBuffer", scope: !41, file: !1, line: 48, type: !47)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 800, elements: !48)
!48 = !{!49}
!49 = !DISubrange(count: 100)
!50 = !DILocation(line: 48, column: 10, scope: !41)
!51 = !DILocation(line: 49, column: 12, scope: !41)
!52 = !DILocation(line: 49, column: 10, scope: !41)
!53 = !DILocalVariable(name: "dataLen", scope: !54, file: !1, line: 52, type: !55)
!54 = distinct !DILexicalBlock(scope: !41, file: !1, line: 50, column: 5)
!55 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !56, line: 46, baseType: !57)
!56 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!57 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!58 = !DILocation(line: 52, column: 16, scope: !54)
!59 = !DILocation(line: 52, column: 33, scope: !54)
!60 = !DILocation(line: 52, column: 26, scope: !54)
!61 = !DILocalVariable(name: "pFile", scope: !54, file: !1, line: 53, type: !62)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !64, line: 7, baseType: !65)
!64 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !66, line: 49, size: 1728, elements: !67)
!66 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!67 = !{!68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78, !79, !80, !83, !85, !86, !87, !91, !93, !95, !97, !100, !102, !105, !108, !109, !110, !111, !112}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !65, file: !66, line: 51, baseType: !5, size: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !65, file: !66, line: 54, baseType: !13, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !65, file: !66, line: 55, baseType: !13, size: 64, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !65, file: !66, line: 56, baseType: !13, size: 64, offset: 192)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !65, file: !66, line: 57, baseType: !13, size: 64, offset: 256)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !65, file: !66, line: 58, baseType: !13, size: 64, offset: 320)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !65, file: !66, line: 59, baseType: !13, size: 64, offset: 384)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !65, file: !66, line: 60, baseType: !13, size: 64, offset: 448)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !65, file: !66, line: 61, baseType: !13, size: 64, offset: 512)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !65, file: !66, line: 64, baseType: !13, size: 64, offset: 576)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !65, file: !66, line: 65, baseType: !13, size: 64, offset: 640)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !65, file: !66, line: 66, baseType: !13, size: 64, offset: 704)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !65, file: !66, line: 68, baseType: !81, size: 64, offset: 768)
!81 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !82, size: 64)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !66, line: 36, flags: DIFlagFwdDecl)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !65, file: !66, line: 70, baseType: !84, size: 64, offset: 832)
!84 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !65, size: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !65, file: !66, line: 72, baseType: !5, size: 32, offset: 896)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !65, file: !66, line: 73, baseType: !5, size: 32, offset: 928)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !65, file: !66, line: 74, baseType: !88, size: 64, offset: 960)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !89, line: 152, baseType: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!90 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !65, file: !66, line: 77, baseType: !92, size: 16, offset: 1024)
!92 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !65, file: !66, line: 78, baseType: !94, size: 8, offset: 1040)
!94 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !65, file: !66, line: 79, baseType: !96, size: 8, offset: 1048)
!96 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !32)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !65, file: !66, line: 81, baseType: !98, size: 64, offset: 1088)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !99, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !66, line: 43, baseType: null)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !65, file: !66, line: 89, baseType: !101, size: 64, offset: 1152)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !89, line: 153, baseType: !90)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !65, file: !66, line: 91, baseType: !103, size: 64, offset: 1216)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !66, line: 37, flags: DIFlagFwdDecl)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !65, file: !66, line: 92, baseType: !106, size: 64, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !107, size: 64)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !66, line: 38, flags: DIFlagFwdDecl)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !65, file: !66, line: 93, baseType: !84, size: 64, offset: 1344)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !65, file: !66, line: 94, baseType: !4, size: 64, offset: 1408)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !65, file: !66, line: 95, baseType: !55, size: 64, offset: 1472)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !65, file: !66, line: 96, baseType: !5, size: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !65, file: !66, line: 98, baseType: !113, size: 160, offset: 1568)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 20)
!116 = !DILocation(line: 53, column: 16, scope: !54)
!117 = !DILocation(line: 55, column: 17, scope: !118)
!118 = distinct !DILexicalBlock(scope: !54, file: !1, line: 55, column: 13)
!119 = !DILocation(line: 55, column: 16, scope: !118)
!120 = !DILocation(line: 55, column: 25, scope: !118)
!121 = !DILocation(line: 55, column: 13, scope: !54)
!122 = !DILocation(line: 57, column: 21, scope: !123)
!123 = distinct !DILexicalBlock(scope: !118, file: !1, line: 56, column: 9)
!124 = !DILocation(line: 57, column: 19, scope: !123)
!125 = !DILocation(line: 58, column: 17, scope: !126)
!126 = distinct !DILexicalBlock(scope: !123, file: !1, line: 58, column: 17)
!127 = !DILocation(line: 58, column: 23, scope: !126)
!128 = !DILocation(line: 58, column: 17, scope: !123)
!129 = !DILocation(line: 61, column: 27, scope: !130)
!130 = distinct !DILexicalBlock(scope: !131, file: !1, line: 61, column: 21)
!131 = distinct !DILexicalBlock(scope: !126, file: !1, line: 59, column: 13)
!132 = !DILocation(line: 61, column: 32, scope: !130)
!133 = !DILocation(line: 61, column: 31, scope: !130)
!134 = !DILocation(line: 61, column: 51, scope: !130)
!135 = !DILocation(line: 61, column: 50, scope: !130)
!136 = !DILocation(line: 61, column: 41, scope: !130)
!137 = !DILocation(line: 61, column: 61, scope: !130)
!138 = !DILocation(line: 61, column: 21, scope: !130)
!139 = !DILocation(line: 61, column: 68, scope: !130)
!140 = !DILocation(line: 61, column: 21, scope: !131)
!141 = !DILocation(line: 63, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !130, file: !1, line: 62, column: 17)
!143 = !DILocation(line: 65, column: 21, scope: !142)
!144 = !DILocation(line: 65, column: 26, scope: !142)
!145 = !DILocation(line: 65, column: 35, scope: !142)
!146 = !DILocation(line: 66, column: 17, scope: !142)
!147 = !DILocation(line: 67, column: 24, scope: !131)
!148 = !DILocation(line: 67, column: 17, scope: !131)
!149 = !DILocation(line: 68, column: 13, scope: !131)
!150 = !DILocation(line: 69, column: 9, scope: !123)
!151 = !DILocalVariable(name: "dataCopy", scope: !152, file: !1, line: 72, type: !13)
!152 = distinct !DILexicalBlock(scope: !41, file: !1, line: 71, column: 5)
!153 = !DILocation(line: 72, column: 16, scope: !152)
!154 = !DILocation(line: 72, column: 27, scope: !152)
!155 = !DILocalVariable(name: "data", scope: !152, file: !1, line: 73, type: !13)
!156 = !DILocation(line: 73, column: 16, scope: !152)
!157 = !DILocation(line: 73, column: 23, scope: !152)
!158 = !DILocation(line: 74, column: 19, scope: !152)
!159 = !DILocation(line: 74, column: 25, scope: !152)
!160 = !DILocation(line: 74, column: 9, scope: !152)
!161 = !DILocation(line: 76, column: 1, scope: !41)
!162 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !1, file: !1, line: 83, type: !11, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!163 = !DILocalVariable(name: "data", arg: 1, scope: !162, file: !1, line: 83, type: !13)
!164 = !DILocation(line: 83, column: 27, scope: !162)
!165 = !DILocalVariable(name: "args", scope: !166, file: !1, line: 86, type: !19)
!166 = distinct !DILexicalBlock(scope: !162, file: !1, line: 85, column: 5)
!167 = !DILocation(line: 86, column: 17, scope: !166)
!168 = !DILocation(line: 87, column: 9, scope: !166)
!169 = !DILocation(line: 89, column: 17, scope: !166)
!170 = !DILocation(line: 89, column: 23, scope: !166)
!171 = !DILocation(line: 89, column: 9, scope: !166)
!172 = !DILocation(line: 90, column: 9, scope: !166)
!173 = !DILocation(line: 92, column: 1, scope: !162)
!174 = distinct !DISubprogram(name: "goodG2B", scope: !1, file: !1, line: 94, type: !42, scopeLine: 95, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
