; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_11.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_020/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_11_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocation(line: 38, column: 8, scope: !65)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 38, column: 8)
!66 = !DILocation(line: 38, column: 8, scope: !52)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !45, line: 42, type: !70)
!68 = distinct !DILexicalBlock(scope: !69, file: !45, line: 40, column: 9)
!69 = distinct !DILexicalBlock(scope: !65, file: !45, line: 39, column: 5)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !71, line: 46, baseType: !72)
!71 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!72 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!73 = !DILocation(line: 42, column: 20, scope: !68)
!74 = !DILocation(line: 42, column: 37, scope: !68)
!75 = !DILocation(line: 42, column: 30, scope: !68)
!76 = !DILocalVariable(name: "pFile", scope: !68, file: !45, line: 43, type: !77)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !79, line: 7, baseType: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!80 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !81, line: 49, size: 1728, elements: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!82 = !{!83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !98, !100, !101, !102, !106, !107, !109, !113, !116, !118, !121, !124, !125, !126, !127, !128}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !80, file: !81, line: 51, baseType: !23, size: 32)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !80, file: !81, line: 54, baseType: !42, size: 64, offset: 64)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !80, file: !81, line: 55, baseType: !42, size: 64, offset: 128)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !80, file: !81, line: 56, baseType: !42, size: 64, offset: 192)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !80, file: !81, line: 57, baseType: !42, size: 64, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !80, file: !81, line: 58, baseType: !42, size: 64, offset: 320)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !80, file: !81, line: 59, baseType: !42, size: 64, offset: 384)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !80, file: !81, line: 60, baseType: !42, size: 64, offset: 448)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !80, file: !81, line: 61, baseType: !42, size: 64, offset: 512)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !80, file: !81, line: 64, baseType: !42, size: 64, offset: 576)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !80, file: !81, line: 65, baseType: !42, size: 64, offset: 640)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !80, file: !81, line: 66, baseType: !42, size: 64, offset: 704)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !80, file: !81, line: 68, baseType: !96, size: 64, offset: 768)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !81, line: 36, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !80, file: !81, line: 70, baseType: !99, size: 64, offset: 832)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !80, size: 64)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !80, file: !81, line: 72, baseType: !23, size: 32, offset: 896)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !80, file: !81, line: 73, baseType: !23, size: 32, offset: 928)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !80, file: !81, line: 74, baseType: !103, size: 64, offset: 960)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !104, line: 152, baseType: !105)
!104 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!105 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !80, file: !81, line: 77, baseType: !24, size: 16, offset: 1024)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !80, file: !81, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !80, file: !81, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 1)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !80, file: !81, line: 81, baseType: !114, size: 64, offset: 1088)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !81, line: 43, baseType: null)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !80, file: !81, line: 89, baseType: !117, size: 64, offset: 1152)
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !104, line: 153, baseType: !105)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !80, file: !81, line: 91, baseType: !119, size: 64, offset: 1216)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !81, line: 37, flags: DIFlagFwdDecl)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !80, file: !81, line: 92, baseType: !122, size: 64, offset: 1280)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !81, line: 38, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !80, file: !81, line: 93, baseType: !99, size: 64, offset: 1344)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !80, file: !81, line: 94, baseType: !22, size: 64, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !80, file: !81, line: 95, baseType: !70, size: 64, offset: 1472)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !80, file: !81, line: 96, baseType: !23, size: 32, offset: 1536)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !80, file: !81, line: 98, baseType: !129, size: 160, offset: 1568)
!129 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !130)
!130 = !{!131}
!131 = !DISubrange(count: 20)
!132 = !DILocation(line: 43, column: 20, scope: !68)
!133 = !DILocation(line: 45, column: 21, scope: !134)
!134 = distinct !DILexicalBlock(scope: !68, file: !45, line: 45, column: 17)
!135 = !DILocation(line: 45, column: 20, scope: !134)
!136 = !DILocation(line: 45, column: 29, scope: !134)
!137 = !DILocation(line: 45, column: 17, scope: !68)
!138 = !DILocation(line: 47, column: 25, scope: !139)
!139 = distinct !DILexicalBlock(scope: !134, file: !45, line: 46, column: 13)
!140 = !DILocation(line: 47, column: 23, scope: !139)
!141 = !DILocation(line: 48, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !139, file: !45, line: 48, column: 21)
!143 = !DILocation(line: 48, column: 27, scope: !142)
!144 = !DILocation(line: 48, column: 21, scope: !139)
!145 = !DILocation(line: 51, column: 31, scope: !146)
!146 = distinct !DILexicalBlock(scope: !147, file: !45, line: 51, column: 25)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 49, column: 17)
!148 = !DILocation(line: 51, column: 36, scope: !146)
!149 = !DILocation(line: 51, column: 35, scope: !146)
!150 = !DILocation(line: 51, column: 55, scope: !146)
!151 = !DILocation(line: 51, column: 54, scope: !146)
!152 = !DILocation(line: 51, column: 45, scope: !146)
!153 = !DILocation(line: 51, column: 65, scope: !146)
!154 = !DILocation(line: 51, column: 25, scope: !146)
!155 = !DILocation(line: 51, column: 72, scope: !146)
!156 = !DILocation(line: 51, column: 25, scope: !147)
!157 = !DILocation(line: 53, column: 25, scope: !158)
!158 = distinct !DILexicalBlock(scope: !146, file: !45, line: 52, column: 21)
!159 = !DILocation(line: 55, column: 25, scope: !158)
!160 = !DILocation(line: 55, column: 30, scope: !158)
!161 = !DILocation(line: 55, column: 39, scope: !158)
!162 = !DILocation(line: 56, column: 21, scope: !158)
!163 = !DILocation(line: 57, column: 28, scope: !147)
!164 = !DILocation(line: 57, column: 21, scope: !147)
!165 = !DILocation(line: 58, column: 17, scope: !147)
!166 = !DILocation(line: 59, column: 13, scope: !139)
!167 = !DILocation(line: 61, column: 5, scope: !69)
!168 = !DILocation(line: 62, column: 8, scope: !169)
!169 = distinct !DILexicalBlock(scope: !52, file: !45, line: 62, column: 8)
!170 = !DILocation(line: 62, column: 8, scope: !52)
!171 = !DILocation(line: 65, column: 16, scope: !172)
!172 = distinct !DILexicalBlock(scope: !169, file: !45, line: 63, column: 5)
!173 = !DILocation(line: 65, column: 9, scope: !172)
!174 = !DILocation(line: 66, column: 5, scope: !172)
!175 = !DILocation(line: 67, column: 1, scope: !52)
!176 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 74, type: !53, scopeLine: 75, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!177 = !DILocalVariable(name: "data", scope: !176, file: !45, line: 76, type: !42)
!178 = !DILocation(line: 76, column: 12, scope: !176)
!179 = !DILocalVariable(name: "dataBuffer", scope: !176, file: !45, line: 77, type: !58)
!180 = !DILocation(line: 77, column: 10, scope: !176)
!181 = !DILocation(line: 78, column: 12, scope: !176)
!182 = !DILocation(line: 78, column: 10, scope: !176)
!183 = !DILocation(line: 79, column: 8, scope: !184)
!184 = distinct !DILexicalBlock(scope: !176, file: !45, line: 79, column: 8)
!185 = !DILocation(line: 79, column: 8, scope: !176)
!186 = !DILocalVariable(name: "dataLen", scope: !187, file: !45, line: 83, type: !70)
!187 = distinct !DILexicalBlock(scope: !188, file: !45, line: 81, column: 9)
!188 = distinct !DILexicalBlock(scope: !184, file: !45, line: 80, column: 5)
!189 = !DILocation(line: 83, column: 20, scope: !187)
!190 = !DILocation(line: 83, column: 37, scope: !187)
!191 = !DILocation(line: 83, column: 30, scope: !187)
!192 = !DILocalVariable(name: "pFile", scope: !187, file: !45, line: 84, type: !77)
!193 = !DILocation(line: 84, column: 20, scope: !187)
!194 = !DILocation(line: 86, column: 21, scope: !195)
!195 = distinct !DILexicalBlock(scope: !187, file: !45, line: 86, column: 17)
!196 = !DILocation(line: 86, column: 20, scope: !195)
!197 = !DILocation(line: 86, column: 29, scope: !195)
!198 = !DILocation(line: 86, column: 17, scope: !187)
!199 = !DILocation(line: 88, column: 25, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !45, line: 87, column: 13)
!201 = !DILocation(line: 88, column: 23, scope: !200)
!202 = !DILocation(line: 89, column: 21, scope: !203)
!203 = distinct !DILexicalBlock(scope: !200, file: !45, line: 89, column: 21)
!204 = !DILocation(line: 89, column: 27, scope: !203)
!205 = !DILocation(line: 89, column: 21, scope: !200)
!206 = !DILocation(line: 92, column: 31, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !45, line: 92, column: 25)
!208 = distinct !DILexicalBlock(scope: !203, file: !45, line: 90, column: 17)
!209 = !DILocation(line: 92, column: 36, scope: !207)
!210 = !DILocation(line: 92, column: 35, scope: !207)
!211 = !DILocation(line: 92, column: 55, scope: !207)
!212 = !DILocation(line: 92, column: 54, scope: !207)
!213 = !DILocation(line: 92, column: 45, scope: !207)
!214 = !DILocation(line: 92, column: 65, scope: !207)
!215 = !DILocation(line: 92, column: 25, scope: !207)
!216 = !DILocation(line: 92, column: 72, scope: !207)
!217 = !DILocation(line: 92, column: 25, scope: !208)
!218 = !DILocation(line: 94, column: 25, scope: !219)
!219 = distinct !DILexicalBlock(scope: !207, file: !45, line: 93, column: 21)
!220 = !DILocation(line: 96, column: 25, scope: !219)
!221 = !DILocation(line: 96, column: 30, scope: !219)
!222 = !DILocation(line: 96, column: 39, scope: !219)
!223 = !DILocation(line: 97, column: 21, scope: !219)
!224 = !DILocation(line: 98, column: 28, scope: !208)
!225 = !DILocation(line: 98, column: 21, scope: !208)
!226 = !DILocation(line: 99, column: 17, scope: !208)
!227 = !DILocation(line: 100, column: 13, scope: !200)
!228 = !DILocation(line: 102, column: 5, scope: !188)
!229 = !DILocation(line: 103, column: 8, scope: !230)
!230 = distinct !DILexicalBlock(scope: !176, file: !45, line: 103, column: 8)
!231 = !DILocation(line: 103, column: 8, scope: !176)
!232 = !DILocation(line: 106, column: 9, scope: !233)
!233 = distinct !DILexicalBlock(scope: !230, file: !45, line: 104, column: 5)
!234 = !DILocation(line: 107, column: 5, scope: !233)
!235 = !DILocation(line: 111, column: 24, scope: !236)
!236 = distinct !DILexicalBlock(scope: !230, file: !45, line: 109, column: 5)
!237 = !DILocation(line: 111, column: 9, scope: !236)
!238 = !DILocation(line: 113, column: 1, scope: !176)
!239 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 116, type: !53, scopeLine: 117, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!240 = !DILocalVariable(name: "data", scope: !239, file: !45, line: 118, type: !42)
!241 = !DILocation(line: 118, column: 12, scope: !239)
!242 = !DILocalVariable(name: "dataBuffer", scope: !239, file: !45, line: 119, type: !58)
!243 = !DILocation(line: 119, column: 10, scope: !239)
!244 = !DILocation(line: 120, column: 12, scope: !239)
!245 = !DILocation(line: 120, column: 10, scope: !239)
!246 = !DILocation(line: 121, column: 8, scope: !247)
!247 = distinct !DILexicalBlock(scope: !239, file: !45, line: 121, column: 8)
!248 = !DILocation(line: 121, column: 8, scope: !239)
!249 = !DILocalVariable(name: "dataLen", scope: !250, file: !45, line: 125, type: !70)
!250 = distinct !DILexicalBlock(scope: !251, file: !45, line: 123, column: 9)
!251 = distinct !DILexicalBlock(scope: !247, file: !45, line: 122, column: 5)
!252 = !DILocation(line: 125, column: 20, scope: !250)
!253 = !DILocation(line: 125, column: 37, scope: !250)
!254 = !DILocation(line: 125, column: 30, scope: !250)
!255 = !DILocalVariable(name: "pFile", scope: !250, file: !45, line: 126, type: !77)
!256 = !DILocation(line: 126, column: 20, scope: !250)
!257 = !DILocation(line: 128, column: 21, scope: !258)
!258 = distinct !DILexicalBlock(scope: !250, file: !45, line: 128, column: 17)
!259 = !DILocation(line: 128, column: 20, scope: !258)
!260 = !DILocation(line: 128, column: 29, scope: !258)
!261 = !DILocation(line: 128, column: 17, scope: !250)
!262 = !DILocation(line: 130, column: 25, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !45, line: 129, column: 13)
!264 = !DILocation(line: 130, column: 23, scope: !263)
!265 = !DILocation(line: 131, column: 21, scope: !266)
!266 = distinct !DILexicalBlock(scope: !263, file: !45, line: 131, column: 21)
!267 = !DILocation(line: 131, column: 27, scope: !266)
!268 = !DILocation(line: 131, column: 21, scope: !263)
!269 = !DILocation(line: 134, column: 31, scope: !270)
!270 = distinct !DILexicalBlock(scope: !271, file: !45, line: 134, column: 25)
!271 = distinct !DILexicalBlock(scope: !266, file: !45, line: 132, column: 17)
!272 = !DILocation(line: 134, column: 36, scope: !270)
!273 = !DILocation(line: 134, column: 35, scope: !270)
!274 = !DILocation(line: 134, column: 55, scope: !270)
!275 = !DILocation(line: 134, column: 54, scope: !270)
!276 = !DILocation(line: 134, column: 45, scope: !270)
!277 = !DILocation(line: 134, column: 65, scope: !270)
!278 = !DILocation(line: 134, column: 25, scope: !270)
!279 = !DILocation(line: 134, column: 72, scope: !270)
!280 = !DILocation(line: 134, column: 25, scope: !271)
!281 = !DILocation(line: 136, column: 25, scope: !282)
!282 = distinct !DILexicalBlock(scope: !270, file: !45, line: 135, column: 21)
!283 = !DILocation(line: 138, column: 25, scope: !282)
!284 = !DILocation(line: 138, column: 30, scope: !282)
!285 = !DILocation(line: 138, column: 39, scope: !282)
!286 = !DILocation(line: 139, column: 21, scope: !282)
!287 = !DILocation(line: 140, column: 28, scope: !271)
!288 = !DILocation(line: 140, column: 21, scope: !271)
!289 = !DILocation(line: 141, column: 17, scope: !271)
!290 = !DILocation(line: 142, column: 13, scope: !263)
!291 = !DILocation(line: 144, column: 5, scope: !251)
!292 = !DILocation(line: 145, column: 8, scope: !293)
!293 = distinct !DILexicalBlock(scope: !239, file: !45, line: 145, column: 8)
!294 = !DILocation(line: 145, column: 8, scope: !239)
!295 = !DILocation(line: 148, column: 24, scope: !296)
!296 = distinct !DILexicalBlock(scope: !293, file: !45, line: 146, column: 5)
!297 = !DILocation(line: 148, column: 9, scope: !296)
!298 = !DILocation(line: 149, column: 5, scope: !296)
!299 = !DILocation(line: 150, column: 1, scope: !239)
!300 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 153, type: !53, scopeLine: 154, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!301 = !DILocalVariable(name: "data", scope: !300, file: !45, line: 155, type: !42)
!302 = !DILocation(line: 155, column: 12, scope: !300)
!303 = !DILocalVariable(name: "dataBuffer", scope: !300, file: !45, line: 156, type: !58)
!304 = !DILocation(line: 156, column: 10, scope: !300)
!305 = !DILocation(line: 157, column: 12, scope: !300)
!306 = !DILocation(line: 157, column: 10, scope: !300)
!307 = !DILocation(line: 158, column: 8, scope: !308)
!308 = distinct !DILexicalBlock(scope: !300, file: !45, line: 158, column: 8)
!309 = !DILocation(line: 158, column: 8, scope: !300)
!310 = !DILocation(line: 161, column: 9, scope: !311)
!311 = distinct !DILexicalBlock(scope: !308, file: !45, line: 159, column: 5)
!312 = !DILocation(line: 162, column: 5, scope: !311)
!313 = !DILocation(line: 166, column: 16, scope: !314)
!314 = distinct !DILexicalBlock(scope: !308, file: !45, line: 164, column: 5)
!315 = !DILocation(line: 166, column: 9, scope: !314)
!316 = !DILocation(line: 168, column: 8, scope: !317)
!317 = distinct !DILexicalBlock(scope: !300, file: !45, line: 168, column: 8)
!318 = !DILocation(line: 168, column: 8, scope: !300)
!319 = !DILocation(line: 171, column: 16, scope: !320)
!320 = distinct !DILexicalBlock(scope: !317, file: !45, line: 169, column: 5)
!321 = !DILocation(line: 171, column: 9, scope: !320)
!322 = !DILocation(line: 172, column: 5, scope: !320)
!323 = !DILocation(line: 173, column: 1, scope: !300)
!324 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 176, type: !53, scopeLine: 177, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!325 = !DILocalVariable(name: "data", scope: !324, file: !45, line: 178, type: !42)
!326 = !DILocation(line: 178, column: 12, scope: !324)
!327 = !DILocalVariable(name: "dataBuffer", scope: !324, file: !45, line: 179, type: !58)
!328 = !DILocation(line: 179, column: 10, scope: !324)
!329 = !DILocation(line: 180, column: 12, scope: !324)
!330 = !DILocation(line: 180, column: 10, scope: !324)
!331 = !DILocation(line: 181, column: 8, scope: !332)
!332 = distinct !DILexicalBlock(scope: !324, file: !45, line: 181, column: 8)
!333 = !DILocation(line: 181, column: 8, scope: !324)
!334 = !DILocation(line: 184, column: 16, scope: !335)
!335 = distinct !DILexicalBlock(scope: !332, file: !45, line: 182, column: 5)
!336 = !DILocation(line: 184, column: 9, scope: !335)
!337 = !DILocation(line: 185, column: 5, scope: !335)
!338 = !DILocation(line: 186, column: 8, scope: !339)
!339 = distinct !DILexicalBlock(scope: !324, file: !45, line: 186, column: 8)
!340 = !DILocation(line: 186, column: 8, scope: !324)
!341 = !DILocation(line: 189, column: 16, scope: !342)
!342 = distinct !DILexicalBlock(scope: !339, file: !45, line: 187, column: 5)
!343 = !DILocation(line: 189, column: 9, scope: !342)
!344 = !DILocation(line: 190, column: 5, scope: !342)
!345 = !DILocation(line: 191, column: 1, scope: !324)
!346 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_11_good", scope: !45, file: !45, line: 193, type: !53, scopeLine: 194, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!347 = !DILocation(line: 195, column: 5, scope: !346)
!348 = !DILocation(line: 196, column: 5, scope: !346)
!349 = !DILocation(line: 197, column: 5, scope: !346)
!350 = !DILocation(line: 198, column: 5, scope: !346)
!351 = !DILocation(line: 199, column: 1, scope: !346)
!352 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !353, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !42}
!355 = !DILocalVariable(name: "line", arg: 1, scope: !352, file: !3, line: 11, type: !42)
!356 = !DILocation(line: 11, column: 25, scope: !352)
!357 = !DILocation(line: 13, column: 1, scope: !352)
!358 = !DILocation(line: 14, column: 8, scope: !359)
!359 = distinct !DILexicalBlock(scope: !352, file: !3, line: 14, column: 8)
!360 = !DILocation(line: 14, column: 13, scope: !359)
!361 = !DILocation(line: 14, column: 8, scope: !352)
!362 = !DILocation(line: 16, column: 24, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 15, column: 5)
!364 = !DILocation(line: 16, column: 9, scope: !363)
!365 = !DILocation(line: 17, column: 5, scope: !363)
!366 = !DILocation(line: 18, column: 5, scope: !352)
!367 = !DILocation(line: 19, column: 1, scope: !352)
!368 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !353, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!369 = !DILocalVariable(name: "line", arg: 1, scope: !368, file: !3, line: 20, type: !42)
!370 = !DILocation(line: 20, column: 29, scope: !368)
!371 = !DILocation(line: 22, column: 8, scope: !372)
!372 = distinct !DILexicalBlock(scope: !368, file: !3, line: 22, column: 8)
!373 = !DILocation(line: 22, column: 13, scope: !372)
!374 = !DILocation(line: 22, column: 8, scope: !368)
!375 = !DILocation(line: 24, column: 24, scope: !376)
!376 = distinct !DILexicalBlock(scope: !372, file: !3, line: 23, column: 5)
!377 = !DILocation(line: 24, column: 9, scope: !376)
!378 = !DILocation(line: 25, column: 5, scope: !376)
!379 = !DILocation(line: 26, column: 1, scope: !368)
!380 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !381, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !383}
!383 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !384, size: 64)
!384 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !71, line: 74, baseType: !23)
!385 = !DILocalVariable(name: "line", arg: 1, scope: !380, file: !3, line: 27, type: !383)
!386 = !DILocation(line: 27, column: 29, scope: !380)
!387 = !DILocation(line: 29, column: 8, scope: !388)
!388 = distinct !DILexicalBlock(scope: !380, file: !3, line: 29, column: 8)
!389 = !DILocation(line: 29, column: 13, scope: !388)
!390 = !DILocation(line: 29, column: 8, scope: !380)
!391 = !DILocation(line: 31, column: 27, scope: !392)
!392 = distinct !DILexicalBlock(scope: !388, file: !3, line: 30, column: 5)
!393 = !DILocation(line: 31, column: 9, scope: !392)
!394 = !DILocation(line: 32, column: 5, scope: !392)
!395 = !DILocation(line: 33, column: 1, scope: !380)
!396 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !397, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !23}
!399 = !DILocalVariable(name: "intNumber", arg: 1, scope: !396, file: !3, line: 35, type: !23)
!400 = !DILocation(line: 35, column: 24, scope: !396)
!401 = !DILocation(line: 37, column: 20, scope: !396)
!402 = !DILocation(line: 37, column: 5, scope: !396)
!403 = !DILocation(line: 38, column: 1, scope: !396)
!404 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !405, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!405 = !DISubroutineType(types: !406)
!406 = !{null, !407}
!407 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!408 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !404, file: !3, line: 40, type: !407)
!409 = !DILocation(line: 40, column: 28, scope: !404)
!410 = !DILocation(line: 42, column: 21, scope: !404)
!411 = !DILocation(line: 42, column: 5, scope: !404)
!412 = !DILocation(line: 43, column: 1, scope: !404)
!413 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !414, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !416}
!416 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!417 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !413, file: !3, line: 45, type: !416)
!418 = !DILocation(line: 45, column: 28, scope: !413)
!419 = !DILocation(line: 47, column: 20, scope: !413)
!420 = !DILocation(line: 47, column: 5, scope: !413)
!421 = !DILocation(line: 48, column: 1, scope: !413)
!422 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !423, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!423 = !DISubroutineType(types: !424)
!424 = !{null, !105}
!425 = !DILocalVariable(name: "longNumber", arg: 1, scope: !422, file: !3, line: 50, type: !105)
!426 = !DILocation(line: 50, column: 26, scope: !422)
!427 = !DILocation(line: 52, column: 21, scope: !422)
!428 = !DILocation(line: 52, column: 5, scope: !422)
!429 = !DILocation(line: 53, column: 1, scope: !422)
!430 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !431, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!431 = !DISubroutineType(types: !432)
!432 = !{null, !433}
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !434, line: 27, baseType: !435)
!434 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!435 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !104, line: 44, baseType: !105)
!436 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !430, file: !3, line: 55, type: !433)
!437 = !DILocation(line: 55, column: 33, scope: !430)
!438 = !DILocation(line: 57, column: 29, scope: !430)
!439 = !DILocation(line: 57, column: 5, scope: !430)
!440 = !DILocation(line: 58, column: 1, scope: !430)
!441 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !442, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !70}
!444 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !441, file: !3, line: 60, type: !70)
!445 = !DILocation(line: 60, column: 29, scope: !441)
!446 = !DILocation(line: 62, column: 21, scope: !441)
!447 = !DILocation(line: 62, column: 5, scope: !441)
!448 = !DILocation(line: 63, column: 1, scope: !441)
!449 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !450, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !43}
!452 = !DILocalVariable(name: "charHex", arg: 1, scope: !449, file: !3, line: 65, type: !43)
!453 = !DILocation(line: 65, column: 29, scope: !449)
!454 = !DILocation(line: 67, column: 22, scope: !449)
!455 = !DILocation(line: 67, column: 5, scope: !449)
!456 = !DILocation(line: 68, column: 1, scope: !449)
!457 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !458, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !384}
!460 = !DILocalVariable(name: "wideChar", arg: 1, scope: !457, file: !3, line: 70, type: !384)
!461 = !DILocation(line: 70, column: 29, scope: !457)
!462 = !DILocalVariable(name: "s", scope: !457, file: !3, line: 74, type: !463)
!463 = !DICompositeType(tag: DW_TAG_array_type, baseType: !384, size: 64, elements: !464)
!464 = !{!465}
!465 = !DISubrange(count: 2)
!466 = !DILocation(line: 74, column: 13, scope: !457)
!467 = !DILocation(line: 75, column: 16, scope: !457)
!468 = !DILocation(line: 75, column: 9, scope: !457)
!469 = !DILocation(line: 75, column: 14, scope: !457)
!470 = !DILocation(line: 76, column: 9, scope: !457)
!471 = !DILocation(line: 76, column: 14, scope: !457)
!472 = !DILocation(line: 77, column: 21, scope: !457)
!473 = !DILocation(line: 77, column: 5, scope: !457)
!474 = !DILocation(line: 78, column: 1, scope: !457)
!475 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !476, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !7}
!478 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !475, file: !3, line: 80, type: !7)
!479 = !DILocation(line: 80, column: 33, scope: !475)
!480 = !DILocation(line: 82, column: 20, scope: !475)
!481 = !DILocation(line: 82, column: 5, scope: !475)
!482 = !DILocation(line: 83, column: 1, scope: !475)
!483 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !484, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!484 = !DISubroutineType(types: !485)
!485 = !{null, !25}
!486 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !483, file: !3, line: 85, type: !25)
!487 = !DILocation(line: 85, column: 45, scope: !483)
!488 = !DILocation(line: 87, column: 22, scope: !483)
!489 = !DILocation(line: 87, column: 5, scope: !483)
!490 = !DILocation(line: 88, column: 1, scope: !483)
!491 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !492, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!492 = !DISubroutineType(types: !493)
!493 = !{null, !494}
!494 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!495 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !491, file: !3, line: 90, type: !494)
!496 = !DILocation(line: 90, column: 29, scope: !491)
!497 = !DILocation(line: 92, column: 20, scope: !491)
!498 = !DILocation(line: 92, column: 5, scope: !491)
!499 = !DILocation(line: 93, column: 1, scope: !491)
!500 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !501, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!501 = !DISubroutineType(types: !502)
!502 = !{null, !503}
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !505, line: 100, baseType: !506)
!505 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_020/source_code")
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !505, line: 96, size: 64, elements: !507)
!507 = !{!508, !509}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !506, file: !505, line: 98, baseType: !23, size: 32)
!509 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !506, file: !505, line: 99, baseType: !23, size: 32, offset: 32)
!510 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !500, file: !3, line: 95, type: !503)
!511 = !DILocation(line: 95, column: 40, scope: !500)
!512 = !DILocation(line: 97, column: 26, scope: !500)
!513 = !DILocation(line: 97, column: 47, scope: !500)
!514 = !DILocation(line: 97, column: 55, scope: !500)
!515 = !DILocation(line: 97, column: 76, scope: !500)
!516 = !DILocation(line: 97, column: 5, scope: !500)
!517 = !DILocation(line: 98, column: 1, scope: !500)
!518 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !519, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!519 = !DISubroutineType(types: !520)
!520 = !{null, !521, !70}
!521 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!522 = !DILocalVariable(name: "bytes", arg: 1, scope: !518, file: !3, line: 100, type: !521)
!523 = !DILocation(line: 100, column: 38, scope: !518)
!524 = !DILocalVariable(name: "numBytes", arg: 2, scope: !518, file: !3, line: 100, type: !70)
!525 = !DILocation(line: 100, column: 52, scope: !518)
!526 = !DILocalVariable(name: "i", scope: !518, file: !3, line: 102, type: !70)
!527 = !DILocation(line: 102, column: 12, scope: !518)
!528 = !DILocation(line: 103, column: 12, scope: !529)
!529 = distinct !DILexicalBlock(scope: !518, file: !3, line: 103, column: 5)
!530 = !DILocation(line: 103, column: 10, scope: !529)
!531 = !DILocation(line: 103, column: 17, scope: !532)
!532 = distinct !DILexicalBlock(scope: !529, file: !3, line: 103, column: 5)
!533 = !DILocation(line: 103, column: 21, scope: !532)
!534 = !DILocation(line: 103, column: 19, scope: !532)
!535 = !DILocation(line: 103, column: 5, scope: !529)
!536 = !DILocation(line: 105, column: 24, scope: !537)
!537 = distinct !DILexicalBlock(scope: !532, file: !3, line: 104, column: 5)
!538 = !DILocation(line: 105, column: 30, scope: !537)
!539 = !DILocation(line: 105, column: 9, scope: !537)
!540 = !DILocation(line: 106, column: 5, scope: !537)
!541 = !DILocation(line: 103, column: 31, scope: !532)
!542 = !DILocation(line: 103, column: 5, scope: !532)
!543 = distinct !{!543, !535, !544, !545}
!544 = !DILocation(line: 106, column: 5, scope: !529)
!545 = !{!"llvm.loop.mustprogress"}
!546 = !DILocation(line: 107, column: 5, scope: !518)
!547 = !DILocation(line: 108, column: 1, scope: !518)
!548 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !549, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!549 = !DISubroutineType(types: !550)
!550 = !{!70, !521, !70, !42}
!551 = !DILocalVariable(name: "bytes", arg: 1, scope: !548, file: !3, line: 113, type: !521)
!552 = !DILocation(line: 113, column: 39, scope: !548)
!553 = !DILocalVariable(name: "numBytes", arg: 2, scope: !548, file: !3, line: 113, type: !70)
!554 = !DILocation(line: 113, column: 53, scope: !548)
!555 = !DILocalVariable(name: "hex", arg: 3, scope: !548, file: !3, line: 113, type: !42)
!556 = !DILocation(line: 113, column: 71, scope: !548)
!557 = !DILocalVariable(name: "numWritten", scope: !548, file: !3, line: 115, type: !70)
!558 = !DILocation(line: 115, column: 12, scope: !548)
!559 = !DILocation(line: 121, column: 5, scope: !548)
!560 = !DILocation(line: 121, column: 12, scope: !548)
!561 = !DILocation(line: 121, column: 25, scope: !548)
!562 = !DILocation(line: 121, column: 23, scope: !548)
!563 = !DILocation(line: 121, column: 34, scope: !548)
!564 = !DILocation(line: 121, column: 37, scope: !548)
!565 = !DILocation(line: 121, column: 67, scope: !548)
!566 = !DILocation(line: 121, column: 70, scope: !548)
!567 = !DILocation(line: 0, scope: !548)
!568 = !DILocalVariable(name: "byte", scope: !569, file: !3, line: 123, type: !23)
!569 = distinct !DILexicalBlock(scope: !548, file: !3, line: 122, column: 5)
