; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_08.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_017/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "staticReturnsTrue", scope: !45, file: !45, line: 34, type: !53, scopeLine: 35, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{!23}
!55 = !DILocation(line: 36, column: 5, scope: !52)
!56 = distinct !DISubprogram(name: "staticReturnsFalse", scope: !45, file: !45, line: 39, type: !53, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!57 = !DILocation(line: 41, column: 5, scope: !56)
!58 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_08_bad", scope: !45, file: !45, line: 46, type: !59, scopeLine: 47, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!59 = !DISubroutineType(types: !60)
!60 = !{null}
!61 = !DILocalVariable(name: "data", scope: !58, file: !45, line: 48, type: !42)
!62 = !DILocation(line: 48, column: 12, scope: !58)
!63 = !DILocalVariable(name: "dataBuffer", scope: !58, file: !45, line: 49, type: !64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !65)
!65 = !{!66}
!66 = !DISubrange(count: 100)
!67 = !DILocation(line: 49, column: 10, scope: !58)
!68 = !DILocation(line: 50, column: 12, scope: !58)
!69 = !DILocation(line: 50, column: 10, scope: !58)
!70 = !DILocation(line: 51, column: 8, scope: !71)
!71 = distinct !DILexicalBlock(scope: !58, file: !45, line: 51, column: 8)
!72 = !DILocation(line: 51, column: 8, scope: !58)
!73 = !DILocalVariable(name: "dataLen", scope: !74, file: !45, line: 55, type: !76)
!74 = distinct !DILexicalBlock(scope: !75, file: !45, line: 53, column: 9)
!75 = distinct !DILexicalBlock(scope: !71, file: !45, line: 52, column: 5)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !77, line: 46, baseType: !78)
!77 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!78 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!79 = !DILocation(line: 55, column: 20, scope: !74)
!80 = !DILocation(line: 55, column: 37, scope: !74)
!81 = !DILocation(line: 55, column: 30, scope: !74)
!82 = !DILocalVariable(name: "pFile", scope: !74, file: !45, line: 56, type: !83)
!83 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !84, size: 64)
!84 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !85, line: 7, baseType: !86)
!85 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!86 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !87, line: 49, size: 1728, elements: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !104, !106, !107, !108, !112, !113, !115, !119, !122, !124, !127, !130, !131, !132, !133, !134}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !86, file: !87, line: 51, baseType: !23, size: 32)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !86, file: !87, line: 54, baseType: !42, size: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !86, file: !87, line: 55, baseType: !42, size: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !86, file: !87, line: 56, baseType: !42, size: 64, offset: 192)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !86, file: !87, line: 57, baseType: !42, size: 64, offset: 256)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !86, file: !87, line: 58, baseType: !42, size: 64, offset: 320)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !86, file: !87, line: 59, baseType: !42, size: 64, offset: 384)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !86, file: !87, line: 60, baseType: !42, size: 64, offset: 448)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !86, file: !87, line: 61, baseType: !42, size: 64, offset: 512)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !86, file: !87, line: 64, baseType: !42, size: 64, offset: 576)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !86, file: !87, line: 65, baseType: !42, size: 64, offset: 640)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !86, file: !87, line: 66, baseType: !42, size: 64, offset: 704)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !86, file: !87, line: 68, baseType: !102, size: 64, offset: 768)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !87, line: 36, flags: DIFlagFwdDecl)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !86, file: !87, line: 70, baseType: !105, size: 64, offset: 832)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !86, file: !87, line: 72, baseType: !23, size: 32, offset: 896)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !86, file: !87, line: 73, baseType: !23, size: 32, offset: 928)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !86, file: !87, line: 74, baseType: !109, size: 64, offset: 960)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !110, line: 152, baseType: !111)
!110 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!111 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !86, file: !87, line: 77, baseType: !24, size: 16, offset: 1024)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !86, file: !87, line: 78, baseType: !114, size: 8, offset: 1040)
!114 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !86, file: !87, line: 79, baseType: !116, size: 8, offset: 1048)
!116 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !117)
!117 = !{!118}
!118 = !DISubrange(count: 1)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !86, file: !87, line: 81, baseType: !120, size: 64, offset: 1088)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !87, line: 43, baseType: null)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !86, file: !87, line: 89, baseType: !123, size: 64, offset: 1152)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !110, line: 153, baseType: !111)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !86, file: !87, line: 91, baseType: !125, size: 64, offset: 1216)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !87, line: 37, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !86, file: !87, line: 92, baseType: !128, size: 64, offset: 1280)
!128 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !129, size: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !87, line: 38, flags: DIFlagFwdDecl)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !86, file: !87, line: 93, baseType: !105, size: 64, offset: 1344)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !86, file: !87, line: 94, baseType: !22, size: 64, offset: 1408)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !86, file: !87, line: 95, baseType: !76, size: 64, offset: 1472)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !86, file: !87, line: 96, baseType: !23, size: 32, offset: 1536)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !86, file: !87, line: 98, baseType: !135, size: 160, offset: 1568)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !136)
!136 = !{!137}
!137 = !DISubrange(count: 20)
!138 = !DILocation(line: 56, column: 20, scope: !74)
!139 = !DILocation(line: 58, column: 21, scope: !140)
!140 = distinct !DILexicalBlock(scope: !74, file: !45, line: 58, column: 17)
!141 = !DILocation(line: 58, column: 20, scope: !140)
!142 = !DILocation(line: 58, column: 29, scope: !140)
!143 = !DILocation(line: 58, column: 17, scope: !74)
!144 = !DILocation(line: 60, column: 25, scope: !145)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 59, column: 13)
!146 = !DILocation(line: 60, column: 23, scope: !145)
!147 = !DILocation(line: 61, column: 21, scope: !148)
!148 = distinct !DILexicalBlock(scope: !145, file: !45, line: 61, column: 21)
!149 = !DILocation(line: 61, column: 27, scope: !148)
!150 = !DILocation(line: 61, column: 21, scope: !145)
!151 = !DILocation(line: 64, column: 31, scope: !152)
!152 = distinct !DILexicalBlock(scope: !153, file: !45, line: 64, column: 25)
!153 = distinct !DILexicalBlock(scope: !148, file: !45, line: 62, column: 17)
!154 = !DILocation(line: 64, column: 36, scope: !152)
!155 = !DILocation(line: 64, column: 35, scope: !152)
!156 = !DILocation(line: 64, column: 55, scope: !152)
!157 = !DILocation(line: 64, column: 54, scope: !152)
!158 = !DILocation(line: 64, column: 45, scope: !152)
!159 = !DILocation(line: 64, column: 65, scope: !152)
!160 = !DILocation(line: 64, column: 25, scope: !152)
!161 = !DILocation(line: 64, column: 72, scope: !152)
!162 = !DILocation(line: 64, column: 25, scope: !153)
!163 = !DILocation(line: 66, column: 25, scope: !164)
!164 = distinct !DILexicalBlock(scope: !152, file: !45, line: 65, column: 21)
!165 = !DILocation(line: 68, column: 25, scope: !164)
!166 = !DILocation(line: 68, column: 30, scope: !164)
!167 = !DILocation(line: 68, column: 39, scope: !164)
!168 = !DILocation(line: 69, column: 21, scope: !164)
!169 = !DILocation(line: 70, column: 28, scope: !153)
!170 = !DILocation(line: 70, column: 21, scope: !153)
!171 = !DILocation(line: 71, column: 17, scope: !153)
!172 = !DILocation(line: 72, column: 13, scope: !145)
!173 = !DILocation(line: 74, column: 5, scope: !75)
!174 = !DILocation(line: 75, column: 8, scope: !175)
!175 = distinct !DILexicalBlock(scope: !58, file: !45, line: 75, column: 8)
!176 = !DILocation(line: 75, column: 8, scope: !58)
!177 = !DILocation(line: 78, column: 16, scope: !178)
!178 = distinct !DILexicalBlock(scope: !175, file: !45, line: 76, column: 5)
!179 = !DILocation(line: 78, column: 9, scope: !178)
!180 = !DILocation(line: 79, column: 5, scope: !178)
!181 = !DILocation(line: 80, column: 1, scope: !58)
!182 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 87, type: !59, scopeLine: 88, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!183 = !DILocalVariable(name: "data", scope: !182, file: !45, line: 89, type: !42)
!184 = !DILocation(line: 89, column: 12, scope: !182)
!185 = !DILocalVariable(name: "dataBuffer", scope: !182, file: !45, line: 90, type: !64)
!186 = !DILocation(line: 90, column: 10, scope: !182)
!187 = !DILocation(line: 91, column: 12, scope: !182)
!188 = !DILocation(line: 91, column: 10, scope: !182)
!189 = !DILocation(line: 92, column: 8, scope: !190)
!190 = distinct !DILexicalBlock(scope: !182, file: !45, line: 92, column: 8)
!191 = !DILocation(line: 92, column: 8, scope: !182)
!192 = !DILocalVariable(name: "dataLen", scope: !193, file: !45, line: 96, type: !76)
!193 = distinct !DILexicalBlock(scope: !194, file: !45, line: 94, column: 9)
!194 = distinct !DILexicalBlock(scope: !190, file: !45, line: 93, column: 5)
!195 = !DILocation(line: 96, column: 20, scope: !193)
!196 = !DILocation(line: 96, column: 37, scope: !193)
!197 = !DILocation(line: 96, column: 30, scope: !193)
!198 = !DILocalVariable(name: "pFile", scope: !193, file: !45, line: 97, type: !83)
!199 = !DILocation(line: 97, column: 20, scope: !193)
!200 = !DILocation(line: 99, column: 21, scope: !201)
!201 = distinct !DILexicalBlock(scope: !193, file: !45, line: 99, column: 17)
!202 = !DILocation(line: 99, column: 20, scope: !201)
!203 = !DILocation(line: 99, column: 29, scope: !201)
!204 = !DILocation(line: 99, column: 17, scope: !193)
!205 = !DILocation(line: 101, column: 25, scope: !206)
!206 = distinct !DILexicalBlock(scope: !201, file: !45, line: 100, column: 13)
!207 = !DILocation(line: 101, column: 23, scope: !206)
!208 = !DILocation(line: 102, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !206, file: !45, line: 102, column: 21)
!210 = !DILocation(line: 102, column: 27, scope: !209)
!211 = !DILocation(line: 102, column: 21, scope: !206)
!212 = !DILocation(line: 105, column: 31, scope: !213)
!213 = distinct !DILexicalBlock(scope: !214, file: !45, line: 105, column: 25)
!214 = distinct !DILexicalBlock(scope: !209, file: !45, line: 103, column: 17)
!215 = !DILocation(line: 105, column: 36, scope: !213)
!216 = !DILocation(line: 105, column: 35, scope: !213)
!217 = !DILocation(line: 105, column: 55, scope: !213)
!218 = !DILocation(line: 105, column: 54, scope: !213)
!219 = !DILocation(line: 105, column: 45, scope: !213)
!220 = !DILocation(line: 105, column: 65, scope: !213)
!221 = !DILocation(line: 105, column: 25, scope: !213)
!222 = !DILocation(line: 105, column: 72, scope: !213)
!223 = !DILocation(line: 105, column: 25, scope: !214)
!224 = !DILocation(line: 107, column: 25, scope: !225)
!225 = distinct !DILexicalBlock(scope: !213, file: !45, line: 106, column: 21)
!226 = !DILocation(line: 109, column: 25, scope: !225)
!227 = !DILocation(line: 109, column: 30, scope: !225)
!228 = !DILocation(line: 109, column: 39, scope: !225)
!229 = !DILocation(line: 110, column: 21, scope: !225)
!230 = !DILocation(line: 111, column: 28, scope: !214)
!231 = !DILocation(line: 111, column: 21, scope: !214)
!232 = !DILocation(line: 112, column: 17, scope: !214)
!233 = !DILocation(line: 113, column: 13, scope: !206)
!234 = !DILocation(line: 115, column: 5, scope: !194)
!235 = !DILocation(line: 116, column: 8, scope: !236)
!236 = distinct !DILexicalBlock(scope: !182, file: !45, line: 116, column: 8)
!237 = !DILocation(line: 116, column: 8, scope: !182)
!238 = !DILocation(line: 119, column: 9, scope: !239)
!239 = distinct !DILexicalBlock(scope: !236, file: !45, line: 117, column: 5)
!240 = !DILocation(line: 120, column: 5, scope: !239)
!241 = !DILocation(line: 124, column: 24, scope: !242)
!242 = distinct !DILexicalBlock(scope: !236, file: !45, line: 122, column: 5)
!243 = !DILocation(line: 124, column: 9, scope: !242)
!244 = !DILocation(line: 126, column: 1, scope: !182)
!245 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 129, type: !59, scopeLine: 130, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!246 = !DILocalVariable(name: "data", scope: !245, file: !45, line: 131, type: !42)
!247 = !DILocation(line: 131, column: 12, scope: !245)
!248 = !DILocalVariable(name: "dataBuffer", scope: !245, file: !45, line: 132, type: !64)
!249 = !DILocation(line: 132, column: 10, scope: !245)
!250 = !DILocation(line: 133, column: 12, scope: !245)
!251 = !DILocation(line: 133, column: 10, scope: !245)
!252 = !DILocation(line: 134, column: 8, scope: !253)
!253 = distinct !DILexicalBlock(scope: !245, file: !45, line: 134, column: 8)
!254 = !DILocation(line: 134, column: 8, scope: !245)
!255 = !DILocalVariable(name: "dataLen", scope: !256, file: !45, line: 138, type: !76)
!256 = distinct !DILexicalBlock(scope: !257, file: !45, line: 136, column: 9)
!257 = distinct !DILexicalBlock(scope: !253, file: !45, line: 135, column: 5)
!258 = !DILocation(line: 138, column: 20, scope: !256)
!259 = !DILocation(line: 138, column: 37, scope: !256)
!260 = !DILocation(line: 138, column: 30, scope: !256)
!261 = !DILocalVariable(name: "pFile", scope: !256, file: !45, line: 139, type: !83)
!262 = !DILocation(line: 139, column: 20, scope: !256)
!263 = !DILocation(line: 141, column: 21, scope: !264)
!264 = distinct !DILexicalBlock(scope: !256, file: !45, line: 141, column: 17)
!265 = !DILocation(line: 141, column: 20, scope: !264)
!266 = !DILocation(line: 141, column: 29, scope: !264)
!267 = !DILocation(line: 141, column: 17, scope: !256)
!268 = !DILocation(line: 143, column: 25, scope: !269)
!269 = distinct !DILexicalBlock(scope: !264, file: !45, line: 142, column: 13)
!270 = !DILocation(line: 143, column: 23, scope: !269)
!271 = !DILocation(line: 144, column: 21, scope: !272)
!272 = distinct !DILexicalBlock(scope: !269, file: !45, line: 144, column: 21)
!273 = !DILocation(line: 144, column: 27, scope: !272)
!274 = !DILocation(line: 144, column: 21, scope: !269)
!275 = !DILocation(line: 147, column: 31, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !45, line: 147, column: 25)
!277 = distinct !DILexicalBlock(scope: !272, file: !45, line: 145, column: 17)
!278 = !DILocation(line: 147, column: 36, scope: !276)
!279 = !DILocation(line: 147, column: 35, scope: !276)
!280 = !DILocation(line: 147, column: 55, scope: !276)
!281 = !DILocation(line: 147, column: 54, scope: !276)
!282 = !DILocation(line: 147, column: 45, scope: !276)
!283 = !DILocation(line: 147, column: 65, scope: !276)
!284 = !DILocation(line: 147, column: 25, scope: !276)
!285 = !DILocation(line: 147, column: 72, scope: !276)
!286 = !DILocation(line: 147, column: 25, scope: !277)
!287 = !DILocation(line: 149, column: 25, scope: !288)
!288 = distinct !DILexicalBlock(scope: !276, file: !45, line: 148, column: 21)
!289 = !DILocation(line: 151, column: 25, scope: !288)
!290 = !DILocation(line: 151, column: 30, scope: !288)
!291 = !DILocation(line: 151, column: 39, scope: !288)
!292 = !DILocation(line: 152, column: 21, scope: !288)
!293 = !DILocation(line: 153, column: 28, scope: !277)
!294 = !DILocation(line: 153, column: 21, scope: !277)
!295 = !DILocation(line: 154, column: 17, scope: !277)
!296 = !DILocation(line: 155, column: 13, scope: !269)
!297 = !DILocation(line: 157, column: 5, scope: !257)
!298 = !DILocation(line: 158, column: 8, scope: !299)
!299 = distinct !DILexicalBlock(scope: !245, file: !45, line: 158, column: 8)
!300 = !DILocation(line: 158, column: 8, scope: !245)
!301 = !DILocation(line: 161, column: 24, scope: !302)
!302 = distinct !DILexicalBlock(scope: !299, file: !45, line: 159, column: 5)
!303 = !DILocation(line: 161, column: 9, scope: !302)
!304 = !DILocation(line: 162, column: 5, scope: !302)
!305 = !DILocation(line: 163, column: 1, scope: !245)
!306 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 166, type: !59, scopeLine: 167, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!307 = !DILocalVariable(name: "data", scope: !306, file: !45, line: 168, type: !42)
!308 = !DILocation(line: 168, column: 12, scope: !306)
!309 = !DILocalVariable(name: "dataBuffer", scope: !306, file: !45, line: 169, type: !64)
!310 = !DILocation(line: 169, column: 10, scope: !306)
!311 = !DILocation(line: 170, column: 12, scope: !306)
!312 = !DILocation(line: 170, column: 10, scope: !306)
!313 = !DILocation(line: 171, column: 8, scope: !314)
!314 = distinct !DILexicalBlock(scope: !306, file: !45, line: 171, column: 8)
!315 = !DILocation(line: 171, column: 8, scope: !306)
!316 = !DILocation(line: 174, column: 9, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !45, line: 172, column: 5)
!318 = !DILocation(line: 175, column: 5, scope: !317)
!319 = !DILocation(line: 179, column: 16, scope: !320)
!320 = distinct !DILexicalBlock(scope: !314, file: !45, line: 177, column: 5)
!321 = !DILocation(line: 179, column: 9, scope: !320)
!322 = !DILocation(line: 181, column: 8, scope: !323)
!323 = distinct !DILexicalBlock(scope: !306, file: !45, line: 181, column: 8)
!324 = !DILocation(line: 181, column: 8, scope: !306)
!325 = !DILocation(line: 184, column: 16, scope: !326)
!326 = distinct !DILexicalBlock(scope: !323, file: !45, line: 182, column: 5)
!327 = !DILocation(line: 184, column: 9, scope: !326)
!328 = !DILocation(line: 185, column: 5, scope: !326)
!329 = !DILocation(line: 186, column: 1, scope: !306)
!330 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 189, type: !59, scopeLine: 190, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!331 = !DILocalVariable(name: "data", scope: !330, file: !45, line: 191, type: !42)
!332 = !DILocation(line: 191, column: 12, scope: !330)
!333 = !DILocalVariable(name: "dataBuffer", scope: !330, file: !45, line: 192, type: !64)
!334 = !DILocation(line: 192, column: 10, scope: !330)
!335 = !DILocation(line: 193, column: 12, scope: !330)
!336 = !DILocation(line: 193, column: 10, scope: !330)
!337 = !DILocation(line: 194, column: 8, scope: !338)
!338 = distinct !DILexicalBlock(scope: !330, file: !45, line: 194, column: 8)
!339 = !DILocation(line: 194, column: 8, scope: !330)
!340 = !DILocation(line: 197, column: 16, scope: !341)
!341 = distinct !DILexicalBlock(scope: !338, file: !45, line: 195, column: 5)
!342 = !DILocation(line: 197, column: 9, scope: !341)
!343 = !DILocation(line: 198, column: 5, scope: !341)
!344 = !DILocation(line: 199, column: 8, scope: !345)
!345 = distinct !DILexicalBlock(scope: !330, file: !45, line: 199, column: 8)
!346 = !DILocation(line: 199, column: 8, scope: !330)
!347 = !DILocation(line: 202, column: 16, scope: !348)
!348 = distinct !DILexicalBlock(scope: !345, file: !45, line: 200, column: 5)
!349 = !DILocation(line: 202, column: 9, scope: !348)
!350 = !DILocation(line: 203, column: 5, scope: !348)
!351 = !DILocation(line: 204, column: 1, scope: !330)
!352 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_08_good", scope: !45, file: !45, line: 206, type: !59, scopeLine: 207, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!353 = !DILocation(line: 208, column: 5, scope: !352)
!354 = !DILocation(line: 209, column: 5, scope: !352)
!355 = !DILocation(line: 210, column: 5, scope: !352)
!356 = !DILocation(line: 211, column: 5, scope: !352)
!357 = !DILocation(line: 212, column: 1, scope: !352)
!358 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !359, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !42}
!361 = !DILocalVariable(name: "line", arg: 1, scope: !358, file: !3, line: 11, type: !42)
!362 = !DILocation(line: 11, column: 25, scope: !358)
!363 = !DILocation(line: 13, column: 1, scope: !358)
!364 = !DILocation(line: 14, column: 8, scope: !365)
!365 = distinct !DILexicalBlock(scope: !358, file: !3, line: 14, column: 8)
!366 = !DILocation(line: 14, column: 13, scope: !365)
!367 = !DILocation(line: 14, column: 8, scope: !358)
!368 = !DILocation(line: 16, column: 24, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !3, line: 15, column: 5)
!370 = !DILocation(line: 16, column: 9, scope: !369)
!371 = !DILocation(line: 17, column: 5, scope: !369)
!372 = !DILocation(line: 18, column: 5, scope: !358)
!373 = !DILocation(line: 19, column: 1, scope: !358)
!374 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !359, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!375 = !DILocalVariable(name: "line", arg: 1, scope: !374, file: !3, line: 20, type: !42)
!376 = !DILocation(line: 20, column: 29, scope: !374)
!377 = !DILocation(line: 22, column: 8, scope: !378)
!378 = distinct !DILexicalBlock(scope: !374, file: !3, line: 22, column: 8)
!379 = !DILocation(line: 22, column: 13, scope: !378)
!380 = !DILocation(line: 22, column: 8, scope: !374)
!381 = !DILocation(line: 24, column: 24, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !3, line: 23, column: 5)
!383 = !DILocation(line: 24, column: 9, scope: !382)
!384 = !DILocation(line: 25, column: 5, scope: !382)
!385 = !DILocation(line: 26, column: 1, scope: !374)
!386 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !387, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !77, line: 74, baseType: !23)
!391 = !DILocalVariable(name: "line", arg: 1, scope: !386, file: !3, line: 27, type: !389)
!392 = !DILocation(line: 27, column: 29, scope: !386)
!393 = !DILocation(line: 29, column: 8, scope: !394)
!394 = distinct !DILexicalBlock(scope: !386, file: !3, line: 29, column: 8)
!395 = !DILocation(line: 29, column: 13, scope: !394)
!396 = !DILocation(line: 29, column: 8, scope: !386)
!397 = !DILocation(line: 31, column: 27, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !3, line: 30, column: 5)
!399 = !DILocation(line: 31, column: 9, scope: !398)
!400 = !DILocation(line: 32, column: 5, scope: !398)
!401 = !DILocation(line: 33, column: 1, scope: !386)
!402 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !403, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !23}
!405 = !DILocalVariable(name: "intNumber", arg: 1, scope: !402, file: !3, line: 35, type: !23)
!406 = !DILocation(line: 35, column: 24, scope: !402)
!407 = !DILocation(line: 37, column: 20, scope: !402)
!408 = !DILocation(line: 37, column: 5, scope: !402)
!409 = !DILocation(line: 38, column: 1, scope: !402)
!410 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !411, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !413}
!413 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!414 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !410, file: !3, line: 40, type: !413)
!415 = !DILocation(line: 40, column: 28, scope: !410)
!416 = !DILocation(line: 42, column: 21, scope: !410)
!417 = !DILocation(line: 42, column: 5, scope: !410)
!418 = !DILocation(line: 43, column: 1, scope: !410)
!419 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !420, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422}
!422 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!423 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !419, file: !3, line: 45, type: !422)
!424 = !DILocation(line: 45, column: 28, scope: !419)
!425 = !DILocation(line: 47, column: 20, scope: !419)
!426 = !DILocation(line: 47, column: 5, scope: !419)
!427 = !DILocation(line: 48, column: 1, scope: !419)
!428 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !429, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !111}
!431 = !DILocalVariable(name: "longNumber", arg: 1, scope: !428, file: !3, line: 50, type: !111)
!432 = !DILocation(line: 50, column: 26, scope: !428)
!433 = !DILocation(line: 52, column: 21, scope: !428)
!434 = !DILocation(line: 52, column: 5, scope: !428)
!435 = !DILocation(line: 53, column: 1, scope: !428)
!436 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !437, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !439}
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !440, line: 27, baseType: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !110, line: 44, baseType: !111)
!442 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !436, file: !3, line: 55, type: !439)
!443 = !DILocation(line: 55, column: 33, scope: !436)
!444 = !DILocation(line: 57, column: 29, scope: !436)
!445 = !DILocation(line: 57, column: 5, scope: !436)
!446 = !DILocation(line: 58, column: 1, scope: !436)
!447 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !448, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !76}
!450 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !447, file: !3, line: 60, type: !76)
!451 = !DILocation(line: 60, column: 29, scope: !447)
!452 = !DILocation(line: 62, column: 21, scope: !447)
!453 = !DILocation(line: 62, column: 5, scope: !447)
!454 = !DILocation(line: 63, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !456, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !43}
!458 = !DILocalVariable(name: "charHex", arg: 1, scope: !455, file: !3, line: 65, type: !43)
!459 = !DILocation(line: 65, column: 29, scope: !455)
!460 = !DILocation(line: 67, column: 22, scope: !455)
!461 = !DILocation(line: 67, column: 5, scope: !455)
!462 = !DILocation(line: 68, column: 1, scope: !455)
!463 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !464, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !390}
!466 = !DILocalVariable(name: "wideChar", arg: 1, scope: !463, file: !3, line: 70, type: !390)
!467 = !DILocation(line: 70, column: 29, scope: !463)
!468 = !DILocalVariable(name: "s", scope: !463, file: !3, line: 74, type: !469)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DILocation(line: 74, column: 13, scope: !463)
!473 = !DILocation(line: 75, column: 16, scope: !463)
!474 = !DILocation(line: 75, column: 9, scope: !463)
!475 = !DILocation(line: 75, column: 14, scope: !463)
!476 = !DILocation(line: 76, column: 9, scope: !463)
!477 = !DILocation(line: 76, column: 14, scope: !463)
!478 = !DILocation(line: 77, column: 21, scope: !463)
!479 = !DILocation(line: 77, column: 5, scope: !463)
!480 = !DILocation(line: 78, column: 1, scope: !463)
!481 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !482, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !7}
!484 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !481, file: !3, line: 80, type: !7)
!485 = !DILocation(line: 80, column: 33, scope: !481)
!486 = !DILocation(line: 82, column: 20, scope: !481)
!487 = !DILocation(line: 82, column: 5, scope: !481)
!488 = !DILocation(line: 83, column: 1, scope: !481)
!489 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !490, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !25}
!492 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !489, file: !3, line: 85, type: !25)
!493 = !DILocation(line: 85, column: 45, scope: !489)
!494 = !DILocation(line: 87, column: 22, scope: !489)
!495 = !DILocation(line: 87, column: 5, scope: !489)
!496 = !DILocation(line: 88, column: 1, scope: !489)
!497 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !498, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !500}
!500 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!501 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !497, file: !3, line: 90, type: !500)
!502 = !DILocation(line: 90, column: 29, scope: !497)
!503 = !DILocation(line: 92, column: 20, scope: !497)
!504 = !DILocation(line: 92, column: 5, scope: !497)
!505 = !DILocation(line: 93, column: 1, scope: !497)
!506 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !507, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !511, line: 100, baseType: !512)
!511 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_017/source_code")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !511, line: 96, size: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !512, file: !511, line: 98, baseType: !23, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !512, file: !511, line: 99, baseType: !23, size: 32, offset: 32)
!516 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !506, file: !3, line: 95, type: !509)
!517 = !DILocation(line: 95, column: 40, scope: !506)
!518 = !DILocation(line: 97, column: 26, scope: !506)
!519 = !DILocation(line: 97, column: 47, scope: !506)
!520 = !DILocation(line: 97, column: 55, scope: !506)
!521 = !DILocation(line: 97, column: 76, scope: !506)
!522 = !DILocation(line: 97, column: 5, scope: !506)
!523 = !DILocation(line: 98, column: 1, scope: !506)
!524 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !525, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !527, !76}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!528 = !DILocalVariable(name: "bytes", arg: 1, scope: !524, file: !3, line: 100, type: !527)
!529 = !DILocation(line: 100, column: 38, scope: !524)
!530 = !DILocalVariable(name: "numBytes", arg: 2, scope: !524, file: !3, line: 100, type: !76)
!531 = !DILocation(line: 100, column: 52, scope: !524)
!532 = !DILocalVariable(name: "i", scope: !524, file: !3, line: 102, type: !76)
!533 = !DILocation(line: 102, column: 12, scope: !524)
!534 = !DILocation(line: 103, column: 12, scope: !535)
!535 = distinct !DILexicalBlock(scope: !524, file: !3, line: 103, column: 5)
!536 = !DILocation(line: 103, column: 10, scope: !535)
!537 = !DILocation(line: 103, column: 17, scope: !538)
!538 = distinct !DILexicalBlock(scope: !535, file: !3, line: 103, column: 5)
!539 = !DILocation(line: 103, column: 21, scope: !538)
!540 = !DILocation(line: 103, column: 19, scope: !538)
!541 = !DILocation(line: 103, column: 5, scope: !535)
!542 = !DILocation(line: 105, column: 24, scope: !543)
!543 = distinct !DILexicalBlock(scope: !538, file: !3, line: 104, column: 5)
!544 = !DILocation(line: 105, column: 30, scope: !543)
!545 = !DILocation(line: 105, column: 9, scope: !543)
!546 = !DILocation(line: 106, column: 5, scope: !543)
!547 = !DILocation(line: 103, column: 31, scope: !538)
!548 = !DILocation(line: 103, column: 5, scope: !538)
!549 = distinct !{!549, !541, !550, !551}
!550 = !DILocation(line: 106, column: 5, scope: !535)
!551 = !{!"llvm.loop.mustprogress"}
!552 = !DILocation(line: 107, column: 5, scope: !524)
!553 = !DILocation(line: 108, column: 1, scope: !524)
!554 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !555, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!555 = !DISubroutineType(types: !556)
!556 = !{!76, !527, !76, !42}
!557 = !DILocalVariable(name: "bytes", arg: 1, scope: !554, file: !3, line: 113, type: !527)
!558 = !DILocation(line: 113, column: 39, scope: !554)
!559 = !DILocalVariable(name: "numBytes", arg: 2, scope: !554, file: !3, line: 113, type: !76)
!560 = !DILocation(line: 113, column: 53, scope: !554)
!561 = !DILocalVariable(name: "hex", arg: 3, scope: !554, file: !3, line: 113, type: !42)
!562 = !DILocation(line: 113, column: 71, scope: !554)
!563 = !DILocalVariable(name: "numWritten", scope: !554, file: !3, line: 115, type: !76)
!564 = !DILocation(line: 115, column: 12, scope: !554)
!565 = !DILocation(line: 121, column: 5, scope: !554)
!566 = !DILocation(line: 121, column: 12, scope: !554)
!567 = !DILocation(line: 121, column: 25, scope: !554)
!568 = !DILocation(line: 121, column: 23, scope: !554)
!569 = !DILocation(line: 121, column: 34, scope: !554)
!570 = !DILocation(line: 121, column: 37, scope: !554)
!571 = !DILocation(line: 121, column: 67, scope: !554)
!572 = !DILocation(line: 121, column: 70, scope: !554)
!573 = !DILocation(line: 0, scope: !554)
!574 = !DILocalVariable(name: "byte", scope: !575, file: !3, line: 123, type: !23)
!575 = distinct !DILexicalBlock(scope: !554, file: !3, line: 122, column: 5)
