; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.3 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3.6 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!135 = !DILocation(line: 80, column: 28, scope: !136)
!136 = distinct !DILexicalBlock(scope: !131, file: !45, line: 78, column: 13)
!137 = !DILocation(line: 81, column: 13, scope: !136)
!138 = !DILocation(line: 77, column: 33, scope: !131)
!139 = !DILocation(line: 77, column: 13, scope: !131)
!140 = distinct !{!140, !134, !141, !98}
!141 = !DILocation(line: 81, column: 13, scope: !128)
!142 = !DILocation(line: 82, column: 26, scope: !126)
!143 = !DILocation(line: 82, column: 13, scope: !126)
!144 = !DILocation(line: 83, column: 9, scope: !126)
!145 = !DILocation(line: 85, column: 1, scope: !103)
!146 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 89, type: !55, scopeLine: 90, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!147 = !DILocalVariable(name: "data", scope: !146, file: !45, line: 91, type: !42)
!148 = !DILocation(line: 91, column: 12, scope: !146)
!149 = !DILocalVariable(name: "dataBuffer", scope: !146, file: !45, line: 92, type: !60)
!150 = !DILocation(line: 92, column: 10, scope: !146)
!151 = !DILocation(line: 93, column: 12, scope: !146)
!152 = !DILocation(line: 93, column: 10, scope: !146)
!153 = !DILocation(line: 94, column: 73, scope: !146)
!154 = !DILocation(line: 94, column: 12, scope: !146)
!155 = !DILocation(line: 94, column: 10, scope: !146)
!156 = !DILocalVariable(name: "i", scope: !157, file: !45, line: 96, type: !23)
!157 = distinct !DILexicalBlock(scope: !146, file: !45, line: 95, column: 5)
!158 = !DILocation(line: 96, column: 13, scope: !157)
!159 = !DILocalVariable(name: "n", scope: !157, file: !45, line: 96, type: !23)
!160 = !DILocation(line: 96, column: 16, scope: !157)
!161 = !DILocalVariable(name: "intVariable", scope: !157, file: !45, line: 96, type: !23)
!162 = !DILocation(line: 96, column: 19, scope: !157)
!163 = !DILocation(line: 97, column: 20, scope: !164)
!164 = distinct !DILexicalBlock(scope: !157, file: !45, line: 97, column: 13)
!165 = !DILocation(line: 97, column: 13, scope: !164)
!166 = !DILocation(line: 97, column: 36, scope: !164)
!167 = !DILocation(line: 97, column: 13, scope: !157)
!168 = !DILocation(line: 100, column: 17, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !45, line: 100, column: 17)
!170 = distinct !DILexicalBlock(scope: !164, file: !45, line: 98, column: 9)
!171 = !DILocation(line: 100, column: 19, scope: !169)
!172 = !DILocation(line: 100, column: 17, scope: !170)
!173 = !DILocation(line: 102, column: 29, scope: !174)
!174 = distinct !DILexicalBlock(scope: !169, file: !45, line: 101, column: 13)
!175 = !DILocation(line: 103, column: 24, scope: !176)
!176 = distinct !DILexicalBlock(scope: !174, file: !45, line: 103, column: 17)
!177 = !DILocation(line: 103, column: 22, scope: !176)
!178 = !DILocation(line: 103, column: 29, scope: !179)
!179 = distinct !DILexicalBlock(scope: !176, file: !45, line: 103, column: 17)
!180 = !DILocation(line: 103, column: 33, scope: !179)
!181 = !DILocation(line: 103, column: 31, scope: !179)
!182 = !DILocation(line: 103, column: 17, scope: !176)
!183 = !DILocation(line: 106, column: 32, scope: !184)
!184 = distinct !DILexicalBlock(scope: !179, file: !45, line: 104, column: 17)
!185 = !DILocation(line: 107, column: 17, scope: !184)
!186 = !DILocation(line: 103, column: 37, scope: !179)
!187 = !DILocation(line: 103, column: 17, scope: !179)
!188 = distinct !{!188, !182, !189, !98}
!189 = !DILocation(line: 107, column: 17, scope: !176)
!190 = !DILocation(line: 108, column: 30, scope: !174)
!191 = !DILocation(line: 108, column: 17, scope: !174)
!192 = !DILocation(line: 109, column: 13, scope: !174)
!193 = !DILocation(line: 110, column: 9, scope: !170)
!194 = !DILocation(line: 112, column: 1, scope: !146)
!195 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_61_good", scope: !45, file: !45, line: 114, type: !55, scopeLine: 115, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!196 = !DILocation(line: 116, column: 5, scope: !195)
!197 = !DILocation(line: 117, column: 5, scope: !195)
!198 = !DILocation(line: 118, column: 1, scope: !195)
!199 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_61b_badSource", scope: !48, file: !48, line: 34, type: !200, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !46)
!200 = !DISubroutineType(types: !201)
!201 = !{!42, !42}
!202 = !DILocalVariable(name: "data", arg: 1, scope: !199, file: !48, line: 34, type: !42)
!203 = !DILocation(line: 34, column: 72, scope: !199)
!204 = !DILocalVariable(name: "dataLen", scope: !205, file: !48, line: 38, type: !206)
!205 = distinct !DILexicalBlock(scope: !199, file: !48, line: 36, column: 5)
!206 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !207, line: 46, baseType: !208)
!207 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!208 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!209 = !DILocation(line: 38, column: 16, scope: !205)
!210 = !DILocation(line: 38, column: 33, scope: !205)
!211 = !DILocation(line: 38, column: 26, scope: !205)
!212 = !DILocalVariable(name: "pFile", scope: !205, file: !48, line: 39, type: !213)
!213 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !214, size: 64)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !215, line: 7, baseType: !216)
!215 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !217, line: 49, size: 1728, elements: !218)
!217 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!218 = !{!219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !234, !236, !237, !238, !242, !243, !245, !249, !252, !254, !257, !260, !261, !262, !263, !264}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !216, file: !217, line: 51, baseType: !23, size: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !216, file: !217, line: 54, baseType: !42, size: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !216, file: !217, line: 55, baseType: !42, size: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !216, file: !217, line: 56, baseType: !42, size: 64, offset: 192)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !216, file: !217, line: 57, baseType: !42, size: 64, offset: 256)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !216, file: !217, line: 58, baseType: !42, size: 64, offset: 320)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !216, file: !217, line: 59, baseType: !42, size: 64, offset: 384)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !216, file: !217, line: 60, baseType: !42, size: 64, offset: 448)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !216, file: !217, line: 61, baseType: !42, size: 64, offset: 512)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !216, file: !217, line: 64, baseType: !42, size: 64, offset: 576)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !216, file: !217, line: 65, baseType: !42, size: 64, offset: 640)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !216, file: !217, line: 66, baseType: !42, size: 64, offset: 704)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !216, file: !217, line: 68, baseType: !232, size: 64, offset: 768)
!232 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !233, size: 64)
!233 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !217, line: 36, flags: DIFlagFwdDecl)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !216, file: !217, line: 70, baseType: !235, size: 64, offset: 832)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !216, size: 64)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !216, file: !217, line: 72, baseType: !23, size: 32, offset: 896)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !216, file: !217, line: 73, baseType: !23, size: 32, offset: 928)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !216, file: !217, line: 74, baseType: !239, size: 64, offset: 960)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !240, line: 152, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!241 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !216, file: !217, line: 77, baseType: !24, size: 16, offset: 1024)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !216, file: !217, line: 78, baseType: !244, size: 8, offset: 1040)
!244 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !216, file: !217, line: 79, baseType: !246, size: 8, offset: 1048)
!246 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !247)
!247 = !{!248}
!248 = !DISubrange(count: 1)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !216, file: !217, line: 81, baseType: !250, size: 64, offset: 1088)
!250 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !217, line: 43, baseType: null)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !216, file: !217, line: 89, baseType: !253, size: 64, offset: 1152)
!253 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !240, line: 153, baseType: !241)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !216, file: !217, line: 91, baseType: !255, size: 64, offset: 1216)
!255 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64)
!256 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !217, line: 37, flags: DIFlagFwdDecl)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !216, file: !217, line: 92, baseType: !258, size: 64, offset: 1280)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !217, line: 38, flags: DIFlagFwdDecl)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !216, file: !217, line: 93, baseType: !235, size: 64, offset: 1344)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !216, file: !217, line: 94, baseType: !22, size: 64, offset: 1408)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !216, file: !217, line: 95, baseType: !206, size: 64, offset: 1472)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !216, file: !217, line: 96, baseType: !23, size: 32, offset: 1536)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !216, file: !217, line: 98, baseType: !265, size: 160, offset: 1568)
!265 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !266)
!266 = !{!267}
!267 = !DISubrange(count: 20)
!268 = !DILocation(line: 39, column: 16, scope: !205)
!269 = !DILocation(line: 41, column: 17, scope: !270)
!270 = distinct !DILexicalBlock(scope: !205, file: !48, line: 41, column: 13)
!271 = !DILocation(line: 41, column: 16, scope: !270)
!272 = !DILocation(line: 41, column: 25, scope: !270)
!273 = !DILocation(line: 41, column: 13, scope: !205)
!274 = !DILocation(line: 43, column: 21, scope: !275)
!275 = distinct !DILexicalBlock(scope: !270, file: !48, line: 42, column: 9)
!276 = !DILocation(line: 43, column: 19, scope: !275)
!277 = !DILocation(line: 44, column: 17, scope: !278)
!278 = distinct !DILexicalBlock(scope: !275, file: !48, line: 44, column: 17)
!279 = !DILocation(line: 44, column: 23, scope: !278)
!280 = !DILocation(line: 44, column: 17, scope: !275)
!281 = !DILocation(line: 47, column: 27, scope: !282)
!282 = distinct !DILexicalBlock(scope: !283, file: !48, line: 47, column: 21)
!283 = distinct !DILexicalBlock(scope: !278, file: !48, line: 45, column: 13)
!284 = !DILocation(line: 47, column: 32, scope: !282)
!285 = !DILocation(line: 47, column: 31, scope: !282)
!286 = !DILocation(line: 47, column: 51, scope: !282)
!287 = !DILocation(line: 47, column: 50, scope: !282)
!288 = !DILocation(line: 47, column: 41, scope: !282)
!289 = !DILocation(line: 47, column: 61, scope: !282)
!290 = !DILocation(line: 47, column: 21, scope: !282)
!291 = !DILocation(line: 47, column: 68, scope: !282)
!292 = !DILocation(line: 47, column: 21, scope: !283)
!293 = !DILocation(line: 49, column: 21, scope: !294)
!294 = distinct !DILexicalBlock(scope: !282, file: !48, line: 48, column: 17)
!295 = !DILocation(line: 51, column: 21, scope: !294)
!296 = !DILocation(line: 51, column: 26, scope: !294)
!297 = !DILocation(line: 51, column: 35, scope: !294)
!298 = !DILocation(line: 52, column: 17, scope: !294)
!299 = !DILocation(line: 53, column: 24, scope: !283)
!300 = !DILocation(line: 53, column: 17, scope: !283)
!301 = !DILocation(line: 54, column: 13, scope: !283)
!302 = !DILocation(line: 55, column: 9, scope: !275)
!303 = !DILocation(line: 57, column: 12, scope: !199)
!304 = !DILocation(line: 57, column: 5, scope: !199)
!305 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_61b_goodG2BSource", scope: !48, file: !48, line: 65, type: !200, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !46)
!306 = !DILocalVariable(name: "data", arg: 1, scope: !305, file: !48, line: 65, type: !42)
!307 = !DILocation(line: 65, column: 76, scope: !305)
!308 = !DILocation(line: 68, column: 12, scope: !305)
!309 = !DILocation(line: 68, column: 5, scope: !305)
!310 = !DILocation(line: 69, column: 12, scope: !305)
!311 = !DILocation(line: 69, column: 5, scope: !305)
!312 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_61b_goodB2GSource", scope: !48, file: !48, line: 73, type: !200, scopeLine: 74, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !47, retainedNodes: !46)
!313 = !DILocalVariable(name: "data", arg: 1, scope: !312, file: !48, line: 73, type: !42)
!314 = !DILocation(line: 73, column: 76, scope: !312)
!315 = !DILocalVariable(name: "dataLen", scope: !316, file: !48, line: 77, type: !206)
!316 = distinct !DILexicalBlock(scope: !312, file: !48, line: 75, column: 5)
!317 = !DILocation(line: 77, column: 16, scope: !316)
!318 = !DILocation(line: 77, column: 33, scope: !316)
!319 = !DILocation(line: 77, column: 26, scope: !316)
!320 = !DILocalVariable(name: "pFile", scope: !316, file: !48, line: 78, type: !213)
!321 = !DILocation(line: 78, column: 16, scope: !316)
!322 = !DILocation(line: 80, column: 17, scope: !323)
!323 = distinct !DILexicalBlock(scope: !316, file: !48, line: 80, column: 13)
!324 = !DILocation(line: 80, column: 16, scope: !323)
!325 = !DILocation(line: 80, column: 25, scope: !323)
!326 = !DILocation(line: 80, column: 13, scope: !316)
!327 = !DILocation(line: 82, column: 21, scope: !328)
!328 = distinct !DILexicalBlock(scope: !323, file: !48, line: 81, column: 9)
!329 = !DILocation(line: 82, column: 19, scope: !328)
!330 = !DILocation(line: 83, column: 17, scope: !331)
!331 = distinct !DILexicalBlock(scope: !328, file: !48, line: 83, column: 17)
!332 = !DILocation(line: 83, column: 23, scope: !331)
!333 = !DILocation(line: 83, column: 17, scope: !328)
!334 = !DILocation(line: 86, column: 27, scope: !335)
!335 = distinct !DILexicalBlock(scope: !336, file: !48, line: 86, column: 21)
!336 = distinct !DILexicalBlock(scope: !331, file: !48, line: 84, column: 13)
!337 = !DILocation(line: 86, column: 32, scope: !335)
!338 = !DILocation(line: 86, column: 31, scope: !335)
!339 = !DILocation(line: 86, column: 51, scope: !335)
!340 = !DILocation(line: 86, column: 50, scope: !335)
!341 = !DILocation(line: 86, column: 41, scope: !335)
!342 = !DILocation(line: 86, column: 61, scope: !335)
!343 = !DILocation(line: 86, column: 21, scope: !335)
!344 = !DILocation(line: 86, column: 68, scope: !335)
!345 = !DILocation(line: 86, column: 21, scope: !336)
!346 = !DILocation(line: 88, column: 21, scope: !347)
!347 = distinct !DILexicalBlock(scope: !335, file: !48, line: 87, column: 17)
!348 = !DILocation(line: 90, column: 21, scope: !347)
!349 = !DILocation(line: 90, column: 26, scope: !347)
!350 = !DILocation(line: 90, column: 35, scope: !347)
!351 = !DILocation(line: 91, column: 17, scope: !347)
!352 = !DILocation(line: 92, column: 24, scope: !336)
!353 = !DILocation(line: 92, column: 17, scope: !336)
!354 = !DILocation(line: 93, column: 13, scope: !336)
!355 = !DILocation(line: 94, column: 9, scope: !328)
!356 = !DILocation(line: 96, column: 12, scope: !312)
!357 = !DILocation(line: 96, column: 5, scope: !312)
!358 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !359, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !42}
!361 = !DILocalVariable(name: "line", arg: 1, scope: !358, file: !3, line: 11, type: !42)
!362 = !DILocation(line: 11, column: 25, scope: !358)
!363 = !DILocation(line: 13, column: 1, scope: !358)
!364 = !DILocation(line: 14, column: 8, scope: !365)
!365 = distinct !DILexicalBlock(scope: !358, file: !3, line: 14, column: 8)
!366 = !DILocation(line: 14, column: 13, scope: !365)
!367 = !DILocation(line: 14, column: 8, scope: !358)
!368 = !DILocation(line: 16, column: 24, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !3, line: 15, column: 5)
!370 = !DILocation(line: 16, column: 9, scope: !369)
!371 = !DILocation(line: 17, column: 5, scope: !369)
!372 = !DILocation(line: 18, column: 5, scope: !358)
!373 = !DILocation(line: 19, column: 1, scope: !358)
!374 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !359, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!375 = !DILocalVariable(name: "line", arg: 1, scope: !374, file: !3, line: 20, type: !42)
!376 = !DILocation(line: 20, column: 29, scope: !374)
!377 = !DILocation(line: 22, column: 8, scope: !378)
!378 = distinct !DILexicalBlock(scope: !374, file: !3, line: 22, column: 8)
!379 = !DILocation(line: 22, column: 13, scope: !378)
!380 = !DILocation(line: 22, column: 8, scope: !374)
!381 = !DILocation(line: 24, column: 24, scope: !382)
!382 = distinct !DILexicalBlock(scope: !378, file: !3, line: 23, column: 5)
!383 = !DILocation(line: 24, column: 9, scope: !382)
!384 = !DILocation(line: 25, column: 5, scope: !382)
!385 = !DILocation(line: 26, column: 1, scope: !374)
!386 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !387, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !389}
!389 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !390, size: 64)
!390 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !207, line: 74, baseType: !23)
!391 = !DILocalVariable(name: "line", arg: 1, scope: !386, file: !3, line: 27, type: !389)
!392 = !DILocation(line: 27, column: 29, scope: !386)
!393 = !DILocation(line: 29, column: 8, scope: !394)
!394 = distinct !DILexicalBlock(scope: !386, file: !3, line: 29, column: 8)
!395 = !DILocation(line: 29, column: 13, scope: !394)
!396 = !DILocation(line: 29, column: 8, scope: !386)
!397 = !DILocation(line: 31, column: 27, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !3, line: 30, column: 5)
!399 = !DILocation(line: 31, column: 9, scope: !398)
!400 = !DILocation(line: 32, column: 5, scope: !398)
!401 = !DILocation(line: 33, column: 1, scope: !386)
!402 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !403, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !23}
!405 = !DILocalVariable(name: "intNumber", arg: 1, scope: !402, file: !3, line: 35, type: !23)
!406 = !DILocation(line: 35, column: 24, scope: !402)
!407 = !DILocation(line: 37, column: 20, scope: !402)
!408 = !DILocation(line: 37, column: 5, scope: !402)
!409 = !DILocation(line: 38, column: 1, scope: !402)
!410 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !411, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!411 = !DISubroutineType(types: !412)
!412 = !{null, !413}
!413 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!414 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !410, file: !3, line: 40, type: !413)
!415 = !DILocation(line: 40, column: 28, scope: !410)
!416 = !DILocation(line: 42, column: 21, scope: !410)
!417 = !DILocation(line: 42, column: 5, scope: !410)
!418 = !DILocation(line: 43, column: 1, scope: !410)
!419 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !420, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !422}
!422 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!423 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !419, file: !3, line: 45, type: !422)
!424 = !DILocation(line: 45, column: 28, scope: !419)
!425 = !DILocation(line: 47, column: 20, scope: !419)
!426 = !DILocation(line: 47, column: 5, scope: !419)
!427 = !DILocation(line: 48, column: 1, scope: !419)
!428 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !429, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !241}
!431 = !DILocalVariable(name: "longNumber", arg: 1, scope: !428, file: !3, line: 50, type: !241)
!432 = !DILocation(line: 50, column: 26, scope: !428)
!433 = !DILocation(line: 52, column: 21, scope: !428)
!434 = !DILocation(line: 52, column: 5, scope: !428)
!435 = !DILocation(line: 53, column: 1, scope: !428)
!436 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !437, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !439}
!439 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !440, line: 27, baseType: !441)
!440 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!441 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !240, line: 44, baseType: !241)
!442 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !436, file: !3, line: 55, type: !439)
!443 = !DILocation(line: 55, column: 33, scope: !436)
!444 = !DILocation(line: 57, column: 29, scope: !436)
!445 = !DILocation(line: 57, column: 5, scope: !436)
!446 = !DILocation(line: 58, column: 1, scope: !436)
!447 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !448, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !206}
!450 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !447, file: !3, line: 60, type: !206)
!451 = !DILocation(line: 60, column: 29, scope: !447)
!452 = !DILocation(line: 62, column: 21, scope: !447)
!453 = !DILocation(line: 62, column: 5, scope: !447)
!454 = !DILocation(line: 63, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !456, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !43}
!458 = !DILocalVariable(name: "charHex", arg: 1, scope: !455, file: !3, line: 65, type: !43)
!459 = !DILocation(line: 65, column: 29, scope: !455)
!460 = !DILocation(line: 67, column: 22, scope: !455)
!461 = !DILocation(line: 67, column: 5, scope: !455)
!462 = !DILocation(line: 68, column: 1, scope: !455)
!463 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !464, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !390}
!466 = !DILocalVariable(name: "wideChar", arg: 1, scope: !463, file: !3, line: 70, type: !390)
!467 = !DILocation(line: 70, column: 29, scope: !463)
!468 = !DILocalVariable(name: "s", scope: !463, file: !3, line: 74, type: !469)
!469 = !DICompositeType(tag: DW_TAG_array_type, baseType: !390, size: 64, elements: !470)
!470 = !{!471}
!471 = !DISubrange(count: 2)
!472 = !DILocation(line: 74, column: 13, scope: !463)
!473 = !DILocation(line: 75, column: 16, scope: !463)
!474 = !DILocation(line: 75, column: 9, scope: !463)
!475 = !DILocation(line: 75, column: 14, scope: !463)
!476 = !DILocation(line: 76, column: 9, scope: !463)
!477 = !DILocation(line: 76, column: 14, scope: !463)
!478 = !DILocation(line: 77, column: 21, scope: !463)
!479 = !DILocation(line: 77, column: 5, scope: !463)
!480 = !DILocation(line: 78, column: 1, scope: !463)
!481 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !482, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !7}
!484 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !481, file: !3, line: 80, type: !7)
!485 = !DILocation(line: 80, column: 33, scope: !481)
!486 = !DILocation(line: 82, column: 20, scope: !481)
!487 = !DILocation(line: 82, column: 5, scope: !481)
!488 = !DILocation(line: 83, column: 1, scope: !481)
!489 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !490, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !25}
!492 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !489, file: !3, line: 85, type: !25)
!493 = !DILocation(line: 85, column: 45, scope: !489)
!494 = !DILocation(line: 87, column: 22, scope: !489)
!495 = !DILocation(line: 87, column: 5, scope: !489)
!496 = !DILocation(line: 88, column: 1, scope: !489)
!497 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !498, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!498 = !DISubroutineType(types: !499)
!499 = !{null, !500}
!500 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!501 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !497, file: !3, line: 90, type: !500)
!502 = !DILocation(line: 90, column: 29, scope: !497)
!503 = !DILocation(line: 92, column: 20, scope: !497)
!504 = !DILocation(line: 92, column: 5, scope: !497)
!505 = !DILocation(line: 93, column: 1, scope: !497)
!506 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !507, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!507 = !DISubroutineType(types: !508)
!508 = !{null, !509}
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !510, size: 64)
!510 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !511, line: 100, baseType: !512)
!511 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_107/source_code")
!512 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !511, line: 96, size: 64, elements: !513)
!513 = !{!514, !515}
!514 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !512, file: !511, line: 98, baseType: !23, size: 32)
!515 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !512, file: !511, line: 99, baseType: !23, size: 32, offset: 32)
!516 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !506, file: !3, line: 95, type: !509)
!517 = !DILocation(line: 95, column: 40, scope: !506)
!518 = !DILocation(line: 97, column: 26, scope: !506)
!519 = !DILocation(line: 97, column: 47, scope: !506)
!520 = !DILocation(line: 97, column: 55, scope: !506)
!521 = !DILocation(line: 97, column: 76, scope: !506)
!522 = !DILocation(line: 97, column: 5, scope: !506)
!523 = !DILocation(line: 98, column: 1, scope: !506)
!524 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !525, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!525 = !DISubroutineType(types: !526)
!526 = !{null, !527, !206}
!527 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!528 = !DILocalVariable(name: "bytes", arg: 1, scope: !524, file: !3, line: 100, type: !527)
!529 = !DILocation(line: 100, column: 38, scope: !524)
!530 = !DILocalVariable(name: "numBytes", arg: 2, scope: !524, file: !3, line: 100, type: !206)
!531 = !DILocation(line: 100, column: 52, scope: !524)
!532 = !DILocalVariable(name: "i", scope: !524, file: !3, line: 102, type: !206)
!533 = !DILocation(line: 102, column: 12, scope: !524)
!534 = !DILocation(line: 103, column: 12, scope: !535)
!535 = distinct !DILexicalBlock(scope: !524, file: !3, line: 103, column: 5)
!536 = !DILocation(line: 103, column: 10, scope: !535)
!537 = !DILocation(line: 103, column: 17, scope: !538)
!538 = distinct !DILexicalBlock(scope: !535, file: !3, line: 103, column: 5)
!539 = !DILocation(line: 103, column: 21, scope: !538)
!540 = !DILocation(line: 103, column: 19, scope: !538)
!541 = !DILocation(line: 103, column: 5, scope: !535)
!542 = !DILocation(line: 105, column: 24, scope: !543)
!543 = distinct !DILexicalBlock(scope: !538, file: !3, line: 104, column: 5)
!544 = !DILocation(line: 105, column: 30, scope: !543)
!545 = !DILocation(line: 105, column: 9, scope: !543)
!546 = !DILocation(line: 106, column: 5, scope: !543)
!547 = !DILocation(line: 103, column: 31, scope: !538)
!548 = !DILocation(line: 103, column: 5, scope: !538)
!549 = distinct !{!549, !541, !550, !98}
!550 = !DILocation(line: 106, column: 5, scope: !535)
!551 = !DILocation(line: 107, column: 5, scope: !524)
!552 = !DILocation(line: 108, column: 1, scope: !524)
!553 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !554, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!554 = !DISubroutineType(types: !555)
!555 = !{!206, !527, !206, !42}
!556 = !DILocalVariable(name: "bytes", arg: 1, scope: !553, file: !3, line: 113, type: !527)
!557 = !DILocation(line: 113, column: 39, scope: !553)
!558 = !DILocalVariable(name: "numBytes", arg: 2, scope: !553, file: !3, line: 113, type: !206)
!559 = !DILocation(line: 113, column: 53, scope: !553)
!560 = !DILocalVariable(name: "hex", arg: 3, scope: !553, file: !3, line: 113, type: !42)
!561 = !DILocation(line: 113, column: 71, scope: !553)
!562 = !DILocalVariable(name: "numWritten", scope: !553, file: !3, line: 115, type: !206)
!563 = !DILocation(line: 115, column: 12, scope: !553)
!564 = !DILocation(line: 121, column: 5, scope: !553)
!565 = !DILocation(line: 121, column: 12, scope: !553)
!566 = !DILocation(line: 121, column: 25, scope: !553)
!567 = !DILocation(line: 121, column: 23, scope: !553)
!568 = !DILocation(line: 121, column: 34, scope: !553)
!569 = !DILocation(line: 121, column: 37, scope: !553)
!570 = !DILocation(line: 121, column: 67, scope: !553)
!571 = !DILocation(line: 121, column: 70, scope: !553)
!572 = !DILocation(line: 0, scope: !553)
!573 = !DILocalVariable(name: "byte", scope: !574, file: !3, line: 123, type: !23)
!574 = distinct !DILexicalBlock(scope: !553, file: !3, line: 122, column: 5)
!575 = !DILocation(line: 123, column: 13, scope: !574)
