; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@staticTrue = dso_local global i32 1, align 4, !dbg !0
@staticFalse = dso_local global i32 0, align 4, !dbg !9
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !11
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !36
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !38
@globalTrue = dso_local global i32 1, align 4, !dbg !40
@globalFalse = dso_local global i32 0, align 4, !dbg !42

!13 = distinct !DICompileUnit(language: DW_LANG_C99, file: !14, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !15, retainedTypes: !32, globals: !35, splitDebugInlining: false, nameTableKind: None)
!14 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_014/source_code")
!15 = !{!16}
!16 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !17, line: 46, baseType: !18, size: 32, elements: !19)
!17 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!18 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!19 = !{!20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31}
!20 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!21 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!22 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!23 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!24 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!29 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!32 = !{!6, !7, !33, !34}
!33 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!34 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!35 = !{!11, !36, !38, !40, !42, !44, !46, !48}
!36 = !DIGlobalVariableExpression(var: !37, expr: !DIExpression())
!37 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !13, file: !14, line: 175, type: !7, isLocal: false, isDefinition: true)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !13, file: !14, line: 176, type: !7, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "globalTrue", scope: !13, file: !14, line: 181, type: !7, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "globalFalse", scope: !13, file: !14, line: 182, type: !7, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "globalFive", scope: !13, file: !14, line: 183, type: !7, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "globalArgc", scope: !13, file: !14, line: 214, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalArgv", scope: !13, file: !14, line: 215, type: !50, isLocal: false, isDefinition: true)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!52 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!53 = !{!"clang version 12.0.0"}
!54 = !{i32 7, !"Dwarf Version", i32 4}
!55 = !{i32 2, !"Debug Info Version", i32 3}
!56 = !{i32 1, !"wchar_size", i32 4}
!57 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_05_bad", scope: !3, file: !3, line: 39, type: !58, scopeLine: 40, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!58 = !DISubroutineType(types: !59)
!59 = !{null}
!60 = !DILocalVariable(name: "data", scope: !57, file: !3, line: 41, type: !51)
!61 = !DILocation(line: 41, column: 12, scope: !57)
!62 = !DILocalVariable(name: "dataBuffer", scope: !57, file: !3, line: 42, type: !63)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 800, elements: !64)
!64 = !{!65}
!65 = !DISubrange(count: 100)
!66 = !DILocation(line: 42, column: 10, scope: !57)
!67 = !DILocation(line: 43, column: 12, scope: !57)
!68 = !DILocation(line: 43, column: 10, scope: !57)
!69 = !DILocation(line: 44, column: 8, scope: !70)
!70 = distinct !DILexicalBlock(scope: !57, file: !3, line: 44, column: 8)
!71 = !DILocation(line: 44, column: 8, scope: !57)
!72 = !DILocalVariable(name: "dataLen", scope: !73, file: !3, line: 48, type: !75)
!73 = distinct !DILexicalBlock(scope: !74, file: !3, line: 46, column: 9)
!74 = distinct !DILexicalBlock(scope: !70, file: !3, line: 45, column: 5)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DILocation(line: 48, column: 20, scope: !73)
!79 = !DILocation(line: 48, column: 37, scope: !73)
!80 = !DILocation(line: 48, column: 30, scope: !73)
!81 = !DILocalVariable(name: "pFile", scope: !73, file: !3, line: 49, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 7, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !105, !106, !107, !111, !112, !114, !118, !121, !123, !126, !129, !130, !131, !132, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !7, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !51, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !51, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !51, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !51, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !51, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !51, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !51, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !51, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !51, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !51, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !51, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !7, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !7, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !33, size: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !113, size: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !115, size: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !119, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !122, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 153, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !104, size: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !6, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !75, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !7, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 49, column: 20, scope: !73)
!138 = !DILocation(line: 51, column: 21, scope: !139)
!139 = distinct !DILexicalBlock(scope: !73, file: !3, line: 51, column: 17)
!140 = !DILocation(line: 51, column: 20, scope: !139)
!141 = !DILocation(line: 51, column: 29, scope: !139)
!142 = !DILocation(line: 51, column: 17, scope: !73)
!143 = !DILocation(line: 53, column: 25, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !3, line: 52, column: 13)
!145 = !DILocation(line: 53, column: 23, scope: !144)
!146 = !DILocation(line: 54, column: 21, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !3, line: 54, column: 21)
!148 = !DILocation(line: 54, column: 27, scope: !147)
!149 = !DILocation(line: 54, column: 21, scope: !144)
!150 = !DILocation(line: 57, column: 31, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 57, column: 25)
!152 = distinct !DILexicalBlock(scope: !147, file: !3, line: 55, column: 17)
!153 = !DILocation(line: 57, column: 36, scope: !151)
!154 = !DILocation(line: 57, column: 35, scope: !151)
!155 = !DILocation(line: 57, column: 55, scope: !151)
!156 = !DILocation(line: 57, column: 54, scope: !151)
!157 = !DILocation(line: 57, column: 45, scope: !151)
!158 = !DILocation(line: 57, column: 65, scope: !151)
!159 = !DILocation(line: 57, column: 25, scope: !151)
!160 = !DILocation(line: 57, column: 72, scope: !151)
!161 = !DILocation(line: 57, column: 25, scope: !152)
!162 = !DILocation(line: 59, column: 25, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !3, line: 58, column: 21)
!164 = !DILocation(line: 61, column: 25, scope: !163)
!165 = !DILocation(line: 61, column: 30, scope: !163)
!166 = !DILocation(line: 61, column: 39, scope: !163)
!167 = !DILocation(line: 62, column: 21, scope: !163)
!168 = !DILocation(line: 63, column: 28, scope: !152)
!169 = !DILocation(line: 63, column: 21, scope: !152)
!170 = !DILocation(line: 64, column: 17, scope: !152)
!171 = !DILocation(line: 65, column: 13, scope: !144)
!172 = !DILocation(line: 67, column: 5, scope: !74)
!173 = !DILocation(line: 68, column: 8, scope: !174)
!174 = distinct !DILexicalBlock(scope: !57, file: !3, line: 68, column: 8)
!175 = !DILocation(line: 68, column: 8, scope: !57)
!176 = !DILocation(line: 71, column: 16, scope: !177)
!177 = distinct !DILexicalBlock(scope: !174, file: !3, line: 69, column: 5)
!178 = !DILocation(line: 71, column: 9, scope: !177)
!179 = !DILocation(line: 72, column: 5, scope: !177)
!180 = !DILocation(line: 73, column: 1, scope: !57)
!181 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 80, type: !58, scopeLine: 81, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!182 = !DILocalVariable(name: "data", scope: !181, file: !3, line: 82, type: !51)
!183 = !DILocation(line: 82, column: 12, scope: !181)
!184 = !DILocalVariable(name: "dataBuffer", scope: !181, file: !3, line: 83, type: !63)
!185 = !DILocation(line: 83, column: 10, scope: !181)
!186 = !DILocation(line: 84, column: 12, scope: !181)
!187 = !DILocation(line: 84, column: 10, scope: !181)
!188 = !DILocation(line: 85, column: 8, scope: !189)
!189 = distinct !DILexicalBlock(scope: !181, file: !3, line: 85, column: 8)
!190 = !DILocation(line: 85, column: 8, scope: !181)
!191 = !DILocalVariable(name: "dataLen", scope: !192, file: !3, line: 89, type: !75)
!192 = distinct !DILexicalBlock(scope: !193, file: !3, line: 87, column: 9)
!193 = distinct !DILexicalBlock(scope: !189, file: !3, line: 86, column: 5)
!194 = !DILocation(line: 89, column: 20, scope: !192)
!195 = !DILocation(line: 89, column: 37, scope: !192)
!196 = !DILocation(line: 89, column: 30, scope: !192)
!197 = !DILocalVariable(name: "pFile", scope: !192, file: !3, line: 90, type: !82)
!198 = !DILocation(line: 90, column: 20, scope: !192)
!199 = !DILocation(line: 92, column: 21, scope: !200)
!200 = distinct !DILexicalBlock(scope: !192, file: !3, line: 92, column: 17)
!201 = !DILocation(line: 92, column: 20, scope: !200)
!202 = !DILocation(line: 92, column: 29, scope: !200)
!203 = !DILocation(line: 92, column: 17, scope: !192)
!204 = !DILocation(line: 94, column: 25, scope: !205)
!205 = distinct !DILexicalBlock(scope: !200, file: !3, line: 93, column: 13)
!206 = !DILocation(line: 94, column: 23, scope: !205)
!207 = !DILocation(line: 95, column: 21, scope: !208)
!208 = distinct !DILexicalBlock(scope: !205, file: !3, line: 95, column: 21)
!209 = !DILocation(line: 95, column: 27, scope: !208)
!210 = !DILocation(line: 95, column: 21, scope: !205)
!211 = !DILocation(line: 98, column: 31, scope: !212)
!212 = distinct !DILexicalBlock(scope: !213, file: !3, line: 98, column: 25)
!213 = distinct !DILexicalBlock(scope: !208, file: !3, line: 96, column: 17)
!214 = !DILocation(line: 98, column: 36, scope: !212)
!215 = !DILocation(line: 98, column: 35, scope: !212)
!216 = !DILocation(line: 98, column: 55, scope: !212)
!217 = !DILocation(line: 98, column: 54, scope: !212)
!218 = !DILocation(line: 98, column: 45, scope: !212)
!219 = !DILocation(line: 98, column: 65, scope: !212)
!220 = !DILocation(line: 98, column: 25, scope: !212)
!221 = !DILocation(line: 98, column: 72, scope: !212)
!222 = !DILocation(line: 98, column: 25, scope: !213)
!223 = !DILocation(line: 100, column: 25, scope: !224)
!224 = distinct !DILexicalBlock(scope: !212, file: !3, line: 99, column: 21)
!225 = !DILocation(line: 102, column: 25, scope: !224)
!226 = !DILocation(line: 102, column: 30, scope: !224)
!227 = !DILocation(line: 102, column: 39, scope: !224)
!228 = !DILocation(line: 103, column: 21, scope: !224)
!229 = !DILocation(line: 104, column: 28, scope: !213)
!230 = !DILocation(line: 104, column: 21, scope: !213)
!231 = !DILocation(line: 105, column: 17, scope: !213)
!232 = !DILocation(line: 106, column: 13, scope: !205)
!233 = !DILocation(line: 108, column: 5, scope: !193)
!234 = !DILocation(line: 109, column: 8, scope: !235)
!235 = distinct !DILexicalBlock(scope: !181, file: !3, line: 109, column: 8)
!236 = !DILocation(line: 109, column: 8, scope: !181)
!237 = !DILocation(line: 112, column: 9, scope: !238)
!238 = distinct !DILexicalBlock(scope: !235, file: !3, line: 110, column: 5)
!239 = !DILocation(line: 113, column: 5, scope: !238)
!240 = !DILocation(line: 117, column: 24, scope: !241)
!241 = distinct !DILexicalBlock(scope: !235, file: !3, line: 115, column: 5)
!242 = !DILocation(line: 117, column: 9, scope: !241)
!243 = !DILocation(line: 119, column: 1, scope: !181)
!244 = distinct !DISubprogram(name: "goodB2G2", scope: !3, file: !3, line: 122, type: !58, scopeLine: 123, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!245 = !DILocalVariable(name: "data", scope: !244, file: !3, line: 124, type: !51)
!246 = !DILocation(line: 124, column: 12, scope: !244)
!247 = !DILocalVariable(name: "dataBuffer", scope: !244, file: !3, line: 125, type: !63)
!248 = !DILocation(line: 125, column: 10, scope: !244)
!249 = !DILocation(line: 126, column: 12, scope: !244)
!250 = !DILocation(line: 126, column: 10, scope: !244)
!251 = !DILocation(line: 127, column: 8, scope: !252)
!252 = distinct !DILexicalBlock(scope: !244, file: !3, line: 127, column: 8)
!253 = !DILocation(line: 127, column: 8, scope: !244)
!254 = !DILocalVariable(name: "dataLen", scope: !255, file: !3, line: 131, type: !75)
!255 = distinct !DILexicalBlock(scope: !256, file: !3, line: 129, column: 9)
!256 = distinct !DILexicalBlock(scope: !252, file: !3, line: 128, column: 5)
!257 = !DILocation(line: 131, column: 20, scope: !255)
!258 = !DILocation(line: 131, column: 37, scope: !255)
!259 = !DILocation(line: 131, column: 30, scope: !255)
!260 = !DILocalVariable(name: "pFile", scope: !255, file: !3, line: 132, type: !82)
!261 = !DILocation(line: 132, column: 20, scope: !255)
!262 = !DILocation(line: 134, column: 21, scope: !263)
!263 = distinct !DILexicalBlock(scope: !255, file: !3, line: 134, column: 17)
!264 = !DILocation(line: 134, column: 20, scope: !263)
!265 = !DILocation(line: 134, column: 29, scope: !263)
!266 = !DILocation(line: 134, column: 17, scope: !255)
!267 = !DILocation(line: 136, column: 25, scope: !268)
!268 = distinct !DILexicalBlock(scope: !263, file: !3, line: 135, column: 13)
!269 = !DILocation(line: 136, column: 23, scope: !268)
!270 = !DILocation(line: 137, column: 21, scope: !271)
!271 = distinct !DILexicalBlock(scope: !268, file: !3, line: 137, column: 21)
!272 = !DILocation(line: 137, column: 27, scope: !271)
!273 = !DILocation(line: 137, column: 21, scope: !268)
!274 = !DILocation(line: 140, column: 31, scope: !275)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 140, column: 25)
!276 = distinct !DILexicalBlock(scope: !271, file: !3, line: 138, column: 17)
!277 = !DILocation(line: 140, column: 36, scope: !275)
!278 = !DILocation(line: 140, column: 35, scope: !275)
!279 = !DILocation(line: 140, column: 55, scope: !275)
!280 = !DILocation(line: 140, column: 54, scope: !275)
!281 = !DILocation(line: 140, column: 45, scope: !275)
!282 = !DILocation(line: 140, column: 65, scope: !275)
!283 = !DILocation(line: 140, column: 25, scope: !275)
!284 = !DILocation(line: 140, column: 72, scope: !275)
!285 = !DILocation(line: 140, column: 25, scope: !276)
!286 = !DILocation(line: 142, column: 25, scope: !287)
!287 = distinct !DILexicalBlock(scope: !275, file: !3, line: 141, column: 21)
!288 = !DILocation(line: 144, column: 25, scope: !287)
!289 = !DILocation(line: 144, column: 30, scope: !287)
!290 = !DILocation(line: 144, column: 39, scope: !287)
!291 = !DILocation(line: 145, column: 21, scope: !287)
!292 = !DILocation(line: 146, column: 28, scope: !276)
!293 = !DILocation(line: 146, column: 21, scope: !276)
!294 = !DILocation(line: 147, column: 17, scope: !276)
!295 = !DILocation(line: 148, column: 13, scope: !268)
!296 = !DILocation(line: 150, column: 5, scope: !256)
!297 = !DILocation(line: 151, column: 8, scope: !298)
!298 = distinct !DILexicalBlock(scope: !244, file: !3, line: 151, column: 8)
!299 = !DILocation(line: 151, column: 8, scope: !244)
!300 = !DILocation(line: 154, column: 24, scope: !301)
!301 = distinct !DILexicalBlock(scope: !298, file: !3, line: 152, column: 5)
!302 = !DILocation(line: 154, column: 9, scope: !301)
!303 = !DILocation(line: 155, column: 5, scope: !301)
!304 = !DILocation(line: 156, column: 1, scope: !244)
!305 = distinct !DISubprogram(name: "goodG2B1", scope: !3, file: !3, line: 159, type: !58, scopeLine: 160, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!306 = !DILocalVariable(name: "data", scope: !305, file: !3, line: 161, type: !51)
!307 = !DILocation(line: 161, column: 12, scope: !305)
!308 = !DILocalVariable(name: "dataBuffer", scope: !305, file: !3, line: 162, type: !63)
!309 = !DILocation(line: 162, column: 10, scope: !305)
!310 = !DILocation(line: 163, column: 12, scope: !305)
!311 = !DILocation(line: 163, column: 10, scope: !305)
!312 = !DILocation(line: 164, column: 8, scope: !313)
!313 = distinct !DILexicalBlock(scope: !305, file: !3, line: 164, column: 8)
!314 = !DILocation(line: 164, column: 8, scope: !305)
!315 = !DILocation(line: 167, column: 9, scope: !316)
!316 = distinct !DILexicalBlock(scope: !313, file: !3, line: 165, column: 5)
!317 = !DILocation(line: 168, column: 5, scope: !316)
!318 = !DILocation(line: 172, column: 16, scope: !319)
!319 = distinct !DILexicalBlock(scope: !313, file: !3, line: 170, column: 5)
!320 = !DILocation(line: 172, column: 9, scope: !319)
!321 = !DILocation(line: 174, column: 8, scope: !322)
!322 = distinct !DILexicalBlock(scope: !305, file: !3, line: 174, column: 8)
!323 = !DILocation(line: 174, column: 8, scope: !305)
!324 = !DILocation(line: 177, column: 16, scope: !325)
!325 = distinct !DILexicalBlock(scope: !322, file: !3, line: 175, column: 5)
!326 = !DILocation(line: 177, column: 9, scope: !325)
!327 = !DILocation(line: 178, column: 5, scope: !325)
!328 = !DILocation(line: 179, column: 1, scope: !305)
!329 = distinct !DISubprogram(name: "goodG2B2", scope: !3, file: !3, line: 182, type: !58, scopeLine: 183, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!330 = !DILocalVariable(name: "data", scope: !329, file: !3, line: 184, type: !51)
!331 = !DILocation(line: 184, column: 12, scope: !329)
!332 = !DILocalVariable(name: "dataBuffer", scope: !329, file: !3, line: 185, type: !63)
!333 = !DILocation(line: 185, column: 10, scope: !329)
!334 = !DILocation(line: 186, column: 12, scope: !329)
!335 = !DILocation(line: 186, column: 10, scope: !329)
!336 = !DILocation(line: 187, column: 8, scope: !337)
!337 = distinct !DILexicalBlock(scope: !329, file: !3, line: 187, column: 8)
!338 = !DILocation(line: 187, column: 8, scope: !329)
!339 = !DILocation(line: 190, column: 16, scope: !340)
!340 = distinct !DILexicalBlock(scope: !337, file: !3, line: 188, column: 5)
!341 = !DILocation(line: 190, column: 9, scope: !340)
!342 = !DILocation(line: 191, column: 5, scope: !340)
!343 = !DILocation(line: 192, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !329, file: !3, line: 192, column: 8)
!345 = !DILocation(line: 192, column: 8, scope: !329)
!346 = !DILocation(line: 195, column: 16, scope: !347)
!347 = distinct !DILexicalBlock(scope: !344, file: !3, line: 193, column: 5)
!348 = !DILocation(line: 195, column: 9, scope: !347)
!349 = !DILocation(line: 196, column: 5, scope: !347)
!350 = !DILocation(line: 197, column: 1, scope: !329)
!351 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_05_good", scope: !3, file: !3, line: 199, type: !58, scopeLine: 200, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!352 = !DILocation(line: 201, column: 5, scope: !351)
!353 = !DILocation(line: 202, column: 5, scope: !351)
!354 = !DILocation(line: 203, column: 5, scope: !351)
!355 = !DILocation(line: 204, column: 5, scope: !351)
!356 = !DILocation(line: 205, column: 1, scope: !351)
!357 = distinct !DISubprogram(name: "printLine", scope: !14, file: !14, line: 11, type: !358, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!358 = !DISubroutineType(types: !359)
!359 = !{null, !51}
!360 = !DILocalVariable(name: "line", arg: 1, scope: !357, file: !14, line: 11, type: !51)
!361 = !DILocation(line: 11, column: 25, scope: !357)
!362 = !DILocation(line: 13, column: 1, scope: !357)
!363 = !DILocation(line: 14, column: 8, scope: !364)
!364 = distinct !DILexicalBlock(scope: !357, file: !14, line: 14, column: 8)
!365 = !DILocation(line: 14, column: 13, scope: !364)
!366 = !DILocation(line: 14, column: 8, scope: !357)
!367 = !DILocation(line: 16, column: 24, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !14, line: 15, column: 5)
!369 = !DILocation(line: 16, column: 9, scope: !368)
!370 = !DILocation(line: 17, column: 5, scope: !368)
!371 = !DILocation(line: 18, column: 5, scope: !357)
!372 = !DILocation(line: 19, column: 1, scope: !357)
!373 = distinct !DISubprogram(name: "printSinkLine", scope: !14, file: !14, line: 20, type: !358, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!374 = !DILocalVariable(name: "line", arg: 1, scope: !373, file: !14, line: 20, type: !51)
!375 = !DILocation(line: 20, column: 29, scope: !373)
!376 = !DILocation(line: 22, column: 8, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !14, line: 22, column: 8)
!378 = !DILocation(line: 22, column: 13, scope: !377)
!379 = !DILocation(line: 22, column: 8, scope: !373)
!380 = !DILocation(line: 24, column: 24, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !14, line: 23, column: 5)
!382 = !DILocation(line: 24, column: 9, scope: !381)
!383 = !DILocation(line: 25, column: 5, scope: !381)
!384 = !DILocation(line: 26, column: 1, scope: !373)
!385 = distinct !DISubprogram(name: "printWLine", scope: !14, file: !14, line: 27, type: !386, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !76, line: 74, baseType: !7)
!390 = !DILocalVariable(name: "line", arg: 1, scope: !385, file: !14, line: 27, type: !388)
!391 = !DILocation(line: 27, column: 29, scope: !385)
!392 = !DILocation(line: 29, column: 8, scope: !393)
!393 = distinct !DILexicalBlock(scope: !385, file: !14, line: 29, column: 8)
!394 = !DILocation(line: 29, column: 13, scope: !393)
!395 = !DILocation(line: 29, column: 8, scope: !385)
!396 = !DILocation(line: 31, column: 27, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !14, line: 30, column: 5)
!398 = !DILocation(line: 31, column: 9, scope: !397)
!399 = !DILocation(line: 32, column: 5, scope: !397)
!400 = !DILocation(line: 33, column: 1, scope: !385)
!401 = distinct !DISubprogram(name: "printIntLine", scope: !14, file: !14, line: 35, type: !402, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !7}
!404 = !DILocalVariable(name: "intNumber", arg: 1, scope: !401, file: !14, line: 35, type: !7)
!405 = !DILocation(line: 35, column: 24, scope: !401)
!406 = !DILocation(line: 37, column: 20, scope: !401)
!407 = !DILocation(line: 37, column: 5, scope: !401)
!408 = !DILocation(line: 38, column: 1, scope: !401)
!409 = distinct !DISubprogram(name: "printShortLine", scope: !14, file: !14, line: 40, type: !410, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!413 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !409, file: !14, line: 40, type: !412)
!414 = !DILocation(line: 40, column: 28, scope: !409)
!415 = !DILocation(line: 42, column: 21, scope: !409)
!416 = !DILocation(line: 42, column: 5, scope: !409)
!417 = !DILocation(line: 43, column: 1, scope: !409)
!418 = distinct !DISubprogram(name: "printFloatLine", scope: !14, file: !14, line: 45, type: !419, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !421}
!421 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!422 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !418, file: !14, line: 45, type: !421)
!423 = !DILocation(line: 45, column: 28, scope: !418)
!424 = !DILocation(line: 47, column: 20, scope: !418)
!425 = !DILocation(line: 47, column: 5, scope: !418)
!426 = !DILocation(line: 48, column: 1, scope: !418)
!427 = distinct !DISubprogram(name: "printLongLine", scope: !14, file: !14, line: 50, type: !428, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !110}
!430 = !DILocalVariable(name: "longNumber", arg: 1, scope: !427, file: !14, line: 50, type: !110)
!431 = !DILocation(line: 50, column: 26, scope: !427)
!432 = !DILocation(line: 52, column: 21, scope: !427)
!433 = !DILocation(line: 52, column: 5, scope: !427)
!434 = !DILocation(line: 53, column: 1, scope: !427)
!435 = distinct !DISubprogram(name: "printLongLongLine", scope: !14, file: !14, line: 55, type: !436, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !439, line: 27, baseType: !440)
!439 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 44, baseType: !110)
!441 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !435, file: !14, line: 55, type: !438)
!442 = !DILocation(line: 55, column: 33, scope: !435)
!443 = !DILocation(line: 57, column: 29, scope: !435)
!444 = !DILocation(line: 57, column: 5, scope: !435)
!445 = !DILocation(line: 58, column: 1, scope: !435)
!446 = distinct !DISubprogram(name: "printSizeTLine", scope: !14, file: !14, line: 60, type: !447, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !75}
!449 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !446, file: !14, line: 60, type: !75)
!450 = !DILocation(line: 60, column: 29, scope: !446)
!451 = !DILocation(line: 62, column: 21, scope: !446)
!452 = !DILocation(line: 62, column: 5, scope: !446)
!453 = !DILocation(line: 63, column: 1, scope: !446)
!454 = distinct !DISubprogram(name: "printHexCharLine", scope: !14, file: !14, line: 65, type: !455, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !52}
!457 = !DILocalVariable(name: "charHex", arg: 1, scope: !454, file: !14, line: 65, type: !52)
!458 = !DILocation(line: 65, column: 29, scope: !454)
!459 = !DILocation(line: 67, column: 22, scope: !454)
!460 = !DILocation(line: 67, column: 5, scope: !454)
!461 = !DILocation(line: 68, column: 1, scope: !454)
!462 = distinct !DISubprogram(name: "printWcharLine", scope: !14, file: !14, line: 70, type: !463, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !389}
!465 = !DILocalVariable(name: "wideChar", arg: 1, scope: !462, file: !14, line: 70, type: !389)
!466 = !DILocation(line: 70, column: 29, scope: !462)
!467 = !DILocalVariable(name: "s", scope: !462, file: !14, line: 74, type: !468)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 2)
!471 = !DILocation(line: 74, column: 13, scope: !462)
!472 = !DILocation(line: 75, column: 16, scope: !462)
!473 = !DILocation(line: 75, column: 9, scope: !462)
!474 = !DILocation(line: 75, column: 14, scope: !462)
!475 = !DILocation(line: 76, column: 9, scope: !462)
!476 = !DILocation(line: 76, column: 14, scope: !462)
!477 = !DILocation(line: 77, column: 21, scope: !462)
!478 = !DILocation(line: 77, column: 5, scope: !462)
!479 = !DILocation(line: 78, column: 1, scope: !462)
!480 = distinct !DISubprogram(name: "printUnsignedLine", scope: !14, file: !14, line: 80, type: !481, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !18}
!483 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !480, file: !14, line: 80, type: !18)
!484 = !DILocation(line: 80, column: 33, scope: !480)
!485 = !DILocation(line: 82, column: 20, scope: !480)
!486 = !DILocation(line: 82, column: 5, scope: !480)
!487 = !DILocation(line: 83, column: 1, scope: !480)
!488 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !14, file: !14, line: 85, type: !489, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !34}
!491 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !488, file: !14, line: 85, type: !34)
!492 = !DILocation(line: 85, column: 45, scope: !488)
!493 = !DILocation(line: 87, column: 22, scope: !488)
!494 = !DILocation(line: 87, column: 5, scope: !488)
!495 = !DILocation(line: 88, column: 1, scope: !488)
!496 = distinct !DISubprogram(name: "printDoubleLine", scope: !14, file: !14, line: 90, type: !497, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499}
!499 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!500 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !496, file: !14, line: 90, type: !499)
!501 = !DILocation(line: 90, column: 29, scope: !496)
!502 = !DILocation(line: 92, column: 20, scope: !496)
!503 = !DILocation(line: 92, column: 5, scope: !496)
!504 = !DILocation(line: 93, column: 1, scope: !496)
!505 = distinct !DISubprogram(name: "printStructLine", scope: !14, file: !14, line: 95, type: !506, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !510, line: 100, baseType: !511)
!510 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_014/source_code")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !510, line: 96, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !511, file: !510, line: 98, baseType: !7, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !511, file: !510, line: 99, baseType: !7, size: 32, offset: 32)
!515 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !505, file: !14, line: 95, type: !508)
!516 = !DILocation(line: 95, column: 40, scope: !505)
!517 = !DILocation(line: 97, column: 26, scope: !505)
!518 = !DILocation(line: 97, column: 47, scope: !505)
!519 = !DILocation(line: 97, column: 55, scope: !505)
!520 = !DILocation(line: 97, column: 76, scope: !505)
!521 = !DILocation(line: 97, column: 5, scope: !505)
!522 = !DILocation(line: 98, column: 1, scope: !505)
!523 = distinct !DISubprogram(name: "printBytesLine", scope: !14, file: !14, line: 100, type: !524, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526, !75}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !34, size: 64)
!527 = !DILocalVariable(name: "bytes", arg: 1, scope: !523, file: !14, line: 100, type: !526)
!528 = !DILocation(line: 100, column: 38, scope: !523)
!529 = !DILocalVariable(name: "numBytes", arg: 2, scope: !523, file: !14, line: 100, type: !75)
!530 = !DILocation(line: 100, column: 52, scope: !523)
!531 = !DILocalVariable(name: "i", scope: !523, file: !14, line: 102, type: !75)
!532 = !DILocation(line: 102, column: 12, scope: !523)
!533 = !DILocation(line: 103, column: 12, scope: !534)
!534 = distinct !DILexicalBlock(scope: !523, file: !14, line: 103, column: 5)
!535 = !DILocation(line: 103, column: 10, scope: !534)
!536 = !DILocation(line: 103, column: 17, scope: !537)
!537 = distinct !DILexicalBlock(scope: !534, file: !14, line: 103, column: 5)
!538 = !DILocation(line: 103, column: 21, scope: !537)
!539 = !DILocation(line: 103, column: 19, scope: !537)
!540 = !DILocation(line: 103, column: 5, scope: !534)
!541 = !DILocation(line: 105, column: 24, scope: !542)
!542 = distinct !DILexicalBlock(scope: !537, file: !14, line: 104, column: 5)
!543 = !DILocation(line: 105, column: 30, scope: !542)
!544 = !DILocation(line: 105, column: 9, scope: !542)
!545 = !DILocation(line: 106, column: 5, scope: !542)
!546 = !DILocation(line: 103, column: 31, scope: !537)
!547 = !DILocation(line: 103, column: 5, scope: !537)
!548 = distinct !{!548, !540, !549, !550}
!549 = !DILocation(line: 106, column: 5, scope: !534)
!550 = !{!"llvm.loop.mustprogress"}
!551 = !DILocation(line: 107, column: 5, scope: !523)
!552 = !DILocation(line: 108, column: 1, scope: !523)
!553 = distinct !DISubprogram(name: "decodeHexChars", scope: !14, file: !14, line: 113, type: !554, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !13, retainedNodes: !4)
!554 = !DISubroutineType(types: !555)
!555 = !{!75, !526, !75, !51}
!556 = !DILocalVariable(name: "bytes", arg: 1, scope: !553, file: !14, line: 113, type: !526)
!557 = !DILocation(line: 113, column: 39, scope: !553)
!558 = !DILocalVariable(name: "numBytes", arg: 2, scope: !553, file: !14, line: 113, type: !75)
!559 = !DILocation(line: 113, column: 53, scope: !553)
!560 = !DILocalVariable(name: "hex", arg: 3, scope: !553, file: !14, line: 113, type: !51)
!561 = !DILocation(line: 113, column: 71, scope: !553)
!562 = !DILocalVariable(name: "numWritten", scope: !553, file: !14, line: 115, type: !75)
!563 = !DILocation(line: 115, column: 12, scope: !553)
!564 = !DILocation(line: 121, column: 5, scope: !553)
!565 = !DILocation(line: 121, column: 12, scope: !553)
!566 = !DILocation(line: 121, column: 25, scope: !553)
!567 = !DILocation(line: 121, column: 23, scope: !553)
!568 = !DILocation(line: 121, column: 34, scope: !553)
!569 = !DILocation(line: 121, column: 37, scope: !553)
!570 = !DILocation(line: 121, column: 67, scope: !553)
!571 = !DILocation(line: 121, column: 70, scope: !553)
!572 = !DILocation(line: 0, scope: !553)
!573 = !DILocalVariable(name: "byte", scope: !574, file: !14, line: 123, type: !7)
!574 = distinct !DILexicalBlock(scope: !553, file: !14, line: 122, column: 5)
