; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!1 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_TRUE", scope: !2, file: !3, line: 174, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_179/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_42.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_179/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badSource", scope: !45, file: !45, line: 34, type: !53, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{!42, !42}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 34, type: !42)
!56 = !DILocation(line: 34, column: 25, scope: !52)
!57 = !DILocalVariable(name: "dataLen", scope: !58, file: !45, line: 38, type: !59)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 36, column: 5)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !60, line: 46, baseType: !61)
!60 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!61 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!62 = !DILocation(line: 38, column: 16, scope: !58)
!63 = !DILocation(line: 38, column: 33, scope: !58)
!64 = !DILocation(line: 38, column: 26, scope: !58)
!65 = !DILocalVariable(name: "pFile", scope: !58, file: !45, line: 39, type: !66)
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !67, size: 64)
!67 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !68, line: 7, baseType: !69)
!68 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !70, line: 49, size: 1728, elements: !71)
!70 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!71 = !{!72, !73, !74, !75, !76, !77, !78, !79, !80, !81, !82, !83, !84, !87, !89, !90, !91, !95, !96, !98, !102, !105, !107, !110, !113, !114, !115, !116, !117}
!72 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !69, file: !70, line: 51, baseType: !23, size: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !69, file: !70, line: 54, baseType: !42, size: 64, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !69, file: !70, line: 55, baseType: !42, size: 64, offset: 128)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !69, file: !70, line: 56, baseType: !42, size: 64, offset: 192)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !69, file: !70, line: 57, baseType: !42, size: 64, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !69, file: !70, line: 58, baseType: !42, size: 64, offset: 320)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !69, file: !70, line: 59, baseType: !42, size: 64, offset: 384)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !69, file: !70, line: 60, baseType: !42, size: 64, offset: 448)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !69, file: !70, line: 61, baseType: !42, size: 64, offset: 512)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !69, file: !70, line: 64, baseType: !42, size: 64, offset: 576)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !69, file: !70, line: 65, baseType: !42, size: 64, offset: 640)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !69, file: !70, line: 66, baseType: !42, size: 64, offset: 704)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !69, file: !70, line: 68, baseType: !85, size: 64, offset: 768)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !70, line: 36, flags: DIFlagFwdDecl)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !69, file: !70, line: 70, baseType: !88, size: 64, offset: 832)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !69, file: !70, line: 72, baseType: !23, size: 32, offset: 896)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !69, file: !70, line: 73, baseType: !23, size: 32, offset: 928)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !69, file: !70, line: 74, baseType: !92, size: 64, offset: 960)
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !93, line: 152, baseType: !94)
!93 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!94 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !69, file: !70, line: 77, baseType: !24, size: 16, offset: 1024)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !69, file: !70, line: 78, baseType: !97, size: 8, offset: 1040)
!97 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !69, file: !70, line: 79, baseType: !99, size: 8, offset: 1048)
!99 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !100)
!100 = !{!101}
!101 = !DISubrange(count: 1)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !69, file: !70, line: 81, baseType: !103, size: 64, offset: 1088)
!103 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64)
!104 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !70, line: 43, baseType: null)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !69, file: !70, line: 89, baseType: !106, size: 64, offset: 1152)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !93, line: 153, baseType: !94)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !69, file: !70, line: 91, baseType: !108, size: 64, offset: 1216)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !70, line: 37, flags: DIFlagFwdDecl)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !69, file: !70, line: 92, baseType: !111, size: 64, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !112, size: 64)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !70, line: 38, flags: DIFlagFwdDecl)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !69, file: !70, line: 93, baseType: !88, size: 64, offset: 1344)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !69, file: !70, line: 94, baseType: !22, size: 64, offset: 1408)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !69, file: !70, line: 95, baseType: !59, size: 64, offset: 1472)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !69, file: !70, line: 96, baseType: !23, size: 32, offset: 1536)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !69, file: !70, line: 98, baseType: !118, size: 160, offset: 1568)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 20)
!121 = !DILocation(line: 39, column: 16, scope: !58)
!122 = !DILocation(line: 41, column: 17, scope: !123)
!123 = distinct !DILexicalBlock(scope: !58, file: !45, line: 41, column: 13)
!124 = !DILocation(line: 41, column: 16, scope: !123)
!125 = !DILocation(line: 41, column: 25, scope: !123)
!126 = !DILocation(line: 41, column: 13, scope: !58)
!127 = !DILocation(line: 43, column: 21, scope: !128)
!128 = distinct !DILexicalBlock(scope: !123, file: !45, line: 42, column: 9)
!129 = !DILocation(line: 43, column: 19, scope: !128)
!130 = !DILocation(line: 44, column: 17, scope: !131)
!131 = distinct !DILexicalBlock(scope: !128, file: !45, line: 44, column: 17)
!132 = !DILocation(line: 44, column: 23, scope: !131)
!133 = !DILocation(line: 44, column: 17, scope: !128)
!134 = !DILocation(line: 47, column: 27, scope: !135)
!135 = distinct !DILexicalBlock(scope: !136, file: !45, line: 47, column: 21)
!136 = distinct !DILexicalBlock(scope: !131, file: !45, line: 45, column: 13)
!137 = !DILocation(line: 47, column: 32, scope: !135)
!138 = !DILocation(line: 47, column: 31, scope: !135)
!139 = !DILocation(line: 47, column: 51, scope: !135)
!140 = !DILocation(line: 47, column: 50, scope: !135)
!141 = !DILocation(line: 47, column: 41, scope: !135)
!142 = !DILocation(line: 47, column: 61, scope: !135)
!143 = !DILocation(line: 47, column: 21, scope: !135)
!144 = !DILocation(line: 47, column: 68, scope: !135)
!145 = !DILocation(line: 47, column: 21, scope: !136)
!146 = !DILocation(line: 49, column: 21, scope: !147)
!147 = distinct !DILexicalBlock(scope: !135, file: !45, line: 48, column: 17)
!148 = !DILocation(line: 51, column: 21, scope: !147)
!149 = !DILocation(line: 51, column: 26, scope: !147)
!150 = !DILocation(line: 51, column: 35, scope: !147)
!151 = !DILocation(line: 52, column: 17, scope: !147)
!152 = !DILocation(line: 53, column: 24, scope: !136)
!153 = !DILocation(line: 53, column: 17, scope: !136)
!154 = !DILocation(line: 54, column: 13, scope: !136)
!155 = !DILocation(line: 55, column: 9, scope: !128)
!156 = !DILocation(line: 57, column: 12, scope: !52)
!157 = !DILocation(line: 57, column: 5, scope: !52)
!158 = distinct !DISubprogram(name: "badVaSink", scope: !45, file: !45, line: 60, type: !159, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !42, null}
!161 = !DILocalVariable(name: "data", arg: 1, scope: !158, file: !45, line: 60, type: !42)
!162 = !DILocation(line: 60, column: 23, scope: !158)
!163 = !DILocalVariable(name: "args", scope: !164, file: !45, line: 63, type: !165)
!164 = distinct !DILexicalBlock(scope: !158, file: !45, line: 62, column: 5)
!165 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !166, line: 52, baseType: !167)
!166 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!167 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !168, line: 32, baseType: !169)
!168 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!169 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !45, baseType: !170)
!170 = !DICompositeType(tag: DW_TAG_array_type, baseType: !171, size: 192, elements: !100)
!171 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !172)
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !171, file: !45, line: 63, baseType: !7, size: 32)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !171, file: !45, line: 63, baseType: !7, size: 32, offset: 32)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !171, file: !45, line: 63, baseType: !22, size: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !171, file: !45, line: 63, baseType: !22, size: 64, offset: 128)
!177 = !DILocation(line: 63, column: 17, scope: !164)
!178 = !DILocation(line: 64, column: 9, scope: !164)
!179 = !DILocation(line: 66, column: 17, scope: !164)
!180 = !DILocation(line: 66, column: 23, scope: !164)
!181 = !DILocation(line: 66, column: 9, scope: !164)
!182 = !DILocation(line: 67, column: 9, scope: !164)
!183 = !DILocation(line: 69, column: 1, scope: !158)
!184 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_42_bad", scope: !45, file: !45, line: 71, type: !185, scopeLine: 72, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!185 = !DISubroutineType(types: !186)
!186 = !{null}
!187 = !DILocalVariable(name: "data", scope: !184, file: !45, line: 73, type: !42)
!188 = !DILocation(line: 73, column: 12, scope: !184)
!189 = !DILocalVariable(name: "dataBuffer", scope: !184, file: !45, line: 74, type: !190)
!190 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !191)
!191 = !{!192}
!192 = !DISubrange(count: 100)
!193 = !DILocation(line: 74, column: 10, scope: !184)
!194 = !DILocation(line: 75, column: 12, scope: !184)
!195 = !DILocation(line: 75, column: 10, scope: !184)
!196 = !DILocation(line: 76, column: 22, scope: !184)
!197 = !DILocation(line: 76, column: 12, scope: !184)
!198 = !DILocation(line: 76, column: 10, scope: !184)
!199 = !DILocation(line: 77, column: 15, scope: !184)
!200 = !DILocation(line: 77, column: 21, scope: !184)
!201 = !DILocation(line: 77, column: 5, scope: !184)
!202 = !DILocation(line: 78, column: 1, scope: !184)
!203 = distinct !DISubprogram(name: "goodG2BSource", scope: !45, file: !45, line: 85, type: !53, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!204 = !DILocalVariable(name: "data", arg: 1, scope: !203, file: !45, line: 85, type: !42)
!205 = !DILocation(line: 85, column: 29, scope: !203)
!206 = !DILocation(line: 88, column: 12, scope: !203)
!207 = !DILocation(line: 88, column: 5, scope: !203)
!208 = !DILocation(line: 89, column: 12, scope: !203)
!209 = !DILocation(line: 89, column: 5, scope: !203)
!210 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !45, file: !45, line: 92, type: !159, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!211 = !DILocalVariable(name: "data", arg: 1, scope: !210, file: !45, line: 92, type: !42)
!212 = !DILocation(line: 92, column: 27, scope: !210)
!213 = !DILocalVariable(name: "args", scope: !214, file: !45, line: 95, type: !165)
!214 = distinct !DILexicalBlock(scope: !210, file: !45, line: 94, column: 5)
!215 = !DILocation(line: 95, column: 17, scope: !214)
!216 = !DILocation(line: 96, column: 9, scope: !214)
!217 = !DILocation(line: 98, column: 17, scope: !214)
!218 = !DILocation(line: 98, column: 23, scope: !214)
!219 = !DILocation(line: 98, column: 9, scope: !214)
!220 = !DILocation(line: 99, column: 9, scope: !214)
!221 = !DILocation(line: 101, column: 1, scope: !210)
!222 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 103, type: !185, scopeLine: 104, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!223 = !DILocalVariable(name: "data", scope: !222, file: !45, line: 105, type: !42)
!224 = !DILocation(line: 105, column: 12, scope: !222)
!225 = !DILocalVariable(name: "dataBuffer", scope: !222, file: !45, line: 106, type: !190)
!226 = !DILocation(line: 106, column: 10, scope: !222)
!227 = !DILocation(line: 107, column: 12, scope: !222)
!228 = !DILocation(line: 107, column: 10, scope: !222)
!229 = !DILocation(line: 108, column: 26, scope: !222)
!230 = !DILocation(line: 108, column: 12, scope: !222)
!231 = !DILocation(line: 108, column: 10, scope: !222)
!232 = !DILocation(line: 109, column: 19, scope: !222)
!233 = !DILocation(line: 109, column: 25, scope: !222)
!234 = !DILocation(line: 109, column: 5, scope: !222)
!235 = !DILocation(line: 110, column: 1, scope: !222)
!236 = distinct !DISubprogram(name: "goodB2GSource", scope: !45, file: !45, line: 113, type: !53, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!237 = !DILocalVariable(name: "data", arg: 1, scope: !236, file: !45, line: 113, type: !42)
!238 = !DILocation(line: 113, column: 29, scope: !236)
!239 = !DILocalVariable(name: "dataLen", scope: !240, file: !45, line: 117, type: !59)
!240 = distinct !DILexicalBlock(scope: !236, file: !45, line: 115, column: 5)
!241 = !DILocation(line: 117, column: 16, scope: !240)
!242 = !DILocation(line: 117, column: 33, scope: !240)
!243 = !DILocation(line: 117, column: 26, scope: !240)
!244 = !DILocalVariable(name: "pFile", scope: !240, file: !45, line: 118, type: !66)
!245 = !DILocation(line: 118, column: 16, scope: !240)
!246 = !DILocation(line: 120, column: 17, scope: !247)
!247 = distinct !DILexicalBlock(scope: !240, file: !45, line: 120, column: 13)
!248 = !DILocation(line: 120, column: 16, scope: !247)
!249 = !DILocation(line: 120, column: 25, scope: !247)
!250 = !DILocation(line: 120, column: 13, scope: !240)
!251 = !DILocation(line: 122, column: 21, scope: !252)
!252 = distinct !DILexicalBlock(scope: !247, file: !45, line: 121, column: 9)
!253 = !DILocation(line: 122, column: 19, scope: !252)
!254 = !DILocation(line: 123, column: 17, scope: !255)
!255 = distinct !DILexicalBlock(scope: !252, file: !45, line: 123, column: 17)
!256 = !DILocation(line: 123, column: 23, scope: !255)
!257 = !DILocation(line: 123, column: 17, scope: !252)
!258 = !DILocation(line: 126, column: 27, scope: !259)
!259 = distinct !DILexicalBlock(scope: !260, file: !45, line: 126, column: 21)
!260 = distinct !DILexicalBlock(scope: !255, file: !45, line: 124, column: 13)
!261 = !DILocation(line: 126, column: 32, scope: !259)
!262 = !DILocation(line: 126, column: 31, scope: !259)
!263 = !DILocation(line: 126, column: 51, scope: !259)
!264 = !DILocation(line: 126, column: 50, scope: !259)
!265 = !DILocation(line: 126, column: 41, scope: !259)
!266 = !DILocation(line: 126, column: 61, scope: !259)
!267 = !DILocation(line: 126, column: 21, scope: !259)
!268 = !DILocation(line: 126, column: 68, scope: !259)
!269 = !DILocation(line: 126, column: 21, scope: !260)
!270 = !DILocation(line: 128, column: 21, scope: !271)
!271 = distinct !DILexicalBlock(scope: !259, file: !45, line: 127, column: 17)
!272 = !DILocation(line: 130, column: 21, scope: !271)
!273 = !DILocation(line: 130, column: 26, scope: !271)
!274 = !DILocation(line: 130, column: 35, scope: !271)
!275 = !DILocation(line: 131, column: 17, scope: !271)
!276 = !DILocation(line: 132, column: 24, scope: !260)
!277 = !DILocation(line: 132, column: 17, scope: !260)
!278 = !DILocation(line: 133, column: 13, scope: !260)
!279 = !DILocation(line: 134, column: 9, scope: !252)
!280 = !DILocation(line: 136, column: 12, scope: !236)
!281 = !DILocation(line: 136, column: 5, scope: !236)
!282 = distinct !DISubprogram(name: "goodB2GVaSink", scope: !45, file: !45, line: 139, type: !159, scopeLine: 140, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!283 = !DILocalVariable(name: "data", arg: 1, scope: !282, file: !45, line: 139, type: !42)
!284 = !DILocation(line: 139, column: 27, scope: !282)
!285 = !DILocalVariable(name: "args", scope: !286, file: !45, line: 142, type: !165)
!286 = distinct !DILexicalBlock(scope: !282, file: !45, line: 141, column: 5)
!287 = !DILocation(line: 142, column: 17, scope: !286)
!288 = !DILocation(line: 143, column: 9, scope: !286)
!289 = !DILocation(line: 145, column: 23, scope: !286)
!290 = !DILocation(line: 145, column: 9, scope: !286)
!291 = !DILocation(line: 146, column: 9, scope: !286)
!292 = !DILocation(line: 148, column: 1, scope: !282)
!293 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 150, type: !185, scopeLine: 151, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!294 = !DILocalVariable(name: "data", scope: !293, file: !45, line: 152, type: !42)
!295 = !DILocation(line: 152, column: 12, scope: !293)
!296 = !DILocalVariable(name: "dataBuffer", scope: !293, file: !45, line: 153, type: !190)
!297 = !DILocation(line: 153, column: 10, scope: !293)
!298 = !DILocation(line: 154, column: 12, scope: !293)
!299 = !DILocation(line: 154, column: 10, scope: !293)
!300 = !DILocation(line: 155, column: 26, scope: !293)
!301 = !DILocation(line: 155, column: 12, scope: !293)
!302 = !DILocation(line: 155, column: 10, scope: !293)
!303 = !DILocation(line: 156, column: 19, scope: !293)
!304 = !DILocation(line: 156, column: 25, scope: !293)
!305 = !DILocation(line: 156, column: 5, scope: !293)
!306 = !DILocation(line: 157, column: 1, scope: !293)
!307 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_42_good", scope: !45, file: !45, line: 159, type: !185, scopeLine: 160, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!308 = !DILocation(line: 161, column: 5, scope: !307)
!309 = !DILocation(line: 162, column: 5, scope: !307)
!310 = !DILocation(line: 163, column: 1, scope: !307)
!311 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !312, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!312 = !DISubroutineType(types: !313)
!313 = !{null, !42}
!314 = !DILocalVariable(name: "line", arg: 1, scope: !311, file: !3, line: 11, type: !42)
!315 = !DILocation(line: 11, column: 25, scope: !311)
!316 = !DILocation(line: 13, column: 1, scope: !311)
!317 = !DILocation(line: 14, column: 8, scope: !318)
!318 = distinct !DILexicalBlock(scope: !311, file: !3, line: 14, column: 8)
!319 = !DILocation(line: 14, column: 13, scope: !318)
!320 = !DILocation(line: 14, column: 8, scope: !311)
!321 = !DILocation(line: 16, column: 24, scope: !322)
!322 = distinct !DILexicalBlock(scope: !318, file: !3, line: 15, column: 5)
!323 = !DILocation(line: 16, column: 9, scope: !322)
!324 = !DILocation(line: 17, column: 5, scope: !322)
!325 = !DILocation(line: 18, column: 5, scope: !311)
!326 = !DILocation(line: 19, column: 1, scope: !311)
!327 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !312, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!328 = !DILocalVariable(name: "line", arg: 1, scope: !327, file: !3, line: 20, type: !42)
!329 = !DILocation(line: 20, column: 29, scope: !327)
!330 = !DILocation(line: 22, column: 8, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !3, line: 22, column: 8)
!332 = !DILocation(line: 22, column: 13, scope: !331)
!333 = !DILocation(line: 22, column: 8, scope: !327)
!334 = !DILocation(line: 24, column: 24, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 23, column: 5)
!336 = !DILocation(line: 24, column: 9, scope: !335)
!337 = !DILocation(line: 25, column: 5, scope: !335)
!338 = !DILocation(line: 26, column: 1, scope: !327)
!339 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !340, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!340 = !DISubroutineType(types: !341)
!341 = !{null, !342}
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64)
!343 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !60, line: 74, baseType: !23)
!344 = !DILocalVariable(name: "line", arg: 1, scope: !339, file: !3, line: 27, type: !342)
!345 = !DILocation(line: 27, column: 29, scope: !339)
!346 = !DILocation(line: 29, column: 8, scope: !347)
!347 = distinct !DILexicalBlock(scope: !339, file: !3, line: 29, column: 8)
!348 = !DILocation(line: 29, column: 13, scope: !347)
!349 = !DILocation(line: 29, column: 8, scope: !339)
!350 = !DILocation(line: 31, column: 27, scope: !351)
!351 = distinct !DILexicalBlock(scope: !347, file: !3, line: 30, column: 5)
!352 = !DILocation(line: 31, column: 9, scope: !351)
!353 = !DILocation(line: 32, column: 5, scope: !351)
!354 = !DILocation(line: 33, column: 1, scope: !339)
!355 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !356, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !23}
!358 = !DILocalVariable(name: "intNumber", arg: 1, scope: !355, file: !3, line: 35, type: !23)
!359 = !DILocation(line: 35, column: 24, scope: !355)
!360 = !DILocation(line: 37, column: 20, scope: !355)
!361 = !DILocation(line: 37, column: 5, scope: !355)
!362 = !DILocation(line: 38, column: 1, scope: !355)
!363 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !364, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !366}
!366 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!367 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !363, file: !3, line: 40, type: !366)
!368 = !DILocation(line: 40, column: 28, scope: !363)
!369 = !DILocation(line: 42, column: 21, scope: !363)
!370 = !DILocation(line: 42, column: 5, scope: !363)
!371 = !DILocation(line: 43, column: 1, scope: !363)
!372 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !373, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!373 = !DISubroutineType(types: !374)
!374 = !{null, !375}
!375 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!376 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !372, file: !3, line: 45, type: !375)
!377 = !DILocation(line: 45, column: 28, scope: !372)
!378 = !DILocation(line: 47, column: 20, scope: !372)
!379 = !DILocation(line: 47, column: 5, scope: !372)
!380 = !DILocation(line: 48, column: 1, scope: !372)
!381 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !382, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!382 = !DISubroutineType(types: !383)
!383 = !{null, !94}
!384 = !DILocalVariable(name: "longNumber", arg: 1, scope: !381, file: !3, line: 50, type: !94)
!385 = !DILocation(line: 50, column: 26, scope: !381)
!386 = !DILocation(line: 52, column: 21, scope: !381)
!387 = !DILocation(line: 52, column: 5, scope: !381)
!388 = !DILocation(line: 53, column: 1, scope: !381)
!389 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !390, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!390 = !DISubroutineType(types: !391)
!391 = !{null, !392}
!392 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !393, line: 27, baseType: !394)
!393 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!394 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !93, line: 44, baseType: !94)
!395 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !389, file: !3, line: 55, type: !392)
!396 = !DILocation(line: 55, column: 33, scope: !389)
!397 = !DILocation(line: 57, column: 29, scope: !389)
!398 = !DILocation(line: 57, column: 5, scope: !389)
!399 = !DILocation(line: 58, column: 1, scope: !389)
!400 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !401, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !59}
!403 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !400, file: !3, line: 60, type: !59)
!404 = !DILocation(line: 60, column: 29, scope: !400)
!405 = !DILocation(line: 62, column: 21, scope: !400)
!406 = !DILocation(line: 62, column: 5, scope: !400)
!407 = !DILocation(line: 63, column: 1, scope: !400)
!408 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !409, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !43}
!411 = !DILocalVariable(name: "charHex", arg: 1, scope: !408, file: !3, line: 65, type: !43)
!412 = !DILocation(line: 65, column: 29, scope: !408)
!413 = !DILocation(line: 67, column: 22, scope: !408)
!414 = !DILocation(line: 67, column: 5, scope: !408)
!415 = !DILocation(line: 68, column: 1, scope: !408)
!416 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !417, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !343}
!419 = !DILocalVariable(name: "wideChar", arg: 1, scope: !416, file: !3, line: 70, type: !343)
!420 = !DILocation(line: 70, column: 29, scope: !416)
!421 = !DILocalVariable(name: "s", scope: !416, file: !3, line: 74, type: !422)
!422 = !DICompositeType(tag: DW_TAG_array_type, baseType: !343, size: 64, elements: !423)
!423 = !{!424}
!424 = !DISubrange(count: 2)
!425 = !DILocation(line: 74, column: 13, scope: !416)
!426 = !DILocation(line: 75, column: 16, scope: !416)
!427 = !DILocation(line: 75, column: 9, scope: !416)
!428 = !DILocation(line: 75, column: 14, scope: !416)
!429 = !DILocation(line: 76, column: 9, scope: !416)
!430 = !DILocation(line: 76, column: 14, scope: !416)
!431 = !DILocation(line: 77, column: 21, scope: !416)
!432 = !DILocation(line: 77, column: 5, scope: !416)
!433 = !DILocation(line: 78, column: 1, scope: !416)
!434 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !435, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!435 = !DISubroutineType(types: !436)
!436 = !{null, !7}
!437 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !434, file: !3, line: 80, type: !7)
!438 = !DILocation(line: 80, column: 33, scope: !434)
!439 = !DILocation(line: 82, column: 20, scope: !434)
!440 = !DILocation(line: 82, column: 5, scope: !434)
!441 = !DILocation(line: 83, column: 1, scope: !434)
!442 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !443, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!443 = !DISubroutineType(types: !444)
!444 = !{null, !25}
!445 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !442, file: !3, line: 85, type: !25)
!446 = !DILocation(line: 85, column: 45, scope: !442)
!447 = !DILocation(line: 87, column: 22, scope: !442)
!448 = !DILocation(line: 87, column: 5, scope: !442)
!449 = !DILocation(line: 88, column: 1, scope: !442)
!450 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !451, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!451 = !DISubroutineType(types: !452)
!452 = !{null, !453}
!453 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!454 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !450, file: !3, line: 90, type: !453)
!455 = !DILocation(line: 90, column: 29, scope: !450)
!456 = !DILocation(line: 92, column: 20, scope: !450)
!457 = !DILocation(line: 92, column: 5, scope: !450)
!458 = !DILocation(line: 93, column: 1, scope: !450)
!459 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !460, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !462}
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !463, size: 64)
!463 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !464, line: 100, baseType: !465)
!464 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_179/source_code")
!465 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !464, line: 96, size: 64, elements: !466)
!466 = !{!467, !468}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !465, file: !464, line: 98, baseType: !23, size: 32)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !465, file: !464, line: 99, baseType: !23, size: 32, offset: 32)
!469 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !459, file: !3, line: 95, type: !462)
!470 = !DILocation(line: 95, column: 40, scope: !459)
!471 = !DILocation(line: 97, column: 26, scope: !459)
!472 = !DILocation(line: 97, column: 47, scope: !459)
!473 = !DILocation(line: 97, column: 55, scope: !459)
!474 = !DILocation(line: 97, column: 76, scope: !459)
!475 = !DILocation(line: 97, column: 5, scope: !459)
!476 = !DILocation(line: 98, column: 1, scope: !459)
!477 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !478, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!478 = !DISubroutineType(types: !479)
!479 = !{null, !480, !59}
!480 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!481 = !DILocalVariable(name: "bytes", arg: 1, scope: !477, file: !3, line: 100, type: !480)
!482 = !DILocation(line: 100, column: 38, scope: !477)
!483 = !DILocalVariable(name: "numBytes", arg: 2, scope: !477, file: !3, line: 100, type: !59)
!484 = !DILocation(line: 100, column: 52, scope: !477)
!485 = !DILocalVariable(name: "i", scope: !477, file: !3, line: 102, type: !59)
!486 = !DILocation(line: 102, column: 12, scope: !477)
!487 = !DILocation(line: 103, column: 12, scope: !488)
!488 = distinct !DILexicalBlock(scope: !477, file: !3, line: 103, column: 5)
!489 = !DILocation(line: 103, column: 10, scope: !488)
!490 = !DILocation(line: 103, column: 17, scope: !491)
!491 = distinct !DILexicalBlock(scope: !488, file: !3, line: 103, column: 5)
!492 = !DILocation(line: 103, column: 21, scope: !491)
!493 = !DILocation(line: 103, column: 19, scope: !491)
!494 = !DILocation(line: 103, column: 5, scope: !488)
!495 = !DILocation(line: 105, column: 24, scope: !496)
!496 = distinct !DILexicalBlock(scope: !491, file: !3, line: 104, column: 5)
!497 = !DILocation(line: 105, column: 30, scope: !496)
!498 = !DILocation(line: 105, column: 9, scope: !496)
!499 = !DILocation(line: 106, column: 5, scope: !496)
!500 = !DILocation(line: 103, column: 31, scope: !491)
!501 = !DILocation(line: 103, column: 5, scope: !491)
!502 = distinct !{!502, !494, !503, !504}
!503 = !DILocation(line: 106, column: 5, scope: !488)
!504 = !{!"llvm.loop.mustprogress"}
!505 = !DILocation(line: 107, column: 5, scope: !477)
!506 = !DILocation(line: 108, column: 1, scope: !477)
!507 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !508, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!508 = !DISubroutineType(types: !509)
!509 = !{!59, !480, !59, !42}
!510 = !DILocalVariable(name: "bytes", arg: 1, scope: !507, file: !3, line: 113, type: !480)
!511 = !DILocation(line: 113, column: 39, scope: !507)
!512 = !DILocalVariable(name: "numBytes", arg: 2, scope: !507, file: !3, line: 113, type: !59)
!513 = !DILocation(line: 113, column: 53, scope: !507)
!514 = !DILocalVariable(name: "hex", arg: 3, scope: !507, file: !3, line: 113, type: !42)
!515 = !DILocation(line: 113, column: 71, scope: !507)
!516 = !DILocalVariable(name: "numWritten", scope: !507, file: !3, line: 115, type: !59)
!517 = !DILocation(line: 115, column: 12, scope: !507)
!518 = !DILocation(line: 121, column: 5, scope: !507)
!519 = !DILocation(line: 121, column: 12, scope: !507)
!520 = !DILocation(line: 121, column: 25, scope: !507)
!521 = !DILocation(line: 121, column: 23, scope: !507)
!522 = !DILocation(line: 121, column: 34, scope: !507)
!523 = !DILocation(line: 121, column: 37, scope: !507)
!524 = !DILocation(line: 121, column: 67, scope: !507)
!525 = !DILocation(line: 121, column: 70, scope: !507)
!526 = !DILocation(line: 0, scope: !507)
!527 = !DILocalVariable(name: "byte", scope: !528, file: !3, line: 123, type: !23)
!528 = distinct !DILexicalBlock(scope: !507, file: !3, line: 122, column: 5)
