; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._CWE134_Uncontrolled_Format_String__char_file_fprintf_67_structType = type { i8* }
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35

!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_001/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_001/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67_bad", scope: !45, file: !45, line: 36, type: !55, scopeLine: 37, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 38, type: !42)
!58 = !DILocation(line: 38, column: 12, scope: !54)
!59 = !DILocalVariable(name: "myStruct", scope: !54, file: !45, line: 39, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67_structType", file: !61, line: 8, baseType: !62)
!61 = !DIFile(filename: "./_costom_header_.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_001/source_code")
!62 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CWE134_Uncontrolled_Format_String__char_file_fprintf_67_structType", file: !61, line: 5, size: 64, elements: !63)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "structFirst", scope: !62, file: !61, line: 7, baseType: !42, size: 64)
!65 = !DILocation(line: 39, column: 72, scope: !54)
!66 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 40, type: !67)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 100)
!70 = !DILocation(line: 40, column: 10, scope: !54)
!71 = !DILocation(line: 41, column: 12, scope: !54)
!72 = !DILocation(line: 41, column: 10, scope: !54)
!73 = !DILocalVariable(name: "dataLen", scope: !74, file: !45, line: 44, type: !75)
!74 = distinct !DILexicalBlock(scope: !54, file: !45, line: 42, column: 5)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DILocation(line: 44, column: 16, scope: !74)
!79 = !DILocation(line: 44, column: 33, scope: !74)
!80 = !DILocation(line: 44, column: 26, scope: !74)
!81 = !DILocalVariable(name: "pFile", scope: !74, file: !45, line: 45, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 7, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !105, !106, !107, !111, !112, !114, !118, !121, !123, !126, !129, !130, !131, !132, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !23, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !42, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !42, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !42, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !42, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !42, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !42, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !42, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !42, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !42, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !42, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !42, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !23, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !23, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !24, size: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !113, size: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !115, size: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !119, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !122, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 153, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !104, size: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !22, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !75, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !23, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 45, column: 16, scope: !74)
!138 = !DILocation(line: 47, column: 17, scope: !139)
!139 = distinct !DILexicalBlock(scope: !74, file: !45, line: 47, column: 13)
!140 = !DILocation(line: 47, column: 16, scope: !139)
!141 = !DILocation(line: 47, column: 25, scope: !139)
!142 = !DILocation(line: 47, column: 13, scope: !74)
!143 = !DILocation(line: 49, column: 21, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !45, line: 48, column: 9)
!145 = !DILocation(line: 49, column: 19, scope: !144)
!146 = !DILocation(line: 50, column: 17, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !45, line: 50, column: 17)
!148 = !DILocation(line: 50, column: 23, scope: !147)
!149 = !DILocation(line: 50, column: 17, scope: !144)
!150 = !DILocation(line: 53, column: 27, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !45, line: 53, column: 21)
!152 = distinct !DILexicalBlock(scope: !147, file: !45, line: 51, column: 13)
!153 = !DILocation(line: 53, column: 32, scope: !151)
!154 = !DILocation(line: 53, column: 31, scope: !151)
!155 = !DILocation(line: 53, column: 51, scope: !151)
!156 = !DILocation(line: 53, column: 50, scope: !151)
!157 = !DILocation(line: 53, column: 41, scope: !151)
!158 = !DILocation(line: 53, column: 61, scope: !151)
!159 = !DILocation(line: 53, column: 21, scope: !151)
!160 = !DILocation(line: 53, column: 68, scope: !151)
!161 = !DILocation(line: 53, column: 21, scope: !152)
!162 = !DILocation(line: 55, column: 21, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !45, line: 54, column: 17)
!164 = !DILocation(line: 57, column: 21, scope: !163)
!165 = !DILocation(line: 57, column: 26, scope: !163)
!166 = !DILocation(line: 57, column: 35, scope: !163)
!167 = !DILocation(line: 58, column: 17, scope: !163)
!168 = !DILocation(line: 59, column: 24, scope: !152)
!169 = !DILocation(line: 59, column: 17, scope: !152)
!170 = !DILocation(line: 60, column: 13, scope: !152)
!171 = !DILocation(line: 61, column: 9, scope: !144)
!172 = !DILocation(line: 63, column: 28, scope: !54)
!173 = !DILocation(line: 63, column: 14, scope: !54)
!174 = !DILocation(line: 63, column: 26, scope: !54)
!175 = !DILocation(line: 64, column: 5, scope: !54)
!176 = !DILocation(line: 65, column: 1, scope: !54)
!177 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 73, type: !55, scopeLine: 74, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!178 = !DILocalVariable(name: "data", scope: !177, file: !45, line: 75, type: !42)
!179 = !DILocation(line: 75, column: 12, scope: !177)
!180 = !DILocalVariable(name: "myStruct", scope: !177, file: !45, line: 76, type: !60)
!181 = !DILocation(line: 76, column: 72, scope: !177)
!182 = !DILocalVariable(name: "dataBuffer", scope: !177, file: !45, line: 77, type: !67)
!183 = !DILocation(line: 77, column: 10, scope: !177)
!184 = !DILocation(line: 78, column: 12, scope: !177)
!185 = !DILocation(line: 78, column: 10, scope: !177)
!186 = !DILocation(line: 80, column: 12, scope: !177)
!187 = !DILocation(line: 80, column: 5, scope: !177)
!188 = !DILocation(line: 81, column: 28, scope: !177)
!189 = !DILocation(line: 81, column: 14, scope: !177)
!190 = !DILocation(line: 81, column: 26, scope: !177)
!191 = !DILocation(line: 82, column: 5, scope: !177)
!192 = !DILocation(line: 83, column: 1, scope: !177)
!193 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 87, type: !55, scopeLine: 88, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!194 = !DILocalVariable(name: "data", scope: !193, file: !45, line: 89, type: !42)
!195 = !DILocation(line: 89, column: 12, scope: !193)
!196 = !DILocalVariable(name: "myStruct", scope: !193, file: !45, line: 90, type: !60)
!197 = !DILocation(line: 90, column: 72, scope: !193)
!198 = !DILocalVariable(name: "dataBuffer", scope: !193, file: !45, line: 91, type: !67)
!199 = !DILocation(line: 91, column: 10, scope: !193)
!200 = !DILocation(line: 92, column: 12, scope: !193)
!201 = !DILocation(line: 92, column: 10, scope: !193)
!202 = !DILocalVariable(name: "dataLen", scope: !203, file: !45, line: 95, type: !75)
!203 = distinct !DILexicalBlock(scope: !193, file: !45, line: 93, column: 5)
!204 = !DILocation(line: 95, column: 16, scope: !203)
!205 = !DILocation(line: 95, column: 33, scope: !203)
!206 = !DILocation(line: 95, column: 26, scope: !203)
!207 = !DILocalVariable(name: "pFile", scope: !203, file: !45, line: 96, type: !82)
!208 = !DILocation(line: 96, column: 16, scope: !203)
!209 = !DILocation(line: 98, column: 17, scope: !210)
!210 = distinct !DILexicalBlock(scope: !203, file: !45, line: 98, column: 13)
!211 = !DILocation(line: 98, column: 16, scope: !210)
!212 = !DILocation(line: 98, column: 25, scope: !210)
!213 = !DILocation(line: 98, column: 13, scope: !203)
!214 = !DILocation(line: 100, column: 21, scope: !215)
!215 = distinct !DILexicalBlock(scope: !210, file: !45, line: 99, column: 9)
!216 = !DILocation(line: 100, column: 19, scope: !215)
!217 = !DILocation(line: 101, column: 17, scope: !218)
!218 = distinct !DILexicalBlock(scope: !215, file: !45, line: 101, column: 17)
!219 = !DILocation(line: 101, column: 23, scope: !218)
!220 = !DILocation(line: 101, column: 17, scope: !215)
!221 = !DILocation(line: 104, column: 27, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !45, line: 104, column: 21)
!223 = distinct !DILexicalBlock(scope: !218, file: !45, line: 102, column: 13)
!224 = !DILocation(line: 104, column: 32, scope: !222)
!225 = !DILocation(line: 104, column: 31, scope: !222)
!226 = !DILocation(line: 104, column: 51, scope: !222)
!227 = !DILocation(line: 104, column: 50, scope: !222)
!228 = !DILocation(line: 104, column: 41, scope: !222)
!229 = !DILocation(line: 104, column: 61, scope: !222)
!230 = !DILocation(line: 104, column: 21, scope: !222)
!231 = !DILocation(line: 104, column: 68, scope: !222)
!232 = !DILocation(line: 104, column: 21, scope: !223)
!233 = !DILocation(line: 106, column: 21, scope: !234)
!234 = distinct !DILexicalBlock(scope: !222, file: !45, line: 105, column: 17)
!235 = !DILocation(line: 108, column: 21, scope: !234)
!236 = !DILocation(line: 108, column: 26, scope: !234)
!237 = !DILocation(line: 108, column: 35, scope: !234)
!238 = !DILocation(line: 109, column: 17, scope: !234)
!239 = !DILocation(line: 110, column: 24, scope: !223)
!240 = !DILocation(line: 110, column: 17, scope: !223)
!241 = !DILocation(line: 111, column: 13, scope: !223)
!242 = !DILocation(line: 112, column: 9, scope: !215)
!243 = !DILocation(line: 114, column: 28, scope: !193)
!244 = !DILocation(line: 114, column: 14, scope: !193)
!245 = !DILocation(line: 114, column: 26, scope: !193)
!246 = !DILocation(line: 115, column: 5, scope: !193)
!247 = !DILocation(line: 116, column: 1, scope: !193)
!248 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67_good", scope: !45, file: !45, line: 118, type: !55, scopeLine: 119, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!249 = !DILocation(line: 120, column: 5, scope: !248)
!250 = !DILocation(line: 121, column: 5, scope: !248)
!251 = !DILocation(line: 122, column: 1, scope: !248)
!252 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67b_badSink", scope: !49, file: !49, line: 37, type: !253, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!253 = !DISubroutineType(types: !254)
!254 = !{null, !255}
!255 = !DIDerivedType(tag: DW_TAG_typedef, name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67_structType", file: !49, line: 33, baseType: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_CWE134_Uncontrolled_Format_String__char_file_fprintf_67_structType", file: !49, line: 30, size: 64, elements: !257)
!257 = !{!258}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "structFirst", scope: !256, file: !49, line: 32, baseType: !42, size: 64)
!259 = !DILocalVariable(name: "myStruct", arg: 1, scope: !252, file: !49, line: 37, type: !255)
!260 = !DILocation(line: 37, column: 138, scope: !252)
!261 = !DILocalVariable(name: "data", scope: !252, file: !49, line: 39, type: !42)
!262 = !DILocation(line: 39, column: 12, scope: !252)
!263 = !DILocation(line: 39, column: 28, scope: !252)
!264 = !DILocation(line: 41, column: 13, scope: !252)
!265 = !DILocation(line: 41, column: 21, scope: !252)
!266 = !DILocation(line: 41, column: 5, scope: !252)
!267 = !DILocation(line: 42, column: 1, scope: !252)
!268 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67b_goodG2BSink", scope: !49, file: !49, line: 49, type: !253, scopeLine: 50, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!269 = !DILocalVariable(name: "myStruct", arg: 1, scope: !268, file: !49, line: 49, type: !255)
!270 = !DILocation(line: 49, column: 142, scope: !268)
!271 = !DILocalVariable(name: "data", scope: !268, file: !49, line: 51, type: !42)
!272 = !DILocation(line: 51, column: 12, scope: !268)
!273 = !DILocation(line: 51, column: 28, scope: !268)
!274 = !DILocation(line: 53, column: 13, scope: !268)
!275 = !DILocation(line: 53, column: 21, scope: !268)
!276 = !DILocation(line: 53, column: 5, scope: !268)
!277 = !DILocation(line: 54, column: 1, scope: !268)
!278 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_67b_goodB2GSink", scope: !49, file: !49, line: 57, type: !253, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!279 = !DILocalVariable(name: "myStruct", arg: 1, scope: !278, file: !49, line: 57, type: !255)
!280 = !DILocation(line: 57, column: 142, scope: !278)
!281 = !DILocalVariable(name: "data", scope: !278, file: !49, line: 59, type: !42)
!282 = !DILocation(line: 59, column: 12, scope: !278)
!283 = !DILocation(line: 59, column: 28, scope: !278)
!284 = !DILocation(line: 61, column: 13, scope: !278)
!285 = !DILocation(line: 61, column: 29, scope: !278)
!286 = !DILocation(line: 61, column: 5, scope: !278)
!287 = !DILocation(line: 62, column: 1, scope: !278)
!288 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !289, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!289 = !DISubroutineType(types: !290)
!290 = !{null, !42}
!291 = !DILocalVariable(name: "line", arg: 1, scope: !288, file: !3, line: 11, type: !42)
!292 = !DILocation(line: 11, column: 25, scope: !288)
!293 = !DILocation(line: 13, column: 1, scope: !288)
!294 = !DILocation(line: 14, column: 8, scope: !295)
!295 = distinct !DILexicalBlock(scope: !288, file: !3, line: 14, column: 8)
!296 = !DILocation(line: 14, column: 13, scope: !295)
!297 = !DILocation(line: 14, column: 8, scope: !288)
!298 = !DILocation(line: 16, column: 24, scope: !299)
!299 = distinct !DILexicalBlock(scope: !295, file: !3, line: 15, column: 5)
!300 = !DILocation(line: 16, column: 9, scope: !299)
!301 = !DILocation(line: 17, column: 5, scope: !299)
!302 = !DILocation(line: 18, column: 5, scope: !288)
!303 = !DILocation(line: 19, column: 1, scope: !288)
!304 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !289, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!305 = !DILocalVariable(name: "line", arg: 1, scope: !304, file: !3, line: 20, type: !42)
!306 = !DILocation(line: 20, column: 29, scope: !304)
!307 = !DILocation(line: 22, column: 8, scope: !308)
!308 = distinct !DILexicalBlock(scope: !304, file: !3, line: 22, column: 8)
!309 = !DILocation(line: 22, column: 13, scope: !308)
!310 = !DILocation(line: 22, column: 8, scope: !304)
!311 = !DILocation(line: 24, column: 24, scope: !312)
!312 = distinct !DILexicalBlock(scope: !308, file: !3, line: 23, column: 5)
!313 = !DILocation(line: 24, column: 9, scope: !312)
!314 = !DILocation(line: 25, column: 5, scope: !312)
!315 = !DILocation(line: 26, column: 1, scope: !304)
!316 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !317, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!317 = !DISubroutineType(types: !318)
!318 = !{null, !319}
!319 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !320, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !76, line: 74, baseType: !23)
!321 = !DILocalVariable(name: "line", arg: 1, scope: !316, file: !3, line: 27, type: !319)
!322 = !DILocation(line: 27, column: 29, scope: !316)
!323 = !DILocation(line: 29, column: 8, scope: !324)
!324 = distinct !DILexicalBlock(scope: !316, file: !3, line: 29, column: 8)
!325 = !DILocation(line: 29, column: 13, scope: !324)
!326 = !DILocation(line: 29, column: 8, scope: !316)
!327 = !DILocation(line: 31, column: 27, scope: !328)
!328 = distinct !DILexicalBlock(scope: !324, file: !3, line: 30, column: 5)
!329 = !DILocation(line: 31, column: 9, scope: !328)
!330 = !DILocation(line: 32, column: 5, scope: !328)
!331 = !DILocation(line: 33, column: 1, scope: !316)
!332 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !333, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!333 = !DISubroutineType(types: !334)
!334 = !{null, !23}
!335 = !DILocalVariable(name: "intNumber", arg: 1, scope: !332, file: !3, line: 35, type: !23)
!336 = !DILocation(line: 35, column: 24, scope: !332)
!337 = !DILocation(line: 37, column: 20, scope: !332)
!338 = !DILocation(line: 37, column: 5, scope: !332)
!339 = !DILocation(line: 38, column: 1, scope: !332)
!340 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !341, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!341 = !DISubroutineType(types: !342)
!342 = !{null, !343}
!343 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!344 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !340, file: !3, line: 40, type: !343)
!345 = !DILocation(line: 40, column: 28, scope: !340)
!346 = !DILocation(line: 42, column: 21, scope: !340)
!347 = !DILocation(line: 42, column: 5, scope: !340)
!348 = !DILocation(line: 43, column: 1, scope: !340)
!349 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !350, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!350 = !DISubroutineType(types: !351)
!351 = !{null, !352}
!352 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!353 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !349, file: !3, line: 45, type: !352)
!354 = !DILocation(line: 45, column: 28, scope: !349)
!355 = !DILocation(line: 47, column: 20, scope: !349)
!356 = !DILocation(line: 47, column: 5, scope: !349)
!357 = !DILocation(line: 48, column: 1, scope: !349)
!358 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !359, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!359 = !DISubroutineType(types: !360)
!360 = !{null, !110}
!361 = !DILocalVariable(name: "longNumber", arg: 1, scope: !358, file: !3, line: 50, type: !110)
!362 = !DILocation(line: 50, column: 26, scope: !358)
!363 = !DILocation(line: 52, column: 21, scope: !358)
!364 = !DILocation(line: 52, column: 5, scope: !358)
!365 = !DILocation(line: 53, column: 1, scope: !358)
!366 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !367, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!367 = !DISubroutineType(types: !368)
!368 = !{null, !369}
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !370, line: 27, baseType: !371)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 44, baseType: !110)
!372 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !366, file: !3, line: 55, type: !369)
!373 = !DILocation(line: 55, column: 33, scope: !366)
!374 = !DILocation(line: 57, column: 29, scope: !366)
!375 = !DILocation(line: 57, column: 5, scope: !366)
!376 = !DILocation(line: 58, column: 1, scope: !366)
!377 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !378, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!378 = !DISubroutineType(types: !379)
!379 = !{null, !75}
!380 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !377, file: !3, line: 60, type: !75)
!381 = !DILocation(line: 60, column: 29, scope: !377)
!382 = !DILocation(line: 62, column: 21, scope: !377)
!383 = !DILocation(line: 62, column: 5, scope: !377)
!384 = !DILocation(line: 63, column: 1, scope: !377)
!385 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !386, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !43}
!388 = !DILocalVariable(name: "charHex", arg: 1, scope: !385, file: !3, line: 65, type: !43)
!389 = !DILocation(line: 65, column: 29, scope: !385)
!390 = !DILocation(line: 67, column: 22, scope: !385)
!391 = !DILocation(line: 67, column: 5, scope: !385)
!392 = !DILocation(line: 68, column: 1, scope: !385)
!393 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !394, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!394 = !DISubroutineType(types: !395)
!395 = !{null, !320}
!396 = !DILocalVariable(name: "wideChar", arg: 1, scope: !393, file: !3, line: 70, type: !320)
!397 = !DILocation(line: 70, column: 29, scope: !393)
!398 = !DILocalVariable(name: "s", scope: !393, file: !3, line: 74, type: !399)
!399 = !DICompositeType(tag: DW_TAG_array_type, baseType: !320, size: 64, elements: !400)
!400 = !{!401}
!401 = !DISubrange(count: 2)
!402 = !DILocation(line: 74, column: 13, scope: !393)
!403 = !DILocation(line: 75, column: 16, scope: !393)
!404 = !DILocation(line: 75, column: 9, scope: !393)
!405 = !DILocation(line: 75, column: 14, scope: !393)
!406 = !DILocation(line: 76, column: 9, scope: !393)
!407 = !DILocation(line: 76, column: 14, scope: !393)
!408 = !DILocation(line: 77, column: 21, scope: !393)
!409 = !DILocation(line: 77, column: 5, scope: !393)
!410 = !DILocation(line: 78, column: 1, scope: !393)
!411 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !412, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !7}
!414 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !411, file: !3, line: 80, type: !7)
!415 = !DILocation(line: 80, column: 33, scope: !411)
!416 = !DILocation(line: 82, column: 20, scope: !411)
!417 = !DILocation(line: 82, column: 5, scope: !411)
!418 = !DILocation(line: 83, column: 1, scope: !411)
!419 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !420, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!420 = !DISubroutineType(types: !421)
!421 = !{null, !25}
!422 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !419, file: !3, line: 85, type: !25)
!423 = !DILocation(line: 85, column: 45, scope: !419)
!424 = !DILocation(line: 87, column: 22, scope: !419)
!425 = !DILocation(line: 87, column: 5, scope: !419)
!426 = !DILocation(line: 88, column: 1, scope: !419)
!427 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !428, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !430}
!430 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!431 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !427, file: !3, line: 90, type: !430)
!432 = !DILocation(line: 90, column: 29, scope: !427)
!433 = !DILocation(line: 92, column: 20, scope: !427)
!434 = !DILocation(line: 92, column: 5, scope: !427)
!435 = !DILocation(line: 93, column: 1, scope: !427)
!436 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !437, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64)
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !441, line: 100, baseType: !442)
!441 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_001/source_code")
!442 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !441, line: 96, size: 64, elements: !443)
!443 = !{!444, !445}
!444 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !442, file: !441, line: 98, baseType: !23, size: 32)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !442, file: !441, line: 99, baseType: !23, size: 32, offset: 32)
!446 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !436, file: !3, line: 95, type: !439)
!447 = !DILocation(line: 95, column: 40, scope: !436)
!448 = !DILocation(line: 97, column: 26, scope: !436)
!449 = !DILocation(line: 97, column: 47, scope: !436)
!450 = !DILocation(line: 97, column: 55, scope: !436)
!451 = !DILocation(line: 97, column: 76, scope: !436)
!452 = !DILocation(line: 97, column: 5, scope: !436)
!453 = !DILocation(line: 98, column: 1, scope: !436)
!454 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !455, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !457, !75}
!457 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!458 = !DILocalVariable(name: "bytes", arg: 1, scope: !454, file: !3, line: 100, type: !457)
!459 = !DILocation(line: 100, column: 38, scope: !454)
!460 = !DILocalVariable(name: "numBytes", arg: 2, scope: !454, file: !3, line: 100, type: !75)
!461 = !DILocation(line: 100, column: 52, scope: !454)
!462 = !DILocalVariable(name: "i", scope: !454, file: !3, line: 102, type: !75)
!463 = !DILocation(line: 102, column: 12, scope: !454)
!464 = !DILocation(line: 103, column: 12, scope: !465)
!465 = distinct !DILexicalBlock(scope: !454, file: !3, line: 103, column: 5)
!466 = !DILocation(line: 103, column: 10, scope: !465)
!467 = !DILocation(line: 103, column: 17, scope: !468)
!468 = distinct !DILexicalBlock(scope: !465, file: !3, line: 103, column: 5)
!469 = !DILocation(line: 103, column: 21, scope: !468)
!470 = !DILocation(line: 103, column: 19, scope: !468)
!471 = !DILocation(line: 103, column: 5, scope: !465)
!472 = !DILocation(line: 105, column: 24, scope: !473)
!473 = distinct !DILexicalBlock(scope: !468, file: !3, line: 104, column: 5)
!474 = !DILocation(line: 105, column: 30, scope: !473)
!475 = !DILocation(line: 105, column: 9, scope: !473)
!476 = !DILocation(line: 106, column: 5, scope: !473)
!477 = !DILocation(line: 103, column: 31, scope: !468)
!478 = !DILocation(line: 103, column: 5, scope: !468)
!479 = distinct !{!479, !471, !480, !481}
!480 = !DILocation(line: 106, column: 5, scope: !465)
!481 = !{!"llvm.loop.mustprogress"}
!482 = !DILocation(line: 107, column: 5, scope: !454)
!483 = !DILocation(line: 108, column: 1, scope: !454)
!484 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !485, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!485 = !DISubroutineType(types: !486)
!486 = !{!75, !457, !75, !42}
!487 = !DILocalVariable(name: "bytes", arg: 1, scope: !484, file: !3, line: 113, type: !457)
!488 = !DILocation(line: 113, column: 39, scope: !484)
!489 = !DILocalVariable(name: "numBytes", arg: 2, scope: !484, file: !3, line: 113, type: !75)
!490 = !DILocation(line: 113, column: 53, scope: !484)
!491 = !DILocalVariable(name: "hex", arg: 3, scope: !484, file: !3, line: 113, type: !42)
!492 = !DILocation(line: 113, column: 71, scope: !484)
!493 = !DILocalVariable(name: "numWritten", scope: !484, file: !3, line: 115, type: !75)
!494 = !DILocation(line: 115, column: 12, scope: !484)
!495 = !DILocation(line: 121, column: 5, scope: !484)
!496 = !DILocation(line: 121, column: 12, scope: !484)
!497 = !DILocation(line: 121, column: 25, scope: !484)
!498 = !DILocation(line: 121, column: 23, scope: !484)
!499 = !DILocation(line: 121, column: 34, scope: !484)
!500 = !DILocation(line: 121, column: 37, scope: !484)
!501 = !DILocation(line: 121, column: 67, scope: !484)
!502 = !DILocation(line: 121, column: 70, scope: !484)
!503 = !DILocation(line: 0, scope: !484)
!504 = !DILocalVariable(name: "byte", scope: !505, file: !3, line: 123, type: !23)
!505 = distinct !DILexicalBlock(scope: !484, file: !3, line: 122, column: 5)
