; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@badStatic = dso_local global i32 0, align 4, !dbg !0
@goodB2G1Static = dso_local global i32 0, align 4, !dbg !9
@goodB2G2Static = dso_local global i32 0, align 4, !dbg !11
@goodG2BStatic = dso_local global i32 0, align 4, !dbg !13
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !15
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !40

!8 = !{!0, !9, !11, !13}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "goodB2G1Static", scope: !2, file: !3, line: 86, type: !7, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "goodB2G2Static", scope: !2, file: !3, line: 87, type: !7, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "goodG2BStatic", scope: !2, file: !3, line: 88, type: !7, isLocal: false, isDefinition: true)
!15 = !DIGlobalVariableExpression(var: !16, expr: !DIExpression())
!16 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_TRUE", scope: !17, file: !18, line: 174, type: !7, isLocal: false, isDefinition: true)
!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !36, globals: !39, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_172/source_code")
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !22, size: 32, elements: !23)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!36 = !{!6, !7, !37, !38}
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!15, !40, !42, !44, !46, !48, !50, !52}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !17, file: !18, line: 175, type: !7, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !17, file: !18, line: 176, type: !7, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "globalTrue", scope: !17, file: !18, line: 181, type: !7, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "globalFalse", scope: !17, file: !18, line: 182, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalFive", scope: !17, file: !18, line: 183, type: !7, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "globalArgc", scope: !17, file: !18, line: 214, type: !7, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "globalArgv", scope: !17, file: !18, line: 215, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!57 = !{!"clang version 12.0.0"}
!58 = !{i32 7, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = distinct !DISubprogram(name: "badVaSink", scope: !3, file: !3, line: 37, type: !62, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!62 = !DISubroutineType(types: !63)
!63 = !{null, !55, null}
!64 = !DILocalVariable(name: "data", arg: 1, scope: !61, file: !3, line: 37, type: !55)
!65 = !DILocation(line: 37, column: 23, scope: !61)
!66 = !DILocation(line: 39, column: 8, scope: !67)
!67 = distinct !DILexicalBlock(scope: !61, file: !3, line: 39, column: 8)
!68 = !DILocation(line: 39, column: 8, scope: !61)
!69 = !DILocalVariable(name: "args", scope: !70, file: !3, line: 42, type: !72)
!70 = distinct !DILexicalBlock(scope: !71, file: !3, line: 41, column: 9)
!71 = distinct !DILexicalBlock(scope: !67, file: !3, line: 40, column: 5)
!72 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !73, line: 52, baseType: !74)
!73 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !75, line: 32, baseType: !76)
!75 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 192, elements: !84)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !79)
!79 = !{!80, !81, !82, !83}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !78, file: !3, line: 42, baseType: !22, size: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !78, file: !3, line: 42, baseType: !22, size: 32, offset: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !78, file: !3, line: 42, baseType: !6, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !78, file: !3, line: 42, baseType: !6, size: 64, offset: 128)
!84 = !{!85}
!85 = !DISubrange(count: 1)
!86 = !DILocation(line: 42, column: 21, scope: !70)
!87 = !DILocation(line: 43, column: 13, scope: !70)
!88 = !DILocation(line: 45, column: 21, scope: !70)
!89 = !DILocation(line: 45, column: 27, scope: !70)
!90 = !DILocation(line: 45, column: 13, scope: !70)
!91 = !DILocation(line: 46, column: 13, scope: !70)
!92 = !DILocation(line: 48, column: 5, scope: !71)
!93 = !DILocation(line: 49, column: 1, scope: !61)
!94 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_21_bad", scope: !3, file: !3, line: 51, type: !95, scopeLine: 52, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!95 = !DISubroutineType(types: !96)
!96 = !{null}
!97 = !DILocalVariable(name: "data", scope: !94, file: !3, line: 53, type: !55)
!98 = !DILocation(line: 53, column: 12, scope: !94)
!99 = !DILocalVariable(name: "dataBuffer", scope: !94, file: !3, line: 54, type: !100)
!100 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 800, elements: !101)
!101 = !{!102}
!102 = !DISubrange(count: 100)
!103 = !DILocation(line: 54, column: 10, scope: !94)
!104 = !DILocation(line: 55, column: 12, scope: !94)
!105 = !DILocation(line: 55, column: 10, scope: !94)
!106 = !DILocalVariable(name: "dataLen", scope: !107, file: !3, line: 58, type: !108)
!107 = distinct !DILexicalBlock(scope: !94, file: !3, line: 56, column: 5)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !109, line: 46, baseType: !110)
!109 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!110 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!111 = !DILocation(line: 58, column: 16, scope: !107)
!112 = !DILocation(line: 58, column: 33, scope: !107)
!113 = !DILocation(line: 58, column: 26, scope: !107)
!114 = !DILocalVariable(name: "pFile", scope: !107, file: !3, line: 59, type: !115)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !117, line: 7, baseType: !118)
!117 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !119, line: 49, size: 1728, elements: !120)
!119 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !136, !138, !139, !140, !144, !145, !147, !149, !152, !154, !157, !160, !161, !162, !163, !164}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !118, file: !119, line: 51, baseType: !7, size: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !118, file: !119, line: 54, baseType: !55, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !118, file: !119, line: 55, baseType: !55, size: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !118, file: !119, line: 56, baseType: !55, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !118, file: !119, line: 57, baseType: !55, size: 64, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !118, file: !119, line: 58, baseType: !55, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !118, file: !119, line: 59, baseType: !55, size: 64, offset: 384)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !118, file: !119, line: 60, baseType: !55, size: 64, offset: 448)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !118, file: !119, line: 61, baseType: !55, size: 64, offset: 512)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !118, file: !119, line: 64, baseType: !55, size: 64, offset: 576)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !118, file: !119, line: 65, baseType: !55, size: 64, offset: 640)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !118, file: !119, line: 66, baseType: !55, size: 64, offset: 704)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !118, file: !119, line: 68, baseType: !134, size: 64, offset: 768)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !119, line: 36, flags: DIFlagFwdDecl)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !118, file: !119, line: 70, baseType: !137, size: 64, offset: 832)
!137 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !118, file: !119, line: 72, baseType: !7, size: 32, offset: 896)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !118, file: !119, line: 73, baseType: !7, size: 32, offset: 928)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !118, file: !119, line: 74, baseType: !141, size: 64, offset: 960)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !142, line: 152, baseType: !143)
!142 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!143 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !118, file: !119, line: 77, baseType: !37, size: 16, offset: 1024)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !118, file: !119, line: 78, baseType: !146, size: 8, offset: 1040)
!146 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !118, file: !119, line: 79, baseType: !148, size: 8, offset: 1048)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 8, elements: !84)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !118, file: !119, line: 81, baseType: !150, size: 64, offset: 1088)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !119, line: 43, baseType: null)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !118, file: !119, line: 89, baseType: !153, size: 64, offset: 1152)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !142, line: 153, baseType: !143)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !118, file: !119, line: 91, baseType: !155, size: 64, offset: 1216)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !119, line: 37, flags: DIFlagFwdDecl)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !118, file: !119, line: 92, baseType: !158, size: 64, offset: 1280)
!158 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !159, size: 64)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !119, line: 38, flags: DIFlagFwdDecl)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !118, file: !119, line: 93, baseType: !137, size: 64, offset: 1344)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !118, file: !119, line: 94, baseType: !6, size: 64, offset: 1408)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !118, file: !119, line: 95, baseType: !108, size: 64, offset: 1472)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !118, file: !119, line: 96, baseType: !7, size: 32, offset: 1536)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !118, file: !119, line: 98, baseType: !165, size: 160, offset: 1568)
!165 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 160, elements: !166)
!166 = !{!167}
!167 = !DISubrange(count: 20)
!168 = !DILocation(line: 59, column: 16, scope: !107)
!169 = !DILocation(line: 61, column: 17, scope: !170)
!170 = distinct !DILexicalBlock(scope: !107, file: !3, line: 61, column: 13)
!171 = !DILocation(line: 61, column: 16, scope: !170)
!172 = !DILocation(line: 61, column: 25, scope: !170)
!173 = !DILocation(line: 61, column: 13, scope: !107)
!174 = !DILocation(line: 63, column: 21, scope: !175)
!175 = distinct !DILexicalBlock(scope: !170, file: !3, line: 62, column: 9)
!176 = !DILocation(line: 63, column: 19, scope: !175)
!177 = !DILocation(line: 64, column: 17, scope: !178)
!178 = distinct !DILexicalBlock(scope: !175, file: !3, line: 64, column: 17)
!179 = !DILocation(line: 64, column: 23, scope: !178)
!180 = !DILocation(line: 64, column: 17, scope: !175)
!181 = !DILocation(line: 67, column: 27, scope: !182)
!182 = distinct !DILexicalBlock(scope: !183, file: !3, line: 67, column: 21)
!183 = distinct !DILexicalBlock(scope: !178, file: !3, line: 65, column: 13)
!184 = !DILocation(line: 67, column: 32, scope: !182)
!185 = !DILocation(line: 67, column: 31, scope: !182)
!186 = !DILocation(line: 67, column: 51, scope: !182)
!187 = !DILocation(line: 67, column: 50, scope: !182)
!188 = !DILocation(line: 67, column: 41, scope: !182)
!189 = !DILocation(line: 67, column: 61, scope: !182)
!190 = !DILocation(line: 67, column: 21, scope: !182)
!191 = !DILocation(line: 67, column: 68, scope: !182)
!192 = !DILocation(line: 67, column: 21, scope: !183)
!193 = !DILocation(line: 69, column: 21, scope: !194)
!194 = distinct !DILexicalBlock(scope: !182, file: !3, line: 68, column: 17)
!195 = !DILocation(line: 71, column: 21, scope: !194)
!196 = !DILocation(line: 71, column: 26, scope: !194)
!197 = !DILocation(line: 71, column: 35, scope: !194)
!198 = !DILocation(line: 72, column: 17, scope: !194)
!199 = !DILocation(line: 73, column: 24, scope: !183)
!200 = !DILocation(line: 73, column: 17, scope: !183)
!201 = !DILocation(line: 74, column: 13, scope: !183)
!202 = !DILocation(line: 75, column: 9, scope: !175)
!203 = !DILocation(line: 77, column: 15, scope: !94)
!204 = !DILocation(line: 78, column: 15, scope: !94)
!205 = !DILocation(line: 78, column: 21, scope: !94)
!206 = !DILocation(line: 78, column: 5, scope: !94)
!207 = !DILocation(line: 79, column: 1, scope: !94)
!208 = distinct !DISubprogram(name: "goodB2G1_vasink", scope: !3, file: !3, line: 91, type: !62, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!209 = !DILocalVariable(name: "data", arg: 1, scope: !208, file: !3, line: 91, type: !55)
!210 = !DILocation(line: 91, column: 29, scope: !208)
!211 = !DILocation(line: 93, column: 8, scope: !212)
!212 = distinct !DILexicalBlock(scope: !208, file: !3, line: 93, column: 8)
!213 = !DILocation(line: 93, column: 8, scope: !208)
!214 = !DILocation(line: 96, column: 9, scope: !215)
!215 = distinct !DILexicalBlock(scope: !212, file: !3, line: 94, column: 5)
!216 = !DILocation(line: 97, column: 5, scope: !215)
!217 = !DILocalVariable(name: "args", scope: !218, file: !3, line: 101, type: !72)
!218 = distinct !DILexicalBlock(scope: !219, file: !3, line: 100, column: 9)
!219 = distinct !DILexicalBlock(scope: !212, file: !3, line: 99, column: 5)
!220 = !DILocation(line: 101, column: 21, scope: !218)
!221 = !DILocation(line: 102, column: 13, scope: !218)
!222 = !DILocation(line: 104, column: 27, scope: !218)
!223 = !DILocation(line: 104, column: 13, scope: !218)
!224 = !DILocation(line: 105, column: 13, scope: !218)
!225 = !DILocation(line: 108, column: 1, scope: !208)
!226 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 110, type: !95, scopeLine: 111, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!227 = !DILocalVariable(name: "data", scope: !226, file: !3, line: 112, type: !55)
!228 = !DILocation(line: 112, column: 12, scope: !226)
!229 = !DILocalVariable(name: "dataBuffer", scope: !226, file: !3, line: 113, type: !100)
!230 = !DILocation(line: 113, column: 10, scope: !226)
!231 = !DILocation(line: 114, column: 12, scope: !226)
!232 = !DILocation(line: 114, column: 10, scope: !226)
!233 = !DILocalVariable(name: "dataLen", scope: !234, file: !3, line: 117, type: !108)
!234 = distinct !DILexicalBlock(scope: !226, file: !3, line: 115, column: 5)
!235 = !DILocation(line: 117, column: 16, scope: !234)
!236 = !DILocation(line: 117, column: 33, scope: !234)
!237 = !DILocation(line: 117, column: 26, scope: !234)
!238 = !DILocalVariable(name: "pFile", scope: !234, file: !3, line: 118, type: !115)
!239 = !DILocation(line: 118, column: 16, scope: !234)
!240 = !DILocation(line: 120, column: 17, scope: !241)
!241 = distinct !DILexicalBlock(scope: !234, file: !3, line: 120, column: 13)
!242 = !DILocation(line: 120, column: 16, scope: !241)
!243 = !DILocation(line: 120, column: 25, scope: !241)
!244 = !DILocation(line: 120, column: 13, scope: !234)
!245 = !DILocation(line: 122, column: 21, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !3, line: 121, column: 9)
!247 = !DILocation(line: 122, column: 19, scope: !246)
!248 = !DILocation(line: 123, column: 17, scope: !249)
!249 = distinct !DILexicalBlock(scope: !246, file: !3, line: 123, column: 17)
!250 = !DILocation(line: 123, column: 23, scope: !249)
!251 = !DILocation(line: 123, column: 17, scope: !246)
!252 = !DILocation(line: 126, column: 27, scope: !253)
!253 = distinct !DILexicalBlock(scope: !254, file: !3, line: 126, column: 21)
!254 = distinct !DILexicalBlock(scope: !249, file: !3, line: 124, column: 13)
!255 = !DILocation(line: 126, column: 32, scope: !253)
!256 = !DILocation(line: 126, column: 31, scope: !253)
!257 = !DILocation(line: 126, column: 51, scope: !253)
!258 = !DILocation(line: 126, column: 50, scope: !253)
!259 = !DILocation(line: 126, column: 41, scope: !253)
!260 = !DILocation(line: 126, column: 61, scope: !253)
!261 = !DILocation(line: 126, column: 21, scope: !253)
!262 = !DILocation(line: 126, column: 68, scope: !253)
!263 = !DILocation(line: 126, column: 21, scope: !254)
!264 = !DILocation(line: 128, column: 21, scope: !265)
!265 = distinct !DILexicalBlock(scope: !253, file: !3, line: 127, column: 17)
!266 = !DILocation(line: 130, column: 21, scope: !265)
!267 = !DILocation(line: 130, column: 26, scope: !265)
!268 = !DILocation(line: 130, column: 35, scope: !265)
!269 = !DILocation(line: 131, column: 17, scope: !265)
!270 = !DILocation(line: 132, column: 24, scope: !254)
!271 = !DILocation(line: 132, column: 17, scope: !254)
!272 = !DILocation(line: 133, column: 13, scope: !254)
!273 = !DILocation(line: 134, column: 9, scope: !246)
!274 = !DILocation(line: 136, column: 20, scope: !226)
!275 = !DILocation(line: 137, column: 21, scope: !226)
!276 = !DILocation(line: 137, column: 27, scope: !226)
!277 = !DILocation(line: 137, column: 5, scope: !226)
!278 = !DILocation(line: 138, column: 1, scope: !226)
!279 = distinct !DISubprogram(name: "goodB2G2_vasink", scope: !3, file: !3, line: 141, type: !62, scopeLine: 142, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!280 = !DILocalVariable(name: "data", arg: 1, scope: !279, file: !3, line: 141, type: !55)
!281 = !DILocation(line: 141, column: 29, scope: !279)
!282 = !DILocation(line: 143, column: 8, scope: !283)
!283 = distinct !DILexicalBlock(scope: !279, file: !3, line: 143, column: 8)
!284 = !DILocation(line: 143, column: 8, scope: !279)
!285 = !DILocalVariable(name: "args", scope: !286, file: !3, line: 146, type: !72)
!286 = distinct !DILexicalBlock(scope: !287, file: !3, line: 145, column: 9)
!287 = distinct !DILexicalBlock(scope: !283, file: !3, line: 144, column: 5)
!288 = !DILocation(line: 146, column: 21, scope: !286)
!289 = !DILocation(line: 147, column: 13, scope: !286)
!290 = !DILocation(line: 149, column: 27, scope: !286)
!291 = !DILocation(line: 149, column: 13, scope: !286)
!292 = !DILocation(line: 150, column: 13, scope: !286)
!293 = !DILocation(line: 152, column: 5, scope: !287)
!294 = !DILocation(line: 153, column: 1, scope: !279)
!295 = distinct !DISubprogram(name: "goodB2G2", scope: !3, file: !3, line: 155, type: !95, scopeLine: 156, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!296 = !DILocalVariable(name: "data", scope: !295, file: !3, line: 157, type: !55)
!297 = !DILocation(line: 157, column: 12, scope: !295)
!298 = !DILocalVariable(name: "dataBuffer", scope: !295, file: !3, line: 158, type: !100)
!299 = !DILocation(line: 158, column: 10, scope: !295)
!300 = !DILocation(line: 159, column: 12, scope: !295)
!301 = !DILocation(line: 159, column: 10, scope: !295)
!302 = !DILocalVariable(name: "dataLen", scope: !303, file: !3, line: 162, type: !108)
!303 = distinct !DILexicalBlock(scope: !295, file: !3, line: 160, column: 5)
!304 = !DILocation(line: 162, column: 16, scope: !303)
!305 = !DILocation(line: 162, column: 33, scope: !303)
!306 = !DILocation(line: 162, column: 26, scope: !303)
!307 = !DILocalVariable(name: "pFile", scope: !303, file: !3, line: 163, type: !115)
!308 = !DILocation(line: 163, column: 16, scope: !303)
!309 = !DILocation(line: 165, column: 17, scope: !310)
!310 = distinct !DILexicalBlock(scope: !303, file: !3, line: 165, column: 13)
!311 = !DILocation(line: 165, column: 16, scope: !310)
!312 = !DILocation(line: 165, column: 25, scope: !310)
!313 = !DILocation(line: 165, column: 13, scope: !303)
!314 = !DILocation(line: 167, column: 21, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !3, line: 166, column: 9)
!316 = !DILocation(line: 167, column: 19, scope: !315)
!317 = !DILocation(line: 168, column: 17, scope: !318)
!318 = distinct !DILexicalBlock(scope: !315, file: !3, line: 168, column: 17)
!319 = !DILocation(line: 168, column: 23, scope: !318)
!320 = !DILocation(line: 168, column: 17, scope: !315)
!321 = !DILocation(line: 171, column: 27, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !3, line: 171, column: 21)
!323 = distinct !DILexicalBlock(scope: !318, file: !3, line: 169, column: 13)
!324 = !DILocation(line: 171, column: 32, scope: !322)
!325 = !DILocation(line: 171, column: 31, scope: !322)
!326 = !DILocation(line: 171, column: 51, scope: !322)
!327 = !DILocation(line: 171, column: 50, scope: !322)
!328 = !DILocation(line: 171, column: 41, scope: !322)
!329 = !DILocation(line: 171, column: 61, scope: !322)
!330 = !DILocation(line: 171, column: 21, scope: !322)
!331 = !DILocation(line: 171, column: 68, scope: !322)
!332 = !DILocation(line: 171, column: 21, scope: !323)
!333 = !DILocation(line: 173, column: 21, scope: !334)
!334 = distinct !DILexicalBlock(scope: !322, file: !3, line: 172, column: 17)
!335 = !DILocation(line: 175, column: 21, scope: !334)
!336 = !DILocation(line: 175, column: 26, scope: !334)
!337 = !DILocation(line: 175, column: 35, scope: !334)
!338 = !DILocation(line: 176, column: 17, scope: !334)
!339 = !DILocation(line: 177, column: 24, scope: !323)
!340 = !DILocation(line: 177, column: 17, scope: !323)
!341 = !DILocation(line: 178, column: 13, scope: !323)
!342 = !DILocation(line: 179, column: 9, scope: !315)
!343 = !DILocation(line: 181, column: 20, scope: !295)
!344 = !DILocation(line: 182, column: 21, scope: !295)
!345 = !DILocation(line: 182, column: 27, scope: !295)
!346 = !DILocation(line: 182, column: 5, scope: !295)
!347 = !DILocation(line: 183, column: 1, scope: !295)
!348 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !3, file: !3, line: 186, type: !62, scopeLine: 187, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!349 = !DILocalVariable(name: "data", arg: 1, scope: !348, file: !3, line: 186, type: !55)
!350 = !DILocation(line: 186, column: 27, scope: !348)
!351 = !DILocation(line: 188, column: 8, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !3, line: 188, column: 8)
!353 = !DILocation(line: 188, column: 8, scope: !348)
!354 = !DILocalVariable(name: "args", scope: !355, file: !3, line: 191, type: !72)
!355 = distinct !DILexicalBlock(scope: !356, file: !3, line: 190, column: 9)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 189, column: 5)
!357 = !DILocation(line: 191, column: 21, scope: !355)
!358 = !DILocation(line: 192, column: 13, scope: !355)
!359 = !DILocation(line: 194, column: 21, scope: !355)
!360 = !DILocation(line: 194, column: 27, scope: !355)
!361 = !DILocation(line: 194, column: 13, scope: !355)
!362 = !DILocation(line: 195, column: 13, scope: !355)
!363 = !DILocation(line: 197, column: 5, scope: !356)
!364 = !DILocation(line: 198, column: 1, scope: !348)
!365 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 200, type: !95, scopeLine: 201, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!366 = !DILocalVariable(name: "data", scope: !365, file: !3, line: 202, type: !55)
!367 = !DILocation(line: 202, column: 12, scope: !365)
!368 = !DILocalVariable(name: "dataBuffer", scope: !365, file: !3, line: 203, type: !100)
!369 = !DILocation(line: 203, column: 10, scope: !365)
!370 = !DILocation(line: 204, column: 12, scope: !365)
!371 = !DILocation(line: 204, column: 10, scope: !365)
!372 = !DILocation(line: 206, column: 12, scope: !365)
!373 = !DILocation(line: 206, column: 5, scope: !365)
!374 = !DILocation(line: 207, column: 19, scope: !365)
!375 = !DILocation(line: 208, column: 19, scope: !365)
!376 = !DILocation(line: 208, column: 25, scope: !365)
!377 = !DILocation(line: 208, column: 5, scope: !365)
!378 = !DILocation(line: 209, column: 1, scope: !365)
!379 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_21_good", scope: !3, file: !3, line: 211, type: !95, scopeLine: 212, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!380 = !DILocation(line: 213, column: 5, scope: !379)
!381 = !DILocation(line: 214, column: 5, scope: !379)
!382 = !DILocation(line: 215, column: 5, scope: !379)
!383 = !DILocation(line: 216, column: 1, scope: !379)
!384 = distinct !DISubprogram(name: "printLine", scope: !18, file: !18, line: 11, type: !385, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!385 = !DISubroutineType(types: !386)
!386 = !{null, !55}
!387 = !DILocalVariable(name: "line", arg: 1, scope: !384, file: !18, line: 11, type: !55)
!388 = !DILocation(line: 11, column: 25, scope: !384)
!389 = !DILocation(line: 13, column: 1, scope: !384)
!390 = !DILocation(line: 14, column: 8, scope: !391)
!391 = distinct !DILexicalBlock(scope: !384, file: !18, line: 14, column: 8)
!392 = !DILocation(line: 14, column: 13, scope: !391)
!393 = !DILocation(line: 14, column: 8, scope: !384)
!394 = !DILocation(line: 16, column: 24, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !18, line: 15, column: 5)
!396 = !DILocation(line: 16, column: 9, scope: !395)
!397 = !DILocation(line: 17, column: 5, scope: !395)
!398 = !DILocation(line: 18, column: 5, scope: !384)
!399 = !DILocation(line: 19, column: 1, scope: !384)
!400 = distinct !DISubprogram(name: "printSinkLine", scope: !18, file: !18, line: 20, type: !385, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!401 = !DILocalVariable(name: "line", arg: 1, scope: !400, file: !18, line: 20, type: !55)
!402 = !DILocation(line: 20, column: 29, scope: !400)
!403 = !DILocation(line: 22, column: 8, scope: !404)
!404 = distinct !DILexicalBlock(scope: !400, file: !18, line: 22, column: 8)
!405 = !DILocation(line: 22, column: 13, scope: !404)
!406 = !DILocation(line: 22, column: 8, scope: !400)
!407 = !DILocation(line: 24, column: 24, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !18, line: 23, column: 5)
!409 = !DILocation(line: 24, column: 9, scope: !408)
!410 = !DILocation(line: 25, column: 5, scope: !408)
!411 = !DILocation(line: 26, column: 1, scope: !400)
!412 = distinct !DISubprogram(name: "printWLine", scope: !18, file: !18, line: 27, type: !413, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!413 = !DISubroutineType(types: !414)
!414 = !{null, !415}
!415 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !416, size: 64)
!416 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !109, line: 74, baseType: !7)
!417 = !DILocalVariable(name: "line", arg: 1, scope: !412, file: !18, line: 27, type: !415)
!418 = !DILocation(line: 27, column: 29, scope: !412)
!419 = !DILocation(line: 29, column: 8, scope: !420)
!420 = distinct !DILexicalBlock(scope: !412, file: !18, line: 29, column: 8)
!421 = !DILocation(line: 29, column: 13, scope: !420)
!422 = !DILocation(line: 29, column: 8, scope: !412)
!423 = !DILocation(line: 31, column: 27, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !18, line: 30, column: 5)
!425 = !DILocation(line: 31, column: 9, scope: !424)
!426 = !DILocation(line: 32, column: 5, scope: !424)
!427 = !DILocation(line: 33, column: 1, scope: !412)
!428 = distinct !DISubprogram(name: "printIntLine", scope: !18, file: !18, line: 35, type: !429, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !7}
!431 = !DILocalVariable(name: "intNumber", arg: 1, scope: !428, file: !18, line: 35, type: !7)
!432 = !DILocation(line: 35, column: 24, scope: !428)
!433 = !DILocation(line: 37, column: 20, scope: !428)
!434 = !DILocation(line: 37, column: 5, scope: !428)
!435 = !DILocation(line: 38, column: 1, scope: !428)
!436 = distinct !DISubprogram(name: "printShortLine", scope: !18, file: !18, line: 40, type: !437, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!437 = !DISubroutineType(types: !438)
!438 = !{null, !439}
!439 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!440 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !436, file: !18, line: 40, type: !439)
!441 = !DILocation(line: 40, column: 28, scope: !436)
!442 = !DILocation(line: 42, column: 21, scope: !436)
!443 = !DILocation(line: 42, column: 5, scope: !436)
!444 = !DILocation(line: 43, column: 1, scope: !436)
!445 = distinct !DISubprogram(name: "printFloatLine", scope: !18, file: !18, line: 45, type: !446, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !448}
!448 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!449 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !445, file: !18, line: 45, type: !448)
!450 = !DILocation(line: 45, column: 28, scope: !445)
!451 = !DILocation(line: 47, column: 20, scope: !445)
!452 = !DILocation(line: 47, column: 5, scope: !445)
!453 = !DILocation(line: 48, column: 1, scope: !445)
!454 = distinct !DISubprogram(name: "printLongLine", scope: !18, file: !18, line: 50, type: !455, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !143}
!457 = !DILocalVariable(name: "longNumber", arg: 1, scope: !454, file: !18, line: 50, type: !143)
!458 = !DILocation(line: 50, column: 26, scope: !454)
!459 = !DILocation(line: 52, column: 21, scope: !454)
!460 = !DILocation(line: 52, column: 5, scope: !454)
!461 = !DILocation(line: 53, column: 1, scope: !454)
!462 = distinct !DISubprogram(name: "printLongLongLine", scope: !18, file: !18, line: 55, type: !463, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !465}
!465 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !466, line: 27, baseType: !467)
!466 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!467 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !142, line: 44, baseType: !143)
!468 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !462, file: !18, line: 55, type: !465)
!469 = !DILocation(line: 55, column: 33, scope: !462)
!470 = !DILocation(line: 57, column: 29, scope: !462)
!471 = !DILocation(line: 57, column: 5, scope: !462)
!472 = !DILocation(line: 58, column: 1, scope: !462)
!473 = distinct !DISubprogram(name: "printSizeTLine", scope: !18, file: !18, line: 60, type: !474, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !108}
!476 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !473, file: !18, line: 60, type: !108)
!477 = !DILocation(line: 60, column: 29, scope: !473)
!478 = !DILocation(line: 62, column: 21, scope: !473)
!479 = !DILocation(line: 62, column: 5, scope: !473)
!480 = !DILocation(line: 63, column: 1, scope: !473)
!481 = distinct !DISubprogram(name: "printHexCharLine", scope: !18, file: !18, line: 65, type: !482, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !56}
!484 = !DILocalVariable(name: "charHex", arg: 1, scope: !481, file: !18, line: 65, type: !56)
!485 = !DILocation(line: 65, column: 29, scope: !481)
!486 = !DILocation(line: 67, column: 22, scope: !481)
!487 = !DILocation(line: 67, column: 5, scope: !481)
!488 = !DILocation(line: 68, column: 1, scope: !481)
!489 = distinct !DISubprogram(name: "printWcharLine", scope: !18, file: !18, line: 70, type: !490, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !416}
!492 = !DILocalVariable(name: "wideChar", arg: 1, scope: !489, file: !18, line: 70, type: !416)
!493 = !DILocation(line: 70, column: 29, scope: !489)
!494 = !DILocalVariable(name: "s", scope: !489, file: !18, line: 74, type: !495)
!495 = !DICompositeType(tag: DW_TAG_array_type, baseType: !416, size: 64, elements: !496)
!496 = !{!497}
!497 = !DISubrange(count: 2)
!498 = !DILocation(line: 74, column: 13, scope: !489)
!499 = !DILocation(line: 75, column: 16, scope: !489)
!500 = !DILocation(line: 75, column: 9, scope: !489)
!501 = !DILocation(line: 75, column: 14, scope: !489)
!502 = !DILocation(line: 76, column: 9, scope: !489)
!503 = !DILocation(line: 76, column: 14, scope: !489)
!504 = !DILocation(line: 77, column: 21, scope: !489)
!505 = !DILocation(line: 77, column: 5, scope: !489)
!506 = !DILocation(line: 78, column: 1, scope: !489)
!507 = distinct !DISubprogram(name: "printUnsignedLine", scope: !18, file: !18, line: 80, type: !508, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!508 = !DISubroutineType(types: !509)
!509 = !{null, !22}
!510 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !507, file: !18, line: 80, type: !22)
!511 = !DILocation(line: 80, column: 33, scope: !507)
!512 = !DILocation(line: 82, column: 20, scope: !507)
!513 = !DILocation(line: 82, column: 5, scope: !507)
!514 = !DILocation(line: 83, column: 1, scope: !507)
!515 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !18, file: !18, line: 85, type: !516, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!516 = !DISubroutineType(types: !517)
!517 = !{null, !38}
!518 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !515, file: !18, line: 85, type: !38)
!519 = !DILocation(line: 85, column: 45, scope: !515)
!520 = !DILocation(line: 87, column: 22, scope: !515)
!521 = !DILocation(line: 87, column: 5, scope: !515)
!522 = !DILocation(line: 88, column: 1, scope: !515)
!523 = distinct !DISubprogram(name: "printDoubleLine", scope: !18, file: !18, line: 90, type: !524, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526}
!526 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!527 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !523, file: !18, line: 90, type: !526)
!528 = !DILocation(line: 90, column: 29, scope: !523)
!529 = !DILocation(line: 92, column: 20, scope: !523)
!530 = !DILocation(line: 92, column: 5, scope: !523)
!531 = !DILocation(line: 93, column: 1, scope: !523)
!532 = distinct !DISubprogram(name: "printStructLine", scope: !18, file: !18, line: 95, type: !533, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!533 = !DISubroutineType(types: !534)
!534 = !{null, !535}
!535 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !536, size: 64)
!536 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !537, line: 100, baseType: !538)
!537 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_172/source_code")
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !537, line: 96, size: 64, elements: !539)
!539 = !{!540, !541}
!540 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !538, file: !537, line: 98, baseType: !7, size: 32)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !538, file: !537, line: 99, baseType: !7, size: 32, offset: 32)
!542 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !532, file: !18, line: 95, type: !535)
!543 = !DILocation(line: 95, column: 40, scope: !532)
!544 = !DILocation(line: 97, column: 26, scope: !532)
!545 = !DILocation(line: 97, column: 47, scope: !532)
!546 = !DILocation(line: 97, column: 55, scope: !532)
!547 = !DILocation(line: 97, column: 76, scope: !532)
!548 = !DILocation(line: 97, column: 5, scope: !532)
!549 = !DILocation(line: 98, column: 1, scope: !532)
!550 = distinct !DISubprogram(name: "printBytesLine", scope: !18, file: !18, line: 100, type: !551, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!551 = !DISubroutineType(types: !552)
!552 = !{null, !553, !108}
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!554 = !DILocalVariable(name: "bytes", arg: 1, scope: !550, file: !18, line: 100, type: !553)
!555 = !DILocation(line: 100, column: 38, scope: !550)
!556 = !DILocalVariable(name: "numBytes", arg: 2, scope: !550, file: !18, line: 100, type: !108)
!557 = !DILocation(line: 100, column: 52, scope: !550)
!558 = !DILocalVariable(name: "i", scope: !550, file: !18, line: 102, type: !108)
!559 = !DILocation(line: 102, column: 12, scope: !550)
!560 = !DILocation(line: 103, column: 12, scope: !561)
!561 = distinct !DILexicalBlock(scope: !550, file: !18, line: 103, column: 5)
!562 = !DILocation(line: 103, column: 10, scope: !561)
!563 = !DILocation(line: 103, column: 17, scope: !564)
!564 = distinct !DILexicalBlock(scope: !561, file: !18, line: 103, column: 5)
!565 = !DILocation(line: 103, column: 21, scope: !564)
!566 = !DILocation(line: 103, column: 19, scope: !564)
!567 = !DILocation(line: 103, column: 5, scope: !561)
!568 = !DILocation(line: 105, column: 24, scope: !569)
!569 = distinct !DILexicalBlock(scope: !564, file: !18, line: 104, column: 5)
!570 = !DILocation(line: 105, column: 30, scope: !569)
!571 = !DILocation(line: 105, column: 9, scope: !569)
!572 = !DILocation(line: 106, column: 5, scope: !569)
!573 = !DILocation(line: 103, column: 31, scope: !564)
!574 = !DILocation(line: 103, column: 5, scope: !564)
!575 = distinct !{!575, !567, !576, !577}
!576 = !DILocation(line: 106, column: 5, scope: !561)
!577 = !{!"llvm.loop.mustprogress"}
!578 = !DILocation(line: 107, column: 5, scope: !550)
!579 = !DILocation(line: 108, column: 1, scope: !550)
!580 = distinct !DISubprogram(name: "decodeHexChars", scope: !18, file: !18, line: 113, type: !581, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!581 = !DISubroutineType(types: !582)
!582 = !{!108, !553, !108, !55}
!583 = !DILocalVariable(name: "bytes", arg: 1, scope: !580, file: !18, line: 113, type: !553)
!584 = !DILocation(line: 113, column: 39, scope: !580)
!585 = !DILocalVariable(name: "numBytes", arg: 2, scope: !580, file: !18, line: 113, type: !108)
!586 = !DILocation(line: 113, column: 53, scope: !580)
!587 = !DILocalVariable(name: "hex", arg: 3, scope: !580, file: !18, line: 113, type: !55)
!588 = !DILocation(line: 113, column: 71, scope: !580)
!589 = !DILocalVariable(name: "numWritten", scope: !580, file: !18, line: 115, type: !108)
!590 = !DILocation(line: 115, column: 12, scope: !580)
!591 = !DILocation(line: 121, column: 5, scope: !580)
!592 = !DILocation(line: 121, column: 12, scope: !580)
!593 = !DILocation(line: 121, column: 25, scope: !580)
!594 = !DILocation(line: 121, column: 23, scope: !580)
!595 = !DILocation(line: 121, column: 34, scope: !580)
!596 = !DILocation(line: 121, column: 37, scope: !580)
!597 = !DILocation(line: 121, column: 67, scope: !580)
!598 = !DILocation(line: 121, column: 70, scope: !580)
!599 = !DILocation(line: 0, scope: !580)
!600 = !DILocalVariable(name: "byte", scope: !601, file: !18, line: 123, type: !7)
!601 = distinct !DILexicalBlock(scope: !580, file: !18, line: 122, column: 5)
