; ModuleID = 'CWE134_Uncontrolled_Format_String__char_file_vprintf_21.c'
source_filename = "CWE134_Uncontrolled_Format_String__char_file_vprintf_21.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@badStatic = dso_local global i32 0, align 4, !dbg !0
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@goodB2G1Static = dso_local global i32 0, align 4, !dbg !9
@goodB2G2Static = dso_local global i32 0, align 4, !dbg !11
@goodG2BStatic = dso_local global i32 0, align 4, !dbg !13
@.str.3 = private unnamed_addr constant [21 x i8] c"Benign, fixed string\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@.str.5 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1

; Function Attrs: noinline nounwind optnone uwtable

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "badStatic", scope: !2, file: !3, line: 35, type: !7, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !8, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_21.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_172/source_code")
!4 = !{}
!5 = !{!6, !7}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!8 = !{!0, !9, !11, !13}
!9 = !DIGlobalVariableExpression(var: !10, expr: !DIExpression())
!10 = distinct !DIGlobalVariable(name: "goodB2G1Static", scope: !2, file: !3, line: 86, type: !7, isLocal: false, isDefinition: true)
!11 = !DIGlobalVariableExpression(var: !12, expr: !DIExpression())
!12 = distinct !DIGlobalVariable(name: "goodB2G2Static", scope: !2, file: !3, line: 87, type: !7, isLocal: false, isDefinition: true)
!13 = !DIGlobalVariableExpression(var: !14, expr: !DIExpression())
!14 = distinct !DIGlobalVariable(name: "goodG2BStatic", scope: !2, file: !3, line: 88, type: !7, isLocal: false, isDefinition: true)
!15 = !{i32 7, !"Dwarf Version", i32 4}
!16 = !{i32 2, !"Debug Info Version", i32 3}
!17 = !{i32 1, !"wchar_size", i32 4}
!18 = !{!"clang version 12.0.0"}
!19 = distinct !DISubprogram(name: "badVaSink", scope: !3, file: !3, line: 37, type: !20, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !22, null}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !23, size: 64)
!23 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!24 = !DILocalVariable(name: "data", arg: 1, scope: !19, file: !3, line: 37, type: !22)
!25 = !DILocation(line: 37, column: 23, scope: !19)
!26 = !DILocation(line: 39, column: 8, scope: !27)
!27 = distinct !DILexicalBlock(scope: !19, file: !3, line: 39, column: 8)
!28 = !DILocation(line: 39, column: 8, scope: !19)
!29 = !DILocalVariable(name: "args", scope: !30, file: !3, line: 42, type: !32)
!30 = distinct !DILexicalBlock(scope: !31, file: !3, line: 41, column: 9)
!31 = distinct !DILexicalBlock(scope: !27, file: !3, line: 40, column: 5)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !33, line: 52, baseType: !34)
!33 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !35, line: 32, baseType: !36)
!35 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !3, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_array_type, baseType: !38, size: 192, elements: !45)
!38 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !39)
!39 = !{!40, !42, !43, !44}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !38, file: !3, line: 42, baseType: !41, size: 32)
!41 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !38, file: !3, line: 42, baseType: !41, size: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !38, file: !3, line: 42, baseType: !6, size: 64, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !38, file: !3, line: 42, baseType: !6, size: 64, offset: 128)
!45 = !{!46}
!46 = !DISubrange(count: 1)
!47 = !DILocation(line: 42, column: 21, scope: !30)
!48 = !DILocation(line: 43, column: 13, scope: !30)
!49 = !DILocation(line: 45, column: 21, scope: !30)
!50 = !DILocation(line: 45, column: 27, scope: !30)
!51 = !DILocation(line: 45, column: 13, scope: !30)
!52 = !DILocation(line: 46, column: 13, scope: !30)
!53 = !DILocation(line: 48, column: 5, scope: !31)
!54 = !DILocation(line: 49, column: 1, scope: !19)
!55 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_21_bad", scope: !3, file: !3, line: 51, type: !56, scopeLine: 52, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!56 = !DISubroutineType(types: !57)
!57 = !{null}
!58 = !DILocalVariable(name: "data", scope: !55, file: !3, line: 53, type: !22)
!59 = !DILocation(line: 53, column: 12, scope: !55)
!60 = !DILocalVariable(name: "dataBuffer", scope: !55, file: !3, line: 54, type: !61)
!61 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 800, elements: !62)
!62 = !{!63}
!63 = !DISubrange(count: 100)
!64 = !DILocation(line: 54, column: 10, scope: !55)
!65 = !DILocation(line: 55, column: 12, scope: !55)
!66 = !DILocation(line: 55, column: 10, scope: !55)
!67 = !DILocalVariable(name: "dataLen", scope: !68, file: !3, line: 58, type: !69)
!68 = distinct !DILexicalBlock(scope: !55, file: !3, line: 56, column: 5)
!69 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !70, line: 46, baseType: !71)
!70 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!71 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!72 = !DILocation(line: 58, column: 16, scope: !68)
!73 = !DILocation(line: 58, column: 33, scope: !68)
!74 = !DILocation(line: 58, column: 26, scope: !68)
!75 = !DILocalVariable(name: "pFile", scope: !68, file: !3, line: 59, type: !76)
!76 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !77, size: 64)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !78, line: 7, baseType: !79)
!78 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !80, line: 49, size: 1728, elements: !81)
!80 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!81 = !{!82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !97, !99, !100, !101, !105, !107, !109, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !79, file: !80, line: 51, baseType: !7, size: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !79, file: !80, line: 54, baseType: !22, size: 64, offset: 64)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !79, file: !80, line: 55, baseType: !22, size: 64, offset: 128)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !79, file: !80, line: 56, baseType: !22, size: 64, offset: 192)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !79, file: !80, line: 57, baseType: !22, size: 64, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !79, file: !80, line: 58, baseType: !22, size: 64, offset: 320)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !79, file: !80, line: 59, baseType: !22, size: 64, offset: 384)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !79, file: !80, line: 60, baseType: !22, size: 64, offset: 448)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !79, file: !80, line: 61, baseType: !22, size: 64, offset: 512)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !79, file: !80, line: 64, baseType: !22, size: 64, offset: 576)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !79, file: !80, line: 65, baseType: !22, size: 64, offset: 640)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !79, file: !80, line: 66, baseType: !22, size: 64, offset: 704)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !79, file: !80, line: 68, baseType: !95, size: 64, offset: 768)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !96, size: 64)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !80, line: 36, flags: DIFlagFwdDecl)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !79, file: !80, line: 70, baseType: !98, size: 64, offset: 832)
!98 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !79, size: 64)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !79, file: !80, line: 72, baseType: !7, size: 32, offset: 896)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !79, file: !80, line: 73, baseType: !7, size: 32, offset: 928)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !79, file: !80, line: 74, baseType: !102, size: 64, offset: 960)
!102 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !103, line: 152, baseType: !104)
!103 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!104 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !79, file: !80, line: 77, baseType: !106, size: 16, offset: 1024)
!106 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !79, file: !80, line: 78, baseType: !108, size: 8, offset: 1040)
!108 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !79, file: !80, line: 79, baseType: !110, size: 8, offset: 1048)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 8, elements: !45)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !79, file: !80, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !80, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !79, file: !80, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !103, line: 153, baseType: !104)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !79, file: !80, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !80, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !79, file: !80, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !80, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !79, file: !80, line: 93, baseType: !98, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !79, file: !80, line: 94, baseType: !6, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !79, file: !80, line: 95, baseType: !69, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !79, file: !80, line: 96, baseType: !7, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !79, file: !80, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 59, column: 16, scope: !68)
!131 = !DILocation(line: 61, column: 17, scope: !132)
!132 = distinct !DILexicalBlock(scope: !68, file: !3, line: 61, column: 13)
!133 = !DILocation(line: 61, column: 16, scope: !132)
!134 = !DILocation(line: 61, column: 25, scope: !132)
!135 = !DILocation(line: 61, column: 13, scope: !68)
!136 = !DILocation(line: 63, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !3, line: 62, column: 9)
!138 = !DILocation(line: 63, column: 19, scope: !137)
!139 = !DILocation(line: 64, column: 17, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !3, line: 64, column: 17)
!141 = !DILocation(line: 64, column: 23, scope: !140)
!142 = !DILocation(line: 64, column: 17, scope: !137)
!143 = !DILocation(line: 67, column: 27, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !3, line: 67, column: 21)
!145 = distinct !DILexicalBlock(scope: !140, file: !3, line: 65, column: 13)
!146 = !DILocation(line: 67, column: 32, scope: !144)
!147 = !DILocation(line: 67, column: 31, scope: !144)
!148 = !DILocation(line: 67, column: 51, scope: !144)
!149 = !DILocation(line: 67, column: 50, scope: !144)
!150 = !DILocation(line: 67, column: 41, scope: !144)
!151 = !DILocation(line: 67, column: 61, scope: !144)
!152 = !DILocation(line: 67, column: 21, scope: !144)
!153 = !DILocation(line: 67, column: 68, scope: !144)
!154 = !DILocation(line: 67, column: 21, scope: !145)
!155 = !DILocation(line: 69, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !3, line: 68, column: 17)
!157 = !DILocation(line: 71, column: 21, scope: !156)
!158 = !DILocation(line: 71, column: 26, scope: !156)
!159 = !DILocation(line: 71, column: 35, scope: !156)
!160 = !DILocation(line: 72, column: 17, scope: !156)
!161 = !DILocation(line: 73, column: 24, scope: !145)
!162 = !DILocation(line: 73, column: 17, scope: !145)
!163 = !DILocation(line: 74, column: 13, scope: !145)
!164 = !DILocation(line: 75, column: 9, scope: !137)
!165 = !DILocation(line: 77, column: 15, scope: !55)
!166 = !DILocation(line: 78, column: 15, scope: !55)
!167 = !DILocation(line: 78, column: 21, scope: !55)
!168 = !DILocation(line: 78, column: 5, scope: !55)
!169 = !DILocation(line: 79, column: 1, scope: !55)
!170 = distinct !DISubprogram(name: "goodB2G1_vasink", scope: !3, file: !3, line: 91, type: !20, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!171 = !DILocalVariable(name: "data", arg: 1, scope: !170, file: !3, line: 91, type: !22)
!172 = !DILocation(line: 91, column: 29, scope: !170)
!173 = !DILocation(line: 93, column: 8, scope: !174)
!174 = distinct !DILexicalBlock(scope: !170, file: !3, line: 93, column: 8)
!175 = !DILocation(line: 93, column: 8, scope: !170)
!176 = !DILocation(line: 96, column: 9, scope: !177)
!177 = distinct !DILexicalBlock(scope: !174, file: !3, line: 94, column: 5)
!178 = !DILocation(line: 97, column: 5, scope: !177)
!179 = !DILocalVariable(name: "args", scope: !180, file: !3, line: 101, type: !32)
!180 = distinct !DILexicalBlock(scope: !181, file: !3, line: 100, column: 9)
!181 = distinct !DILexicalBlock(scope: !174, file: !3, line: 99, column: 5)
!182 = !DILocation(line: 101, column: 21, scope: !180)
!183 = !DILocation(line: 102, column: 13, scope: !180)
!184 = !DILocation(line: 104, column: 27, scope: !180)
!185 = !DILocation(line: 104, column: 13, scope: !180)
!186 = !DILocation(line: 105, column: 13, scope: !180)
!187 = !DILocation(line: 108, column: 1, scope: !170)
!188 = distinct !DISubprogram(name: "goodB2G1", scope: !3, file: !3, line: 110, type: !56, scopeLine: 111, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
