; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_03.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_076/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_03_bad", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 37, type: !42)
!56 = !DILocation(line: 37, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 38, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 38, column: 10, scope: !52)
!62 = !DILocation(line: 39, column: 12, scope: !52)
!63 = !DILocation(line: 39, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 44, type: !68)
!65 = distinct !DILexicalBlock(scope: !66, file: !45, line: 42, column: 9)
!66 = distinct !DILexicalBlock(scope: !67, file: !45, line: 41, column: 5)
!67 = distinct !DILexicalBlock(scope: !52, file: !45, line: 40, column: 8)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 44, column: 20, scope: !65)
!72 = !DILocation(line: 44, column: 37, scope: !65)
!73 = !DILocation(line: 44, column: 30, scope: !65)
!74 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 45, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !23, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !42, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !42, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !42, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !42, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !42, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !42, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !42, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !42, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !42, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !42, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !23, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !23, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !24, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !22, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !23, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 45, column: 20, scope: !65)
!131 = !DILocation(line: 47, column: 21, scope: !132)
!132 = distinct !DILexicalBlock(scope: !65, file: !45, line: 47, column: 17)
!133 = !DILocation(line: 47, column: 20, scope: !132)
!134 = !DILocation(line: 47, column: 29, scope: !132)
!135 = !DILocation(line: 47, column: 17, scope: !65)
!136 = !DILocation(line: 49, column: 25, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !45, line: 48, column: 13)
!138 = !DILocation(line: 49, column: 23, scope: !137)
!139 = !DILocation(line: 50, column: 21, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !45, line: 50, column: 21)
!141 = !DILocation(line: 50, column: 27, scope: !140)
!142 = !DILocation(line: 50, column: 21, scope: !137)
!143 = !DILocation(line: 53, column: 31, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !45, line: 53, column: 25)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 51, column: 17)
!146 = !DILocation(line: 53, column: 36, scope: !144)
!147 = !DILocation(line: 53, column: 35, scope: !144)
!148 = !DILocation(line: 53, column: 55, scope: !144)
!149 = !DILocation(line: 53, column: 54, scope: !144)
!150 = !DILocation(line: 53, column: 45, scope: !144)
!151 = !DILocation(line: 53, column: 65, scope: !144)
!152 = !DILocation(line: 53, column: 25, scope: !144)
!153 = !DILocation(line: 53, column: 72, scope: !144)
!154 = !DILocation(line: 53, column: 25, scope: !145)
!155 = !DILocation(line: 55, column: 25, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !45, line: 54, column: 21)
!157 = !DILocation(line: 57, column: 25, scope: !156)
!158 = !DILocation(line: 57, column: 30, scope: !156)
!159 = !DILocation(line: 57, column: 39, scope: !156)
!160 = !DILocation(line: 58, column: 21, scope: !156)
!161 = !DILocation(line: 59, column: 28, scope: !145)
!162 = !DILocation(line: 59, column: 21, scope: !145)
!163 = !DILocation(line: 60, column: 17, scope: !145)
!164 = !DILocation(line: 61, column: 13, scope: !137)
!165 = !DILocalVariable(name: "i", scope: !166, file: !45, line: 67, type: !23)
!166 = distinct !DILexicalBlock(scope: !167, file: !45, line: 66, column: 9)
!167 = distinct !DILexicalBlock(scope: !168, file: !45, line: 65, column: 5)
!168 = distinct !DILexicalBlock(scope: !52, file: !45, line: 64, column: 8)
!169 = !DILocation(line: 67, column: 17, scope: !166)
!170 = !DILocalVariable(name: "n", scope: !166, file: !45, line: 67, type: !23)
!171 = !DILocation(line: 67, column: 20, scope: !166)
!172 = !DILocalVariable(name: "intVariable", scope: !166, file: !45, line: 67, type: !23)
!173 = !DILocation(line: 67, column: 23, scope: !166)
!174 = !DILocation(line: 68, column: 24, scope: !175)
!175 = distinct !DILexicalBlock(scope: !166, file: !45, line: 68, column: 17)
!176 = !DILocation(line: 68, column: 17, scope: !175)
!177 = !DILocation(line: 68, column: 40, scope: !175)
!178 = !DILocation(line: 68, column: 17, scope: !166)
!179 = !DILocation(line: 71, column: 29, scope: !180)
!180 = distinct !DILexicalBlock(scope: !175, file: !45, line: 69, column: 13)
!181 = !DILocation(line: 72, column: 24, scope: !182)
!182 = distinct !DILexicalBlock(scope: !180, file: !45, line: 72, column: 17)
!183 = !DILocation(line: 72, column: 22, scope: !182)
!184 = !DILocation(line: 72, column: 29, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !45, line: 72, column: 17)
!186 = !DILocation(line: 72, column: 33, scope: !185)
!187 = !DILocation(line: 72, column: 31, scope: !185)
!188 = !DILocation(line: 72, column: 17, scope: !182)
!189 = !DILocation(line: 75, column: 32, scope: !190)
!190 = distinct !DILexicalBlock(scope: !185, file: !45, line: 73, column: 17)
!191 = !DILocation(line: 76, column: 17, scope: !190)
!192 = !DILocation(line: 72, column: 37, scope: !185)
!193 = !DILocation(line: 72, column: 17, scope: !185)
!194 = distinct !{!194, !188, !195, !196}
!195 = !DILocation(line: 76, column: 17, scope: !182)
!196 = !{!"llvm.loop.mustprogress"}
!197 = !DILocation(line: 77, column: 30, scope: !180)
!198 = !DILocation(line: 77, column: 17, scope: !180)
!199 = !DILocation(line: 78, column: 13, scope: !180)
!200 = !DILocation(line: 81, column: 1, scope: !52)
!201 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 88, type: !53, scopeLine: 89, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!202 = !DILocalVariable(name: "data", scope: !201, file: !45, line: 90, type: !42)
!203 = !DILocation(line: 90, column: 12, scope: !201)
!204 = !DILocalVariable(name: "dataBuffer", scope: !201, file: !45, line: 91, type: !58)
!205 = !DILocation(line: 91, column: 10, scope: !201)
!206 = !DILocation(line: 92, column: 12, scope: !201)
!207 = !DILocation(line: 92, column: 10, scope: !201)
!208 = !DILocalVariable(name: "dataLen", scope: !209, file: !45, line: 97, type: !68)
!209 = distinct !DILexicalBlock(scope: !210, file: !45, line: 95, column: 9)
!210 = distinct !DILexicalBlock(scope: !211, file: !45, line: 94, column: 5)
!211 = distinct !DILexicalBlock(scope: !201, file: !45, line: 93, column: 8)
!212 = !DILocation(line: 97, column: 20, scope: !209)
!213 = !DILocation(line: 97, column: 37, scope: !209)
!214 = !DILocation(line: 97, column: 30, scope: !209)
!215 = !DILocalVariable(name: "pFile", scope: !209, file: !45, line: 98, type: !75)
!216 = !DILocation(line: 98, column: 20, scope: !209)
!217 = !DILocation(line: 100, column: 21, scope: !218)
!218 = distinct !DILexicalBlock(scope: !209, file: !45, line: 100, column: 17)
!219 = !DILocation(line: 100, column: 20, scope: !218)
!220 = !DILocation(line: 100, column: 29, scope: !218)
!221 = !DILocation(line: 100, column: 17, scope: !209)
!222 = !DILocation(line: 102, column: 25, scope: !223)
!223 = distinct !DILexicalBlock(scope: !218, file: !45, line: 101, column: 13)
!224 = !DILocation(line: 102, column: 23, scope: !223)
!225 = !DILocation(line: 103, column: 21, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !45, line: 103, column: 21)
!227 = !DILocation(line: 103, column: 27, scope: !226)
!228 = !DILocation(line: 103, column: 21, scope: !223)
!229 = !DILocation(line: 106, column: 31, scope: !230)
!230 = distinct !DILexicalBlock(scope: !231, file: !45, line: 106, column: 25)
!231 = distinct !DILexicalBlock(scope: !226, file: !45, line: 104, column: 17)
!232 = !DILocation(line: 106, column: 36, scope: !230)
!233 = !DILocation(line: 106, column: 35, scope: !230)
!234 = !DILocation(line: 106, column: 55, scope: !230)
!235 = !DILocation(line: 106, column: 54, scope: !230)
!236 = !DILocation(line: 106, column: 45, scope: !230)
!237 = !DILocation(line: 106, column: 65, scope: !230)
!238 = !DILocation(line: 106, column: 25, scope: !230)
!239 = !DILocation(line: 106, column: 72, scope: !230)
!240 = !DILocation(line: 106, column: 25, scope: !231)
!241 = !DILocation(line: 108, column: 25, scope: !242)
!242 = distinct !DILexicalBlock(scope: !230, file: !45, line: 107, column: 21)
!243 = !DILocation(line: 110, column: 25, scope: !242)
!244 = !DILocation(line: 110, column: 30, scope: !242)
!245 = !DILocation(line: 110, column: 39, scope: !242)
!246 = !DILocation(line: 111, column: 21, scope: !242)
!247 = !DILocation(line: 112, column: 28, scope: !231)
!248 = !DILocation(line: 112, column: 21, scope: !231)
!249 = !DILocation(line: 113, column: 17, scope: !231)
!250 = !DILocation(line: 114, column: 13, scope: !223)
!251 = !DILocalVariable(name: "i", scope: !252, file: !45, line: 125, type: !23)
!252 = distinct !DILexicalBlock(scope: !253, file: !45, line: 124, column: 9)
!253 = distinct !DILexicalBlock(scope: !254, file: !45, line: 123, column: 5)
!254 = distinct !DILexicalBlock(scope: !201, file: !45, line: 117, column: 8)
!255 = !DILocation(line: 125, column: 17, scope: !252)
!256 = !DILocalVariable(name: "n", scope: !252, file: !45, line: 125, type: !23)
!257 = !DILocation(line: 125, column: 20, scope: !252)
!258 = !DILocalVariable(name: "intVariable", scope: !252, file: !45, line: 125, type: !23)
!259 = !DILocation(line: 125, column: 23, scope: !252)
!260 = !DILocation(line: 126, column: 24, scope: !261)
!261 = distinct !DILexicalBlock(scope: !252, file: !45, line: 126, column: 17)
!262 = !DILocation(line: 126, column: 17, scope: !261)
!263 = !DILocation(line: 126, column: 40, scope: !261)
!264 = !DILocation(line: 126, column: 17, scope: !252)
!265 = !DILocation(line: 129, column: 21, scope: !266)
!266 = distinct !DILexicalBlock(scope: !267, file: !45, line: 129, column: 21)
!267 = distinct !DILexicalBlock(scope: !261, file: !45, line: 127, column: 13)
!268 = !DILocation(line: 129, column: 23, scope: !266)
!269 = !DILocation(line: 129, column: 21, scope: !267)
!270 = !DILocation(line: 131, column: 33, scope: !271)
!271 = distinct !DILexicalBlock(scope: !266, file: !45, line: 130, column: 17)
!272 = !DILocation(line: 132, column: 28, scope: !273)
!273 = distinct !DILexicalBlock(scope: !271, file: !45, line: 132, column: 21)
!274 = !DILocation(line: 132, column: 26, scope: !273)
!275 = !DILocation(line: 132, column: 33, scope: !276)
!276 = distinct !DILexicalBlock(scope: !273, file: !45, line: 132, column: 21)
!277 = !DILocation(line: 132, column: 37, scope: !276)
!278 = !DILocation(line: 132, column: 35, scope: !276)
!279 = !DILocation(line: 132, column: 21, scope: !273)
!280 = !DILocation(line: 135, column: 36, scope: !281)
!281 = distinct !DILexicalBlock(scope: !276, file: !45, line: 133, column: 21)
!282 = !DILocation(line: 136, column: 21, scope: !281)
!283 = !DILocation(line: 132, column: 41, scope: !276)
!284 = !DILocation(line: 132, column: 21, scope: !276)
!285 = distinct !{!285, !279, !286, !196}
!286 = !DILocation(line: 136, column: 21, scope: !273)
!287 = !DILocation(line: 137, column: 34, scope: !271)
!288 = !DILocation(line: 137, column: 21, scope: !271)
!289 = !DILocation(line: 138, column: 17, scope: !271)
!290 = !DILocation(line: 139, column: 13, scope: !267)
!291 = !DILocation(line: 142, column: 1, scope: !201)
!292 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 145, type: !53, scopeLine: 146, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!293 = !DILocalVariable(name: "data", scope: !292, file: !45, line: 147, type: !42)
!294 = !DILocation(line: 147, column: 12, scope: !292)
!295 = !DILocalVariable(name: "dataBuffer", scope: !292, file: !45, line: 148, type: !58)
!296 = !DILocation(line: 148, column: 10, scope: !292)
!297 = !DILocation(line: 149, column: 12, scope: !292)
!298 = !DILocation(line: 149, column: 10, scope: !292)
!299 = !DILocalVariable(name: "dataLen", scope: !300, file: !45, line: 154, type: !68)
!300 = distinct !DILexicalBlock(scope: !301, file: !45, line: 152, column: 9)
!301 = distinct !DILexicalBlock(scope: !302, file: !45, line: 151, column: 5)
!302 = distinct !DILexicalBlock(scope: !292, file: !45, line: 150, column: 8)
!303 = !DILocation(line: 154, column: 20, scope: !300)
!304 = !DILocation(line: 154, column: 37, scope: !300)
!305 = !DILocation(line: 154, column: 30, scope: !300)
!306 = !DILocalVariable(name: "pFile", scope: !300, file: !45, line: 155, type: !75)
!307 = !DILocation(line: 155, column: 20, scope: !300)
!308 = !DILocation(line: 157, column: 21, scope: !309)
!309 = distinct !DILexicalBlock(scope: !300, file: !45, line: 157, column: 17)
!310 = !DILocation(line: 157, column: 20, scope: !309)
!311 = !DILocation(line: 157, column: 29, scope: !309)
!312 = !DILocation(line: 157, column: 17, scope: !300)
!313 = !DILocation(line: 159, column: 25, scope: !314)
!314 = distinct !DILexicalBlock(scope: !309, file: !45, line: 158, column: 13)
!315 = !DILocation(line: 159, column: 23, scope: !314)
!316 = !DILocation(line: 160, column: 21, scope: !317)
!317 = distinct !DILexicalBlock(scope: !314, file: !45, line: 160, column: 21)
!318 = !DILocation(line: 160, column: 27, scope: !317)
!319 = !DILocation(line: 160, column: 21, scope: !314)
!320 = !DILocation(line: 163, column: 31, scope: !321)
!321 = distinct !DILexicalBlock(scope: !322, file: !45, line: 163, column: 25)
!322 = distinct !DILexicalBlock(scope: !317, file: !45, line: 161, column: 17)
!323 = !DILocation(line: 163, column: 36, scope: !321)
!324 = !DILocation(line: 163, column: 35, scope: !321)
!325 = !DILocation(line: 163, column: 55, scope: !321)
!326 = !DILocation(line: 163, column: 54, scope: !321)
!327 = !DILocation(line: 163, column: 45, scope: !321)
!328 = !DILocation(line: 163, column: 65, scope: !321)
!329 = !DILocation(line: 163, column: 25, scope: !321)
!330 = !DILocation(line: 163, column: 72, scope: !321)
!331 = !DILocation(line: 163, column: 25, scope: !322)
!332 = !DILocation(line: 165, column: 25, scope: !333)
!333 = distinct !DILexicalBlock(scope: !321, file: !45, line: 164, column: 21)
!334 = !DILocation(line: 167, column: 25, scope: !333)
!335 = !DILocation(line: 167, column: 30, scope: !333)
!336 = !DILocation(line: 167, column: 39, scope: !333)
!337 = !DILocation(line: 168, column: 21, scope: !333)
!338 = !DILocation(line: 169, column: 28, scope: !322)
!339 = !DILocation(line: 169, column: 21, scope: !322)
!340 = !DILocation(line: 170, column: 17, scope: !322)
!341 = !DILocation(line: 171, column: 13, scope: !314)
!342 = !DILocalVariable(name: "i", scope: !343, file: !45, line: 177, type: !23)
!343 = distinct !DILexicalBlock(scope: !344, file: !45, line: 176, column: 9)
!344 = distinct !DILexicalBlock(scope: !345, file: !45, line: 175, column: 5)
!345 = distinct !DILexicalBlock(scope: !292, file: !45, line: 174, column: 8)
!346 = !DILocation(line: 177, column: 17, scope: !343)
!347 = !DILocalVariable(name: "n", scope: !343, file: !45, line: 177, type: !23)
!348 = !DILocation(line: 177, column: 20, scope: !343)
!349 = !DILocalVariable(name: "intVariable", scope: !343, file: !45, line: 177, type: !23)
!350 = !DILocation(line: 177, column: 23, scope: !343)
!351 = !DILocation(line: 178, column: 24, scope: !352)
!352 = distinct !DILexicalBlock(scope: !343, file: !45, line: 178, column: 17)
!353 = !DILocation(line: 178, column: 17, scope: !352)
!354 = !DILocation(line: 178, column: 40, scope: !352)
!355 = !DILocation(line: 178, column: 17, scope: !343)
!356 = !DILocation(line: 181, column: 21, scope: !357)
!357 = distinct !DILexicalBlock(scope: !358, file: !45, line: 181, column: 21)
!358 = distinct !DILexicalBlock(scope: !352, file: !45, line: 179, column: 13)
!359 = !DILocation(line: 181, column: 23, scope: !357)
!360 = !DILocation(line: 181, column: 21, scope: !358)
!361 = !DILocation(line: 183, column: 33, scope: !362)
!362 = distinct !DILexicalBlock(scope: !357, file: !45, line: 182, column: 17)
!363 = !DILocation(line: 184, column: 28, scope: !364)
!364 = distinct !DILexicalBlock(scope: !362, file: !45, line: 184, column: 21)
!365 = !DILocation(line: 184, column: 26, scope: !364)
!366 = !DILocation(line: 184, column: 33, scope: !367)
!367 = distinct !DILexicalBlock(scope: !364, file: !45, line: 184, column: 21)
!368 = !DILocation(line: 184, column: 37, scope: !367)
!369 = !DILocation(line: 184, column: 35, scope: !367)
!370 = !DILocation(line: 184, column: 21, scope: !364)
!371 = !DILocation(line: 187, column: 36, scope: !372)
!372 = distinct !DILexicalBlock(scope: !367, file: !45, line: 185, column: 21)
!373 = !DILocation(line: 188, column: 21, scope: !372)
!374 = !DILocation(line: 184, column: 41, scope: !367)
!375 = !DILocation(line: 184, column: 21, scope: !367)
!376 = distinct !{!376, !370, !377, !196}
!377 = !DILocation(line: 188, column: 21, scope: !364)
!378 = !DILocation(line: 189, column: 34, scope: !362)
!379 = !DILocation(line: 189, column: 21, scope: !362)
!380 = !DILocation(line: 190, column: 17, scope: !362)
!381 = !DILocation(line: 191, column: 13, scope: !358)
!382 = !DILocation(line: 194, column: 1, scope: !292)
!383 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 197, type: !53, scopeLine: 198, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!384 = !DILocalVariable(name: "data", scope: !383, file: !45, line: 199, type: !42)
!385 = !DILocation(line: 199, column: 12, scope: !383)
!386 = !DILocalVariable(name: "dataBuffer", scope: !383, file: !45, line: 200, type: !58)
!387 = !DILocation(line: 200, column: 10, scope: !383)
!388 = !DILocation(line: 201, column: 12, scope: !383)
!389 = !DILocation(line: 201, column: 10, scope: !383)
!390 = !DILocation(line: 210, column: 16, scope: !391)
!391 = distinct !DILexicalBlock(scope: !392, file: !45, line: 208, column: 5)
!392 = distinct !DILexicalBlock(scope: !383, file: !45, line: 202, column: 8)
!393 = !DILocation(line: 210, column: 9, scope: !391)
!394 = !DILocalVariable(name: "i", scope: !395, file: !45, line: 215, type: !23)
!395 = distinct !DILexicalBlock(scope: !396, file: !45, line: 214, column: 9)
!396 = distinct !DILexicalBlock(scope: !397, file: !45, line: 213, column: 5)
!397 = distinct !DILexicalBlock(scope: !383, file: !45, line: 212, column: 8)
!398 = !DILocation(line: 215, column: 17, scope: !395)
!399 = !DILocalVariable(name: "n", scope: !395, file: !45, line: 215, type: !23)
!400 = !DILocation(line: 215, column: 20, scope: !395)
!401 = !DILocalVariable(name: "intVariable", scope: !395, file: !45, line: 215, type: !23)
!402 = !DILocation(line: 215, column: 23, scope: !395)
!403 = !DILocation(line: 216, column: 24, scope: !404)
!404 = distinct !DILexicalBlock(scope: !395, file: !45, line: 216, column: 17)
!405 = !DILocation(line: 216, column: 17, scope: !404)
!406 = !DILocation(line: 216, column: 40, scope: !404)
!407 = !DILocation(line: 216, column: 17, scope: !395)
!408 = !DILocation(line: 219, column: 29, scope: !409)
!409 = distinct !DILexicalBlock(scope: !404, file: !45, line: 217, column: 13)
!410 = !DILocation(line: 220, column: 24, scope: !411)
!411 = distinct !DILexicalBlock(scope: !409, file: !45, line: 220, column: 17)
!412 = !DILocation(line: 220, column: 22, scope: !411)
!413 = !DILocation(line: 220, column: 29, scope: !414)
!414 = distinct !DILexicalBlock(scope: !411, file: !45, line: 220, column: 17)
!415 = !DILocation(line: 220, column: 33, scope: !414)
!416 = !DILocation(line: 220, column: 31, scope: !414)
!417 = !DILocation(line: 220, column: 17, scope: !411)
!418 = !DILocation(line: 223, column: 32, scope: !419)
!419 = distinct !DILexicalBlock(scope: !414, file: !45, line: 221, column: 17)
!420 = !DILocation(line: 224, column: 17, scope: !419)
!421 = !DILocation(line: 220, column: 37, scope: !414)
!422 = !DILocation(line: 220, column: 17, scope: !414)
!423 = distinct !{!423, !417, !424, !196}
!424 = !DILocation(line: 224, column: 17, scope: !411)
!425 = !DILocation(line: 225, column: 30, scope: !409)
!426 = !DILocation(line: 225, column: 17, scope: !409)
!427 = !DILocation(line: 226, column: 13, scope: !409)
!428 = !DILocation(line: 229, column: 1, scope: !383)
!429 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 232, type: !53, scopeLine: 233, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!430 = !DILocalVariable(name: "data", scope: !429, file: !45, line: 234, type: !42)
!431 = !DILocation(line: 234, column: 12, scope: !429)
!432 = !DILocalVariable(name: "dataBuffer", scope: !429, file: !45, line: 235, type: !58)
!433 = !DILocation(line: 235, column: 10, scope: !429)
!434 = !DILocation(line: 236, column: 12, scope: !429)
!435 = !DILocation(line: 236, column: 10, scope: !429)
!436 = !DILocation(line: 240, column: 16, scope: !437)
!437 = distinct !DILexicalBlock(scope: !438, file: !45, line: 238, column: 5)
!438 = distinct !DILexicalBlock(scope: !429, file: !45, line: 237, column: 8)
!439 = !DILocation(line: 240, column: 9, scope: !437)
!440 = !DILocalVariable(name: "i", scope: !441, file: !45, line: 245, type: !23)
!441 = distinct !DILexicalBlock(scope: !442, file: !45, line: 244, column: 9)
!442 = distinct !DILexicalBlock(scope: !443, file: !45, line: 243, column: 5)
!443 = distinct !DILexicalBlock(scope: !429, file: !45, line: 242, column: 8)
!444 = !DILocation(line: 245, column: 17, scope: !441)
!445 = !DILocalVariable(name: "n", scope: !441, file: !45, line: 245, type: !23)
!446 = !DILocation(line: 245, column: 20, scope: !441)
!447 = !DILocalVariable(name: "intVariable", scope: !441, file: !45, line: 245, type: !23)
!448 = !DILocation(line: 245, column: 23, scope: !441)
!449 = !DILocation(line: 246, column: 24, scope: !450)
!450 = distinct !DILexicalBlock(scope: !441, file: !45, line: 246, column: 17)
!451 = !DILocation(line: 246, column: 17, scope: !450)
!452 = !DILocation(line: 246, column: 40, scope: !450)
!453 = !DILocation(line: 246, column: 17, scope: !441)
!454 = !DILocation(line: 249, column: 29, scope: !455)
!455 = distinct !DILexicalBlock(scope: !450, file: !45, line: 247, column: 13)
!456 = !DILocation(line: 250, column: 24, scope: !457)
!457 = distinct !DILexicalBlock(scope: !455, file: !45, line: 250, column: 17)
!458 = !DILocation(line: 250, column: 22, scope: !457)
!459 = !DILocation(line: 250, column: 29, scope: !460)
!460 = distinct !DILexicalBlock(scope: !457, file: !45, line: 250, column: 17)
!461 = !DILocation(line: 250, column: 33, scope: !460)
!462 = !DILocation(line: 250, column: 31, scope: !460)
!463 = !DILocation(line: 250, column: 17, scope: !457)
!464 = !DILocation(line: 253, column: 32, scope: !465)
!465 = distinct !DILexicalBlock(scope: !460, file: !45, line: 251, column: 17)
!466 = !DILocation(line: 254, column: 17, scope: !465)
!467 = !DILocation(line: 250, column: 37, scope: !460)
!468 = !DILocation(line: 250, column: 17, scope: !460)
!469 = distinct !{!469, !463, !470, !196}
!470 = !DILocation(line: 254, column: 17, scope: !457)
!471 = !DILocation(line: 255, column: 30, scope: !455)
!472 = !DILocation(line: 255, column: 17, scope: !455)
!473 = !DILocation(line: 256, column: 13, scope: !455)
!474 = !DILocation(line: 259, column: 1, scope: !429)
!475 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_03_good", scope: !45, file: !45, line: 261, type: !53, scopeLine: 262, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!476 = !DILocation(line: 263, column: 5, scope: !475)
!477 = !DILocation(line: 264, column: 5, scope: !475)
!478 = !DILocation(line: 265, column: 5, scope: !475)
!479 = !DILocation(line: 266, column: 5, scope: !475)
!480 = !DILocation(line: 267, column: 1, scope: !475)
!481 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !482, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !42}
!484 = !DILocalVariable(name: "line", arg: 1, scope: !481, file: !3, line: 11, type: !42)
!485 = !DILocation(line: 11, column: 25, scope: !481)
!486 = !DILocation(line: 13, column: 1, scope: !481)
!487 = !DILocation(line: 14, column: 8, scope: !488)
!488 = distinct !DILexicalBlock(scope: !481, file: !3, line: 14, column: 8)
!489 = !DILocation(line: 14, column: 13, scope: !488)
!490 = !DILocation(line: 14, column: 8, scope: !481)
!491 = !DILocation(line: 16, column: 24, scope: !492)
!492 = distinct !DILexicalBlock(scope: !488, file: !3, line: 15, column: 5)
!493 = !DILocation(line: 16, column: 9, scope: !492)
!494 = !DILocation(line: 17, column: 5, scope: !492)
!495 = !DILocation(line: 18, column: 5, scope: !481)
!496 = !DILocation(line: 19, column: 1, scope: !481)
!497 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !482, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!498 = !DILocalVariable(name: "line", arg: 1, scope: !497, file: !3, line: 20, type: !42)
!499 = !DILocation(line: 20, column: 29, scope: !497)
!500 = !DILocation(line: 22, column: 8, scope: !501)
!501 = distinct !DILexicalBlock(scope: !497, file: !3, line: 22, column: 8)
!502 = !DILocation(line: 22, column: 13, scope: !501)
!503 = !DILocation(line: 22, column: 8, scope: !497)
!504 = !DILocation(line: 24, column: 24, scope: !505)
!505 = distinct !DILexicalBlock(scope: !501, file: !3, line: 23, column: 5)
!506 = !DILocation(line: 24, column: 9, scope: !505)
!507 = !DILocation(line: 25, column: 5, scope: !505)
!508 = !DILocation(line: 26, column: 1, scope: !497)
!509 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !510, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!510 = !DISubroutineType(types: !511)
!511 = !{null, !512}
!512 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !513, size: 64)
!513 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !23)
!514 = !DILocalVariable(name: "line", arg: 1, scope: !509, file: !3, line: 27, type: !512)
!515 = !DILocation(line: 27, column: 29, scope: !509)
!516 = !DILocation(line: 29, column: 8, scope: !517)
!517 = distinct !DILexicalBlock(scope: !509, file: !3, line: 29, column: 8)
!518 = !DILocation(line: 29, column: 13, scope: !517)
!519 = !DILocation(line: 29, column: 8, scope: !509)
!520 = !DILocation(line: 31, column: 27, scope: !521)
!521 = distinct !DILexicalBlock(scope: !517, file: !3, line: 30, column: 5)
!522 = !DILocation(line: 31, column: 9, scope: !521)
!523 = !DILocation(line: 32, column: 5, scope: !521)
!524 = !DILocation(line: 33, column: 1, scope: !509)
!525 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !526, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!526 = !DISubroutineType(types: !527)
!527 = !{null, !23}
!528 = !DILocalVariable(name: "intNumber", arg: 1, scope: !525, file: !3, line: 35, type: !23)
!529 = !DILocation(line: 35, column: 24, scope: !525)
!530 = !DILocation(line: 37, column: 20, scope: !525)
!531 = !DILocation(line: 37, column: 5, scope: !525)
!532 = !DILocation(line: 38, column: 1, scope: !525)
!533 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !534, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!534 = !DISubroutineType(types: !535)
!535 = !{null, !536}
!536 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!537 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !533, file: !3, line: 40, type: !536)
!538 = !DILocation(line: 40, column: 28, scope: !533)
!539 = !DILocation(line: 42, column: 21, scope: !533)
!540 = !DILocation(line: 42, column: 5, scope: !533)
!541 = !DILocation(line: 43, column: 1, scope: !533)
!542 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !543, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!543 = !DISubroutineType(types: !544)
!544 = !{null, !545}
!545 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!546 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !542, file: !3, line: 45, type: !545)
!547 = !DILocation(line: 45, column: 28, scope: !542)
!548 = !DILocation(line: 47, column: 20, scope: !542)
!549 = !DILocation(line: 47, column: 5, scope: !542)
!550 = !DILocation(line: 48, column: 1, scope: !542)
!551 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !552, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!552 = !DISubroutineType(types: !553)
!553 = !{null, !103}
!554 = !DILocalVariable(name: "longNumber", arg: 1, scope: !551, file: !3, line: 50, type: !103)
!555 = !DILocation(line: 50, column: 26, scope: !551)
!556 = !DILocation(line: 52, column: 21, scope: !551)
!557 = !DILocation(line: 52, column: 5, scope: !551)
!558 = !DILocation(line: 53, column: 1, scope: !551)
!559 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !560, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!560 = !DISubroutineType(types: !561)
!561 = !{null, !562}
!562 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !563, line: 27, baseType: !564)
!563 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!564 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 44, baseType: !103)
!565 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !559, file: !3, line: 55, type: !562)
!566 = !DILocation(line: 55, column: 33, scope: !559)
!567 = !DILocation(line: 57, column: 29, scope: !559)
!568 = !DILocation(line: 57, column: 5, scope: !559)
!569 = !DILocation(line: 58, column: 1, scope: !559)
!570 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !571, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!571 = !DISubroutineType(types: !572)
!572 = !{null, !68}
!573 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !570, file: !3, line: 60, type: !68)
!574 = !DILocation(line: 60, column: 29, scope: !570)
!575 = !DILocation(line: 62, column: 21, scope: !570)
!576 = !DILocation(line: 62, column: 5, scope: !570)
!577 = !DILocation(line: 63, column: 1, scope: !570)
!578 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !579, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!579 = !DISubroutineType(types: !580)
!580 = !{null, !43}
!581 = !DILocalVariable(name: "charHex", arg: 1, scope: !578, file: !3, line: 65, type: !43)
!582 = !DILocation(line: 65, column: 29, scope: !578)
!583 = !DILocation(line: 67, column: 22, scope: !578)
!584 = !DILocation(line: 67, column: 5, scope: !578)
!585 = !DILocation(line: 68, column: 1, scope: !578)
!586 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !587, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!587 = !DISubroutineType(types: !588)
!588 = !{null, !513}
!589 = !DILocalVariable(name: "wideChar", arg: 1, scope: !586, file: !3, line: 70, type: !513)
!590 = !DILocation(line: 70, column: 29, scope: !586)
!591 = !DILocalVariable(name: "s", scope: !586, file: !3, line: 74, type: !592)
!592 = !DICompositeType(tag: DW_TAG_array_type, baseType: !513, size: 64, elements: !593)
!593 = !{!594}
!594 = !DISubrange(count: 2)
!595 = !DILocation(line: 74, column: 13, scope: !586)
!596 = !DILocation(line: 75, column: 16, scope: !586)
!597 = !DILocation(line: 75, column: 9, scope: !586)
!598 = !DILocation(line: 75, column: 14, scope: !586)
!599 = !DILocation(line: 76, column: 9, scope: !586)
!600 = !DILocation(line: 76, column: 14, scope: !586)
!601 = !DILocation(line: 77, column: 21, scope: !586)
!602 = !DILocation(line: 77, column: 5, scope: !586)
!603 = !DILocation(line: 78, column: 1, scope: !586)
!604 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !605, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!605 = !DISubroutineType(types: !606)
!606 = !{null, !7}
!607 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !604, file: !3, line: 80, type: !7)
!608 = !DILocation(line: 80, column: 33, scope: !604)
!609 = !DILocation(line: 82, column: 20, scope: !604)
!610 = !DILocation(line: 82, column: 5, scope: !604)
!611 = !DILocation(line: 83, column: 1, scope: !604)
!612 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !613, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!613 = !DISubroutineType(types: !614)
!614 = !{null, !25}
!615 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !612, file: !3, line: 85, type: !25)
!616 = !DILocation(line: 85, column: 45, scope: !612)
!617 = !DILocation(line: 87, column: 22, scope: !612)
!618 = !DILocation(line: 87, column: 5, scope: !612)
!619 = !DILocation(line: 88, column: 1, scope: !612)
!620 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !621, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!621 = !DISubroutineType(types: !622)
!622 = !{null, !623}
!623 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!624 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !620, file: !3, line: 90, type: !623)
!625 = !DILocation(line: 90, column: 29, scope: !620)
!626 = !DILocation(line: 92, column: 20, scope: !620)
!627 = !DILocation(line: 92, column: 5, scope: !620)
!628 = !DILocation(line: 93, column: 1, scope: !620)
!629 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !630, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!630 = !DISubroutineType(types: !631)
!631 = !{null, !632}
!632 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !633, size: 64)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !634, line: 100, baseType: !635)
!634 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_076/source_code")
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !634, line: 96, size: 64, elements: !636)
!636 = !{!637, !638}
!637 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !635, file: !634, line: 98, baseType: !23, size: 32)
!638 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !635, file: !634, line: 99, baseType: !23, size: 32, offset: 32)
!639 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !629, file: !3, line: 95, type: !632)
!640 = !DILocation(line: 95, column: 40, scope: !629)
!641 = !DILocation(line: 97, column: 26, scope: !629)
!642 = !DILocation(line: 97, column: 47, scope: !629)
!643 = !DILocation(line: 97, column: 55, scope: !629)
!644 = !DILocation(line: 97, column: 76, scope: !629)
!645 = !DILocation(line: 97, column: 5, scope: !629)
!646 = !DILocation(line: 98, column: 1, scope: !629)
!647 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !648, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!648 = !DISubroutineType(types: !649)
!649 = !{null, !650, !68}
!650 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!651 = !DILocalVariable(name: "bytes", arg: 1, scope: !647, file: !3, line: 100, type: !650)
!652 = !DILocation(line: 100, column: 38, scope: !647)
!653 = !DILocalVariable(name: "numBytes", arg: 2, scope: !647, file: !3, line: 100, type: !68)
!654 = !DILocation(line: 100, column: 52, scope: !647)
!655 = !DILocalVariable(name: "i", scope: !647, file: !3, line: 102, type: !68)
!656 = !DILocation(line: 102, column: 12, scope: !647)
!657 = !DILocation(line: 103, column: 12, scope: !658)
!658 = distinct !DILexicalBlock(scope: !647, file: !3, line: 103, column: 5)
!659 = !DILocation(line: 103, column: 10, scope: !658)
!660 = !DILocation(line: 103, column: 17, scope: !661)
!661 = distinct !DILexicalBlock(scope: !658, file: !3, line: 103, column: 5)
!662 = !DILocation(line: 103, column: 21, scope: !661)
!663 = !DILocation(line: 103, column: 19, scope: !661)
!664 = !DILocation(line: 103, column: 5, scope: !658)
!665 = !DILocation(line: 105, column: 24, scope: !666)
!666 = distinct !DILexicalBlock(scope: !661, file: !3, line: 104, column: 5)
!667 = !DILocation(line: 105, column: 30, scope: !666)
!668 = !DILocation(line: 105, column: 9, scope: !666)
!669 = !DILocation(line: 106, column: 5, scope: !666)
!670 = !DILocation(line: 103, column: 31, scope: !661)
!671 = !DILocation(line: 103, column: 5, scope: !661)
!672 = distinct !{!672, !664, !673, !196}
!673 = !DILocation(line: 106, column: 5, scope: !658)
!674 = !DILocation(line: 107, column: 5, scope: !647)
!675 = !DILocation(line: 108, column: 1, scope: !647)
!676 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !677, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!677 = !DISubroutineType(types: !678)
!678 = !{!68, !650, !68, !42}
!679 = !DILocalVariable(name: "bytes", arg: 1, scope: !676, file: !3, line: 113, type: !650)
!680 = !DILocation(line: 113, column: 39, scope: !676)
!681 = !DILocalVariable(name: "numBytes", arg: 2, scope: !676, file: !3, line: 113, type: !68)
!682 = !DILocation(line: 113, column: 53, scope: !676)
!683 = !DILocalVariable(name: "hex", arg: 3, scope: !676, file: !3, line: 113, type: !42)
!684 = !DILocation(line: 113, column: 71, scope: !676)
!685 = !DILocalVariable(name: "numWritten", scope: !676, file: !3, line: 115, type: !68)
!686 = !DILocation(line: 115, column: 12, scope: !676)
!687 = !DILocation(line: 121, column: 5, scope: !676)
!688 = !DILocation(line: 121, column: 12, scope: !676)
!689 = !DILocation(line: 121, column: 25, scope: !676)
!690 = !DILocation(line: 121, column: 23, scope: !676)
!691 = !DILocation(line: 121, column: 34, scope: !676)
!692 = !DILocation(line: 121, column: 37, scope: !676)
!693 = !DILocation(line: 121, column: 67, scope: !676)
!694 = !DILocation(line: 121, column: 70, scope: !676)
!695 = !DILocation(line: 0, scope: !676)
!696 = !DILocalVariable(name: "byte", scope: !697, file: !3, line: 123, type: !23)
!697 = distinct !DILexicalBlock(scope: !676, file: !3, line: 122, column: 5)
!698 = !DILocation(line: 123, column: 13, scope: !697)
