; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_024/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_15.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_024/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_15_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 43, type: !66)
!65 = distinct !DILexicalBlock(scope: !52, file: !45, line: 41, column: 5)
!66 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !67, line: 46, baseType: !68)
!67 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!68 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!69 = !DILocation(line: 43, column: 16, scope: !65)
!70 = !DILocation(line: 43, column: 33, scope: !65)
!71 = !DILocation(line: 43, column: 26, scope: !65)
!72 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 44, type: !73)
!73 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !74, size: 64)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !75, line: 7, baseType: !76)
!75 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !77, line: 49, size: 1728, elements: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !94, !96, !97, !98, !102, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !76, file: !77, line: 51, baseType: !23, size: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !76, file: !77, line: 54, baseType: !42, size: 64, offset: 64)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !76, file: !77, line: 55, baseType: !42, size: 64, offset: 128)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !76, file: !77, line: 56, baseType: !42, size: 64, offset: 192)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !76, file: !77, line: 57, baseType: !42, size: 64, offset: 256)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !76, file: !77, line: 58, baseType: !42, size: 64, offset: 320)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !76, file: !77, line: 59, baseType: !42, size: 64, offset: 384)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !76, file: !77, line: 60, baseType: !42, size: 64, offset: 448)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !76, file: !77, line: 61, baseType: !42, size: 64, offset: 512)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !76, file: !77, line: 64, baseType: !42, size: 64, offset: 576)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !76, file: !77, line: 65, baseType: !42, size: 64, offset: 640)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !76, file: !77, line: 66, baseType: !42, size: 64, offset: 704)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !76, file: !77, line: 68, baseType: !92, size: 64, offset: 768)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !93, size: 64)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !77, line: 36, flags: DIFlagFwdDecl)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !76, file: !77, line: 70, baseType: !95, size: 64, offset: 832)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !76, file: !77, line: 72, baseType: !23, size: 32, offset: 896)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !76, file: !77, line: 73, baseType: !23, size: 32, offset: 928)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !76, file: !77, line: 74, baseType: !99, size: 64, offset: 960)
!99 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !100, line: 152, baseType: !101)
!100 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!101 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !76, file: !77, line: 77, baseType: !24, size: 16, offset: 1024)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !76, file: !77, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !76, file: !77, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !76, file: !77, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !77, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !76, file: !77, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !100, line: 153, baseType: !101)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !76, file: !77, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !77, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !76, file: !77, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !77, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !76, file: !77, line: 93, baseType: !95, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !76, file: !77, line: 94, baseType: !22, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !76, file: !77, line: 95, baseType: !66, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !76, file: !77, line: 96, baseType: !23, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !76, file: !77, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocation(line: 44, column: 16, scope: !65)
!129 = !DILocation(line: 46, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !65, file: !45, line: 46, column: 13)
!131 = !DILocation(line: 46, column: 16, scope: !130)
!132 = !DILocation(line: 46, column: 25, scope: !130)
!133 = !DILocation(line: 46, column: 13, scope: !65)
!134 = !DILocation(line: 48, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !45, line: 47, column: 9)
!136 = !DILocation(line: 48, column: 19, scope: !135)
!137 = !DILocation(line: 49, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !45, line: 49, column: 17)
!139 = !DILocation(line: 49, column: 23, scope: !138)
!140 = !DILocation(line: 49, column: 17, scope: !135)
!141 = !DILocation(line: 52, column: 27, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !45, line: 52, column: 21)
!143 = distinct !DILexicalBlock(scope: !138, file: !45, line: 50, column: 13)
!144 = !DILocation(line: 52, column: 32, scope: !142)
!145 = !DILocation(line: 52, column: 31, scope: !142)
!146 = !DILocation(line: 52, column: 51, scope: !142)
!147 = !DILocation(line: 52, column: 50, scope: !142)
!148 = !DILocation(line: 52, column: 41, scope: !142)
!149 = !DILocation(line: 52, column: 61, scope: !142)
!150 = !DILocation(line: 52, column: 21, scope: !142)
!151 = !DILocation(line: 52, column: 68, scope: !142)
!152 = !DILocation(line: 52, column: 21, scope: !143)
!153 = !DILocation(line: 54, column: 21, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !45, line: 53, column: 17)
!155 = !DILocation(line: 56, column: 21, scope: !154)
!156 = !DILocation(line: 56, column: 26, scope: !154)
!157 = !DILocation(line: 56, column: 35, scope: !154)
!158 = !DILocation(line: 57, column: 17, scope: !154)
!159 = !DILocation(line: 58, column: 24, scope: !143)
!160 = !DILocation(line: 58, column: 17, scope: !143)
!161 = !DILocation(line: 59, column: 13, scope: !143)
!162 = !DILocation(line: 60, column: 9, scope: !135)
!163 = !DILocation(line: 72, column: 16, scope: !52)
!164 = !DILocation(line: 72, column: 9, scope: !52)
!165 = !DILocation(line: 79, column: 1, scope: !52)
!166 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 86, type: !53, scopeLine: 87, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!167 = !DILocalVariable(name: "data", scope: !166, file: !45, line: 88, type: !42)
!168 = !DILocation(line: 88, column: 12, scope: !166)
!169 = !DILocalVariable(name: "dataBuffer", scope: !166, file: !45, line: 89, type: !58)
!170 = !DILocation(line: 89, column: 10, scope: !166)
!171 = !DILocation(line: 90, column: 12, scope: !166)
!172 = !DILocation(line: 90, column: 10, scope: !166)
!173 = !DILocalVariable(name: "dataLen", scope: !174, file: !45, line: 96, type: !66)
!174 = distinct !DILexicalBlock(scope: !166, file: !45, line: 94, column: 5)
!175 = !DILocation(line: 96, column: 16, scope: !174)
!176 = !DILocation(line: 96, column: 33, scope: !174)
!177 = !DILocation(line: 96, column: 26, scope: !174)
!178 = !DILocalVariable(name: "pFile", scope: !174, file: !45, line: 97, type: !73)
!179 = !DILocation(line: 97, column: 16, scope: !174)
!180 = !DILocation(line: 99, column: 17, scope: !181)
!181 = distinct !DILexicalBlock(scope: !174, file: !45, line: 99, column: 13)
!182 = !DILocation(line: 99, column: 16, scope: !181)
!183 = !DILocation(line: 99, column: 25, scope: !181)
!184 = !DILocation(line: 99, column: 13, scope: !174)
!185 = !DILocation(line: 101, column: 21, scope: !186)
!186 = distinct !DILexicalBlock(scope: !181, file: !45, line: 100, column: 9)
!187 = !DILocation(line: 101, column: 19, scope: !186)
!188 = !DILocation(line: 102, column: 17, scope: !189)
!189 = distinct !DILexicalBlock(scope: !186, file: !45, line: 102, column: 17)
!190 = !DILocation(line: 102, column: 23, scope: !189)
!191 = !DILocation(line: 102, column: 17, scope: !186)
!192 = !DILocation(line: 105, column: 27, scope: !193)
!193 = distinct !DILexicalBlock(scope: !194, file: !45, line: 105, column: 21)
!194 = distinct !DILexicalBlock(scope: !189, file: !45, line: 103, column: 13)
!195 = !DILocation(line: 105, column: 32, scope: !193)
!196 = !DILocation(line: 105, column: 31, scope: !193)
!197 = !DILocation(line: 105, column: 51, scope: !193)
!198 = !DILocation(line: 105, column: 50, scope: !193)
!199 = !DILocation(line: 105, column: 41, scope: !193)
!200 = !DILocation(line: 105, column: 61, scope: !193)
!201 = !DILocation(line: 105, column: 21, scope: !193)
!202 = !DILocation(line: 105, column: 68, scope: !193)
!203 = !DILocation(line: 105, column: 21, scope: !194)
!204 = !DILocation(line: 107, column: 21, scope: !205)
!205 = distinct !DILexicalBlock(scope: !193, file: !45, line: 106, column: 17)
!206 = !DILocation(line: 109, column: 21, scope: !205)
!207 = !DILocation(line: 109, column: 26, scope: !205)
!208 = !DILocation(line: 109, column: 35, scope: !205)
!209 = !DILocation(line: 110, column: 17, scope: !205)
!210 = !DILocation(line: 111, column: 24, scope: !194)
!211 = !DILocation(line: 111, column: 17, scope: !194)
!212 = !DILocation(line: 112, column: 13, scope: !194)
!213 = !DILocation(line: 113, column: 9, scope: !186)
!214 = !DILocation(line: 129, column: 24, scope: !166)
!215 = !DILocation(line: 129, column: 9, scope: !166)
!216 = !DILocation(line: 132, column: 1, scope: !166)
!217 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 135, type: !53, scopeLine: 136, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!218 = !DILocalVariable(name: "data", scope: !217, file: !45, line: 137, type: !42)
!219 = !DILocation(line: 137, column: 12, scope: !217)
!220 = !DILocalVariable(name: "dataBuffer", scope: !217, file: !45, line: 138, type: !58)
!221 = !DILocation(line: 138, column: 10, scope: !217)
!222 = !DILocation(line: 139, column: 12, scope: !217)
!223 = !DILocation(line: 139, column: 10, scope: !217)
!224 = !DILocalVariable(name: "dataLen", scope: !225, file: !45, line: 145, type: !66)
!225 = distinct !DILexicalBlock(scope: !217, file: !45, line: 143, column: 5)
!226 = !DILocation(line: 145, column: 16, scope: !225)
!227 = !DILocation(line: 145, column: 33, scope: !225)
!228 = !DILocation(line: 145, column: 26, scope: !225)
!229 = !DILocalVariable(name: "pFile", scope: !225, file: !45, line: 146, type: !73)
!230 = !DILocation(line: 146, column: 16, scope: !225)
!231 = !DILocation(line: 148, column: 17, scope: !232)
!232 = distinct !DILexicalBlock(scope: !225, file: !45, line: 148, column: 13)
!233 = !DILocation(line: 148, column: 16, scope: !232)
!234 = !DILocation(line: 148, column: 25, scope: !232)
!235 = !DILocation(line: 148, column: 13, scope: !225)
!236 = !DILocation(line: 150, column: 21, scope: !237)
!237 = distinct !DILexicalBlock(scope: !232, file: !45, line: 149, column: 9)
!238 = !DILocation(line: 150, column: 19, scope: !237)
!239 = !DILocation(line: 151, column: 17, scope: !240)
!240 = distinct !DILexicalBlock(scope: !237, file: !45, line: 151, column: 17)
!241 = !DILocation(line: 151, column: 23, scope: !240)
!242 = !DILocation(line: 151, column: 17, scope: !237)
!243 = !DILocation(line: 154, column: 27, scope: !244)
!244 = distinct !DILexicalBlock(scope: !245, file: !45, line: 154, column: 21)
!245 = distinct !DILexicalBlock(scope: !240, file: !45, line: 152, column: 13)
!246 = !DILocation(line: 154, column: 32, scope: !244)
!247 = !DILocation(line: 154, column: 31, scope: !244)
!248 = !DILocation(line: 154, column: 51, scope: !244)
!249 = !DILocation(line: 154, column: 50, scope: !244)
!250 = !DILocation(line: 154, column: 41, scope: !244)
!251 = !DILocation(line: 154, column: 61, scope: !244)
!252 = !DILocation(line: 154, column: 21, scope: !244)
!253 = !DILocation(line: 154, column: 68, scope: !244)
!254 = !DILocation(line: 154, column: 21, scope: !245)
!255 = !DILocation(line: 156, column: 21, scope: !256)
!256 = distinct !DILexicalBlock(scope: !244, file: !45, line: 155, column: 17)
!257 = !DILocation(line: 158, column: 21, scope: !256)
!258 = !DILocation(line: 158, column: 26, scope: !256)
!259 = !DILocation(line: 158, column: 35, scope: !256)
!260 = !DILocation(line: 159, column: 17, scope: !256)
!261 = !DILocation(line: 160, column: 24, scope: !245)
!262 = !DILocation(line: 160, column: 17, scope: !245)
!263 = !DILocation(line: 161, column: 13, scope: !245)
!264 = !DILocation(line: 162, column: 9, scope: !237)
!265 = !DILocation(line: 174, column: 24, scope: !217)
!266 = !DILocation(line: 174, column: 9, scope: !217)
!267 = !DILocation(line: 181, column: 1, scope: !217)
!268 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 184, type: !53, scopeLine: 185, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!269 = !DILocalVariable(name: "data", scope: !268, file: !45, line: 186, type: !42)
!270 = !DILocation(line: 186, column: 12, scope: !268)
!271 = !DILocalVariable(name: "dataBuffer", scope: !268, file: !45, line: 187, type: !58)
!272 = !DILocation(line: 187, column: 10, scope: !268)
!273 = !DILocation(line: 188, column: 12, scope: !268)
!274 = !DILocation(line: 188, column: 10, scope: !268)
!275 = !DILocation(line: 197, column: 16, scope: !268)
!276 = !DILocation(line: 197, column: 9, scope: !268)
!277 = !DILocation(line: 204, column: 16, scope: !268)
!278 = !DILocation(line: 204, column: 9, scope: !268)
!279 = !DILocation(line: 211, column: 1, scope: !268)
!280 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 214, type: !53, scopeLine: 215, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!281 = !DILocalVariable(name: "data", scope: !280, file: !45, line: 216, type: !42)
!282 = !DILocation(line: 216, column: 12, scope: !280)
!283 = !DILocalVariable(name: "dataBuffer", scope: !280, file: !45, line: 217, type: !58)
!284 = !DILocation(line: 217, column: 10, scope: !280)
!285 = !DILocation(line: 218, column: 12, scope: !280)
!286 = !DILocation(line: 218, column: 10, scope: !280)
!287 = !DILocation(line: 223, column: 16, scope: !280)
!288 = !DILocation(line: 223, column: 9, scope: !280)
!289 = !DILocation(line: 234, column: 16, scope: !280)
!290 = !DILocation(line: 234, column: 9, scope: !280)
!291 = !DILocation(line: 241, column: 1, scope: !280)
!292 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_15_good", scope: !45, file: !45, line: 243, type: !53, scopeLine: 244, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!293 = !DILocation(line: 245, column: 5, scope: !292)
!294 = !DILocation(line: 246, column: 5, scope: !292)
!295 = !DILocation(line: 247, column: 5, scope: !292)
!296 = !DILocation(line: 248, column: 5, scope: !292)
!297 = !DILocation(line: 249, column: 1, scope: !292)
!298 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !299, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!299 = !DISubroutineType(types: !300)
!300 = !{null, !42}
!301 = !DILocalVariable(name: "line", arg: 1, scope: !298, file: !3, line: 11, type: !42)
!302 = !DILocation(line: 11, column: 25, scope: !298)
!303 = !DILocation(line: 13, column: 1, scope: !298)
!304 = !DILocation(line: 14, column: 8, scope: !305)
!305 = distinct !DILexicalBlock(scope: !298, file: !3, line: 14, column: 8)
!306 = !DILocation(line: 14, column: 13, scope: !305)
!307 = !DILocation(line: 14, column: 8, scope: !298)
!308 = !DILocation(line: 16, column: 24, scope: !309)
!309 = distinct !DILexicalBlock(scope: !305, file: !3, line: 15, column: 5)
!310 = !DILocation(line: 16, column: 9, scope: !309)
!311 = !DILocation(line: 17, column: 5, scope: !309)
!312 = !DILocation(line: 18, column: 5, scope: !298)
!313 = !DILocation(line: 19, column: 1, scope: !298)
!314 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !299, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!315 = !DILocalVariable(name: "line", arg: 1, scope: !314, file: !3, line: 20, type: !42)
!316 = !DILocation(line: 20, column: 29, scope: !314)
!317 = !DILocation(line: 22, column: 8, scope: !318)
!318 = distinct !DILexicalBlock(scope: !314, file: !3, line: 22, column: 8)
!319 = !DILocation(line: 22, column: 13, scope: !318)
!320 = !DILocation(line: 22, column: 8, scope: !314)
!321 = !DILocation(line: 24, column: 24, scope: !322)
!322 = distinct !DILexicalBlock(scope: !318, file: !3, line: 23, column: 5)
!323 = !DILocation(line: 24, column: 9, scope: !322)
!324 = !DILocation(line: 25, column: 5, scope: !322)
!325 = !DILocation(line: 26, column: 1, scope: !314)
!326 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !327, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!327 = !DISubroutineType(types: !328)
!328 = !{null, !329}
!329 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !330, size: 64)
!330 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !67, line: 74, baseType: !23)
!331 = !DILocalVariable(name: "line", arg: 1, scope: !326, file: !3, line: 27, type: !329)
!332 = !DILocation(line: 27, column: 29, scope: !326)
!333 = !DILocation(line: 29, column: 8, scope: !334)
!334 = distinct !DILexicalBlock(scope: !326, file: !3, line: 29, column: 8)
!335 = !DILocation(line: 29, column: 13, scope: !334)
!336 = !DILocation(line: 29, column: 8, scope: !326)
!337 = !DILocation(line: 31, column: 27, scope: !338)
!338 = distinct !DILexicalBlock(scope: !334, file: !3, line: 30, column: 5)
!339 = !DILocation(line: 31, column: 9, scope: !338)
!340 = !DILocation(line: 32, column: 5, scope: !338)
!341 = !DILocation(line: 33, column: 1, scope: !326)
!342 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !343, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !23}
!345 = !DILocalVariable(name: "intNumber", arg: 1, scope: !342, file: !3, line: 35, type: !23)
!346 = !DILocation(line: 35, column: 24, scope: !342)
!347 = !DILocation(line: 37, column: 20, scope: !342)
!348 = !DILocation(line: 37, column: 5, scope: !342)
!349 = !DILocation(line: 38, column: 1, scope: !342)
!350 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !351, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!351 = !DISubroutineType(types: !352)
!352 = !{null, !353}
!353 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!354 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !350, file: !3, line: 40, type: !353)
!355 = !DILocation(line: 40, column: 28, scope: !350)
!356 = !DILocation(line: 42, column: 21, scope: !350)
!357 = !DILocation(line: 42, column: 5, scope: !350)
!358 = !DILocation(line: 43, column: 1, scope: !350)
!359 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !360, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!360 = !DISubroutineType(types: !361)
!361 = !{null, !362}
!362 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!363 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !359, file: !3, line: 45, type: !362)
!364 = !DILocation(line: 45, column: 28, scope: !359)
!365 = !DILocation(line: 47, column: 20, scope: !359)
!366 = !DILocation(line: 47, column: 5, scope: !359)
!367 = !DILocation(line: 48, column: 1, scope: !359)
!368 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !369, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !101}
!371 = !DILocalVariable(name: "longNumber", arg: 1, scope: !368, file: !3, line: 50, type: !101)
!372 = !DILocation(line: 50, column: 26, scope: !368)
!373 = !DILocation(line: 52, column: 21, scope: !368)
!374 = !DILocation(line: 52, column: 5, scope: !368)
!375 = !DILocation(line: 53, column: 1, scope: !368)
!376 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !377, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !380, line: 27, baseType: !381)
!380 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!381 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !100, line: 44, baseType: !101)
!382 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !376, file: !3, line: 55, type: !379)
!383 = !DILocation(line: 55, column: 33, scope: !376)
!384 = !DILocation(line: 57, column: 29, scope: !376)
!385 = !DILocation(line: 57, column: 5, scope: !376)
!386 = !DILocation(line: 58, column: 1, scope: !376)
!387 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !388, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!388 = !DISubroutineType(types: !389)
!389 = !{null, !66}
!390 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !387, file: !3, line: 60, type: !66)
!391 = !DILocation(line: 60, column: 29, scope: !387)
!392 = !DILocation(line: 62, column: 21, scope: !387)
!393 = !DILocation(line: 62, column: 5, scope: !387)
!394 = !DILocation(line: 63, column: 1, scope: !387)
!395 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !396, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!396 = !DISubroutineType(types: !397)
!397 = !{null, !43}
!398 = !DILocalVariable(name: "charHex", arg: 1, scope: !395, file: !3, line: 65, type: !43)
!399 = !DILocation(line: 65, column: 29, scope: !395)
!400 = !DILocation(line: 67, column: 22, scope: !395)
!401 = !DILocation(line: 67, column: 5, scope: !395)
!402 = !DILocation(line: 68, column: 1, scope: !395)
!403 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !404, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!404 = !DISubroutineType(types: !405)
!405 = !{null, !330}
!406 = !DILocalVariable(name: "wideChar", arg: 1, scope: !403, file: !3, line: 70, type: !330)
!407 = !DILocation(line: 70, column: 29, scope: !403)
!408 = !DILocalVariable(name: "s", scope: !403, file: !3, line: 74, type: !409)
!409 = !DICompositeType(tag: DW_TAG_array_type, baseType: !330, size: 64, elements: !410)
!410 = !{!411}
!411 = !DISubrange(count: 2)
!412 = !DILocation(line: 74, column: 13, scope: !403)
!413 = !DILocation(line: 75, column: 16, scope: !403)
!414 = !DILocation(line: 75, column: 9, scope: !403)
!415 = !DILocation(line: 75, column: 14, scope: !403)
!416 = !DILocation(line: 76, column: 9, scope: !403)
!417 = !DILocation(line: 76, column: 14, scope: !403)
!418 = !DILocation(line: 77, column: 21, scope: !403)
!419 = !DILocation(line: 77, column: 5, scope: !403)
!420 = !DILocation(line: 78, column: 1, scope: !403)
!421 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !422, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !7}
!424 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !421, file: !3, line: 80, type: !7)
!425 = !DILocation(line: 80, column: 33, scope: !421)
!426 = !DILocation(line: 82, column: 20, scope: !421)
!427 = !DILocation(line: 82, column: 5, scope: !421)
!428 = !DILocation(line: 83, column: 1, scope: !421)
!429 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !430, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !25}
!432 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !429, file: !3, line: 85, type: !25)
!433 = !DILocation(line: 85, column: 45, scope: !429)
!434 = !DILocation(line: 87, column: 22, scope: !429)
!435 = !DILocation(line: 87, column: 5, scope: !429)
!436 = !DILocation(line: 88, column: 1, scope: !429)
!437 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !438, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !440}
!440 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!441 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !437, file: !3, line: 90, type: !440)
!442 = !DILocation(line: 90, column: 29, scope: !437)
!443 = !DILocation(line: 92, column: 20, scope: !437)
!444 = !DILocation(line: 92, column: 5, scope: !437)
!445 = !DILocation(line: 93, column: 1, scope: !437)
!446 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !447, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !450, size: 64)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !451, line: 100, baseType: !452)
!451 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_024/source_code")
!452 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !451, line: 96, size: 64, elements: !453)
!453 = !{!454, !455}
!454 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !452, file: !451, line: 98, baseType: !23, size: 32)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !452, file: !451, line: 99, baseType: !23, size: 32, offset: 32)
!456 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !446, file: !3, line: 95, type: !449)
!457 = !DILocation(line: 95, column: 40, scope: !446)
!458 = !DILocation(line: 97, column: 26, scope: !446)
!459 = !DILocation(line: 97, column: 47, scope: !446)
!460 = !DILocation(line: 97, column: 55, scope: !446)
!461 = !DILocation(line: 97, column: 76, scope: !446)
!462 = !DILocation(line: 97, column: 5, scope: !446)
!463 = !DILocation(line: 98, column: 1, scope: !446)
!464 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !465, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!465 = !DISubroutineType(types: !466)
!466 = !{null, !467, !66}
!467 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!468 = !DILocalVariable(name: "bytes", arg: 1, scope: !464, file: !3, line: 100, type: !467)
!469 = !DILocation(line: 100, column: 38, scope: !464)
!470 = !DILocalVariable(name: "numBytes", arg: 2, scope: !464, file: !3, line: 100, type: !66)
!471 = !DILocation(line: 100, column: 52, scope: !464)
!472 = !DILocalVariable(name: "i", scope: !464, file: !3, line: 102, type: !66)
!473 = !DILocation(line: 102, column: 12, scope: !464)
!474 = !DILocation(line: 103, column: 12, scope: !475)
!475 = distinct !DILexicalBlock(scope: !464, file: !3, line: 103, column: 5)
!476 = !DILocation(line: 103, column: 10, scope: !475)
!477 = !DILocation(line: 103, column: 17, scope: !478)
!478 = distinct !DILexicalBlock(scope: !475, file: !3, line: 103, column: 5)
!479 = !DILocation(line: 103, column: 21, scope: !478)
!480 = !DILocation(line: 103, column: 19, scope: !478)
!481 = !DILocation(line: 103, column: 5, scope: !475)
!482 = !DILocation(line: 105, column: 24, scope: !483)
!483 = distinct !DILexicalBlock(scope: !478, file: !3, line: 104, column: 5)
!484 = !DILocation(line: 105, column: 30, scope: !483)
!485 = !DILocation(line: 105, column: 9, scope: !483)
!486 = !DILocation(line: 106, column: 5, scope: !483)
!487 = !DILocation(line: 103, column: 31, scope: !478)
!488 = !DILocation(line: 103, column: 5, scope: !478)
!489 = distinct !{!489, !481, !490, !491}
!490 = !DILocation(line: 106, column: 5, scope: !475)
!491 = !{!"llvm.loop.mustprogress"}
!492 = !DILocation(line: 107, column: 5, scope: !464)
!493 = !DILocation(line: 108, column: 1, scope: !464)
!494 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !495, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!495 = !DISubroutineType(types: !496)
!496 = !{!66, !467, !66, !42}
!497 = !DILocalVariable(name: "bytes", arg: 1, scope: !494, file: !3, line: 113, type: !467)
!498 = !DILocation(line: 113, column: 39, scope: !494)
!499 = !DILocalVariable(name: "numBytes", arg: 2, scope: !494, file: !3, line: 113, type: !66)
!500 = !DILocation(line: 113, column: 53, scope: !494)
!501 = !DILocalVariable(name: "hex", arg: 3, scope: !494, file: !3, line: 113, type: !42)
!502 = !DILocation(line: 113, column: 71, scope: !494)
!503 = !DILocalVariable(name: "numWritten", scope: !494, file: !3, line: 115, type: !66)
!504 = !DILocation(line: 115, column: 12, scope: !494)
!505 = !DILocation(line: 121, column: 5, scope: !494)
!506 = !DILocation(line: 121, column: 12, scope: !494)
!507 = !DILocation(line: 121, column: 25, scope: !494)
!508 = !DILocation(line: 121, column: 23, scope: !494)
!509 = !DILocation(line: 121, column: 34, scope: !494)
!510 = !DILocation(line: 121, column: 37, scope: !494)
!511 = !DILocation(line: 121, column: 67, scope: !494)
!512 = !DILocation(line: 121, column: 70, scope: !494)
!513 = !DILocation(line: 0, scope: !494)
!514 = !DILocalVariable(name: "byte", scope: !515, file: !3, line: 123, type: !23)
!515 = distinct !DILexicalBlock(scope: !494, file: !3, line: 122, column: 5)
