; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_17108CWE606_Unchecked_Loop_Condition__char_file_17161_1.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_17108CWE606_Unchecked_Loop_Condition__char_file_17161_1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @CWE606_Unchecked_Loop_Condition__char_file_17108CWE606_Unchecked_Loop_Condition__char_file_17161_1(i8* %_goodB2G_data_0, void (i32)* %opsink) #0 !dbg !9 {
entry:
  %_goodB2G_data_0.addr = alloca i8*, align 8
  %opsink.addr = alloca void (i32)*, align 8
  %_goodB2G_i_0 = alloca i32, align 4

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_17108CWE606_Unchecked_Loop_Condition__char_file_17161_1.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_090/code_gened")
!2 = !{}
!3 = !{!4}
!4 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!5 = !{i32 7, !"Dwarf Version", i32 4}
!6 = !{i32 2, !"Debug Info Version", i32 3}
!7 = !{i32 1, !"wchar_size", i32 4}
!8 = !{!"clang version 12.0.0"}
!9 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_17108CWE606_Unchecked_Loop_Condition__char_file_17161_1", scope: !1, file: !1, line: 3, type: !10, scopeLine: 4, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!10 = !DISubroutineType(types: !11)
!11 = !{null, !12, !14}
!12 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!13 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!14 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !15, size: 64)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !4}
!17 = !DILocalVariable(name: "_goodB2G_data_0", arg: 1, scope: !9, file: !1, line: 3, type: !12)
!18 = !DILocation(line: 3, column: 111, scope: !9)
!19 = !DILocalVariable(name: "opsink", arg: 2, scope: !9, file: !1, line: 3, type: !14)
!20 = !DILocation(line: 3, column: 135, scope: !9)
!21 = !DILocalVariable(name: "_goodB2G_i_0", scope: !22, file: !1, line: 6, type: !4)
!22 = distinct !DILexicalBlock(scope: !9, file: !1, line: 5, column: 3)
!23 = !DILocation(line: 6, column: 9, scope: !22)
!24 = !DILocalVariable(name: "_goodB2G_k_0", scope: !22, file: !1, line: 7, type: !4)
!25 = !DILocation(line: 7, column: 9, scope: !22)
!26 = !DILocalVariable(name: "_goodB2G_dataBuffer_0", scope: !22, file: !1, line: 8, type: !27)
!27 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 800, elements: !28)
!28 = !{!29}
!29 = !DISubrange(count: 100)
!30 = !DILocation(line: 8, column: 10, scope: !22)
!31 = !DILocation(line: 9, column: 23, scope: !22)
!32 = !DILocation(line: 9, column: 21, scope: !22)
!33 = !DILocation(line: 10, column: 23, scope: !34)
!34 = distinct !DILexicalBlock(scope: !22, file: !1, line: 10, column: 5)
!35 = !DILocation(line: 10, column: 10, scope: !34)
!36 = !DILocation(line: 10, column: 28, scope: !37)
!37 = distinct !DILexicalBlock(scope: !34, file: !1, line: 10, column: 5)
!38 = !DILocation(line: 10, column: 41, scope: !37)
!39 = !DILocation(line: 10, column: 5, scope: !34)
!40 = !DILocalVariable(name: "_goodB2G_dataLen_0", scope: !41, file: !1, line: 13, type: !43)
!41 = distinct !DILexicalBlock(scope: !42, file: !1, line: 12, column: 7)
!42 = distinct !DILexicalBlock(scope: !37, file: !1, line: 11, column: 5)
!43 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !44, line: 46, baseType: !45)
!44 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!45 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!46 = !DILocation(line: 13, column: 16, scope: !41)
!47 = !DILocation(line: 13, column: 44, scope: !41)
!48 = !DILocation(line: 13, column: 37, scope: !41)
!49 = !DILocalVariable(name: "_goodB2G_pFile_0", scope: !41, file: !1, line: 14, type: !50)
!50 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !51, size: 64)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !52, line: 7, baseType: !53)
!52 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !54, line: 49, size: 1728, elements: !55)
!54 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!55 = !{!56, !57, !58, !59, !60, !61, !62, !63, !64, !65, !66, !67, !68, !71, !73, !74, !75, !79, !81, !83, !87, !90, !92, !95, !98, !99, !101, !102, !103}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !53, file: !54, line: 51, baseType: !4, size: 32)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !53, file: !54, line: 54, baseType: !12, size: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !53, file: !54, line: 55, baseType: !12, size: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !53, file: !54, line: 56, baseType: !12, size: 64, offset: 192)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !53, file: !54, line: 57, baseType: !12, size: 64, offset: 256)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !53, file: !54, line: 58, baseType: !12, size: 64, offset: 320)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !53, file: !54, line: 59, baseType: !12, size: 64, offset: 384)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !53, file: !54, line: 60, baseType: !12, size: 64, offset: 448)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !53, file: !54, line: 61, baseType: !12, size: 64, offset: 512)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !53, file: !54, line: 64, baseType: !12, size: 64, offset: 576)
!66 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !53, file: !54, line: 65, baseType: !12, size: 64, offset: 640)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !53, file: !54, line: 66, baseType: !12, size: 64, offset: 704)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !53, file: !54, line: 68, baseType: !69, size: 64, offset: 768)
!69 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !70, size: 64)
!70 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !54, line: 36, flags: DIFlagFwdDecl)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !53, file: !54, line: 70, baseType: !72, size: 64, offset: 832)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !53, file: !54, line: 72, baseType: !4, size: 32, offset: 896)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !53, file: !54, line: 73, baseType: !4, size: 32, offset: 928)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !53, file: !54, line: 74, baseType: !76, size: 64, offset: 960)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !77, line: 152, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!78 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !53, file: !54, line: 77, baseType: !80, size: 16, offset: 1024)
!80 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !53, file: !54, line: 78, baseType: !82, size: 8, offset: 1040)
!82 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !53, file: !54, line: 79, baseType: !84, size: 8, offset: 1048)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 8, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 1)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !53, file: !54, line: 81, baseType: !88, size: 64, offset: 1088)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !89, size: 64)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !54, line: 43, baseType: null)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !53, file: !54, line: 89, baseType: !91, size: 64, offset: 1152)
!91 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !77, line: 153, baseType: !78)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !53, file: !54, line: 91, baseType: !93, size: 64, offset: 1216)
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !54, line: 37, flags: DIFlagFwdDecl)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !53, file: !54, line: 92, baseType: !96, size: 64, offset: 1280)
!96 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !97, size: 64)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !54, line: 38, flags: DIFlagFwdDecl)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !53, file: !54, line: 93, baseType: !72, size: 64, offset: 1344)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !53, file: !54, line: 94, baseType: !100, size: 64, offset: 1408)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !53, file: !54, line: 95, baseType: !43, size: 64, offset: 1472)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !53, file: !54, line: 96, baseType: !4, size: 32, offset: 1536)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !53, file: !54, line: 98, baseType: !104, size: 160, offset: 1568)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !13, size: 160, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 20)
!107 = !DILocation(line: 14, column: 15, scope: !41)
!108 = !DILocation(line: 15, column: 20, scope: !109)
!109 = distinct !DILexicalBlock(scope: !41, file: !1, line: 15, column: 13)
!110 = !DILocation(line: 15, column: 18, scope: !109)
!111 = !DILocation(line: 15, column: 40, scope: !109)
!112 = !DILocation(line: 15, column: 13, scope: !41)
!113 = !DILocation(line: 17, column: 30, scope: !114)
!114 = distinct !DILexicalBlock(scope: !109, file: !1, line: 16, column: 9)
!115 = !DILocation(line: 17, column: 28, scope: !114)
!116 = !DILocation(line: 18, column: 15, scope: !117)
!117 = distinct !DILexicalBlock(scope: !114, file: !1, line: 18, column: 15)
!118 = !DILocation(line: 18, column: 32, scope: !117)
!119 = !DILocation(line: 18, column: 15, scope: !114)
!120 = !DILocation(line: 20, column: 23, scope: !121)
!121 = distinct !DILexicalBlock(scope: !122, file: !1, line: 20, column: 17)
!122 = distinct !DILexicalBlock(scope: !117, file: !1, line: 19, column: 11)
!123 = !DILocation(line: 20, column: 41, scope: !121)
!124 = !DILocation(line: 20, column: 39, scope: !121)
!125 = !DILocation(line: 20, column: 74, scope: !121)
!126 = !DILocation(line: 20, column: 72, scope: !121)
!127 = !DILocation(line: 20, column: 61, scope: !121)
!128 = !DILocation(line: 20, column: 95, scope: !121)
!129 = !DILocation(line: 20, column: 17, scope: !121)
!130 = !DILocation(line: 20, column: 113, scope: !121)
!131 = !DILocation(line: 20, column: 17, scope: !122)
!132 = !DILocation(line: 22, column: 15, scope: !133)
!133 = distinct !DILexicalBlock(scope: !121, file: !1, line: 21, column: 13)
!134 = !DILocation(line: 23, column: 15, scope: !133)
!135 = !DILocation(line: 23, column: 31, scope: !133)
!136 = !DILocation(line: 23, column: 51, scope: !133)
!137 = !DILocation(line: 24, column: 13, scope: !133)
!138 = !DILocation(line: 26, column: 20, scope: !122)
!139 = !DILocation(line: 26, column: 13, scope: !122)
!140 = !DILocation(line: 27, column: 11, scope: !122)
!141 = !DILocation(line: 29, column: 9, scope: !114)
!142 = !DILocation(line: 32, column: 5, scope: !42)
!143 = !DILocation(line: 10, column: 58, scope: !37)
!144 = !DILocation(line: 10, column: 5, scope: !37)
!145 = distinct !{!145, !39, !146, !147}
!146 = !DILocation(line: 32, column: 5, scope: !34)
!147 = !{!"llvm.loop.mustprogress"}
!148 = !DILocation(line: 34, column: 23, scope: !149)
!149 = distinct !DILexicalBlock(scope: !22, file: !1, line: 34, column: 5)
!150 = !DILocation(line: 34, column: 10, scope: !149)
!151 = !DILocation(line: 34, column: 28, scope: !152)
!152 = distinct !DILexicalBlock(scope: !149, file: !1, line: 34, column: 5)
!153 = !DILocation(line: 34, column: 41, scope: !152)
!154 = !DILocation(line: 34, column: 5, scope: !149)
!155 = !DILocalVariable(name: "_goodB2G_i_1", scope: !156, file: !1, line: 37, type: !4)
!156 = distinct !DILexicalBlock(scope: !157, file: !1, line: 36, column: 7)
!157 = distinct !DILexicalBlock(scope: !152, file: !1, line: 35, column: 5)
!158 = !DILocation(line: 37, column: 13, scope: !156)
!159 = !DILocalVariable(name: "_goodB2G_n_0", scope: !156, file: !1, line: 38, type: !4)
!160 = !DILocation(line: 38, column: 13, scope: !156)
!161 = !DILocalVariable(name: "_goodB2G_intVariable_0", scope: !156, file: !1, line: 39, type: !4)
!162 = !DILocation(line: 39, column: 13, scope: !156)
!163 = !DILocation(line: 40, column: 20, scope: !164)
!164 = distinct !DILexicalBlock(scope: !156, file: !1, line: 40, column: 13)
!165 = !DILocation(line: 40, column: 13, scope: !164)
!166 = !DILocation(line: 40, column: 58, scope: !164)
!167 = !DILocation(line: 40, column: 13, scope: !156)
!168 = !DILocation(line: 42, column: 15, scope: !169)
!169 = distinct !DILexicalBlock(scope: !170, file: !1, line: 42, column: 15)
