; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_03.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_012/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_03_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 12, scope: !52)
!57 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 36, type: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !59)
!59 = !{!60}
!60 = !DISubrange(count: 100)
!61 = !DILocation(line: 36, column: 10, scope: !52)
!62 = !DILocation(line: 37, column: 12, scope: !52)
!63 = !DILocation(line: 37, column: 10, scope: !52)
!64 = !DILocalVariable(name: "dataLen", scope: !65, file: !45, line: 42, type: !68)
!65 = distinct !DILexicalBlock(scope: !66, file: !45, line: 40, column: 9)
!66 = distinct !DILexicalBlock(scope: !67, file: !45, line: 39, column: 5)
!67 = distinct !DILexicalBlock(scope: !52, file: !45, line: 38, column: 8)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 42, column: 20, scope: !65)
!72 = !DILocation(line: 42, column: 37, scope: !65)
!73 = !DILocation(line: 42, column: 30, scope: !65)
!74 = !DILocalVariable(name: "pFile", scope: !65, file: !45, line: 43, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !23, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !42, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !42, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !42, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !42, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !42, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !42, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !42, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !42, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !42, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !42, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !23, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !23, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !24, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !22, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !23, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 43, column: 20, scope: !65)
!131 = !DILocation(line: 45, column: 21, scope: !132)
!132 = distinct !DILexicalBlock(scope: !65, file: !45, line: 45, column: 17)
!133 = !DILocation(line: 45, column: 20, scope: !132)
!134 = !DILocation(line: 45, column: 29, scope: !132)
!135 = !DILocation(line: 45, column: 17, scope: !65)
!136 = !DILocation(line: 47, column: 25, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !45, line: 46, column: 13)
!138 = !DILocation(line: 47, column: 23, scope: !137)
!139 = !DILocation(line: 48, column: 21, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !45, line: 48, column: 21)
!141 = !DILocation(line: 48, column: 27, scope: !140)
!142 = !DILocation(line: 48, column: 21, scope: !137)
!143 = !DILocation(line: 51, column: 31, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !45, line: 51, column: 25)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 49, column: 17)
!146 = !DILocation(line: 51, column: 36, scope: !144)
!147 = !DILocation(line: 51, column: 35, scope: !144)
!148 = !DILocation(line: 51, column: 55, scope: !144)
!149 = !DILocation(line: 51, column: 54, scope: !144)
!150 = !DILocation(line: 51, column: 45, scope: !144)
!151 = !DILocation(line: 51, column: 65, scope: !144)
!152 = !DILocation(line: 51, column: 25, scope: !144)
!153 = !DILocation(line: 51, column: 72, scope: !144)
!154 = !DILocation(line: 51, column: 25, scope: !145)
!155 = !DILocation(line: 53, column: 25, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !45, line: 52, column: 21)
!157 = !DILocation(line: 55, column: 25, scope: !156)
!158 = !DILocation(line: 55, column: 30, scope: !156)
!159 = !DILocation(line: 55, column: 39, scope: !156)
!160 = !DILocation(line: 56, column: 21, scope: !156)
!161 = !DILocation(line: 57, column: 28, scope: !145)
!162 = !DILocation(line: 57, column: 21, scope: !145)
!163 = !DILocation(line: 58, column: 17, scope: !145)
!164 = !DILocation(line: 59, column: 13, scope: !137)
!165 = !DILocation(line: 65, column: 16, scope: !166)
!166 = distinct !DILexicalBlock(scope: !167, file: !45, line: 63, column: 5)
!167 = distinct !DILexicalBlock(scope: !52, file: !45, line: 62, column: 8)
!168 = !DILocation(line: 65, column: 9, scope: !166)
!169 = !DILocation(line: 67, column: 1, scope: !52)
!170 = distinct !DISubprogram(name: "goodB2G1", scope: !45, file: !45, line: 74, type: !53, scopeLine: 75, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!171 = !DILocalVariable(name: "data", scope: !170, file: !45, line: 76, type: !42)
!172 = !DILocation(line: 76, column: 12, scope: !170)
!173 = !DILocalVariable(name: "dataBuffer", scope: !170, file: !45, line: 77, type: !58)
!174 = !DILocation(line: 77, column: 10, scope: !170)
!175 = !DILocation(line: 78, column: 12, scope: !170)
!176 = !DILocation(line: 78, column: 10, scope: !170)
!177 = !DILocalVariable(name: "dataLen", scope: !178, file: !45, line: 83, type: !68)
!178 = distinct !DILexicalBlock(scope: !179, file: !45, line: 81, column: 9)
!179 = distinct !DILexicalBlock(scope: !180, file: !45, line: 80, column: 5)
!180 = distinct !DILexicalBlock(scope: !170, file: !45, line: 79, column: 8)
!181 = !DILocation(line: 83, column: 20, scope: !178)
!182 = !DILocation(line: 83, column: 37, scope: !178)
!183 = !DILocation(line: 83, column: 30, scope: !178)
!184 = !DILocalVariable(name: "pFile", scope: !178, file: !45, line: 84, type: !75)
!185 = !DILocation(line: 84, column: 20, scope: !178)
!186 = !DILocation(line: 86, column: 21, scope: !187)
!187 = distinct !DILexicalBlock(scope: !178, file: !45, line: 86, column: 17)
!188 = !DILocation(line: 86, column: 20, scope: !187)
!189 = !DILocation(line: 86, column: 29, scope: !187)
!190 = !DILocation(line: 86, column: 17, scope: !178)
!191 = !DILocation(line: 88, column: 25, scope: !192)
!192 = distinct !DILexicalBlock(scope: !187, file: !45, line: 87, column: 13)
!193 = !DILocation(line: 88, column: 23, scope: !192)
!194 = !DILocation(line: 89, column: 21, scope: !195)
!195 = distinct !DILexicalBlock(scope: !192, file: !45, line: 89, column: 21)
!196 = !DILocation(line: 89, column: 27, scope: !195)
!197 = !DILocation(line: 89, column: 21, scope: !192)
!198 = !DILocation(line: 92, column: 31, scope: !199)
!199 = distinct !DILexicalBlock(scope: !200, file: !45, line: 92, column: 25)
!200 = distinct !DILexicalBlock(scope: !195, file: !45, line: 90, column: 17)
!201 = !DILocation(line: 92, column: 36, scope: !199)
!202 = !DILocation(line: 92, column: 35, scope: !199)
!203 = !DILocation(line: 92, column: 55, scope: !199)
!204 = !DILocation(line: 92, column: 54, scope: !199)
!205 = !DILocation(line: 92, column: 45, scope: !199)
!206 = !DILocation(line: 92, column: 65, scope: !199)
!207 = !DILocation(line: 92, column: 25, scope: !199)
!208 = !DILocation(line: 92, column: 72, scope: !199)
!209 = !DILocation(line: 92, column: 25, scope: !200)
!210 = !DILocation(line: 94, column: 25, scope: !211)
!211 = distinct !DILexicalBlock(scope: !199, file: !45, line: 93, column: 21)
!212 = !DILocation(line: 96, column: 25, scope: !211)
!213 = !DILocation(line: 96, column: 30, scope: !211)
!214 = !DILocation(line: 96, column: 39, scope: !211)
!215 = !DILocation(line: 97, column: 21, scope: !211)
!216 = !DILocation(line: 98, column: 28, scope: !200)
!217 = !DILocation(line: 98, column: 21, scope: !200)
!218 = !DILocation(line: 99, column: 17, scope: !200)
!219 = !DILocation(line: 100, column: 13, scope: !192)
!220 = !DILocation(line: 111, column: 24, scope: !221)
!221 = distinct !DILexicalBlock(scope: !222, file: !45, line: 109, column: 5)
!222 = distinct !DILexicalBlock(scope: !170, file: !45, line: 103, column: 8)
!223 = !DILocation(line: 111, column: 9, scope: !221)
!224 = !DILocation(line: 113, column: 1, scope: !170)
!225 = distinct !DISubprogram(name: "goodB2G2", scope: !45, file: !45, line: 116, type: !53, scopeLine: 117, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!226 = !DILocalVariable(name: "data", scope: !225, file: !45, line: 118, type: !42)
!227 = !DILocation(line: 118, column: 12, scope: !225)
!228 = !DILocalVariable(name: "dataBuffer", scope: !225, file: !45, line: 119, type: !58)
!229 = !DILocation(line: 119, column: 10, scope: !225)
!230 = !DILocation(line: 120, column: 12, scope: !225)
!231 = !DILocation(line: 120, column: 10, scope: !225)
!232 = !DILocalVariable(name: "dataLen", scope: !233, file: !45, line: 125, type: !68)
!233 = distinct !DILexicalBlock(scope: !234, file: !45, line: 123, column: 9)
!234 = distinct !DILexicalBlock(scope: !235, file: !45, line: 122, column: 5)
!235 = distinct !DILexicalBlock(scope: !225, file: !45, line: 121, column: 8)
!236 = !DILocation(line: 125, column: 20, scope: !233)
!237 = !DILocation(line: 125, column: 37, scope: !233)
!238 = !DILocation(line: 125, column: 30, scope: !233)
!239 = !DILocalVariable(name: "pFile", scope: !233, file: !45, line: 126, type: !75)
!240 = !DILocation(line: 126, column: 20, scope: !233)
!241 = !DILocation(line: 128, column: 21, scope: !242)
!242 = distinct !DILexicalBlock(scope: !233, file: !45, line: 128, column: 17)
!243 = !DILocation(line: 128, column: 20, scope: !242)
!244 = !DILocation(line: 128, column: 29, scope: !242)
!245 = !DILocation(line: 128, column: 17, scope: !233)
!246 = !DILocation(line: 130, column: 25, scope: !247)
!247 = distinct !DILexicalBlock(scope: !242, file: !45, line: 129, column: 13)
!248 = !DILocation(line: 130, column: 23, scope: !247)
!249 = !DILocation(line: 131, column: 21, scope: !250)
!250 = distinct !DILexicalBlock(scope: !247, file: !45, line: 131, column: 21)
!251 = !DILocation(line: 131, column: 27, scope: !250)
!252 = !DILocation(line: 131, column: 21, scope: !247)
!253 = !DILocation(line: 134, column: 31, scope: !254)
!254 = distinct !DILexicalBlock(scope: !255, file: !45, line: 134, column: 25)
!255 = distinct !DILexicalBlock(scope: !250, file: !45, line: 132, column: 17)
!256 = !DILocation(line: 134, column: 36, scope: !254)
!257 = !DILocation(line: 134, column: 35, scope: !254)
!258 = !DILocation(line: 134, column: 55, scope: !254)
!259 = !DILocation(line: 134, column: 54, scope: !254)
!260 = !DILocation(line: 134, column: 45, scope: !254)
!261 = !DILocation(line: 134, column: 65, scope: !254)
!262 = !DILocation(line: 134, column: 25, scope: !254)
!263 = !DILocation(line: 134, column: 72, scope: !254)
!264 = !DILocation(line: 134, column: 25, scope: !255)
!265 = !DILocation(line: 136, column: 25, scope: !266)
!266 = distinct !DILexicalBlock(scope: !254, file: !45, line: 135, column: 21)
!267 = !DILocation(line: 138, column: 25, scope: !266)
!268 = !DILocation(line: 138, column: 30, scope: !266)
!269 = !DILocation(line: 138, column: 39, scope: !266)
!270 = !DILocation(line: 139, column: 21, scope: !266)
!271 = !DILocation(line: 140, column: 28, scope: !255)
!272 = !DILocation(line: 140, column: 21, scope: !255)
!273 = !DILocation(line: 141, column: 17, scope: !255)
!274 = !DILocation(line: 142, column: 13, scope: !247)
!275 = !DILocation(line: 148, column: 24, scope: !276)
!276 = distinct !DILexicalBlock(scope: !277, file: !45, line: 146, column: 5)
!277 = distinct !DILexicalBlock(scope: !225, file: !45, line: 145, column: 8)
!278 = !DILocation(line: 148, column: 9, scope: !276)
!279 = !DILocation(line: 150, column: 1, scope: !225)
!280 = distinct !DISubprogram(name: "goodG2B1", scope: !45, file: !45, line: 153, type: !53, scopeLine: 154, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!281 = !DILocalVariable(name: "data", scope: !280, file: !45, line: 155, type: !42)
!282 = !DILocation(line: 155, column: 12, scope: !280)
!283 = !DILocalVariable(name: "dataBuffer", scope: !280, file: !45, line: 156, type: !58)
!284 = !DILocation(line: 156, column: 10, scope: !280)
!285 = !DILocation(line: 157, column: 12, scope: !280)
!286 = !DILocation(line: 157, column: 10, scope: !280)
!287 = !DILocation(line: 166, column: 16, scope: !288)
!288 = distinct !DILexicalBlock(scope: !289, file: !45, line: 164, column: 5)
!289 = distinct !DILexicalBlock(scope: !280, file: !45, line: 158, column: 8)
!290 = !DILocation(line: 166, column: 9, scope: !288)
!291 = !DILocation(line: 171, column: 16, scope: !292)
!292 = distinct !DILexicalBlock(scope: !293, file: !45, line: 169, column: 5)
!293 = distinct !DILexicalBlock(scope: !280, file: !45, line: 168, column: 8)
!294 = !DILocation(line: 171, column: 9, scope: !292)
!295 = !DILocation(line: 173, column: 1, scope: !280)
!296 = distinct !DISubprogram(name: "goodG2B2", scope: !45, file: !45, line: 176, type: !53, scopeLine: 177, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!297 = !DILocalVariable(name: "data", scope: !296, file: !45, line: 178, type: !42)
!298 = !DILocation(line: 178, column: 12, scope: !296)
!299 = !DILocalVariable(name: "dataBuffer", scope: !296, file: !45, line: 179, type: !58)
!300 = !DILocation(line: 179, column: 10, scope: !296)
!301 = !DILocation(line: 180, column: 12, scope: !296)
!302 = !DILocation(line: 180, column: 10, scope: !296)
!303 = !DILocation(line: 184, column: 16, scope: !304)
!304 = distinct !DILexicalBlock(scope: !305, file: !45, line: 182, column: 5)
!305 = distinct !DILexicalBlock(scope: !296, file: !45, line: 181, column: 8)
!306 = !DILocation(line: 184, column: 9, scope: !304)
!307 = !DILocation(line: 189, column: 16, scope: !308)
!308 = distinct !DILexicalBlock(scope: !309, file: !45, line: 187, column: 5)
!309 = distinct !DILexicalBlock(scope: !296, file: !45, line: 186, column: 8)
!310 = !DILocation(line: 189, column: 9, scope: !308)
!311 = !DILocation(line: 191, column: 1, scope: !296)
!312 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_03_good", scope: !45, file: !45, line: 193, type: !53, scopeLine: 194, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!313 = !DILocation(line: 195, column: 5, scope: !312)
!314 = !DILocation(line: 196, column: 5, scope: !312)
!315 = !DILocation(line: 197, column: 5, scope: !312)
!316 = !DILocation(line: 198, column: 5, scope: !312)
!317 = !DILocation(line: 199, column: 1, scope: !312)
!318 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !319, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!319 = !DISubroutineType(types: !320)
!320 = !{null, !42}
!321 = !DILocalVariable(name: "line", arg: 1, scope: !318, file: !3, line: 11, type: !42)
!322 = !DILocation(line: 11, column: 25, scope: !318)
!323 = !DILocation(line: 13, column: 1, scope: !318)
!324 = !DILocation(line: 14, column: 8, scope: !325)
!325 = distinct !DILexicalBlock(scope: !318, file: !3, line: 14, column: 8)
!326 = !DILocation(line: 14, column: 13, scope: !325)
!327 = !DILocation(line: 14, column: 8, scope: !318)
!328 = !DILocation(line: 16, column: 24, scope: !329)
!329 = distinct !DILexicalBlock(scope: !325, file: !3, line: 15, column: 5)
!330 = !DILocation(line: 16, column: 9, scope: !329)
!331 = !DILocation(line: 17, column: 5, scope: !329)
!332 = !DILocation(line: 18, column: 5, scope: !318)
!333 = !DILocation(line: 19, column: 1, scope: !318)
!334 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !319, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!335 = !DILocalVariable(name: "line", arg: 1, scope: !334, file: !3, line: 20, type: !42)
!336 = !DILocation(line: 20, column: 29, scope: !334)
!337 = !DILocation(line: 22, column: 8, scope: !338)
!338 = distinct !DILexicalBlock(scope: !334, file: !3, line: 22, column: 8)
!339 = !DILocation(line: 22, column: 13, scope: !338)
!340 = !DILocation(line: 22, column: 8, scope: !334)
!341 = !DILocation(line: 24, column: 24, scope: !342)
!342 = distinct !DILexicalBlock(scope: !338, file: !3, line: 23, column: 5)
!343 = !DILocation(line: 24, column: 9, scope: !342)
!344 = !DILocation(line: 25, column: 5, scope: !342)
!345 = !DILocation(line: 26, column: 1, scope: !334)
!346 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !347, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !349}
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64)
!350 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !23)
!351 = !DILocalVariable(name: "line", arg: 1, scope: !346, file: !3, line: 27, type: !349)
!352 = !DILocation(line: 27, column: 29, scope: !346)
!353 = !DILocation(line: 29, column: 8, scope: !354)
!354 = distinct !DILexicalBlock(scope: !346, file: !3, line: 29, column: 8)
!355 = !DILocation(line: 29, column: 13, scope: !354)
!356 = !DILocation(line: 29, column: 8, scope: !346)
!357 = !DILocation(line: 31, column: 27, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !3, line: 30, column: 5)
!359 = !DILocation(line: 31, column: 9, scope: !358)
!360 = !DILocation(line: 32, column: 5, scope: !358)
!361 = !DILocation(line: 33, column: 1, scope: !346)
!362 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !363, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!363 = !DISubroutineType(types: !364)
!364 = !{null, !23}
!365 = !DILocalVariable(name: "intNumber", arg: 1, scope: !362, file: !3, line: 35, type: !23)
!366 = !DILocation(line: 35, column: 24, scope: !362)
!367 = !DILocation(line: 37, column: 20, scope: !362)
!368 = !DILocation(line: 37, column: 5, scope: !362)
!369 = !DILocation(line: 38, column: 1, scope: !362)
!370 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !371, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!371 = !DISubroutineType(types: !372)
!372 = !{null, !373}
!373 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!374 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !370, file: !3, line: 40, type: !373)
!375 = !DILocation(line: 40, column: 28, scope: !370)
!376 = !DILocation(line: 42, column: 21, scope: !370)
!377 = !DILocation(line: 42, column: 5, scope: !370)
!378 = !DILocation(line: 43, column: 1, scope: !370)
!379 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !380, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!380 = !DISubroutineType(types: !381)
!381 = !{null, !382}
!382 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!383 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !379, file: !3, line: 45, type: !382)
!384 = !DILocation(line: 45, column: 28, scope: !379)
!385 = !DILocation(line: 47, column: 20, scope: !379)
!386 = !DILocation(line: 47, column: 5, scope: !379)
!387 = !DILocation(line: 48, column: 1, scope: !379)
!388 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !389, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !103}
!391 = !DILocalVariable(name: "longNumber", arg: 1, scope: !388, file: !3, line: 50, type: !103)
!392 = !DILocation(line: 50, column: 26, scope: !388)
!393 = !DILocation(line: 52, column: 21, scope: !388)
!394 = !DILocation(line: 52, column: 5, scope: !388)
!395 = !DILocation(line: 53, column: 1, scope: !388)
!396 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !397, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!397 = !DISubroutineType(types: !398)
!398 = !{null, !399}
!399 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !400, line: 27, baseType: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 44, baseType: !103)
!402 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !396, file: !3, line: 55, type: !399)
!403 = !DILocation(line: 55, column: 33, scope: !396)
!404 = !DILocation(line: 57, column: 29, scope: !396)
!405 = !DILocation(line: 57, column: 5, scope: !396)
!406 = !DILocation(line: 58, column: 1, scope: !396)
!407 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !408, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !68}
!410 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !407, file: !3, line: 60, type: !68)
!411 = !DILocation(line: 60, column: 29, scope: !407)
!412 = !DILocation(line: 62, column: 21, scope: !407)
!413 = !DILocation(line: 62, column: 5, scope: !407)
!414 = !DILocation(line: 63, column: 1, scope: !407)
!415 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !416, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !43}
!418 = !DILocalVariable(name: "charHex", arg: 1, scope: !415, file: !3, line: 65, type: !43)
!419 = !DILocation(line: 65, column: 29, scope: !415)
!420 = !DILocation(line: 67, column: 22, scope: !415)
!421 = !DILocation(line: 67, column: 5, scope: !415)
!422 = !DILocation(line: 68, column: 1, scope: !415)
!423 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !424, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!424 = !DISubroutineType(types: !425)
!425 = !{null, !350}
!426 = !DILocalVariable(name: "wideChar", arg: 1, scope: !423, file: !3, line: 70, type: !350)
!427 = !DILocation(line: 70, column: 29, scope: !423)
!428 = !DILocalVariable(name: "s", scope: !423, file: !3, line: 74, type: !429)
!429 = !DICompositeType(tag: DW_TAG_array_type, baseType: !350, size: 64, elements: !430)
!430 = !{!431}
!431 = !DISubrange(count: 2)
!432 = !DILocation(line: 74, column: 13, scope: !423)
!433 = !DILocation(line: 75, column: 16, scope: !423)
!434 = !DILocation(line: 75, column: 9, scope: !423)
!435 = !DILocation(line: 75, column: 14, scope: !423)
!436 = !DILocation(line: 76, column: 9, scope: !423)
!437 = !DILocation(line: 76, column: 14, scope: !423)
!438 = !DILocation(line: 77, column: 21, scope: !423)
!439 = !DILocation(line: 77, column: 5, scope: !423)
!440 = !DILocation(line: 78, column: 1, scope: !423)
!441 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !442, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !7}
!444 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !441, file: !3, line: 80, type: !7)
!445 = !DILocation(line: 80, column: 33, scope: !441)
!446 = !DILocation(line: 82, column: 20, scope: !441)
!447 = !DILocation(line: 82, column: 5, scope: !441)
!448 = !DILocation(line: 83, column: 1, scope: !441)
!449 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !450, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!450 = !DISubroutineType(types: !451)
!451 = !{null, !25}
!452 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !449, file: !3, line: 85, type: !25)
!453 = !DILocation(line: 85, column: 45, scope: !449)
!454 = !DILocation(line: 87, column: 22, scope: !449)
!455 = !DILocation(line: 87, column: 5, scope: !449)
!456 = !DILocation(line: 88, column: 1, scope: !449)
!457 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !458, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!458 = !DISubroutineType(types: !459)
!459 = !{null, !460}
!460 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!461 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !457, file: !3, line: 90, type: !460)
!462 = !DILocation(line: 90, column: 29, scope: !457)
!463 = !DILocation(line: 92, column: 20, scope: !457)
!464 = !DILocation(line: 92, column: 5, scope: !457)
!465 = !DILocation(line: 93, column: 1, scope: !457)
!466 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !467, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!467 = !DISubroutineType(types: !468)
!468 = !{null, !469}
!469 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !470, size: 64)
!470 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !471, line: 100, baseType: !472)
!471 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_012/source_code")
!472 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !471, line: 96, size: 64, elements: !473)
!473 = !{!474, !475}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !472, file: !471, line: 98, baseType: !23, size: 32)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !472, file: !471, line: 99, baseType: !23, size: 32, offset: 32)
!476 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !466, file: !3, line: 95, type: !469)
!477 = !DILocation(line: 95, column: 40, scope: !466)
!478 = !DILocation(line: 97, column: 26, scope: !466)
!479 = !DILocation(line: 97, column: 47, scope: !466)
!480 = !DILocation(line: 97, column: 55, scope: !466)
!481 = !DILocation(line: 97, column: 76, scope: !466)
!482 = !DILocation(line: 97, column: 5, scope: !466)
!483 = !DILocation(line: 98, column: 1, scope: !466)
!484 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !485, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487, !68}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!488 = !DILocalVariable(name: "bytes", arg: 1, scope: !484, file: !3, line: 100, type: !487)
!489 = !DILocation(line: 100, column: 38, scope: !484)
!490 = !DILocalVariable(name: "numBytes", arg: 2, scope: !484, file: !3, line: 100, type: !68)
!491 = !DILocation(line: 100, column: 52, scope: !484)
!492 = !DILocalVariable(name: "i", scope: !484, file: !3, line: 102, type: !68)
!493 = !DILocation(line: 102, column: 12, scope: !484)
!494 = !DILocation(line: 103, column: 12, scope: !495)
!495 = distinct !DILexicalBlock(scope: !484, file: !3, line: 103, column: 5)
!496 = !DILocation(line: 103, column: 10, scope: !495)
!497 = !DILocation(line: 103, column: 17, scope: !498)
!498 = distinct !DILexicalBlock(scope: !495, file: !3, line: 103, column: 5)
!499 = !DILocation(line: 103, column: 21, scope: !498)
!500 = !DILocation(line: 103, column: 19, scope: !498)
!501 = !DILocation(line: 103, column: 5, scope: !495)
!502 = !DILocation(line: 105, column: 24, scope: !503)
!503 = distinct !DILexicalBlock(scope: !498, file: !3, line: 104, column: 5)
!504 = !DILocation(line: 105, column: 30, scope: !503)
!505 = !DILocation(line: 105, column: 9, scope: !503)
!506 = !DILocation(line: 106, column: 5, scope: !503)
!507 = !DILocation(line: 103, column: 31, scope: !498)
!508 = !DILocation(line: 103, column: 5, scope: !498)
!509 = distinct !{!509, !501, !510, !511}
!510 = !DILocation(line: 106, column: 5, scope: !495)
!511 = !{!"llvm.loop.mustprogress"}
!512 = !DILocation(line: 107, column: 5, scope: !484)
!513 = !DILocation(line: 108, column: 1, scope: !484)
!514 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !515, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!515 = !DISubroutineType(types: !516)
!516 = !{!68, !487, !68, !42}
!517 = !DILocalVariable(name: "bytes", arg: 1, scope: !514, file: !3, line: 113, type: !487)
!518 = !DILocation(line: 113, column: 39, scope: !514)
!519 = !DILocalVariable(name: "numBytes", arg: 2, scope: !514, file: !3, line: 113, type: !68)
!520 = !DILocation(line: 113, column: 53, scope: !514)
!521 = !DILocalVariable(name: "hex", arg: 3, scope: !514, file: !3, line: 113, type: !42)
!522 = !DILocation(line: 113, column: 71, scope: !514)
!523 = !DILocalVariable(name: "numWritten", scope: !514, file: !3, line: 115, type: !68)
!524 = !DILocation(line: 115, column: 12, scope: !514)
!525 = !DILocation(line: 121, column: 5, scope: !514)
!526 = !DILocation(line: 121, column: 12, scope: !514)
!527 = !DILocation(line: 121, column: 25, scope: !514)
!528 = !DILocation(line: 121, column: 23, scope: !514)
!529 = !DILocation(line: 121, column: 34, scope: !514)
!530 = !DILocation(line: 121, column: 37, scope: !514)
!531 = !DILocation(line: 121, column: 67, scope: !514)
!532 = !DILocation(line: 121, column: 70, scope: !514)
!533 = !DILocation(line: 0, scope: !514)
!534 = !DILocalVariable(name: "byte", scope: !535, file: !3, line: 123, type: !23)
!535 = distinct !DILexicalBlock(scope: !514, file: !3, line: 122, column: 5)
