; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_51a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_103/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_51b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_103/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_51_bad", scope: !45, file: !45, line: 37, type: !55, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 39, type: !42)
!58 = !DILocation(line: 39, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 40, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 100)
!63 = !DILocation(line: 40, column: 10, scope: !54)
!64 = !DILocation(line: 41, column: 12, scope: !54)
!65 = !DILocation(line: 41, column: 10, scope: !54)
!66 = !DILocalVariable(name: "dataLen", scope: !67, file: !45, line: 44, type: !68)
!67 = distinct !DILexicalBlock(scope: !54, file: !45, line: 42, column: 5)
!68 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !69, line: 46, baseType: !70)
!69 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!70 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!71 = !DILocation(line: 44, column: 16, scope: !67)
!72 = !DILocation(line: 44, column: 33, scope: !67)
!73 = !DILocation(line: 44, column: 26, scope: !67)
!74 = !DILocalVariable(name: "pFile", scope: !67, file: !45, line: 45, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !124, !125, !126}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !23, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !42, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !42, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !42, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !42, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !42, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !42, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !42, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !42, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !42, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !42, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !42, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !23, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !23, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !24, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !22, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !68, size: 64, offset: 1472)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !23, size: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !127, size: 160, offset: 1568)
!127 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !128)
!128 = !{!129}
!129 = !DISubrange(count: 20)
!130 = !DILocation(line: 45, column: 16, scope: !67)
!131 = !DILocation(line: 47, column: 17, scope: !132)
!132 = distinct !DILexicalBlock(scope: !67, file: !45, line: 47, column: 13)
!133 = !DILocation(line: 47, column: 16, scope: !132)
!134 = !DILocation(line: 47, column: 25, scope: !132)
!135 = !DILocation(line: 47, column: 13, scope: !67)
!136 = !DILocation(line: 49, column: 21, scope: !137)
!137 = distinct !DILexicalBlock(scope: !132, file: !45, line: 48, column: 9)
!138 = !DILocation(line: 49, column: 19, scope: !137)
!139 = !DILocation(line: 50, column: 17, scope: !140)
!140 = distinct !DILexicalBlock(scope: !137, file: !45, line: 50, column: 17)
!141 = !DILocation(line: 50, column: 23, scope: !140)
!142 = !DILocation(line: 50, column: 17, scope: !137)
!143 = !DILocation(line: 53, column: 27, scope: !144)
!144 = distinct !DILexicalBlock(scope: !145, file: !45, line: 53, column: 21)
!145 = distinct !DILexicalBlock(scope: !140, file: !45, line: 51, column: 13)
!146 = !DILocation(line: 53, column: 32, scope: !144)
!147 = !DILocation(line: 53, column: 31, scope: !144)
!148 = !DILocation(line: 53, column: 51, scope: !144)
!149 = !DILocation(line: 53, column: 50, scope: !144)
!150 = !DILocation(line: 53, column: 41, scope: !144)
!151 = !DILocation(line: 53, column: 61, scope: !144)
!152 = !DILocation(line: 53, column: 21, scope: !144)
!153 = !DILocation(line: 53, column: 68, scope: !144)
!154 = !DILocation(line: 53, column: 21, scope: !145)
!155 = !DILocation(line: 55, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !144, file: !45, line: 54, column: 17)
!157 = !DILocation(line: 57, column: 21, scope: !156)
!158 = !DILocation(line: 57, column: 26, scope: !156)
!159 = !DILocation(line: 57, column: 35, scope: !156)
!160 = !DILocation(line: 58, column: 17, scope: !156)
!161 = !DILocation(line: 59, column: 24, scope: !145)
!162 = !DILocation(line: 59, column: 17, scope: !145)
!163 = !DILocation(line: 60, column: 13, scope: !145)
!164 = !DILocation(line: 61, column: 9, scope: !137)
!165 = !DILocation(line: 63, column: 60, scope: !54)
!166 = !DILocation(line: 63, column: 5, scope: !54)
!167 = !DILocation(line: 64, column: 1, scope: !54)
!168 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 72, type: !55, scopeLine: 73, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!169 = !DILocalVariable(name: "data", scope: !168, file: !45, line: 74, type: !42)
!170 = !DILocation(line: 74, column: 12, scope: !168)
!171 = !DILocalVariable(name: "dataBuffer", scope: !168, file: !45, line: 75, type: !60)
!172 = !DILocation(line: 75, column: 10, scope: !168)
!173 = !DILocation(line: 76, column: 12, scope: !168)
!174 = !DILocation(line: 76, column: 10, scope: !168)
!175 = !DILocation(line: 78, column: 12, scope: !168)
!176 = !DILocation(line: 78, column: 5, scope: !168)
!177 = !DILocation(line: 79, column: 64, scope: !168)
!178 = !DILocation(line: 79, column: 5, scope: !168)
!179 = !DILocation(line: 80, column: 1, scope: !168)
!180 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 84, type: !55, scopeLine: 85, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!181 = !DILocalVariable(name: "data", scope: !180, file: !45, line: 86, type: !42)
!182 = !DILocation(line: 86, column: 12, scope: !180)
!183 = !DILocalVariable(name: "dataBuffer", scope: !180, file: !45, line: 87, type: !60)
!184 = !DILocation(line: 87, column: 10, scope: !180)
!185 = !DILocation(line: 88, column: 12, scope: !180)
!186 = !DILocation(line: 88, column: 10, scope: !180)
!187 = !DILocalVariable(name: "dataLen", scope: !188, file: !45, line: 91, type: !68)
!188 = distinct !DILexicalBlock(scope: !180, file: !45, line: 89, column: 5)
!189 = !DILocation(line: 91, column: 16, scope: !188)
!190 = !DILocation(line: 91, column: 33, scope: !188)
!191 = !DILocation(line: 91, column: 26, scope: !188)
!192 = !DILocalVariable(name: "pFile", scope: !188, file: !45, line: 92, type: !75)
!193 = !DILocation(line: 92, column: 16, scope: !188)
!194 = !DILocation(line: 94, column: 17, scope: !195)
!195 = distinct !DILexicalBlock(scope: !188, file: !45, line: 94, column: 13)
!196 = !DILocation(line: 94, column: 16, scope: !195)
!197 = !DILocation(line: 94, column: 25, scope: !195)
!198 = !DILocation(line: 94, column: 13, scope: !188)
!199 = !DILocation(line: 96, column: 21, scope: !200)
!200 = distinct !DILexicalBlock(scope: !195, file: !45, line: 95, column: 9)
!201 = !DILocation(line: 96, column: 19, scope: !200)
!202 = !DILocation(line: 97, column: 17, scope: !203)
!203 = distinct !DILexicalBlock(scope: !200, file: !45, line: 97, column: 17)
!204 = !DILocation(line: 97, column: 23, scope: !203)
!205 = !DILocation(line: 97, column: 17, scope: !200)
!206 = !DILocation(line: 100, column: 27, scope: !207)
!207 = distinct !DILexicalBlock(scope: !208, file: !45, line: 100, column: 21)
!208 = distinct !DILexicalBlock(scope: !203, file: !45, line: 98, column: 13)
!209 = !DILocation(line: 100, column: 32, scope: !207)
!210 = !DILocation(line: 100, column: 31, scope: !207)
!211 = !DILocation(line: 100, column: 51, scope: !207)
!212 = !DILocation(line: 100, column: 50, scope: !207)
!213 = !DILocation(line: 100, column: 41, scope: !207)
!214 = !DILocation(line: 100, column: 61, scope: !207)
!215 = !DILocation(line: 100, column: 21, scope: !207)
!216 = !DILocation(line: 100, column: 68, scope: !207)
!217 = !DILocation(line: 100, column: 21, scope: !208)
!218 = !DILocation(line: 102, column: 21, scope: !219)
!219 = distinct !DILexicalBlock(scope: !207, file: !45, line: 101, column: 17)
!220 = !DILocation(line: 104, column: 21, scope: !219)
!221 = !DILocation(line: 104, column: 26, scope: !219)
!222 = !DILocation(line: 104, column: 35, scope: !219)
!223 = !DILocation(line: 105, column: 17, scope: !219)
!224 = !DILocation(line: 106, column: 24, scope: !208)
!225 = !DILocation(line: 106, column: 17, scope: !208)
!226 = !DILocation(line: 107, column: 13, scope: !208)
!227 = !DILocation(line: 108, column: 9, scope: !200)
!228 = !DILocation(line: 110, column: 64, scope: !180)
!229 = !DILocation(line: 110, column: 5, scope: !180)
!230 = !DILocation(line: 111, column: 1, scope: !180)
!231 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_51_good", scope: !45, file: !45, line: 113, type: !55, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!232 = !DILocation(line: 115, column: 5, scope: !231)
!233 = !DILocation(line: 116, column: 5, scope: !231)
!234 = !DILocation(line: 117, column: 1, scope: !231)
!235 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_51b_badSink", scope: !49, file: !49, line: 34, type: !236, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!236 = !DISubroutineType(types: !237)
!237 = !{null, !42}
!238 = !DILocalVariable(name: "data", arg: 1, scope: !235, file: !49, line: 34, type: !42)
!239 = !DILocation(line: 34, column: 68, scope: !235)
!240 = !DILocalVariable(name: "i", scope: !241, file: !49, line: 37, type: !23)
!241 = distinct !DILexicalBlock(scope: !235, file: !49, line: 36, column: 5)
!242 = !DILocation(line: 37, column: 13, scope: !241)
!243 = !DILocalVariable(name: "n", scope: !241, file: !49, line: 37, type: !23)
!244 = !DILocation(line: 37, column: 16, scope: !241)
!245 = !DILocalVariable(name: "intVariable", scope: !241, file: !49, line: 37, type: !23)
!246 = !DILocation(line: 37, column: 19, scope: !241)
!247 = !DILocation(line: 38, column: 20, scope: !248)
!248 = distinct !DILexicalBlock(scope: !241, file: !49, line: 38, column: 13)
!249 = !DILocation(line: 38, column: 13, scope: !248)
!250 = !DILocation(line: 38, column: 36, scope: !248)
!251 = !DILocation(line: 38, column: 13, scope: !241)
!252 = !DILocation(line: 41, column: 25, scope: !253)
!253 = distinct !DILexicalBlock(scope: !248, file: !49, line: 39, column: 9)
!254 = !DILocation(line: 42, column: 20, scope: !255)
!255 = distinct !DILexicalBlock(scope: !253, file: !49, line: 42, column: 13)
!256 = !DILocation(line: 42, column: 18, scope: !255)
!257 = !DILocation(line: 42, column: 25, scope: !258)
!258 = distinct !DILexicalBlock(scope: !255, file: !49, line: 42, column: 13)
!259 = !DILocation(line: 42, column: 29, scope: !258)
!260 = !DILocation(line: 42, column: 27, scope: !258)
!261 = !DILocation(line: 42, column: 13, scope: !255)
!262 = !DILocation(line: 45, column: 28, scope: !263)
!263 = distinct !DILexicalBlock(scope: !258, file: !49, line: 43, column: 13)
!264 = !DILocation(line: 46, column: 13, scope: !263)
!265 = !DILocation(line: 42, column: 33, scope: !258)
!266 = !DILocation(line: 42, column: 13, scope: !258)
!267 = distinct !{!267, !261, !268, !269}
!268 = !DILocation(line: 46, column: 13, scope: !255)
!269 = !{!"llvm.loop.mustprogress"}
!270 = !DILocation(line: 47, column: 26, scope: !253)
!271 = !DILocation(line: 47, column: 13, scope: !253)
!272 = !DILocation(line: 48, column: 9, scope: !253)
!273 = !DILocation(line: 50, column: 1, scope: !235)
!274 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_51b_goodG2BSink", scope: !49, file: !49, line: 57, type: !236, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!275 = !DILocalVariable(name: "data", arg: 1, scope: !274, file: !49, line: 57, type: !42)
!276 = !DILocation(line: 57, column: 72, scope: !274)
!277 = !DILocalVariable(name: "i", scope: !278, file: !49, line: 60, type: !23)
!278 = distinct !DILexicalBlock(scope: !274, file: !49, line: 59, column: 5)
!279 = !DILocation(line: 60, column: 13, scope: !278)
!280 = !DILocalVariable(name: "n", scope: !278, file: !49, line: 60, type: !23)
!281 = !DILocation(line: 60, column: 16, scope: !278)
!282 = !DILocalVariable(name: "intVariable", scope: !278, file: !49, line: 60, type: !23)
!283 = !DILocation(line: 60, column: 19, scope: !278)
!284 = !DILocation(line: 61, column: 20, scope: !285)
!285 = distinct !DILexicalBlock(scope: !278, file: !49, line: 61, column: 13)
!286 = !DILocation(line: 61, column: 13, scope: !285)
!287 = !DILocation(line: 61, column: 36, scope: !285)
!288 = !DILocation(line: 61, column: 13, scope: !278)
!289 = !DILocation(line: 64, column: 25, scope: !290)
!290 = distinct !DILexicalBlock(scope: !285, file: !49, line: 62, column: 9)
!291 = !DILocation(line: 65, column: 20, scope: !292)
!292 = distinct !DILexicalBlock(scope: !290, file: !49, line: 65, column: 13)
!293 = !DILocation(line: 65, column: 18, scope: !292)
!294 = !DILocation(line: 65, column: 25, scope: !295)
!295 = distinct !DILexicalBlock(scope: !292, file: !49, line: 65, column: 13)
!296 = !DILocation(line: 65, column: 29, scope: !295)
!297 = !DILocation(line: 65, column: 27, scope: !295)
!298 = !DILocation(line: 65, column: 13, scope: !292)
!299 = !DILocation(line: 68, column: 28, scope: !300)
!300 = distinct !DILexicalBlock(scope: !295, file: !49, line: 66, column: 13)
!301 = !DILocation(line: 69, column: 13, scope: !300)
!302 = !DILocation(line: 65, column: 33, scope: !295)
!303 = !DILocation(line: 65, column: 13, scope: !295)
!304 = distinct !{!304, !298, !305, !269}
!305 = !DILocation(line: 69, column: 13, scope: !292)
!306 = !DILocation(line: 70, column: 26, scope: !290)
!307 = !DILocation(line: 70, column: 13, scope: !290)
!308 = !DILocation(line: 71, column: 9, scope: !290)
!309 = !DILocation(line: 73, column: 1, scope: !274)
!310 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_51b_goodB2GSink", scope: !49, file: !49, line: 76, type: !236, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!311 = !DILocalVariable(name: "data", arg: 1, scope: !310, file: !49, line: 76, type: !42)
!312 = !DILocation(line: 76, column: 72, scope: !310)
!313 = !DILocalVariable(name: "i", scope: !314, file: !49, line: 79, type: !23)
!314 = distinct !DILexicalBlock(scope: !310, file: !49, line: 78, column: 5)
!315 = !DILocation(line: 79, column: 13, scope: !314)
!316 = !DILocalVariable(name: "n", scope: !314, file: !49, line: 79, type: !23)
!317 = !DILocation(line: 79, column: 16, scope: !314)
!318 = !DILocalVariable(name: "intVariable", scope: !314, file: !49, line: 79, type: !23)
!319 = !DILocation(line: 79, column: 19, scope: !314)
!320 = !DILocation(line: 80, column: 20, scope: !321)
!321 = distinct !DILexicalBlock(scope: !314, file: !49, line: 80, column: 13)
!322 = !DILocation(line: 80, column: 13, scope: !321)
!323 = !DILocation(line: 80, column: 36, scope: !321)
!324 = !DILocation(line: 80, column: 13, scope: !314)
!325 = !DILocation(line: 83, column: 17, scope: !326)
!326 = distinct !DILexicalBlock(scope: !327, file: !49, line: 83, column: 17)
!327 = distinct !DILexicalBlock(scope: !321, file: !49, line: 81, column: 9)
!328 = !DILocation(line: 83, column: 19, scope: !326)
!329 = !DILocation(line: 83, column: 17, scope: !327)
!330 = !DILocation(line: 85, column: 29, scope: !331)
!331 = distinct !DILexicalBlock(scope: !326, file: !49, line: 84, column: 13)
!332 = !DILocation(line: 86, column: 24, scope: !333)
!333 = distinct !DILexicalBlock(scope: !331, file: !49, line: 86, column: 17)
!334 = !DILocation(line: 86, column: 22, scope: !333)
!335 = !DILocation(line: 86, column: 29, scope: !336)
!336 = distinct !DILexicalBlock(scope: !333, file: !49, line: 86, column: 17)
!337 = !DILocation(line: 86, column: 33, scope: !336)
!338 = !DILocation(line: 86, column: 31, scope: !336)
!339 = !DILocation(line: 86, column: 17, scope: !333)
!340 = !DILocation(line: 89, column: 32, scope: !341)
!341 = distinct !DILexicalBlock(scope: !336, file: !49, line: 87, column: 17)
!342 = !DILocation(line: 90, column: 17, scope: !341)
!343 = !DILocation(line: 86, column: 37, scope: !336)
!344 = !DILocation(line: 86, column: 17, scope: !336)
!345 = distinct !{!345, !339, !346, !269}
!346 = !DILocation(line: 90, column: 17, scope: !333)
!347 = !DILocation(line: 91, column: 30, scope: !331)
!348 = !DILocation(line: 91, column: 17, scope: !331)
!349 = !DILocation(line: 92, column: 13, scope: !331)
!350 = !DILocation(line: 93, column: 9, scope: !327)
!351 = !DILocation(line: 95, column: 1, scope: !310)
!352 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !236, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!353 = !DILocalVariable(name: "line", arg: 1, scope: !352, file: !3, line: 11, type: !42)
!354 = !DILocation(line: 11, column: 25, scope: !352)
!355 = !DILocation(line: 13, column: 1, scope: !352)
!356 = !DILocation(line: 14, column: 8, scope: !357)
!357 = distinct !DILexicalBlock(scope: !352, file: !3, line: 14, column: 8)
!358 = !DILocation(line: 14, column: 13, scope: !357)
!359 = !DILocation(line: 14, column: 8, scope: !352)
!360 = !DILocation(line: 16, column: 24, scope: !361)
!361 = distinct !DILexicalBlock(scope: !357, file: !3, line: 15, column: 5)
!362 = !DILocation(line: 16, column: 9, scope: !361)
!363 = !DILocation(line: 17, column: 5, scope: !361)
!364 = !DILocation(line: 18, column: 5, scope: !352)
!365 = !DILocation(line: 19, column: 1, scope: !352)
!366 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !236, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!367 = !DILocalVariable(name: "line", arg: 1, scope: !366, file: !3, line: 20, type: !42)
!368 = !DILocation(line: 20, column: 29, scope: !366)
!369 = !DILocation(line: 22, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !366, file: !3, line: 22, column: 8)
!371 = !DILocation(line: 22, column: 13, scope: !370)
!372 = !DILocation(line: 22, column: 8, scope: !366)
!373 = !DILocation(line: 24, column: 24, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !3, line: 23, column: 5)
!375 = !DILocation(line: 24, column: 9, scope: !374)
!376 = !DILocation(line: 25, column: 5, scope: !374)
!377 = !DILocation(line: 26, column: 1, scope: !366)
!378 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !379, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!379 = !DISubroutineType(types: !380)
!380 = !{null, !381}
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64)
!382 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !69, line: 74, baseType: !23)
!383 = !DILocalVariable(name: "line", arg: 1, scope: !378, file: !3, line: 27, type: !381)
!384 = !DILocation(line: 27, column: 29, scope: !378)
!385 = !DILocation(line: 29, column: 8, scope: !386)
!386 = distinct !DILexicalBlock(scope: !378, file: !3, line: 29, column: 8)
!387 = !DILocation(line: 29, column: 13, scope: !386)
!388 = !DILocation(line: 29, column: 8, scope: !378)
!389 = !DILocation(line: 31, column: 27, scope: !390)
!390 = distinct !DILexicalBlock(scope: !386, file: !3, line: 30, column: 5)
!391 = !DILocation(line: 31, column: 9, scope: !390)
!392 = !DILocation(line: 32, column: 5, scope: !390)
!393 = !DILocation(line: 33, column: 1, scope: !378)
!394 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !395, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !23}
!397 = !DILocalVariable(name: "intNumber", arg: 1, scope: !394, file: !3, line: 35, type: !23)
!398 = !DILocation(line: 35, column: 24, scope: !394)
!399 = !DILocation(line: 37, column: 20, scope: !394)
!400 = !DILocation(line: 37, column: 5, scope: !394)
!401 = !DILocation(line: 38, column: 1, scope: !394)
!402 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !403, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !405}
!405 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!406 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !402, file: !3, line: 40, type: !405)
!407 = !DILocation(line: 40, column: 28, scope: !402)
!408 = !DILocation(line: 42, column: 21, scope: !402)
!409 = !DILocation(line: 42, column: 5, scope: !402)
!410 = !DILocation(line: 43, column: 1, scope: !402)
!411 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !412, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!412 = !DISubroutineType(types: !413)
!413 = !{null, !414}
!414 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!415 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !411, file: !3, line: 45, type: !414)
!416 = !DILocation(line: 45, column: 28, scope: !411)
!417 = !DILocation(line: 47, column: 20, scope: !411)
!418 = !DILocation(line: 47, column: 5, scope: !411)
!419 = !DILocation(line: 48, column: 1, scope: !411)
!420 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !421, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!421 = !DISubroutineType(types: !422)
!422 = !{null, !103}
!423 = !DILocalVariable(name: "longNumber", arg: 1, scope: !420, file: !3, line: 50, type: !103)
!424 = !DILocation(line: 50, column: 26, scope: !420)
!425 = !DILocation(line: 52, column: 21, scope: !420)
!426 = !DILocation(line: 52, column: 5, scope: !420)
!427 = !DILocation(line: 53, column: 1, scope: !420)
!428 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !429, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!429 = !DISubroutineType(types: !430)
!430 = !{null, !431}
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !432, line: 27, baseType: !433)
!432 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!433 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !102, line: 44, baseType: !103)
!434 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !428, file: !3, line: 55, type: !431)
!435 = !DILocation(line: 55, column: 33, scope: !428)
!436 = !DILocation(line: 57, column: 29, scope: !428)
!437 = !DILocation(line: 57, column: 5, scope: !428)
!438 = !DILocation(line: 58, column: 1, scope: !428)
!439 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !440, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!440 = !DISubroutineType(types: !441)
!441 = !{null, !68}
!442 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !439, file: !3, line: 60, type: !68)
!443 = !DILocation(line: 60, column: 29, scope: !439)
!444 = !DILocation(line: 62, column: 21, scope: !439)
!445 = !DILocation(line: 62, column: 5, scope: !439)
!446 = !DILocation(line: 63, column: 1, scope: !439)
!447 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !448, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !43}
!450 = !DILocalVariable(name: "charHex", arg: 1, scope: !447, file: !3, line: 65, type: !43)
!451 = !DILocation(line: 65, column: 29, scope: !447)
!452 = !DILocation(line: 67, column: 22, scope: !447)
!453 = !DILocation(line: 67, column: 5, scope: !447)
!454 = !DILocation(line: 68, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !456, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !382}
!458 = !DILocalVariable(name: "wideChar", arg: 1, scope: !455, file: !3, line: 70, type: !382)
!459 = !DILocation(line: 70, column: 29, scope: !455)
!460 = !DILocalVariable(name: "s", scope: !455, file: !3, line: 74, type: !461)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !382, size: 64, elements: !462)
!462 = !{!463}
!463 = !DISubrange(count: 2)
!464 = !DILocation(line: 74, column: 13, scope: !455)
!465 = !DILocation(line: 75, column: 16, scope: !455)
!466 = !DILocation(line: 75, column: 9, scope: !455)
!467 = !DILocation(line: 75, column: 14, scope: !455)
!468 = !DILocation(line: 76, column: 9, scope: !455)
!469 = !DILocation(line: 76, column: 14, scope: !455)
!470 = !DILocation(line: 77, column: 21, scope: !455)
!471 = !DILocation(line: 77, column: 5, scope: !455)
!472 = !DILocation(line: 78, column: 1, scope: !455)
!473 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !474, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!474 = !DISubroutineType(types: !475)
!475 = !{null, !7}
!476 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !473, file: !3, line: 80, type: !7)
!477 = !DILocation(line: 80, column: 33, scope: !473)
!478 = !DILocation(line: 82, column: 20, scope: !473)
!479 = !DILocation(line: 82, column: 5, scope: !473)
!480 = !DILocation(line: 83, column: 1, scope: !473)
!481 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !482, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!482 = !DISubroutineType(types: !483)
!483 = !{null, !25}
!484 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !481, file: !3, line: 85, type: !25)
!485 = !DILocation(line: 85, column: 45, scope: !481)
!486 = !DILocation(line: 87, column: 22, scope: !481)
!487 = !DILocation(line: 87, column: 5, scope: !481)
!488 = !DILocation(line: 88, column: 1, scope: !481)
!489 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !490, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!490 = !DISubroutineType(types: !491)
!491 = !{null, !492}
!492 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!493 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !489, file: !3, line: 90, type: !492)
!494 = !DILocation(line: 90, column: 29, scope: !489)
!495 = !DILocation(line: 92, column: 20, scope: !489)
!496 = !DILocation(line: 92, column: 5, scope: !489)
!497 = !DILocation(line: 93, column: 1, scope: !489)
!498 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !499, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!499 = !DISubroutineType(types: !500)
!500 = !{null, !501}
!501 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !502, size: 64)
!502 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !503, line: 100, baseType: !504)
!503 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_103/source_code")
!504 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !503, line: 96, size: 64, elements: !505)
!505 = !{!506, !507}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !504, file: !503, line: 98, baseType: !23, size: 32)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !504, file: !503, line: 99, baseType: !23, size: 32, offset: 32)
!508 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !498, file: !3, line: 95, type: !501)
!509 = !DILocation(line: 95, column: 40, scope: !498)
!510 = !DILocation(line: 97, column: 26, scope: !498)
!511 = !DILocation(line: 97, column: 47, scope: !498)
!512 = !DILocation(line: 97, column: 55, scope: !498)
!513 = !DILocation(line: 97, column: 76, scope: !498)
!514 = !DILocation(line: 97, column: 5, scope: !498)
!515 = !DILocation(line: 98, column: 1, scope: !498)
!516 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !517, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!517 = !DISubroutineType(types: !518)
!518 = !{null, !519, !68}
!519 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!520 = !DILocalVariable(name: "bytes", arg: 1, scope: !516, file: !3, line: 100, type: !519)
!521 = !DILocation(line: 100, column: 38, scope: !516)
!522 = !DILocalVariable(name: "numBytes", arg: 2, scope: !516, file: !3, line: 100, type: !68)
!523 = !DILocation(line: 100, column: 52, scope: !516)
!524 = !DILocalVariable(name: "i", scope: !516, file: !3, line: 102, type: !68)
!525 = !DILocation(line: 102, column: 12, scope: !516)
!526 = !DILocation(line: 103, column: 12, scope: !527)
!527 = distinct !DILexicalBlock(scope: !516, file: !3, line: 103, column: 5)
!528 = !DILocation(line: 103, column: 10, scope: !527)
!529 = !DILocation(line: 103, column: 17, scope: !530)
!530 = distinct !DILexicalBlock(scope: !527, file: !3, line: 103, column: 5)
!531 = !DILocation(line: 103, column: 21, scope: !530)
!532 = !DILocation(line: 103, column: 19, scope: !530)
!533 = !DILocation(line: 103, column: 5, scope: !527)
!534 = !DILocation(line: 105, column: 24, scope: !535)
!535 = distinct !DILexicalBlock(scope: !530, file: !3, line: 104, column: 5)
!536 = !DILocation(line: 105, column: 30, scope: !535)
!537 = !DILocation(line: 105, column: 9, scope: !535)
!538 = !DILocation(line: 106, column: 5, scope: !535)
!539 = !DILocation(line: 103, column: 31, scope: !530)
!540 = !DILocation(line: 103, column: 5, scope: !530)
!541 = distinct !{!541, !533, !542, !269}
!542 = !DILocation(line: 106, column: 5, scope: !527)
!543 = !DILocation(line: 107, column: 5, scope: !516)
!544 = !DILocation(line: 108, column: 1, scope: !516)
!545 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !546, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!546 = !DISubroutineType(types: !547)
!547 = !{!68, !519, !68, !42}
!548 = !DILocalVariable(name: "bytes", arg: 1, scope: !545, file: !3, line: 113, type: !519)
!549 = !DILocation(line: 113, column: 39, scope: !545)
!550 = !DILocalVariable(name: "numBytes", arg: 2, scope: !545, file: !3, line: 113, type: !68)
!551 = !DILocation(line: 113, column: 53, scope: !545)
!552 = !DILocalVariable(name: "hex", arg: 3, scope: !545, file: !3, line: 113, type: !42)
!553 = !DILocation(line: 113, column: 71, scope: !545)
!554 = !DILocalVariable(name: "numWritten", scope: !545, file: !3, line: 115, type: !68)
!555 = !DILocation(line: 115, column: 12, scope: !545)
!556 = !DILocation(line: 121, column: 5, scope: !545)
!557 = !DILocation(line: 121, column: 12, scope: !545)
!558 = !DILocation(line: 121, column: 25, scope: !545)
!559 = !DILocation(line: 121, column: 23, scope: !545)
!560 = !DILocation(line: 121, column: 34, scope: !545)
!561 = !DILocation(line: 121, column: 37, scope: !545)
!562 = !DILocation(line: 121, column: 67, scope: !545)
!563 = !DILocation(line: 121, column: 70, scope: !545)
!564 = !DILocation(line: 0, scope: !545)
!565 = !DILocalVariable(name: "byte", scope: !566, file: !3, line: 123, type: !23)
!566 = distinct !DILexicalBlock(scope: !545, file: !3, line: 122, column: 5)
!567 = !DILocation(line: 123, column: 13, scope: !566)
