; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_65a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_111/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_65b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_111/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_65_bad", scope: !45, file: !45, line: 37, type: !55, scopeLine: 38, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 39, type: !42)
!58 = !DILocation(line: 39, column: 12, scope: !54)
!59 = !DILocalVariable(name: "funcPtr", scope: !54, file: !45, line: 41, type: !60)
!60 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !61, size: 64)
!61 = !DISubroutineType(types: !62)
!62 = !{null, !42}
!63 = !DILocation(line: 41, column: 12, scope: !54)
!64 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 42, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 100)
!68 = !DILocation(line: 42, column: 10, scope: !54)
!69 = !DILocation(line: 43, column: 12, scope: !54)
!70 = !DILocation(line: 43, column: 10, scope: !54)
!71 = !DILocalVariable(name: "dataLen", scope: !72, file: !45, line: 46, type: !73)
!72 = distinct !DILexicalBlock(scope: !54, file: !45, line: 44, column: 5)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DILocation(line: 46, column: 16, scope: !72)
!77 = !DILocation(line: 46, column: 33, scope: !72)
!78 = !DILocation(line: 46, column: 26, scope: !72)
!79 = !DILocalVariable(name: "pFile", scope: !72, file: !45, line: 47, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !23, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !42, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !42, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !42, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !42, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !42, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !42, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !42, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !42, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !42, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !42, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !42, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !23, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !23, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !24, size: 16, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !102, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !22, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !73, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !23, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DILocation(line: 47, column: 16, scope: !72)
!136 = !DILocation(line: 49, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !72, file: !45, line: 49, column: 13)
!138 = !DILocation(line: 49, column: 16, scope: !137)
!139 = !DILocation(line: 49, column: 25, scope: !137)
!140 = !DILocation(line: 49, column: 13, scope: !72)
!141 = !DILocation(line: 51, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !45, line: 50, column: 9)
!143 = !DILocation(line: 51, column: 19, scope: !142)
!144 = !DILocation(line: 52, column: 17, scope: !145)
!145 = distinct !DILexicalBlock(scope: !142, file: !45, line: 52, column: 17)
!146 = !DILocation(line: 52, column: 23, scope: !145)
!147 = !DILocation(line: 52, column: 17, scope: !142)
!148 = !DILocation(line: 55, column: 27, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !45, line: 55, column: 21)
!150 = distinct !DILexicalBlock(scope: !145, file: !45, line: 53, column: 13)
!151 = !DILocation(line: 55, column: 32, scope: !149)
!152 = !DILocation(line: 55, column: 31, scope: !149)
!153 = !DILocation(line: 55, column: 51, scope: !149)
!154 = !DILocation(line: 55, column: 50, scope: !149)
!155 = !DILocation(line: 55, column: 41, scope: !149)
!156 = !DILocation(line: 55, column: 61, scope: !149)
!157 = !DILocation(line: 55, column: 21, scope: !149)
!158 = !DILocation(line: 55, column: 68, scope: !149)
!159 = !DILocation(line: 55, column: 21, scope: !150)
!160 = !DILocation(line: 57, column: 21, scope: !161)
!161 = distinct !DILexicalBlock(scope: !149, file: !45, line: 56, column: 17)
!162 = !DILocation(line: 59, column: 21, scope: !161)
!163 = !DILocation(line: 59, column: 26, scope: !161)
!164 = !DILocation(line: 59, column: 35, scope: !161)
!165 = !DILocation(line: 60, column: 17, scope: !161)
!166 = !DILocation(line: 61, column: 24, scope: !150)
!167 = !DILocation(line: 61, column: 17, scope: !150)
!168 = !DILocation(line: 62, column: 13, scope: !150)
!169 = !DILocation(line: 63, column: 9, scope: !142)
!170 = !DILocation(line: 66, column: 5, scope: !54)
!171 = !DILocation(line: 66, column: 13, scope: !54)
!172 = !DILocation(line: 67, column: 1, scope: !54)
!173 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 75, type: !55, scopeLine: 76, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!174 = !DILocalVariable(name: "data", scope: !173, file: !45, line: 77, type: !42)
!175 = !DILocation(line: 77, column: 12, scope: !173)
!176 = !DILocalVariable(name: "funcPtr", scope: !173, file: !45, line: 78, type: !60)
!177 = !DILocation(line: 78, column: 12, scope: !173)
!178 = !DILocalVariable(name: "dataBuffer", scope: !173, file: !45, line: 79, type: !65)
!179 = !DILocation(line: 79, column: 10, scope: !173)
!180 = !DILocation(line: 80, column: 12, scope: !173)
!181 = !DILocation(line: 80, column: 10, scope: !173)
!182 = !DILocation(line: 82, column: 12, scope: !173)
!183 = !DILocation(line: 82, column: 5, scope: !173)
!184 = !DILocation(line: 83, column: 5, scope: !173)
!185 = !DILocation(line: 83, column: 13, scope: !173)
!186 = !DILocation(line: 84, column: 1, scope: !173)
!187 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 88, type: !55, scopeLine: 89, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!188 = !DILocalVariable(name: "data", scope: !187, file: !45, line: 90, type: !42)
!189 = !DILocation(line: 90, column: 12, scope: !187)
!190 = !DILocalVariable(name: "funcPtr", scope: !187, file: !45, line: 91, type: !60)
!191 = !DILocation(line: 91, column: 12, scope: !187)
!192 = !DILocalVariable(name: "dataBuffer", scope: !187, file: !45, line: 92, type: !65)
!193 = !DILocation(line: 92, column: 10, scope: !187)
!194 = !DILocation(line: 93, column: 12, scope: !187)
!195 = !DILocation(line: 93, column: 10, scope: !187)
!196 = !DILocalVariable(name: "dataLen", scope: !197, file: !45, line: 96, type: !73)
!197 = distinct !DILexicalBlock(scope: !187, file: !45, line: 94, column: 5)
!198 = !DILocation(line: 96, column: 16, scope: !197)
!199 = !DILocation(line: 96, column: 33, scope: !197)
!200 = !DILocation(line: 96, column: 26, scope: !197)
!201 = !DILocalVariable(name: "pFile", scope: !197, file: !45, line: 97, type: !80)
!202 = !DILocation(line: 97, column: 16, scope: !197)
!203 = !DILocation(line: 99, column: 17, scope: !204)
!204 = distinct !DILexicalBlock(scope: !197, file: !45, line: 99, column: 13)
!205 = !DILocation(line: 99, column: 16, scope: !204)
!206 = !DILocation(line: 99, column: 25, scope: !204)
!207 = !DILocation(line: 99, column: 13, scope: !197)
!208 = !DILocation(line: 101, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !204, file: !45, line: 100, column: 9)
!210 = !DILocation(line: 101, column: 19, scope: !209)
!211 = !DILocation(line: 102, column: 17, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !45, line: 102, column: 17)
!213 = !DILocation(line: 102, column: 23, scope: !212)
!214 = !DILocation(line: 102, column: 17, scope: !209)
!215 = !DILocation(line: 105, column: 27, scope: !216)
!216 = distinct !DILexicalBlock(scope: !217, file: !45, line: 105, column: 21)
!217 = distinct !DILexicalBlock(scope: !212, file: !45, line: 103, column: 13)
!218 = !DILocation(line: 105, column: 32, scope: !216)
!219 = !DILocation(line: 105, column: 31, scope: !216)
!220 = !DILocation(line: 105, column: 51, scope: !216)
!221 = !DILocation(line: 105, column: 50, scope: !216)
!222 = !DILocation(line: 105, column: 41, scope: !216)
!223 = !DILocation(line: 105, column: 61, scope: !216)
!224 = !DILocation(line: 105, column: 21, scope: !216)
!225 = !DILocation(line: 105, column: 68, scope: !216)
!226 = !DILocation(line: 105, column: 21, scope: !217)
!227 = !DILocation(line: 107, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !216, file: !45, line: 106, column: 17)
!229 = !DILocation(line: 109, column: 21, scope: !228)
!230 = !DILocation(line: 109, column: 26, scope: !228)
!231 = !DILocation(line: 109, column: 35, scope: !228)
!232 = !DILocation(line: 110, column: 17, scope: !228)
!233 = !DILocation(line: 111, column: 24, scope: !217)
!234 = !DILocation(line: 111, column: 17, scope: !217)
!235 = !DILocation(line: 112, column: 13, scope: !217)
!236 = !DILocation(line: 113, column: 9, scope: !209)
!237 = !DILocation(line: 115, column: 5, scope: !187)
!238 = !DILocation(line: 115, column: 13, scope: !187)
!239 = !DILocation(line: 116, column: 1, scope: !187)
!240 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_65_good", scope: !45, file: !45, line: 118, type: !55, scopeLine: 119, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!241 = !DILocation(line: 120, column: 5, scope: !240)
!242 = !DILocation(line: 121, column: 5, scope: !240)
!243 = !DILocation(line: 122, column: 1, scope: !240)
!244 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_65b_badSink", scope: !49, file: !49, line: 34, type: !61, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!245 = !DILocalVariable(name: "data", arg: 1, scope: !244, file: !49, line: 34, type: !42)
!246 = !DILocation(line: 34, column: 68, scope: !244)
!247 = !DILocalVariable(name: "i", scope: !248, file: !49, line: 37, type: !23)
!248 = distinct !DILexicalBlock(scope: !244, file: !49, line: 36, column: 5)
!249 = !DILocation(line: 37, column: 13, scope: !248)
!250 = !DILocalVariable(name: "n", scope: !248, file: !49, line: 37, type: !23)
!251 = !DILocation(line: 37, column: 16, scope: !248)
!252 = !DILocalVariable(name: "intVariable", scope: !248, file: !49, line: 37, type: !23)
!253 = !DILocation(line: 37, column: 19, scope: !248)
!254 = !DILocation(line: 38, column: 20, scope: !255)
!255 = distinct !DILexicalBlock(scope: !248, file: !49, line: 38, column: 13)
!256 = !DILocation(line: 38, column: 13, scope: !255)
!257 = !DILocation(line: 38, column: 36, scope: !255)
!258 = !DILocation(line: 38, column: 13, scope: !248)
!259 = !DILocation(line: 41, column: 25, scope: !260)
!260 = distinct !DILexicalBlock(scope: !255, file: !49, line: 39, column: 9)
!261 = !DILocation(line: 42, column: 20, scope: !262)
!262 = distinct !DILexicalBlock(scope: !260, file: !49, line: 42, column: 13)
!263 = !DILocation(line: 42, column: 18, scope: !262)
!264 = !DILocation(line: 42, column: 25, scope: !265)
!265 = distinct !DILexicalBlock(scope: !262, file: !49, line: 42, column: 13)
!266 = !DILocation(line: 42, column: 29, scope: !265)
!267 = !DILocation(line: 42, column: 27, scope: !265)
!268 = !DILocation(line: 42, column: 13, scope: !262)
!269 = !DILocation(line: 45, column: 28, scope: !270)
!270 = distinct !DILexicalBlock(scope: !265, file: !49, line: 43, column: 13)
!271 = !DILocation(line: 46, column: 13, scope: !270)
!272 = !DILocation(line: 42, column: 33, scope: !265)
!273 = !DILocation(line: 42, column: 13, scope: !265)
!274 = distinct !{!274, !268, !275, !276}
!275 = !DILocation(line: 46, column: 13, scope: !262)
!276 = !{!"llvm.loop.mustprogress"}
!277 = !DILocation(line: 47, column: 26, scope: !260)
!278 = !DILocation(line: 47, column: 13, scope: !260)
!279 = !DILocation(line: 48, column: 9, scope: !260)
!280 = !DILocation(line: 50, column: 1, scope: !244)
!281 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_65b_goodG2BSink", scope: !49, file: !49, line: 57, type: !61, scopeLine: 58, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!282 = !DILocalVariable(name: "data", arg: 1, scope: !281, file: !49, line: 57, type: !42)
!283 = !DILocation(line: 57, column: 72, scope: !281)
!284 = !DILocalVariable(name: "i", scope: !285, file: !49, line: 60, type: !23)
!285 = distinct !DILexicalBlock(scope: !281, file: !49, line: 59, column: 5)
!286 = !DILocation(line: 60, column: 13, scope: !285)
!287 = !DILocalVariable(name: "n", scope: !285, file: !49, line: 60, type: !23)
!288 = !DILocation(line: 60, column: 16, scope: !285)
!289 = !DILocalVariable(name: "intVariable", scope: !285, file: !49, line: 60, type: !23)
!290 = !DILocation(line: 60, column: 19, scope: !285)
!291 = !DILocation(line: 61, column: 20, scope: !292)
!292 = distinct !DILexicalBlock(scope: !285, file: !49, line: 61, column: 13)
!293 = !DILocation(line: 61, column: 13, scope: !292)
!294 = !DILocation(line: 61, column: 36, scope: !292)
!295 = !DILocation(line: 61, column: 13, scope: !285)
!296 = !DILocation(line: 64, column: 25, scope: !297)
!297 = distinct !DILexicalBlock(scope: !292, file: !49, line: 62, column: 9)
!298 = !DILocation(line: 65, column: 20, scope: !299)
!299 = distinct !DILexicalBlock(scope: !297, file: !49, line: 65, column: 13)
!300 = !DILocation(line: 65, column: 18, scope: !299)
!301 = !DILocation(line: 65, column: 25, scope: !302)
!302 = distinct !DILexicalBlock(scope: !299, file: !49, line: 65, column: 13)
!303 = !DILocation(line: 65, column: 29, scope: !302)
!304 = !DILocation(line: 65, column: 27, scope: !302)
!305 = !DILocation(line: 65, column: 13, scope: !299)
!306 = !DILocation(line: 68, column: 28, scope: !307)
!307 = distinct !DILexicalBlock(scope: !302, file: !49, line: 66, column: 13)
!308 = !DILocation(line: 69, column: 13, scope: !307)
!309 = !DILocation(line: 65, column: 33, scope: !302)
!310 = !DILocation(line: 65, column: 13, scope: !302)
!311 = distinct !{!311, !305, !312, !276}
!312 = !DILocation(line: 69, column: 13, scope: !299)
!313 = !DILocation(line: 70, column: 26, scope: !297)
!314 = !DILocation(line: 70, column: 13, scope: !297)
!315 = !DILocation(line: 71, column: 9, scope: !297)
!316 = !DILocation(line: 73, column: 1, scope: !281)
!317 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_65b_goodB2GSink", scope: !49, file: !49, line: 76, type: !61, scopeLine: 77, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!318 = !DILocalVariable(name: "data", arg: 1, scope: !317, file: !49, line: 76, type: !42)
!319 = !DILocation(line: 76, column: 72, scope: !317)
!320 = !DILocalVariable(name: "i", scope: !321, file: !49, line: 79, type: !23)
!321 = distinct !DILexicalBlock(scope: !317, file: !49, line: 78, column: 5)
!322 = !DILocation(line: 79, column: 13, scope: !321)
!323 = !DILocalVariable(name: "n", scope: !321, file: !49, line: 79, type: !23)
!324 = !DILocation(line: 79, column: 16, scope: !321)
!325 = !DILocalVariable(name: "intVariable", scope: !321, file: !49, line: 79, type: !23)
!326 = !DILocation(line: 79, column: 19, scope: !321)
!327 = !DILocation(line: 80, column: 20, scope: !328)
!328 = distinct !DILexicalBlock(scope: !321, file: !49, line: 80, column: 13)
!329 = !DILocation(line: 80, column: 13, scope: !328)
!330 = !DILocation(line: 80, column: 36, scope: !328)
!331 = !DILocation(line: 80, column: 13, scope: !321)
!332 = !DILocation(line: 83, column: 17, scope: !333)
!333 = distinct !DILexicalBlock(scope: !334, file: !49, line: 83, column: 17)
!334 = distinct !DILexicalBlock(scope: !328, file: !49, line: 81, column: 9)
!335 = !DILocation(line: 83, column: 19, scope: !333)
!336 = !DILocation(line: 83, column: 17, scope: !334)
!337 = !DILocation(line: 85, column: 29, scope: !338)
!338 = distinct !DILexicalBlock(scope: !333, file: !49, line: 84, column: 13)
!339 = !DILocation(line: 86, column: 24, scope: !340)
!340 = distinct !DILexicalBlock(scope: !338, file: !49, line: 86, column: 17)
!341 = !DILocation(line: 86, column: 22, scope: !340)
!342 = !DILocation(line: 86, column: 29, scope: !343)
!343 = distinct !DILexicalBlock(scope: !340, file: !49, line: 86, column: 17)
!344 = !DILocation(line: 86, column: 33, scope: !343)
!345 = !DILocation(line: 86, column: 31, scope: !343)
!346 = !DILocation(line: 86, column: 17, scope: !340)
!347 = !DILocation(line: 89, column: 32, scope: !348)
!348 = distinct !DILexicalBlock(scope: !343, file: !49, line: 87, column: 17)
!349 = !DILocation(line: 90, column: 17, scope: !348)
!350 = !DILocation(line: 86, column: 37, scope: !343)
!351 = !DILocation(line: 86, column: 17, scope: !343)
!352 = distinct !{!352, !346, !353, !276}
!353 = !DILocation(line: 90, column: 17, scope: !340)
!354 = !DILocation(line: 91, column: 30, scope: !338)
!355 = !DILocation(line: 91, column: 17, scope: !338)
!356 = !DILocation(line: 92, column: 13, scope: !338)
!357 = !DILocation(line: 93, column: 9, scope: !334)
!358 = !DILocation(line: 95, column: 1, scope: !317)
!359 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !61, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!360 = !DILocalVariable(name: "line", arg: 1, scope: !359, file: !3, line: 11, type: !42)
!361 = !DILocation(line: 11, column: 25, scope: !359)
!362 = !DILocation(line: 13, column: 1, scope: !359)
!363 = !DILocation(line: 14, column: 8, scope: !364)
!364 = distinct !DILexicalBlock(scope: !359, file: !3, line: 14, column: 8)
!365 = !DILocation(line: 14, column: 13, scope: !364)
!366 = !DILocation(line: 14, column: 8, scope: !359)
!367 = !DILocation(line: 16, column: 24, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !3, line: 15, column: 5)
!369 = !DILocation(line: 16, column: 9, scope: !368)
!370 = !DILocation(line: 17, column: 5, scope: !368)
!371 = !DILocation(line: 18, column: 5, scope: !359)
!372 = !DILocation(line: 19, column: 1, scope: !359)
!373 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !61, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!374 = !DILocalVariable(name: "line", arg: 1, scope: !373, file: !3, line: 20, type: !42)
!375 = !DILocation(line: 20, column: 29, scope: !373)
!376 = !DILocation(line: 22, column: 8, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !3, line: 22, column: 8)
!378 = !DILocation(line: 22, column: 13, scope: !377)
!379 = !DILocation(line: 22, column: 8, scope: !373)
!380 = !DILocation(line: 24, column: 24, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !3, line: 23, column: 5)
!382 = !DILocation(line: 24, column: 9, scope: !381)
!383 = !DILocation(line: 25, column: 5, scope: !381)
!384 = !DILocation(line: 26, column: 1, scope: !373)
!385 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !386, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !74, line: 74, baseType: !23)
!390 = !DILocalVariable(name: "line", arg: 1, scope: !385, file: !3, line: 27, type: !388)
!391 = !DILocation(line: 27, column: 29, scope: !385)
!392 = !DILocation(line: 29, column: 8, scope: !393)
!393 = distinct !DILexicalBlock(scope: !385, file: !3, line: 29, column: 8)
!394 = !DILocation(line: 29, column: 13, scope: !393)
!395 = !DILocation(line: 29, column: 8, scope: !385)
!396 = !DILocation(line: 31, column: 27, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !3, line: 30, column: 5)
!398 = !DILocation(line: 31, column: 9, scope: !397)
!399 = !DILocation(line: 32, column: 5, scope: !397)
!400 = !DILocation(line: 33, column: 1, scope: !385)
!401 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !402, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!402 = !DISubroutineType(types: !403)
!403 = !{null, !23}
!404 = !DILocalVariable(name: "intNumber", arg: 1, scope: !401, file: !3, line: 35, type: !23)
!405 = !DILocation(line: 35, column: 24, scope: !401)
!406 = !DILocation(line: 37, column: 20, scope: !401)
!407 = !DILocation(line: 37, column: 5, scope: !401)
!408 = !DILocation(line: 38, column: 1, scope: !401)
!409 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !410, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!413 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !409, file: !3, line: 40, type: !412)
!414 = !DILocation(line: 40, column: 28, scope: !409)
!415 = !DILocation(line: 42, column: 21, scope: !409)
!416 = !DILocation(line: 42, column: 5, scope: !409)
!417 = !DILocation(line: 43, column: 1, scope: !409)
!418 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !419, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !421}
!421 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!422 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !418, file: !3, line: 45, type: !421)
!423 = !DILocation(line: 45, column: 28, scope: !418)
!424 = !DILocation(line: 47, column: 20, scope: !418)
!425 = !DILocation(line: 47, column: 5, scope: !418)
!426 = !DILocation(line: 48, column: 1, scope: !418)
!427 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !428, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !108}
!430 = !DILocalVariable(name: "longNumber", arg: 1, scope: !427, file: !3, line: 50, type: !108)
!431 = !DILocation(line: 50, column: 26, scope: !427)
!432 = !DILocation(line: 52, column: 21, scope: !427)
!433 = !DILocation(line: 52, column: 5, scope: !427)
!434 = !DILocation(line: 53, column: 1, scope: !427)
!435 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !436, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!436 = !DISubroutineType(types: !437)
!437 = !{null, !438}
!438 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !439, line: 27, baseType: !440)
!439 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!440 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 44, baseType: !108)
!441 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !435, file: !3, line: 55, type: !438)
!442 = !DILocation(line: 55, column: 33, scope: !435)
!443 = !DILocation(line: 57, column: 29, scope: !435)
!444 = !DILocation(line: 57, column: 5, scope: !435)
!445 = !DILocation(line: 58, column: 1, scope: !435)
!446 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !447, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!447 = !DISubroutineType(types: !448)
!448 = !{null, !73}
!449 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !446, file: !3, line: 60, type: !73)
!450 = !DILocation(line: 60, column: 29, scope: !446)
!451 = !DILocation(line: 62, column: 21, scope: !446)
!452 = !DILocation(line: 62, column: 5, scope: !446)
!453 = !DILocation(line: 63, column: 1, scope: !446)
!454 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !455, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!455 = !DISubroutineType(types: !456)
!456 = !{null, !43}
!457 = !DILocalVariable(name: "charHex", arg: 1, scope: !454, file: !3, line: 65, type: !43)
!458 = !DILocation(line: 65, column: 29, scope: !454)
!459 = !DILocation(line: 67, column: 22, scope: !454)
!460 = !DILocation(line: 67, column: 5, scope: !454)
!461 = !DILocation(line: 68, column: 1, scope: !454)
!462 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !463, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!463 = !DISubroutineType(types: !464)
!464 = !{null, !389}
!465 = !DILocalVariable(name: "wideChar", arg: 1, scope: !462, file: !3, line: 70, type: !389)
!466 = !DILocation(line: 70, column: 29, scope: !462)
!467 = !DILocalVariable(name: "s", scope: !462, file: !3, line: 74, type: !468)
!468 = !DICompositeType(tag: DW_TAG_array_type, baseType: !389, size: 64, elements: !469)
!469 = !{!470}
!470 = !DISubrange(count: 2)
!471 = !DILocation(line: 74, column: 13, scope: !462)
!472 = !DILocation(line: 75, column: 16, scope: !462)
!473 = !DILocation(line: 75, column: 9, scope: !462)
!474 = !DILocation(line: 75, column: 14, scope: !462)
!475 = !DILocation(line: 76, column: 9, scope: !462)
!476 = !DILocation(line: 76, column: 14, scope: !462)
!477 = !DILocation(line: 77, column: 21, scope: !462)
!478 = !DILocation(line: 77, column: 5, scope: !462)
!479 = !DILocation(line: 78, column: 1, scope: !462)
!480 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !481, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !7}
!483 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !480, file: !3, line: 80, type: !7)
!484 = !DILocation(line: 80, column: 33, scope: !480)
!485 = !DILocation(line: 82, column: 20, scope: !480)
!486 = !DILocation(line: 82, column: 5, scope: !480)
!487 = !DILocation(line: 83, column: 1, scope: !480)
!488 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !489, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !25}
!491 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !488, file: !3, line: 85, type: !25)
!492 = !DILocation(line: 85, column: 45, scope: !488)
!493 = !DILocation(line: 87, column: 22, scope: !488)
!494 = !DILocation(line: 87, column: 5, scope: !488)
!495 = !DILocation(line: 88, column: 1, scope: !488)
!496 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !497, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499}
!499 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!500 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !496, file: !3, line: 90, type: !499)
!501 = !DILocation(line: 90, column: 29, scope: !496)
!502 = !DILocation(line: 92, column: 20, scope: !496)
!503 = !DILocation(line: 92, column: 5, scope: !496)
!504 = !DILocation(line: 93, column: 1, scope: !496)
!505 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !506, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!506 = !DISubroutineType(types: !507)
!507 = !{null, !508}
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !510, line: 100, baseType: !511)
!510 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_111/source_code")
!511 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !510, line: 96, size: 64, elements: !512)
!512 = !{!513, !514}
!513 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !511, file: !510, line: 98, baseType: !23, size: 32)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !511, file: !510, line: 99, baseType: !23, size: 32, offset: 32)
!515 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !505, file: !3, line: 95, type: !508)
!516 = !DILocation(line: 95, column: 40, scope: !505)
!517 = !DILocation(line: 97, column: 26, scope: !505)
!518 = !DILocation(line: 97, column: 47, scope: !505)
!519 = !DILocation(line: 97, column: 55, scope: !505)
!520 = !DILocation(line: 97, column: 76, scope: !505)
!521 = !DILocation(line: 97, column: 5, scope: !505)
!522 = !DILocation(line: 98, column: 1, scope: !505)
!523 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !524, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!524 = !DISubroutineType(types: !525)
!525 = !{null, !526, !73}
!526 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!527 = !DILocalVariable(name: "bytes", arg: 1, scope: !523, file: !3, line: 100, type: !526)
!528 = !DILocation(line: 100, column: 38, scope: !523)
!529 = !DILocalVariable(name: "numBytes", arg: 2, scope: !523, file: !3, line: 100, type: !73)
!530 = !DILocation(line: 100, column: 52, scope: !523)
!531 = !DILocalVariable(name: "i", scope: !523, file: !3, line: 102, type: !73)
!532 = !DILocation(line: 102, column: 12, scope: !523)
!533 = !DILocation(line: 103, column: 12, scope: !534)
!534 = distinct !DILexicalBlock(scope: !523, file: !3, line: 103, column: 5)
!535 = !DILocation(line: 103, column: 10, scope: !534)
!536 = !DILocation(line: 103, column: 17, scope: !537)
!537 = distinct !DILexicalBlock(scope: !534, file: !3, line: 103, column: 5)
!538 = !DILocation(line: 103, column: 21, scope: !537)
!539 = !DILocation(line: 103, column: 19, scope: !537)
!540 = !DILocation(line: 103, column: 5, scope: !534)
!541 = !DILocation(line: 105, column: 24, scope: !542)
!542 = distinct !DILexicalBlock(scope: !537, file: !3, line: 104, column: 5)
!543 = !DILocation(line: 105, column: 30, scope: !542)
!544 = !DILocation(line: 105, column: 9, scope: !542)
!545 = !DILocation(line: 106, column: 5, scope: !542)
!546 = !DILocation(line: 103, column: 31, scope: !537)
!547 = !DILocation(line: 103, column: 5, scope: !537)
!548 = distinct !{!548, !540, !549, !276}
!549 = !DILocation(line: 106, column: 5, scope: !534)
!550 = !DILocation(line: 107, column: 5, scope: !523)
!551 = !DILocation(line: 108, column: 1, scope: !523)
!552 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !553, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!553 = !DISubroutineType(types: !554)
!554 = !{!73, !526, !73, !42}
!555 = !DILocalVariable(name: "bytes", arg: 1, scope: !552, file: !3, line: 113, type: !526)
!556 = !DILocation(line: 113, column: 39, scope: !552)
!557 = !DILocalVariable(name: "numBytes", arg: 2, scope: !552, file: !3, line: 113, type: !73)
!558 = !DILocation(line: 113, column: 53, scope: !552)
!559 = !DILocalVariable(name: "hex", arg: 3, scope: !552, file: !3, line: 113, type: !42)
!560 = !DILocation(line: 113, column: 71, scope: !552)
!561 = !DILocalVariable(name: "numWritten", scope: !552, file: !3, line: 115, type: !73)
!562 = !DILocation(line: 115, column: 12, scope: !552)
!563 = !DILocation(line: 121, column: 5, scope: !552)
!564 = !DILocation(line: 121, column: 12, scope: !552)
!565 = !DILocation(line: 121, column: 25, scope: !552)
!566 = !DILocation(line: 121, column: 23, scope: !552)
!567 = !DILocation(line: 121, column: 34, scope: !552)
!568 = !DILocation(line: 121, column: 37, scope: !552)
!569 = !DILocation(line: 121, column: 67, scope: !552)
!570 = !DILocation(line: 121, column: 70, scope: !552)
!571 = !DILocation(line: 0, scope: !552)
!572 = !DILocalVariable(name: "byte", scope: !573, file: !3, line: 123, type: !23)
!573 = distinct !DILexicalBlock(scope: !552, file: !3, line: 122, column: 5)
!574 = !DILocation(line: 123, column: 13, scope: !573)
