; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@stdout = external dso_local global %struct._IO_FILE*, align 8
@.str.7 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37

!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66a.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_000/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = distinct !DICompileUnit(language: DW_LANG_C99, file: !49, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, splitDebugInlining: false, nameTableKind: None)
!49 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_000/source_code")
!50 = !{!"clang version 12.0.0"}
!51 = !{i32 7, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{i32 1, !"wchar_size", i32 4}
!54 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66_bad", scope: !45, file: !45, line: 35, type: !55, scopeLine: 36, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!55 = !DISubroutineType(types: !56)
!56 = !{null}
!57 = !DILocalVariable(name: "data", scope: !54, file: !45, line: 37, type: !42)
!58 = !DILocation(line: 37, column: 12, scope: !54)
!59 = !DILocalVariable(name: "dataArray", scope: !54, file: !45, line: 38, type: !60)
!60 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 320, elements: !61)
!61 = !{!62}
!62 = !DISubrange(count: 5)
!63 = !DILocation(line: 38, column: 12, scope: !54)
!64 = !DILocalVariable(name: "dataBuffer", scope: !54, file: !45, line: 39, type: !65)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 100)
!68 = !DILocation(line: 39, column: 10, scope: !54)
!69 = !DILocation(line: 40, column: 12, scope: !54)
!70 = !DILocation(line: 40, column: 10, scope: !54)
!71 = !DILocalVariable(name: "dataLen", scope: !72, file: !45, line: 43, type: !73)
!72 = distinct !DILexicalBlock(scope: !54, file: !45, line: 41, column: 5)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !74, line: 46, baseType: !75)
!74 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!75 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!76 = !DILocation(line: 43, column: 16, scope: !72)
!77 = !DILocation(line: 43, column: 33, scope: !72)
!78 = !DILocation(line: 43, column: 26, scope: !72)
!79 = !DILocalVariable(name: "pFile", scope: !72, file: !45, line: 44, type: !80)
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !81, size: 64)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !82, line: 7, baseType: !83)
!82 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!83 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !84, line: 49, size: 1728, elements: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !101, !103, !104, !105, !109, !110, !112, !116, !119, !121, !124, !127, !128, !129, !130, !131}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !83, file: !84, line: 51, baseType: !23, size: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !83, file: !84, line: 54, baseType: !42, size: 64, offset: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !83, file: !84, line: 55, baseType: !42, size: 64, offset: 128)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !83, file: !84, line: 56, baseType: !42, size: 64, offset: 192)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !83, file: !84, line: 57, baseType: !42, size: 64, offset: 256)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !83, file: !84, line: 58, baseType: !42, size: 64, offset: 320)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !83, file: !84, line: 59, baseType: !42, size: 64, offset: 384)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !83, file: !84, line: 60, baseType: !42, size: 64, offset: 448)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !83, file: !84, line: 61, baseType: !42, size: 64, offset: 512)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !83, file: !84, line: 64, baseType: !42, size: 64, offset: 576)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !83, file: !84, line: 65, baseType: !42, size: 64, offset: 640)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !83, file: !84, line: 66, baseType: !42, size: 64, offset: 704)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !83, file: !84, line: 68, baseType: !99, size: 64, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!100 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !84, line: 36, flags: DIFlagFwdDecl)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !83, file: !84, line: 70, baseType: !102, size: 64, offset: 832)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !83, file: !84, line: 72, baseType: !23, size: 32, offset: 896)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !83, file: !84, line: 73, baseType: !23, size: 32, offset: 928)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !83, file: !84, line: 74, baseType: !106, size: 64, offset: 960)
!106 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !107, line: 152, baseType: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!108 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !83, file: !84, line: 77, baseType: !24, size: 16, offset: 1024)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !83, file: !84, line: 78, baseType: !111, size: 8, offset: 1040)
!111 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !83, file: !84, line: 79, baseType: !113, size: 8, offset: 1048)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 1)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !83, file: !84, line: 81, baseType: !117, size: 64, offset: 1088)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !84, line: 43, baseType: null)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !83, file: !84, line: 89, baseType: !120, size: 64, offset: 1152)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !107, line: 153, baseType: !108)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !83, file: !84, line: 91, baseType: !122, size: 64, offset: 1216)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !84, line: 37, flags: DIFlagFwdDecl)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !83, file: !84, line: 92, baseType: !125, size: 64, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !126, size: 64)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !84, line: 38, flags: DIFlagFwdDecl)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !83, file: !84, line: 93, baseType: !102, size: 64, offset: 1344)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !83, file: !84, line: 94, baseType: !22, size: 64, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !83, file: !84, line: 95, baseType: !73, size: 64, offset: 1472)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !83, file: !84, line: 96, baseType: !23, size: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !83, file: !84, line: 98, baseType: !132, size: 160, offset: 1568)
!132 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !133)
!133 = !{!134}
!134 = !DISubrange(count: 20)
!135 = !DILocation(line: 44, column: 16, scope: !72)
!136 = !DILocation(line: 46, column: 17, scope: !137)
!137 = distinct !DILexicalBlock(scope: !72, file: !45, line: 46, column: 13)
!138 = !DILocation(line: 46, column: 16, scope: !137)
!139 = !DILocation(line: 46, column: 25, scope: !137)
!140 = !DILocation(line: 46, column: 13, scope: !72)
!141 = !DILocation(line: 48, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !137, file: !45, line: 47, column: 9)
!143 = !DILocation(line: 48, column: 19, scope: !142)
!144 = !DILocation(line: 49, column: 17, scope: !145)
!145 = distinct !DILexicalBlock(scope: !142, file: !45, line: 49, column: 17)
!146 = !DILocation(line: 49, column: 23, scope: !145)
!147 = !DILocation(line: 49, column: 17, scope: !142)
!148 = !DILocation(line: 52, column: 27, scope: !149)
!149 = distinct !DILexicalBlock(scope: !150, file: !45, line: 52, column: 21)
!150 = distinct !DILexicalBlock(scope: !145, file: !45, line: 50, column: 13)
!151 = !DILocation(line: 52, column: 32, scope: !149)
!152 = !DILocation(line: 52, column: 31, scope: !149)
!153 = !DILocation(line: 52, column: 51, scope: !149)
!154 = !DILocation(line: 52, column: 50, scope: !149)
!155 = !DILocation(line: 52, column: 41, scope: !149)
!156 = !DILocation(line: 52, column: 61, scope: !149)
!157 = !DILocation(line: 52, column: 21, scope: !149)
!158 = !DILocation(line: 52, column: 68, scope: !149)
!159 = !DILocation(line: 52, column: 21, scope: !150)
!160 = !DILocation(line: 54, column: 21, scope: !161)
!161 = distinct !DILexicalBlock(scope: !149, file: !45, line: 53, column: 17)
!162 = !DILocation(line: 56, column: 21, scope: !161)
!163 = !DILocation(line: 56, column: 26, scope: !161)
!164 = !DILocation(line: 56, column: 35, scope: !161)
!165 = !DILocation(line: 57, column: 17, scope: !161)
!166 = !DILocation(line: 58, column: 24, scope: !150)
!167 = !DILocation(line: 58, column: 17, scope: !150)
!168 = !DILocation(line: 59, column: 13, scope: !150)
!169 = !DILocation(line: 60, column: 9, scope: !142)
!170 = !DILocation(line: 63, column: 20, scope: !54)
!171 = !DILocation(line: 63, column: 5, scope: !54)
!172 = !DILocation(line: 63, column: 18, scope: !54)
!173 = !DILocation(line: 64, column: 70, scope: !54)
!174 = !DILocation(line: 64, column: 5, scope: !54)
!175 = !DILocation(line: 65, column: 1, scope: !54)
!176 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 73, type: !55, scopeLine: 74, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!177 = !DILocalVariable(name: "data", scope: !176, file: !45, line: 75, type: !42)
!178 = !DILocation(line: 75, column: 12, scope: !176)
!179 = !DILocalVariable(name: "dataArray", scope: !176, file: !45, line: 76, type: !60)
!180 = !DILocation(line: 76, column: 12, scope: !176)
!181 = !DILocalVariable(name: "dataBuffer", scope: !176, file: !45, line: 77, type: !65)
!182 = !DILocation(line: 77, column: 10, scope: !176)
!183 = !DILocation(line: 78, column: 12, scope: !176)
!184 = !DILocation(line: 78, column: 10, scope: !176)
!185 = !DILocation(line: 80, column: 12, scope: !176)
!186 = !DILocation(line: 80, column: 5, scope: !176)
!187 = !DILocation(line: 81, column: 20, scope: !176)
!188 = !DILocation(line: 81, column: 5, scope: !176)
!189 = !DILocation(line: 81, column: 18, scope: !176)
!190 = !DILocation(line: 82, column: 74, scope: !176)
!191 = !DILocation(line: 82, column: 5, scope: !176)
!192 = !DILocation(line: 83, column: 1, scope: !176)
!193 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 87, type: !55, scopeLine: 88, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!194 = !DILocalVariable(name: "data", scope: !193, file: !45, line: 89, type: !42)
!195 = !DILocation(line: 89, column: 12, scope: !193)
!196 = !DILocalVariable(name: "dataArray", scope: !193, file: !45, line: 90, type: !60)
!197 = !DILocation(line: 90, column: 12, scope: !193)
!198 = !DILocalVariable(name: "dataBuffer", scope: !193, file: !45, line: 91, type: !65)
!199 = !DILocation(line: 91, column: 10, scope: !193)
!200 = !DILocation(line: 92, column: 12, scope: !193)
!201 = !DILocation(line: 92, column: 10, scope: !193)
!202 = !DILocalVariable(name: "dataLen", scope: !203, file: !45, line: 95, type: !73)
!203 = distinct !DILexicalBlock(scope: !193, file: !45, line: 93, column: 5)
!204 = !DILocation(line: 95, column: 16, scope: !203)
!205 = !DILocation(line: 95, column: 33, scope: !203)
!206 = !DILocation(line: 95, column: 26, scope: !203)
!207 = !DILocalVariable(name: "pFile", scope: !203, file: !45, line: 96, type: !80)
!208 = !DILocation(line: 96, column: 16, scope: !203)
!209 = !DILocation(line: 98, column: 17, scope: !210)
!210 = distinct !DILexicalBlock(scope: !203, file: !45, line: 98, column: 13)
!211 = !DILocation(line: 98, column: 16, scope: !210)
!212 = !DILocation(line: 98, column: 25, scope: !210)
!213 = !DILocation(line: 98, column: 13, scope: !203)
!214 = !DILocation(line: 100, column: 21, scope: !215)
!215 = distinct !DILexicalBlock(scope: !210, file: !45, line: 99, column: 9)
!216 = !DILocation(line: 100, column: 19, scope: !215)
!217 = !DILocation(line: 101, column: 17, scope: !218)
!218 = distinct !DILexicalBlock(scope: !215, file: !45, line: 101, column: 17)
!219 = !DILocation(line: 101, column: 23, scope: !218)
!220 = !DILocation(line: 101, column: 17, scope: !215)
!221 = !DILocation(line: 104, column: 27, scope: !222)
!222 = distinct !DILexicalBlock(scope: !223, file: !45, line: 104, column: 21)
!223 = distinct !DILexicalBlock(scope: !218, file: !45, line: 102, column: 13)
!224 = !DILocation(line: 104, column: 32, scope: !222)
!225 = !DILocation(line: 104, column: 31, scope: !222)
!226 = !DILocation(line: 104, column: 51, scope: !222)
!227 = !DILocation(line: 104, column: 50, scope: !222)
!228 = !DILocation(line: 104, column: 41, scope: !222)
!229 = !DILocation(line: 104, column: 61, scope: !222)
!230 = !DILocation(line: 104, column: 21, scope: !222)
!231 = !DILocation(line: 104, column: 68, scope: !222)
!232 = !DILocation(line: 104, column: 21, scope: !223)
!233 = !DILocation(line: 106, column: 21, scope: !234)
!234 = distinct !DILexicalBlock(scope: !222, file: !45, line: 105, column: 17)
!235 = !DILocation(line: 108, column: 21, scope: !234)
!236 = !DILocation(line: 108, column: 26, scope: !234)
!237 = !DILocation(line: 108, column: 35, scope: !234)
!238 = !DILocation(line: 109, column: 17, scope: !234)
!239 = !DILocation(line: 110, column: 24, scope: !223)
!240 = !DILocation(line: 110, column: 17, scope: !223)
!241 = !DILocation(line: 111, column: 13, scope: !223)
!242 = !DILocation(line: 112, column: 9, scope: !215)
!243 = !DILocation(line: 114, column: 20, scope: !193)
!244 = !DILocation(line: 114, column: 5, scope: !193)
!245 = !DILocation(line: 114, column: 18, scope: !193)
!246 = !DILocation(line: 115, column: 74, scope: !193)
!247 = !DILocation(line: 115, column: 5, scope: !193)
!248 = !DILocation(line: 116, column: 1, scope: !193)
!249 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66_good", scope: !45, file: !45, line: 118, type: !55, scopeLine: 119, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!250 = !DILocation(line: 120, column: 5, scope: !249)
!251 = !DILocation(line: 121, column: 5, scope: !249)
!252 = !DILocation(line: 122, column: 1, scope: !249)
!253 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66b_badSink", scope: !49, file: !49, line: 32, type: !254, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!254 = !DISubroutineType(types: !255)
!255 = !{null, !41}
!256 = !DILocalVariable(name: "dataArray", arg: 1, scope: !253, file: !49, line: 32, type: !41)
!257 = !DILocation(line: 32, column: 78, scope: !253)
!258 = !DILocalVariable(name: "data", scope: !253, file: !49, line: 35, type: !42)
!259 = !DILocation(line: 35, column: 12, scope: !253)
!260 = !DILocation(line: 35, column: 19, scope: !253)
!261 = !DILocation(line: 37, column: 13, scope: !253)
!262 = !DILocation(line: 37, column: 21, scope: !253)
!263 = !DILocation(line: 37, column: 5, scope: !253)
!264 = !DILocation(line: 38, column: 1, scope: !253)
!265 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66b_goodG2BSink", scope: !49, file: !49, line: 45, type: !254, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!266 = !DILocalVariable(name: "dataArray", arg: 1, scope: !265, file: !49, line: 45, type: !41)
!267 = !DILocation(line: 45, column: 82, scope: !265)
!268 = !DILocalVariable(name: "data", scope: !265, file: !49, line: 47, type: !42)
!269 = !DILocation(line: 47, column: 12, scope: !265)
!270 = !DILocation(line: 47, column: 19, scope: !265)
!271 = !DILocation(line: 49, column: 13, scope: !265)
!272 = !DILocation(line: 49, column: 21, scope: !265)
!273 = !DILocation(line: 49, column: 5, scope: !265)
!274 = !DILocation(line: 50, column: 1, scope: !265)
!275 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_fprintf_66b_goodB2GSink", scope: !49, file: !49, line: 53, type: !254, scopeLine: 54, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !48, retainedNodes: !46)
!276 = !DILocalVariable(name: "dataArray", arg: 1, scope: !275, file: !49, line: 53, type: !41)
!277 = !DILocation(line: 53, column: 82, scope: !275)
!278 = !DILocalVariable(name: "data", scope: !275, file: !49, line: 55, type: !42)
!279 = !DILocation(line: 55, column: 12, scope: !275)
!280 = !DILocation(line: 55, column: 19, scope: !275)
!281 = !DILocation(line: 57, column: 13, scope: !275)
!282 = !DILocation(line: 57, column: 29, scope: !275)
!283 = !DILocation(line: 57, column: 5, scope: !275)
!284 = !DILocation(line: 58, column: 1, scope: !275)
!285 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !286, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!286 = !DISubroutineType(types: !287)
!287 = !{null, !42}
!288 = !DILocalVariable(name: "line", arg: 1, scope: !285, file: !3, line: 11, type: !42)
!289 = !DILocation(line: 11, column: 25, scope: !285)
!290 = !DILocation(line: 13, column: 1, scope: !285)
!291 = !DILocation(line: 14, column: 8, scope: !292)
!292 = distinct !DILexicalBlock(scope: !285, file: !3, line: 14, column: 8)
!293 = !DILocation(line: 14, column: 13, scope: !292)
!294 = !DILocation(line: 14, column: 8, scope: !285)
!295 = !DILocation(line: 16, column: 24, scope: !296)
!296 = distinct !DILexicalBlock(scope: !292, file: !3, line: 15, column: 5)
!297 = !DILocation(line: 16, column: 9, scope: !296)
!298 = !DILocation(line: 17, column: 5, scope: !296)
!299 = !DILocation(line: 18, column: 5, scope: !285)
!300 = !DILocation(line: 19, column: 1, scope: !285)
!301 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !286, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!302 = !DILocalVariable(name: "line", arg: 1, scope: !301, file: !3, line: 20, type: !42)
!303 = !DILocation(line: 20, column: 29, scope: !301)
!304 = !DILocation(line: 22, column: 8, scope: !305)
!305 = distinct !DILexicalBlock(scope: !301, file: !3, line: 22, column: 8)
!306 = !DILocation(line: 22, column: 13, scope: !305)
!307 = !DILocation(line: 22, column: 8, scope: !301)
!308 = !DILocation(line: 24, column: 24, scope: !309)
!309 = distinct !DILexicalBlock(scope: !305, file: !3, line: 23, column: 5)
!310 = !DILocation(line: 24, column: 9, scope: !309)
!311 = !DILocation(line: 25, column: 5, scope: !309)
!312 = !DILocation(line: 26, column: 1, scope: !301)
!313 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !314, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!314 = !DISubroutineType(types: !315)
!315 = !{null, !316}
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !74, line: 74, baseType: !23)
!318 = !DILocalVariable(name: "line", arg: 1, scope: !313, file: !3, line: 27, type: !316)
!319 = !DILocation(line: 27, column: 29, scope: !313)
!320 = !DILocation(line: 29, column: 8, scope: !321)
!321 = distinct !DILexicalBlock(scope: !313, file: !3, line: 29, column: 8)
!322 = !DILocation(line: 29, column: 13, scope: !321)
!323 = !DILocation(line: 29, column: 8, scope: !313)
!324 = !DILocation(line: 31, column: 27, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !3, line: 30, column: 5)
!326 = !DILocation(line: 31, column: 9, scope: !325)
!327 = !DILocation(line: 32, column: 5, scope: !325)
!328 = !DILocation(line: 33, column: 1, scope: !313)
!329 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !330, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!330 = !DISubroutineType(types: !331)
!331 = !{null, !23}
!332 = !DILocalVariable(name: "intNumber", arg: 1, scope: !329, file: !3, line: 35, type: !23)
!333 = !DILocation(line: 35, column: 24, scope: !329)
!334 = !DILocation(line: 37, column: 20, scope: !329)
!335 = !DILocation(line: 37, column: 5, scope: !329)
!336 = !DILocation(line: 38, column: 1, scope: !329)
!337 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !338, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!338 = !DISubroutineType(types: !339)
!339 = !{null, !340}
!340 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!341 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !337, file: !3, line: 40, type: !340)
!342 = !DILocation(line: 40, column: 28, scope: !337)
!343 = !DILocation(line: 42, column: 21, scope: !337)
!344 = !DILocation(line: 42, column: 5, scope: !337)
!345 = !DILocation(line: 43, column: 1, scope: !337)
!346 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !347, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!347 = !DISubroutineType(types: !348)
!348 = !{null, !349}
!349 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!350 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !346, file: !3, line: 45, type: !349)
!351 = !DILocation(line: 45, column: 28, scope: !346)
!352 = !DILocation(line: 47, column: 20, scope: !346)
!353 = !DILocation(line: 47, column: 5, scope: !346)
!354 = !DILocation(line: 48, column: 1, scope: !346)
!355 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !356, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!356 = !DISubroutineType(types: !357)
!357 = !{null, !108}
!358 = !DILocalVariable(name: "longNumber", arg: 1, scope: !355, file: !3, line: 50, type: !108)
!359 = !DILocation(line: 50, column: 26, scope: !355)
!360 = !DILocation(line: 52, column: 21, scope: !355)
!361 = !DILocation(line: 52, column: 5, scope: !355)
!362 = !DILocation(line: 53, column: 1, scope: !355)
!363 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !364, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !366}
!366 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !367, line: 27, baseType: !368)
!367 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !107, line: 44, baseType: !108)
!369 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !363, file: !3, line: 55, type: !366)
!370 = !DILocation(line: 55, column: 33, scope: !363)
!371 = !DILocation(line: 57, column: 29, scope: !363)
!372 = !DILocation(line: 57, column: 5, scope: !363)
!373 = !DILocation(line: 58, column: 1, scope: !363)
!374 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !375, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!375 = !DISubroutineType(types: !376)
!376 = !{null, !73}
!377 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !374, file: !3, line: 60, type: !73)
!378 = !DILocation(line: 60, column: 29, scope: !374)
!379 = !DILocation(line: 62, column: 21, scope: !374)
!380 = !DILocation(line: 62, column: 5, scope: !374)
!381 = !DILocation(line: 63, column: 1, scope: !374)
!382 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !383, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!383 = !DISubroutineType(types: !384)
!384 = !{null, !43}
!385 = !DILocalVariable(name: "charHex", arg: 1, scope: !382, file: !3, line: 65, type: !43)
!386 = !DILocation(line: 65, column: 29, scope: !382)
!387 = !DILocation(line: 67, column: 22, scope: !382)
!388 = !DILocation(line: 67, column: 5, scope: !382)
!389 = !DILocation(line: 68, column: 1, scope: !382)
!390 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !391, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!391 = !DISubroutineType(types: !392)
!392 = !{null, !317}
!393 = !DILocalVariable(name: "wideChar", arg: 1, scope: !390, file: !3, line: 70, type: !317)
!394 = !DILocation(line: 70, column: 29, scope: !390)
!395 = !DILocalVariable(name: "s", scope: !390, file: !3, line: 74, type: !396)
!396 = !DICompositeType(tag: DW_TAG_array_type, baseType: !317, size: 64, elements: !397)
!397 = !{!398}
!398 = !DISubrange(count: 2)
!399 = !DILocation(line: 74, column: 13, scope: !390)
!400 = !DILocation(line: 75, column: 16, scope: !390)
!401 = !DILocation(line: 75, column: 9, scope: !390)
!402 = !DILocation(line: 75, column: 14, scope: !390)
!403 = !DILocation(line: 76, column: 9, scope: !390)
!404 = !DILocation(line: 76, column: 14, scope: !390)
!405 = !DILocation(line: 77, column: 21, scope: !390)
!406 = !DILocation(line: 77, column: 5, scope: !390)
!407 = !DILocation(line: 78, column: 1, scope: !390)
!408 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !409, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!409 = !DISubroutineType(types: !410)
!410 = !{null, !7}
!411 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !408, file: !3, line: 80, type: !7)
!412 = !DILocation(line: 80, column: 33, scope: !408)
!413 = !DILocation(line: 82, column: 20, scope: !408)
!414 = !DILocation(line: 82, column: 5, scope: !408)
!415 = !DILocation(line: 83, column: 1, scope: !408)
!416 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !417, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!417 = !DISubroutineType(types: !418)
!418 = !{null, !25}
!419 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !416, file: !3, line: 85, type: !25)
!420 = !DILocation(line: 85, column: 45, scope: !416)
!421 = !DILocation(line: 87, column: 22, scope: !416)
!422 = !DILocation(line: 87, column: 5, scope: !416)
!423 = !DILocation(line: 88, column: 1, scope: !416)
!424 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !425, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427}
!427 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!428 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !424, file: !3, line: 90, type: !427)
!429 = !DILocation(line: 90, column: 29, scope: !424)
!430 = !DILocation(line: 92, column: 20, scope: !424)
!431 = !DILocation(line: 92, column: 5, scope: !424)
!432 = !DILocation(line: 93, column: 1, scope: !424)
!433 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !434, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !436}
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !437, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !438, line: 100, baseType: !439)
!438 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_000/source_code")
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !438, line: 96, size: 64, elements: !440)
!440 = !{!441, !442}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !439, file: !438, line: 98, baseType: !23, size: 32)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !439, file: !438, line: 99, baseType: !23, size: 32, offset: 32)
!443 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !433, file: !3, line: 95, type: !436)
!444 = !DILocation(line: 95, column: 40, scope: !433)
!445 = !DILocation(line: 97, column: 26, scope: !433)
!446 = !DILocation(line: 97, column: 47, scope: !433)
!447 = !DILocation(line: 97, column: 55, scope: !433)
!448 = !DILocation(line: 97, column: 76, scope: !433)
!449 = !DILocation(line: 97, column: 5, scope: !433)
!450 = !DILocation(line: 98, column: 1, scope: !433)
!451 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !452, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!452 = !DISubroutineType(types: !453)
!453 = !{null, !454, !73}
!454 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!455 = !DILocalVariable(name: "bytes", arg: 1, scope: !451, file: !3, line: 100, type: !454)
!456 = !DILocation(line: 100, column: 38, scope: !451)
!457 = !DILocalVariable(name: "numBytes", arg: 2, scope: !451, file: !3, line: 100, type: !73)
!458 = !DILocation(line: 100, column: 52, scope: !451)
!459 = !DILocalVariable(name: "i", scope: !451, file: !3, line: 102, type: !73)
!460 = !DILocation(line: 102, column: 12, scope: !451)
!461 = !DILocation(line: 103, column: 12, scope: !462)
!462 = distinct !DILexicalBlock(scope: !451, file: !3, line: 103, column: 5)
!463 = !DILocation(line: 103, column: 10, scope: !462)
!464 = !DILocation(line: 103, column: 17, scope: !465)
!465 = distinct !DILexicalBlock(scope: !462, file: !3, line: 103, column: 5)
!466 = !DILocation(line: 103, column: 21, scope: !465)
!467 = !DILocation(line: 103, column: 19, scope: !465)
!468 = !DILocation(line: 103, column: 5, scope: !462)
!469 = !DILocation(line: 105, column: 24, scope: !470)
!470 = distinct !DILexicalBlock(scope: !465, file: !3, line: 104, column: 5)
!471 = !DILocation(line: 105, column: 30, scope: !470)
!472 = !DILocation(line: 105, column: 9, scope: !470)
!473 = !DILocation(line: 106, column: 5, scope: !470)
!474 = !DILocation(line: 103, column: 31, scope: !465)
!475 = !DILocation(line: 103, column: 5, scope: !465)
!476 = distinct !{!476, !468, !477, !478}
!477 = !DILocation(line: 106, column: 5, scope: !462)
!478 = !{!"llvm.loop.mustprogress"}
!479 = !DILocation(line: 107, column: 5, scope: !451)
!480 = !DILocation(line: 108, column: 1, scope: !451)
!481 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !482, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!482 = !DISubroutineType(types: !483)
!483 = !{!73, !454, !73, !42}
!484 = !DILocalVariable(name: "bytes", arg: 1, scope: !481, file: !3, line: 113, type: !454)
!485 = !DILocation(line: 113, column: 39, scope: !481)
!486 = !DILocalVariable(name: "numBytes", arg: 2, scope: !481, file: !3, line: 113, type: !73)
!487 = !DILocation(line: 113, column: 53, scope: !481)
!488 = !DILocalVariable(name: "hex", arg: 3, scope: !481, file: !3, line: 113, type: !42)
!489 = !DILocation(line: 113, column: 71, scope: !481)
!490 = !DILocalVariable(name: "numWritten", scope: !481, file: !3, line: 115, type: !73)
!491 = !DILocation(line: 115, column: 12, scope: !481)
!492 = !DILocation(line: 121, column: 5, scope: !481)
!493 = !DILocation(line: 121, column: 12, scope: !481)
!494 = !DILocation(line: 121, column: 25, scope: !481)
!495 = !DILocation(line: 121, column: 23, scope: !481)
!496 = !DILocation(line: 121, column: 34, scope: !481)
!497 = !DILocation(line: 121, column: 37, scope: !481)
!498 = !DILocation(line: 121, column: 67, scope: !481)
!499 = !DILocation(line: 121, column: 70, scope: !481)
!500 = !DILocation(line: 0, scope: !481)
!501 = !DILocalVariable(name: "byte", scope: !502, file: !3, line: 123, type: !23)
!502 = distinct !DILexicalBlock(scope: !481, file: !3, line: 122, column: 5)
