; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@CWE606_Unchecked_Loop_Condition__char_file_68_badData = dso_local global i8* null, align 8, !dbg !0
@CWE606_Unchecked_Loop_Condition__char_file_68_goodG2BData = dso_local global i8* null, align 8, !dbg !9
@CWE606_Unchecked_Loop_Condition__char_file_68_goodB2GData = dso_local global i8* null, align 8, !dbg !13
@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !15
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !40
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !42

!17 = distinct !DICompileUnit(language: DW_LANG_C99, file: !18, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !19, retainedTypes: !36, globals: !39, splitDebugInlining: false, nameTableKind: None)
!18 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_114/source_code")
!19 = !{!20}
!20 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !21, line: 46, baseType: !22, size: 32, elements: !23)
!21 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!22 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!23 = !{!24, !25, !26, !27, !28, !29, !30, !31, !32, !33, !34, !35}
!24 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!25 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!26 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!27 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!28 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!29 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!30 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!31 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!32 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!33 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!34 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!35 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!36 = !{!6, !7, !37, !38}
!37 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!38 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!39 = !{!15, !40, !42, !44, !46, !48, !50, !52}
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !17, file: !18, line: 175, type: !7, isLocal: false, isDefinition: true)
!42 = !DIGlobalVariableExpression(var: !43, expr: !DIExpression())
!43 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !17, file: !18, line: 176, type: !7, isLocal: false, isDefinition: true)
!44 = !DIGlobalVariableExpression(var: !45, expr: !DIExpression())
!45 = distinct !DIGlobalVariable(name: "globalTrue", scope: !17, file: !18, line: 181, type: !7, isLocal: false, isDefinition: true)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "globalFalse", scope: !17, file: !18, line: 182, type: !7, isLocal: false, isDefinition: true)
!48 = !DIGlobalVariableExpression(var: !49, expr: !DIExpression())
!49 = distinct !DIGlobalVariable(name: "globalFive", scope: !17, file: !18, line: 183, type: !7, isLocal: false, isDefinition: true)
!50 = !DIGlobalVariableExpression(var: !51, expr: !DIExpression())
!51 = distinct !DIGlobalVariable(name: "globalArgc", scope: !17, file: !18, line: 214, type: !7, isLocal: false, isDefinition: true)
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "globalArgv", scope: !17, file: !18, line: 215, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!55 = distinct !DICompileUnit(language: DW_LANG_C99, file: !56, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!56 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_68b.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_114/source_code")
!57 = !{!"clang version 12.0.0"}
!58 = !{i32 7, !"Dwarf Version", i32 4}
!59 = !{i32 2, !"Debug Info Version", i32 3}
!60 = !{i32 1, !"wchar_size", i32 4}
!61 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_68_bad", scope: !3, file: !3, line: 41, type: !62, scopeLine: 42, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!62 = !DISubroutineType(types: !63)
!63 = !{null}
!64 = !DILocalVariable(name: "data", scope: !61, file: !3, line: 43, type: !11)
!65 = !DILocation(line: 43, column: 12, scope: !61)
!66 = !DILocalVariable(name: "dataBuffer", scope: !61, file: !3, line: 44, type: !67)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 800, elements: !68)
!68 = !{!69}
!69 = !DISubrange(count: 100)
!70 = !DILocation(line: 44, column: 10, scope: !61)
!71 = !DILocation(line: 45, column: 12, scope: !61)
!72 = !DILocation(line: 45, column: 10, scope: !61)
!73 = !DILocalVariable(name: "dataLen", scope: !74, file: !3, line: 48, type: !75)
!74 = distinct !DILexicalBlock(scope: !61, file: !3, line: 46, column: 5)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !76, line: 46, baseType: !77)
!76 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!77 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!78 = !DILocation(line: 48, column: 16, scope: !74)
!79 = !DILocation(line: 48, column: 33, scope: !74)
!80 = !DILocation(line: 48, column: 26, scope: !74)
!81 = !DILocalVariable(name: "pFile", scope: !74, file: !3, line: 49, type: !82)
!82 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !83, size: 64)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !84, line: 7, baseType: !85)
!84 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !86, line: 49, size: 1728, elements: !87)
!86 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!87 = !{!88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !103, !105, !106, !107, !111, !112, !114, !118, !121, !123, !126, !129, !130, !131, !132, !133}
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !85, file: !86, line: 51, baseType: !7, size: 32)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !85, file: !86, line: 54, baseType: !11, size: 64, offset: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !85, file: !86, line: 55, baseType: !11, size: 64, offset: 128)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !85, file: !86, line: 56, baseType: !11, size: 64, offset: 192)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !85, file: !86, line: 57, baseType: !11, size: 64, offset: 256)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !85, file: !86, line: 58, baseType: !11, size: 64, offset: 320)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !85, file: !86, line: 59, baseType: !11, size: 64, offset: 384)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !85, file: !86, line: 60, baseType: !11, size: 64, offset: 448)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !85, file: !86, line: 61, baseType: !11, size: 64, offset: 512)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !85, file: !86, line: 64, baseType: !11, size: 64, offset: 576)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !85, file: !86, line: 65, baseType: !11, size: 64, offset: 640)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !85, file: !86, line: 66, baseType: !11, size: 64, offset: 704)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !85, file: !86, line: 68, baseType: !101, size: 64, offset: 768)
!101 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !102, size: 64)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !86, line: 36, flags: DIFlagFwdDecl)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !85, file: !86, line: 70, baseType: !104, size: 64, offset: 832)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !85, size: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !85, file: !86, line: 72, baseType: !7, size: 32, offset: 896)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !85, file: !86, line: 73, baseType: !7, size: 32, offset: 928)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !85, file: !86, line: 74, baseType: !108, size: 64, offset: 960)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !109, line: 152, baseType: !110)
!109 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!110 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !85, file: !86, line: 77, baseType: !37, size: 16, offset: 1024)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !85, file: !86, line: 78, baseType: !113, size: 8, offset: 1040)
!113 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !85, file: !86, line: 79, baseType: !115, size: 8, offset: 1048)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 8, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 1)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !85, file: !86, line: 81, baseType: !119, size: 64, offset: 1088)
!119 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !120, size: 64)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !86, line: 43, baseType: null)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !85, file: !86, line: 89, baseType: !122, size: 64, offset: 1152)
!122 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !109, line: 153, baseType: !110)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !85, file: !86, line: 91, baseType: !124, size: 64, offset: 1216)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !125, size: 64)
!125 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !86, line: 37, flags: DIFlagFwdDecl)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !85, file: !86, line: 92, baseType: !127, size: 64, offset: 1280)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !86, line: 38, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !85, file: !86, line: 93, baseType: !104, size: 64, offset: 1344)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !85, file: !86, line: 94, baseType: !6, size: 64, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !85, file: !86, line: 95, baseType: !75, size: 64, offset: 1472)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !85, file: !86, line: 96, baseType: !7, size: 32, offset: 1536)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !85, file: !86, line: 98, baseType: !134, size: 160, offset: 1568)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 160, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 20)
!137 = !DILocation(line: 49, column: 16, scope: !74)
!138 = !DILocation(line: 51, column: 17, scope: !139)
!139 = distinct !DILexicalBlock(scope: !74, file: !3, line: 51, column: 13)
!140 = !DILocation(line: 51, column: 16, scope: !139)
!141 = !DILocation(line: 51, column: 25, scope: !139)
!142 = !DILocation(line: 51, column: 13, scope: !74)
!143 = !DILocation(line: 53, column: 21, scope: !144)
!144 = distinct !DILexicalBlock(scope: !139, file: !3, line: 52, column: 9)
!145 = !DILocation(line: 53, column: 19, scope: !144)
!146 = !DILocation(line: 54, column: 17, scope: !147)
!147 = distinct !DILexicalBlock(scope: !144, file: !3, line: 54, column: 17)
!148 = !DILocation(line: 54, column: 23, scope: !147)
!149 = !DILocation(line: 54, column: 17, scope: !144)
!150 = !DILocation(line: 57, column: 27, scope: !151)
!151 = distinct !DILexicalBlock(scope: !152, file: !3, line: 57, column: 21)
!152 = distinct !DILexicalBlock(scope: !147, file: !3, line: 55, column: 13)
!153 = !DILocation(line: 57, column: 32, scope: !151)
!154 = !DILocation(line: 57, column: 31, scope: !151)
!155 = !DILocation(line: 57, column: 51, scope: !151)
!156 = !DILocation(line: 57, column: 50, scope: !151)
!157 = !DILocation(line: 57, column: 41, scope: !151)
!158 = !DILocation(line: 57, column: 61, scope: !151)
!159 = !DILocation(line: 57, column: 21, scope: !151)
!160 = !DILocation(line: 57, column: 68, scope: !151)
!161 = !DILocation(line: 57, column: 21, scope: !152)
!162 = !DILocation(line: 59, column: 21, scope: !163)
!163 = distinct !DILexicalBlock(scope: !151, file: !3, line: 58, column: 17)
!164 = !DILocation(line: 61, column: 21, scope: !163)
!165 = !DILocation(line: 61, column: 26, scope: !163)
!166 = !DILocation(line: 61, column: 35, scope: !163)
!167 = !DILocation(line: 62, column: 17, scope: !163)
!168 = !DILocation(line: 63, column: 24, scope: !152)
!169 = !DILocation(line: 63, column: 17, scope: !152)
!170 = !DILocation(line: 64, column: 13, scope: !152)
!171 = !DILocation(line: 65, column: 9, scope: !144)
!172 = !DILocation(line: 67, column: 61, scope: !61)
!173 = !DILocation(line: 67, column: 59, scope: !61)
!174 = !DILocation(line: 68, column: 5, scope: !61)
!175 = !DILocation(line: 69, column: 1, scope: !61)
!176 = distinct !DISubprogram(name: "goodG2B", scope: !3, file: !3, line: 78, type: !62, scopeLine: 79, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!177 = !DILocalVariable(name: "data", scope: !176, file: !3, line: 80, type: !11)
!178 = !DILocation(line: 80, column: 12, scope: !176)
!179 = !DILocalVariable(name: "dataBuffer", scope: !176, file: !3, line: 81, type: !67)
!180 = !DILocation(line: 81, column: 10, scope: !176)
!181 = !DILocation(line: 82, column: 12, scope: !176)
!182 = !DILocation(line: 82, column: 10, scope: !176)
!183 = !DILocation(line: 84, column: 12, scope: !176)
!184 = !DILocation(line: 84, column: 5, scope: !176)
!185 = !DILocation(line: 85, column: 65, scope: !176)
!186 = !DILocation(line: 85, column: 63, scope: !176)
!187 = !DILocation(line: 86, column: 5, scope: !176)
!188 = !DILocation(line: 87, column: 1, scope: !176)
!189 = distinct !DISubprogram(name: "goodB2G", scope: !3, file: !3, line: 90, type: !62, scopeLine: 91, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!190 = !DILocalVariable(name: "data", scope: !189, file: !3, line: 92, type: !11)
!191 = !DILocation(line: 92, column: 12, scope: !189)
!192 = !DILocalVariable(name: "dataBuffer", scope: !189, file: !3, line: 93, type: !67)
!193 = !DILocation(line: 93, column: 10, scope: !189)
!194 = !DILocation(line: 94, column: 12, scope: !189)
!195 = !DILocation(line: 94, column: 10, scope: !189)
!196 = !DILocalVariable(name: "dataLen", scope: !197, file: !3, line: 97, type: !75)
!197 = distinct !DILexicalBlock(scope: !189, file: !3, line: 95, column: 5)
!198 = !DILocation(line: 97, column: 16, scope: !197)
!199 = !DILocation(line: 97, column: 33, scope: !197)
!200 = !DILocation(line: 97, column: 26, scope: !197)
!201 = !DILocalVariable(name: "pFile", scope: !197, file: !3, line: 98, type: !82)
!202 = !DILocation(line: 98, column: 16, scope: !197)
!203 = !DILocation(line: 100, column: 17, scope: !204)
!204 = distinct !DILexicalBlock(scope: !197, file: !3, line: 100, column: 13)
!205 = !DILocation(line: 100, column: 16, scope: !204)
!206 = !DILocation(line: 100, column: 25, scope: !204)
!207 = !DILocation(line: 100, column: 13, scope: !197)
!208 = !DILocation(line: 102, column: 21, scope: !209)
!209 = distinct !DILexicalBlock(scope: !204, file: !3, line: 101, column: 9)
!210 = !DILocation(line: 102, column: 19, scope: !209)
!211 = !DILocation(line: 103, column: 17, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !3, line: 103, column: 17)
!213 = !DILocation(line: 103, column: 23, scope: !212)
!214 = !DILocation(line: 103, column: 17, scope: !209)
!215 = !DILocation(line: 106, column: 27, scope: !216)
!216 = distinct !DILexicalBlock(scope: !217, file: !3, line: 106, column: 21)
!217 = distinct !DILexicalBlock(scope: !212, file: !3, line: 104, column: 13)
!218 = !DILocation(line: 106, column: 32, scope: !216)
!219 = !DILocation(line: 106, column: 31, scope: !216)
!220 = !DILocation(line: 106, column: 51, scope: !216)
!221 = !DILocation(line: 106, column: 50, scope: !216)
!222 = !DILocation(line: 106, column: 41, scope: !216)
!223 = !DILocation(line: 106, column: 61, scope: !216)
!224 = !DILocation(line: 106, column: 21, scope: !216)
!225 = !DILocation(line: 106, column: 68, scope: !216)
!226 = !DILocation(line: 106, column: 21, scope: !217)
!227 = !DILocation(line: 108, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !216, file: !3, line: 107, column: 17)
!229 = !DILocation(line: 110, column: 21, scope: !228)
!230 = !DILocation(line: 110, column: 26, scope: !228)
!231 = !DILocation(line: 110, column: 35, scope: !228)
!232 = !DILocation(line: 111, column: 17, scope: !228)
!233 = !DILocation(line: 112, column: 24, scope: !217)
!234 = !DILocation(line: 112, column: 17, scope: !217)
!235 = !DILocation(line: 113, column: 13, scope: !217)
!236 = !DILocation(line: 114, column: 9, scope: !209)
!237 = !DILocation(line: 116, column: 65, scope: !189)
!238 = !DILocation(line: 116, column: 63, scope: !189)
!239 = !DILocation(line: 117, column: 5, scope: !189)
!240 = !DILocation(line: 118, column: 1, scope: !189)
!241 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_68_good", scope: !3, file: !3, line: 120, type: !62, scopeLine: 121, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!242 = !DILocation(line: 122, column: 5, scope: !241)
!243 = !DILocation(line: 123, column: 5, scope: !241)
!244 = !DILocation(line: 124, column: 1, scope: !241)
!245 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_68b_badSink", scope: !56, file: !56, line: 38, type: !62, scopeLine: 39, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!246 = !DILocalVariable(name: "data", scope: !245, file: !56, line: 40, type: !11)
!247 = !DILocation(line: 40, column: 12, scope: !245)
!248 = !DILocation(line: 40, column: 19, scope: !245)
!249 = !DILocalVariable(name: "i", scope: !250, file: !56, line: 42, type: !7)
!250 = distinct !DILexicalBlock(scope: !245, file: !56, line: 41, column: 5)
!251 = !DILocation(line: 42, column: 13, scope: !250)
!252 = !DILocalVariable(name: "n", scope: !250, file: !56, line: 42, type: !7)
!253 = !DILocation(line: 42, column: 16, scope: !250)
!254 = !DILocalVariable(name: "intVariable", scope: !250, file: !56, line: 42, type: !7)
!255 = !DILocation(line: 42, column: 19, scope: !250)
!256 = !DILocation(line: 43, column: 20, scope: !257)
!257 = distinct !DILexicalBlock(scope: !250, file: !56, line: 43, column: 13)
!258 = !DILocation(line: 43, column: 13, scope: !257)
!259 = !DILocation(line: 43, column: 36, scope: !257)
!260 = !DILocation(line: 43, column: 13, scope: !250)
!261 = !DILocation(line: 46, column: 25, scope: !262)
!262 = distinct !DILexicalBlock(scope: !257, file: !56, line: 44, column: 9)
!263 = !DILocation(line: 47, column: 20, scope: !264)
!264 = distinct !DILexicalBlock(scope: !262, file: !56, line: 47, column: 13)
!265 = !DILocation(line: 47, column: 18, scope: !264)
!266 = !DILocation(line: 47, column: 25, scope: !267)
!267 = distinct !DILexicalBlock(scope: !264, file: !56, line: 47, column: 13)
!268 = !DILocation(line: 47, column: 29, scope: !267)
!269 = !DILocation(line: 47, column: 27, scope: !267)
!270 = !DILocation(line: 47, column: 13, scope: !264)
!271 = !DILocation(line: 50, column: 28, scope: !272)
!272 = distinct !DILexicalBlock(scope: !267, file: !56, line: 48, column: 13)
!273 = !DILocation(line: 51, column: 13, scope: !272)
!274 = !DILocation(line: 47, column: 33, scope: !267)
!275 = !DILocation(line: 47, column: 13, scope: !267)
!276 = distinct !{!276, !270, !277, !278}
!277 = !DILocation(line: 51, column: 13, scope: !264)
!278 = !{!"llvm.loop.mustprogress"}
!279 = !DILocation(line: 52, column: 26, scope: !262)
!280 = !DILocation(line: 52, column: 13, scope: !262)
!281 = !DILocation(line: 53, column: 9, scope: !262)
!282 = !DILocation(line: 55, column: 1, scope: !245)
!283 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_68b_goodG2BSink", scope: !56, file: !56, line: 62, type: !62, scopeLine: 63, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!284 = !DILocalVariable(name: "data", scope: !283, file: !56, line: 64, type: !11)
!285 = !DILocation(line: 64, column: 12, scope: !283)
!286 = !DILocation(line: 64, column: 19, scope: !283)
!287 = !DILocalVariable(name: "i", scope: !288, file: !56, line: 66, type: !7)
!288 = distinct !DILexicalBlock(scope: !283, file: !56, line: 65, column: 5)
!289 = !DILocation(line: 66, column: 13, scope: !288)
!290 = !DILocalVariable(name: "n", scope: !288, file: !56, line: 66, type: !7)
!291 = !DILocation(line: 66, column: 16, scope: !288)
!292 = !DILocalVariable(name: "intVariable", scope: !288, file: !56, line: 66, type: !7)
!293 = !DILocation(line: 66, column: 19, scope: !288)
!294 = !DILocation(line: 67, column: 20, scope: !295)
!295 = distinct !DILexicalBlock(scope: !288, file: !56, line: 67, column: 13)
!296 = !DILocation(line: 67, column: 13, scope: !295)
!297 = !DILocation(line: 67, column: 36, scope: !295)
!298 = !DILocation(line: 67, column: 13, scope: !288)
!299 = !DILocation(line: 70, column: 25, scope: !300)
!300 = distinct !DILexicalBlock(scope: !295, file: !56, line: 68, column: 9)
!301 = !DILocation(line: 71, column: 20, scope: !302)
!302 = distinct !DILexicalBlock(scope: !300, file: !56, line: 71, column: 13)
!303 = !DILocation(line: 71, column: 18, scope: !302)
!304 = !DILocation(line: 71, column: 25, scope: !305)
!305 = distinct !DILexicalBlock(scope: !302, file: !56, line: 71, column: 13)
!306 = !DILocation(line: 71, column: 29, scope: !305)
!307 = !DILocation(line: 71, column: 27, scope: !305)
!308 = !DILocation(line: 71, column: 13, scope: !302)
!309 = !DILocation(line: 74, column: 28, scope: !310)
!310 = distinct !DILexicalBlock(scope: !305, file: !56, line: 72, column: 13)
!311 = !DILocation(line: 75, column: 13, scope: !310)
!312 = !DILocation(line: 71, column: 33, scope: !305)
!313 = !DILocation(line: 71, column: 13, scope: !305)
!314 = distinct !{!314, !308, !315, !278}
!315 = !DILocation(line: 75, column: 13, scope: !302)
!316 = !DILocation(line: 76, column: 26, scope: !300)
!317 = !DILocation(line: 76, column: 13, scope: !300)
!318 = !DILocation(line: 77, column: 9, scope: !300)
!319 = !DILocation(line: 79, column: 1, scope: !283)
!320 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_68b_goodB2GSink", scope: !56, file: !56, line: 82, type: !62, scopeLine: 83, spFlags: DISPFlagDefinition, unit: !55, retainedNodes: !4)
!321 = !DILocalVariable(name: "data", scope: !320, file: !56, line: 84, type: !11)
!322 = !DILocation(line: 84, column: 12, scope: !320)
!323 = !DILocation(line: 84, column: 19, scope: !320)
!324 = !DILocalVariable(name: "i", scope: !325, file: !56, line: 86, type: !7)
!325 = distinct !DILexicalBlock(scope: !320, file: !56, line: 85, column: 5)
!326 = !DILocation(line: 86, column: 13, scope: !325)
!327 = !DILocalVariable(name: "n", scope: !325, file: !56, line: 86, type: !7)
!328 = !DILocation(line: 86, column: 16, scope: !325)
!329 = !DILocalVariable(name: "intVariable", scope: !325, file: !56, line: 86, type: !7)
!330 = !DILocation(line: 86, column: 19, scope: !325)
!331 = !DILocation(line: 87, column: 20, scope: !332)
!332 = distinct !DILexicalBlock(scope: !325, file: !56, line: 87, column: 13)
!333 = !DILocation(line: 87, column: 13, scope: !332)
!334 = !DILocation(line: 87, column: 36, scope: !332)
!335 = !DILocation(line: 87, column: 13, scope: !325)
!336 = !DILocation(line: 90, column: 17, scope: !337)
!337 = distinct !DILexicalBlock(scope: !338, file: !56, line: 90, column: 17)
!338 = distinct !DILexicalBlock(scope: !332, file: !56, line: 88, column: 9)
!339 = !DILocation(line: 90, column: 19, scope: !337)
!340 = !DILocation(line: 90, column: 17, scope: !338)
!341 = !DILocation(line: 92, column: 29, scope: !342)
!342 = distinct !DILexicalBlock(scope: !337, file: !56, line: 91, column: 13)
!343 = !DILocation(line: 93, column: 24, scope: !344)
!344 = distinct !DILexicalBlock(scope: !342, file: !56, line: 93, column: 17)
!345 = !DILocation(line: 93, column: 22, scope: !344)
!346 = !DILocation(line: 93, column: 29, scope: !347)
!347 = distinct !DILexicalBlock(scope: !344, file: !56, line: 93, column: 17)
!348 = !DILocation(line: 93, column: 33, scope: !347)
!349 = !DILocation(line: 93, column: 31, scope: !347)
!350 = !DILocation(line: 93, column: 17, scope: !344)
!351 = !DILocation(line: 96, column: 32, scope: !352)
!352 = distinct !DILexicalBlock(scope: !347, file: !56, line: 94, column: 17)
!353 = !DILocation(line: 97, column: 17, scope: !352)
!354 = !DILocation(line: 93, column: 37, scope: !347)
!355 = !DILocation(line: 93, column: 17, scope: !347)
!356 = distinct !{!356, !350, !357, !278}
!357 = !DILocation(line: 97, column: 17, scope: !344)
!358 = !DILocation(line: 98, column: 30, scope: !342)
!359 = !DILocation(line: 98, column: 17, scope: !342)
!360 = !DILocation(line: 99, column: 13, scope: !342)
!361 = !DILocation(line: 100, column: 9, scope: !338)
!362 = !DILocation(line: 102, column: 1, scope: !320)
!363 = distinct !DISubprogram(name: "printLine", scope: !18, file: !18, line: 11, type: !364, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!364 = !DISubroutineType(types: !365)
!365 = !{null, !11}
!366 = !DILocalVariable(name: "line", arg: 1, scope: !363, file: !18, line: 11, type: !11)
!367 = !DILocation(line: 11, column: 25, scope: !363)
!368 = !DILocation(line: 13, column: 1, scope: !363)
!369 = !DILocation(line: 14, column: 8, scope: !370)
!370 = distinct !DILexicalBlock(scope: !363, file: !18, line: 14, column: 8)
!371 = !DILocation(line: 14, column: 13, scope: !370)
!372 = !DILocation(line: 14, column: 8, scope: !363)
!373 = !DILocation(line: 16, column: 24, scope: !374)
!374 = distinct !DILexicalBlock(scope: !370, file: !18, line: 15, column: 5)
!375 = !DILocation(line: 16, column: 9, scope: !374)
!376 = !DILocation(line: 17, column: 5, scope: !374)
!377 = !DILocation(line: 18, column: 5, scope: !363)
!378 = !DILocation(line: 19, column: 1, scope: !363)
!379 = distinct !DISubprogram(name: "printSinkLine", scope: !18, file: !18, line: 20, type: !364, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!380 = !DILocalVariable(name: "line", arg: 1, scope: !379, file: !18, line: 20, type: !11)
!381 = !DILocation(line: 20, column: 29, scope: !379)
!382 = !DILocation(line: 22, column: 8, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !18, line: 22, column: 8)
!384 = !DILocation(line: 22, column: 13, scope: !383)
!385 = !DILocation(line: 22, column: 8, scope: !379)
!386 = !DILocation(line: 24, column: 24, scope: !387)
!387 = distinct !DILexicalBlock(scope: !383, file: !18, line: 23, column: 5)
!388 = !DILocation(line: 24, column: 9, scope: !387)
!389 = !DILocation(line: 25, column: 5, scope: !387)
!390 = !DILocation(line: 26, column: 1, scope: !379)
!391 = distinct !DISubprogram(name: "printWLine", scope: !18, file: !18, line: 27, type: !392, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!392 = !DISubroutineType(types: !393)
!393 = !{null, !394}
!394 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !395, size: 64)
!395 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !76, line: 74, baseType: !7)
!396 = !DILocalVariable(name: "line", arg: 1, scope: !391, file: !18, line: 27, type: !394)
!397 = !DILocation(line: 27, column: 29, scope: !391)
!398 = !DILocation(line: 29, column: 8, scope: !399)
!399 = distinct !DILexicalBlock(scope: !391, file: !18, line: 29, column: 8)
!400 = !DILocation(line: 29, column: 13, scope: !399)
!401 = !DILocation(line: 29, column: 8, scope: !391)
!402 = !DILocation(line: 31, column: 27, scope: !403)
!403 = distinct !DILexicalBlock(scope: !399, file: !18, line: 30, column: 5)
!404 = !DILocation(line: 31, column: 9, scope: !403)
!405 = !DILocation(line: 32, column: 5, scope: !403)
!406 = !DILocation(line: 33, column: 1, scope: !391)
!407 = distinct !DISubprogram(name: "printIntLine", scope: !18, file: !18, line: 35, type: !408, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!408 = !DISubroutineType(types: !409)
!409 = !{null, !7}
!410 = !DILocalVariable(name: "intNumber", arg: 1, scope: !407, file: !18, line: 35, type: !7)
!411 = !DILocation(line: 35, column: 24, scope: !407)
!412 = !DILocation(line: 37, column: 20, scope: !407)
!413 = !DILocation(line: 37, column: 5, scope: !407)
!414 = !DILocation(line: 38, column: 1, scope: !407)
!415 = distinct !DISubprogram(name: "printShortLine", scope: !18, file: !18, line: 40, type: !416, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!416 = !DISubroutineType(types: !417)
!417 = !{null, !418}
!418 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!419 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !415, file: !18, line: 40, type: !418)
!420 = !DILocation(line: 40, column: 28, scope: !415)
!421 = !DILocation(line: 42, column: 21, scope: !415)
!422 = !DILocation(line: 42, column: 5, scope: !415)
!423 = !DILocation(line: 43, column: 1, scope: !415)
!424 = distinct !DISubprogram(name: "printFloatLine", scope: !18, file: !18, line: 45, type: !425, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!425 = !DISubroutineType(types: !426)
!426 = !{null, !427}
!427 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!428 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !424, file: !18, line: 45, type: !427)
!429 = !DILocation(line: 45, column: 28, scope: !424)
!430 = !DILocation(line: 47, column: 20, scope: !424)
!431 = !DILocation(line: 47, column: 5, scope: !424)
!432 = !DILocation(line: 48, column: 1, scope: !424)
!433 = distinct !DISubprogram(name: "printLongLine", scope: !18, file: !18, line: 50, type: !434, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !110}
!436 = !DILocalVariable(name: "longNumber", arg: 1, scope: !433, file: !18, line: 50, type: !110)
!437 = !DILocation(line: 50, column: 26, scope: !433)
!438 = !DILocation(line: 52, column: 21, scope: !433)
!439 = !DILocation(line: 52, column: 5, scope: !433)
!440 = !DILocation(line: 53, column: 1, scope: !433)
!441 = distinct !DISubprogram(name: "printLongLongLine", scope: !18, file: !18, line: 55, type: !442, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !444}
!444 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !445, line: 27, baseType: !446)
!445 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!446 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !109, line: 44, baseType: !110)
!447 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !441, file: !18, line: 55, type: !444)
!448 = !DILocation(line: 55, column: 33, scope: !441)
!449 = !DILocation(line: 57, column: 29, scope: !441)
!450 = !DILocation(line: 57, column: 5, scope: !441)
!451 = !DILocation(line: 58, column: 1, scope: !441)
!452 = distinct !DISubprogram(name: "printSizeTLine", scope: !18, file: !18, line: 60, type: !453, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!453 = !DISubroutineType(types: !454)
!454 = !{null, !75}
!455 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !452, file: !18, line: 60, type: !75)
!456 = !DILocation(line: 60, column: 29, scope: !452)
!457 = !DILocation(line: 62, column: 21, scope: !452)
!458 = !DILocation(line: 62, column: 5, scope: !452)
!459 = !DILocation(line: 63, column: 1, scope: !452)
!460 = distinct !DISubprogram(name: "printHexCharLine", scope: !18, file: !18, line: 65, type: !461, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!461 = !DISubroutineType(types: !462)
!462 = !{null, !12}
!463 = !DILocalVariable(name: "charHex", arg: 1, scope: !460, file: !18, line: 65, type: !12)
!464 = !DILocation(line: 65, column: 29, scope: !460)
!465 = !DILocation(line: 67, column: 22, scope: !460)
!466 = !DILocation(line: 67, column: 5, scope: !460)
!467 = !DILocation(line: 68, column: 1, scope: !460)
!468 = distinct !DISubprogram(name: "printWcharLine", scope: !18, file: !18, line: 70, type: !469, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!469 = !DISubroutineType(types: !470)
!470 = !{null, !395}
!471 = !DILocalVariable(name: "wideChar", arg: 1, scope: !468, file: !18, line: 70, type: !395)
!472 = !DILocation(line: 70, column: 29, scope: !468)
!473 = !DILocalVariable(name: "s", scope: !468, file: !18, line: 74, type: !474)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !395, size: 64, elements: !475)
!475 = !{!476}
!476 = !DISubrange(count: 2)
!477 = !DILocation(line: 74, column: 13, scope: !468)
!478 = !DILocation(line: 75, column: 16, scope: !468)
!479 = !DILocation(line: 75, column: 9, scope: !468)
!480 = !DILocation(line: 75, column: 14, scope: !468)
!481 = !DILocation(line: 76, column: 9, scope: !468)
!482 = !DILocation(line: 76, column: 14, scope: !468)
!483 = !DILocation(line: 77, column: 21, scope: !468)
!484 = !DILocation(line: 77, column: 5, scope: !468)
!485 = !DILocation(line: 78, column: 1, scope: !468)
!486 = distinct !DISubprogram(name: "printUnsignedLine", scope: !18, file: !18, line: 80, type: !487, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!487 = !DISubroutineType(types: !488)
!488 = !{null, !22}
!489 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !486, file: !18, line: 80, type: !22)
!490 = !DILocation(line: 80, column: 33, scope: !486)
!491 = !DILocation(line: 82, column: 20, scope: !486)
!492 = !DILocation(line: 82, column: 5, scope: !486)
!493 = !DILocation(line: 83, column: 1, scope: !486)
!494 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !18, file: !18, line: 85, type: !495, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!495 = !DISubroutineType(types: !496)
!496 = !{null, !38}
!497 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !494, file: !18, line: 85, type: !38)
!498 = !DILocation(line: 85, column: 45, scope: !494)
!499 = !DILocation(line: 87, column: 22, scope: !494)
!500 = !DILocation(line: 87, column: 5, scope: !494)
!501 = !DILocation(line: 88, column: 1, scope: !494)
!502 = distinct !DISubprogram(name: "printDoubleLine", scope: !18, file: !18, line: 90, type: !503, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505}
!505 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!506 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !502, file: !18, line: 90, type: !505)
!507 = !DILocation(line: 90, column: 29, scope: !502)
!508 = !DILocation(line: 92, column: 20, scope: !502)
!509 = !DILocation(line: 92, column: 5, scope: !502)
!510 = !DILocation(line: 93, column: 1, scope: !502)
!511 = distinct !DISubprogram(name: "printStructLine", scope: !18, file: !18, line: 95, type: !512, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!512 = !DISubroutineType(types: !513)
!513 = !{null, !514}
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !516, line: 100, baseType: !517)
!516 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_114/source_code")
!517 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !516, line: 96, size: 64, elements: !518)
!518 = !{!519, !520}
!519 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !517, file: !516, line: 98, baseType: !7, size: 32)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !517, file: !516, line: 99, baseType: !7, size: 32, offset: 32)
!521 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !511, file: !18, line: 95, type: !514)
!522 = !DILocation(line: 95, column: 40, scope: !511)
!523 = !DILocation(line: 97, column: 26, scope: !511)
!524 = !DILocation(line: 97, column: 47, scope: !511)
!525 = !DILocation(line: 97, column: 55, scope: !511)
!526 = !DILocation(line: 97, column: 76, scope: !511)
!527 = !DILocation(line: 97, column: 5, scope: !511)
!528 = !DILocation(line: 98, column: 1, scope: !511)
!529 = distinct !DISubprogram(name: "printBytesLine", scope: !18, file: !18, line: 100, type: !530, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!530 = !DISubroutineType(types: !531)
!531 = !{null, !532, !75}
!532 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !38, size: 64)
!533 = !DILocalVariable(name: "bytes", arg: 1, scope: !529, file: !18, line: 100, type: !532)
!534 = !DILocation(line: 100, column: 38, scope: !529)
!535 = !DILocalVariable(name: "numBytes", arg: 2, scope: !529, file: !18, line: 100, type: !75)
!536 = !DILocation(line: 100, column: 52, scope: !529)
!537 = !DILocalVariable(name: "i", scope: !529, file: !18, line: 102, type: !75)
!538 = !DILocation(line: 102, column: 12, scope: !529)
!539 = !DILocation(line: 103, column: 12, scope: !540)
!540 = distinct !DILexicalBlock(scope: !529, file: !18, line: 103, column: 5)
!541 = !DILocation(line: 103, column: 10, scope: !540)
!542 = !DILocation(line: 103, column: 17, scope: !543)
!543 = distinct !DILexicalBlock(scope: !540, file: !18, line: 103, column: 5)
!544 = !DILocation(line: 103, column: 21, scope: !543)
!545 = !DILocation(line: 103, column: 19, scope: !543)
!546 = !DILocation(line: 103, column: 5, scope: !540)
!547 = !DILocation(line: 105, column: 24, scope: !548)
!548 = distinct !DILexicalBlock(scope: !543, file: !18, line: 104, column: 5)
!549 = !DILocation(line: 105, column: 30, scope: !548)
!550 = !DILocation(line: 105, column: 9, scope: !548)
!551 = !DILocation(line: 106, column: 5, scope: !548)
!552 = !DILocation(line: 103, column: 31, scope: !543)
!553 = !DILocation(line: 103, column: 5, scope: !543)
!554 = distinct !{!554, !546, !555, !278}
!555 = !DILocation(line: 106, column: 5, scope: !540)
!556 = !DILocation(line: 107, column: 5, scope: !529)
!557 = !DILocation(line: 108, column: 1, scope: !529)
!558 = distinct !DISubprogram(name: "decodeHexChars", scope: !18, file: !18, line: 113, type: !559, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !17, retainedNodes: !4)
!559 = !DISubroutineType(types: !560)
!560 = !{!75, !532, !75, !11}
!561 = !DILocalVariable(name: "bytes", arg: 1, scope: !558, file: !18, line: 113, type: !532)
!562 = !DILocation(line: 113, column: 39, scope: !558)
!563 = !DILocalVariable(name: "numBytes", arg: 2, scope: !558, file: !18, line: 113, type: !75)
!564 = !DILocation(line: 113, column: 53, scope: !558)
!565 = !DILocalVariable(name: "hex", arg: 3, scope: !558, file: !18, line: 113, type: !11)
!566 = !DILocation(line: 113, column: 71, scope: !558)
!567 = !DILocalVariable(name: "numWritten", scope: !558, file: !18, line: 115, type: !75)
!568 = !DILocation(line: 115, column: 12, scope: !558)
!569 = !DILocation(line: 121, column: 5, scope: !558)
!570 = !DILocation(line: 121, column: 12, scope: !558)
!571 = !DILocation(line: 121, column: 25, scope: !558)
!572 = !DILocation(line: 121, column: 23, scope: !558)
!573 = !DILocation(line: 121, column: 34, scope: !558)
!574 = !DILocation(line: 121, column: 37, scope: !558)
!575 = !DILocation(line: 121, column: 67, scope: !558)
!576 = !DILocation(line: 121, column: 70, scope: !558)
!577 = !DILocation(line: 0, scope: !558)
!578 = !DILocalVariable(name: "byte", scope: !579, file: !18, line: 123, type: !7)
!579 = distinct !DILexicalBlock(scope: !558, file: !18, line: 122, column: 5)
