; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"%s\0A\00", align 1
@.str.4 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_printf_17.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_026/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_17_bad", scope: !45, file: !45, line: 33, type: !53, scopeLine: 34, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null}
!55 = !DILocalVariable(name: "i", scope: !52, file: !45, line: 35, type: !23)
!56 = !DILocation(line: 35, column: 9, scope: !52)
!57 = !DILocalVariable(name: "j", scope: !52, file: !45, line: 35, type: !23)
!58 = !DILocation(line: 35, column: 11, scope: !52)
!59 = !DILocalVariable(name: "data", scope: !52, file: !45, line: 36, type: !42)
!60 = !DILocation(line: 36, column: 12, scope: !52)
!61 = !DILocalVariable(name: "dataBuffer", scope: !52, file: !45, line: 37, type: !62)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !63)
!63 = !{!64}
!64 = !DISubrange(count: 100)
!65 = !DILocation(line: 37, column: 10, scope: !52)
!66 = !DILocation(line: 38, column: 12, scope: !52)
!67 = !DILocation(line: 38, column: 10, scope: !52)
!68 = !DILocation(line: 39, column: 11, scope: !69)
!69 = distinct !DILexicalBlock(scope: !52, file: !45, line: 39, column: 5)
!70 = !DILocation(line: 39, column: 9, scope: !69)
!71 = !DILocation(line: 39, column: 16, scope: !72)
!72 = distinct !DILexicalBlock(scope: !69, file: !45, line: 39, column: 5)
!73 = !DILocation(line: 39, column: 18, scope: !72)
!74 = !DILocation(line: 39, column: 5, scope: !69)
!75 = !DILocalVariable(name: "dataLen", scope: !76, file: !45, line: 43, type: !78)
!76 = distinct !DILexicalBlock(scope: !77, file: !45, line: 41, column: 9)
!77 = distinct !DILexicalBlock(scope: !72, file: !45, line: 40, column: 5)
!78 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !79, line: 46, baseType: !80)
!79 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!80 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!81 = !DILocation(line: 43, column: 20, scope: !76)
!82 = !DILocation(line: 43, column: 37, scope: !76)
!83 = !DILocation(line: 43, column: 30, scope: !76)
!84 = !DILocalVariable(name: "pFile", scope: !76, file: !45, line: 44, type: !85)
!85 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !86, size: 64)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !87, line: 7, baseType: !88)
!87 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!88 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !89, line: 49, size: 1728, elements: !90)
!89 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !106, !108, !109, !110, !114, !115, !117, !121, !124, !126, !129, !132, !133, !134, !135, !136}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !88, file: !89, line: 51, baseType: !23, size: 32)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !88, file: !89, line: 54, baseType: !42, size: 64, offset: 64)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !88, file: !89, line: 55, baseType: !42, size: 64, offset: 128)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !88, file: !89, line: 56, baseType: !42, size: 64, offset: 192)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !88, file: !89, line: 57, baseType: !42, size: 64, offset: 256)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !88, file: !89, line: 58, baseType: !42, size: 64, offset: 320)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !88, file: !89, line: 59, baseType: !42, size: 64, offset: 384)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !88, file: !89, line: 60, baseType: !42, size: 64, offset: 448)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !88, file: !89, line: 61, baseType: !42, size: 64, offset: 512)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !88, file: !89, line: 64, baseType: !42, size: 64, offset: 576)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !88, file: !89, line: 65, baseType: !42, size: 64, offset: 640)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !88, file: !89, line: 66, baseType: !42, size: 64, offset: 704)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !88, file: !89, line: 68, baseType: !104, size: 64, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !105, size: 64)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !89, line: 36, flags: DIFlagFwdDecl)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !88, file: !89, line: 70, baseType: !107, size: 64, offset: 832)
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !88, file: !89, line: 72, baseType: !23, size: 32, offset: 896)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !88, file: !89, line: 73, baseType: !23, size: 32, offset: 928)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !88, file: !89, line: 74, baseType: !111, size: 64, offset: 960)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !112, line: 152, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!113 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !88, file: !89, line: 77, baseType: !24, size: 16, offset: 1024)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !88, file: !89, line: 78, baseType: !116, size: 8, offset: 1040)
!116 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !88, file: !89, line: 79, baseType: !118, size: 8, offset: 1048)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !119)
!119 = !{!120}
!120 = !DISubrange(count: 1)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !88, file: !89, line: 81, baseType: !122, size: 64, offset: 1088)
!122 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !123, size: 64)
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !89, line: 43, baseType: null)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !88, file: !89, line: 89, baseType: !125, size: 64, offset: 1152)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !112, line: 153, baseType: !113)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !88, file: !89, line: 91, baseType: !127, size: 64, offset: 1216)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !89, line: 37, flags: DIFlagFwdDecl)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !88, file: !89, line: 92, baseType: !130, size: 64, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !89, line: 38, flags: DIFlagFwdDecl)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !88, file: !89, line: 93, baseType: !107, size: 64, offset: 1344)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !88, file: !89, line: 94, baseType: !22, size: 64, offset: 1408)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !88, file: !89, line: 95, baseType: !78, size: 64, offset: 1472)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !88, file: !89, line: 96, baseType: !23, size: 32, offset: 1536)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !88, file: !89, line: 98, baseType: !137, size: 160, offset: 1568)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 20)
!140 = !DILocation(line: 44, column: 20, scope: !76)
!141 = !DILocation(line: 46, column: 21, scope: !142)
!142 = distinct !DILexicalBlock(scope: !76, file: !45, line: 46, column: 17)
!143 = !DILocation(line: 46, column: 20, scope: !142)
!144 = !DILocation(line: 46, column: 29, scope: !142)
!145 = !DILocation(line: 46, column: 17, scope: !76)
!146 = !DILocation(line: 48, column: 25, scope: !147)
!147 = distinct !DILexicalBlock(scope: !142, file: !45, line: 47, column: 13)
!148 = !DILocation(line: 48, column: 23, scope: !147)
!149 = !DILocation(line: 49, column: 21, scope: !150)
!150 = distinct !DILexicalBlock(scope: !147, file: !45, line: 49, column: 21)
!151 = !DILocation(line: 49, column: 27, scope: !150)
!152 = !DILocation(line: 49, column: 21, scope: !147)
!153 = !DILocation(line: 52, column: 31, scope: !154)
!154 = distinct !DILexicalBlock(scope: !155, file: !45, line: 52, column: 25)
!155 = distinct !DILexicalBlock(scope: !150, file: !45, line: 50, column: 17)
!156 = !DILocation(line: 52, column: 36, scope: !154)
!157 = !DILocation(line: 52, column: 35, scope: !154)
!158 = !DILocation(line: 52, column: 55, scope: !154)
!159 = !DILocation(line: 52, column: 54, scope: !154)
!160 = !DILocation(line: 52, column: 45, scope: !154)
!161 = !DILocation(line: 52, column: 65, scope: !154)
!162 = !DILocation(line: 52, column: 25, scope: !154)
!163 = !DILocation(line: 52, column: 72, scope: !154)
!164 = !DILocation(line: 52, column: 25, scope: !155)
!165 = !DILocation(line: 54, column: 25, scope: !166)
!166 = distinct !DILexicalBlock(scope: !154, file: !45, line: 53, column: 21)
!167 = !DILocation(line: 56, column: 25, scope: !166)
!168 = !DILocation(line: 56, column: 30, scope: !166)
!169 = !DILocation(line: 56, column: 39, scope: !166)
!170 = !DILocation(line: 57, column: 21, scope: !166)
!171 = !DILocation(line: 58, column: 28, scope: !155)
!172 = !DILocation(line: 58, column: 21, scope: !155)
!173 = !DILocation(line: 59, column: 17, scope: !155)
!174 = !DILocation(line: 60, column: 13, scope: !147)
!175 = !DILocation(line: 62, column: 5, scope: !77)
!176 = !DILocation(line: 39, column: 24, scope: !72)
!177 = !DILocation(line: 39, column: 5, scope: !72)
!178 = distinct !{!178, !74, !179, !180}
!179 = !DILocation(line: 62, column: 5, scope: !69)
!180 = !{!"llvm.loop.mustprogress"}
!181 = !DILocation(line: 63, column: 11, scope: !182)
!182 = distinct !DILexicalBlock(scope: !52, file: !45, line: 63, column: 5)
!183 = !DILocation(line: 63, column: 9, scope: !182)
!184 = !DILocation(line: 63, column: 16, scope: !185)
!185 = distinct !DILexicalBlock(scope: !182, file: !45, line: 63, column: 5)
!186 = !DILocation(line: 63, column: 18, scope: !185)
!187 = !DILocation(line: 63, column: 5, scope: !182)
!188 = !DILocation(line: 66, column: 16, scope: !189)
!189 = distinct !DILexicalBlock(scope: !185, file: !45, line: 64, column: 5)
!190 = !DILocation(line: 66, column: 9, scope: !189)
!191 = !DILocation(line: 67, column: 5, scope: !189)
!192 = !DILocation(line: 63, column: 24, scope: !185)
!193 = !DILocation(line: 63, column: 5, scope: !185)
!194 = distinct !{!194, !187, !195, !180}
!195 = !DILocation(line: 67, column: 5, scope: !182)
!196 = !DILocation(line: 68, column: 1, scope: !52)
!197 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 75, type: !53, scopeLine: 76, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!198 = !DILocalVariable(name: "i", scope: !197, file: !45, line: 77, type: !23)
!199 = !DILocation(line: 77, column: 9, scope: !197)
!200 = !DILocalVariable(name: "k", scope: !197, file: !45, line: 77, type: !23)
!201 = !DILocation(line: 77, column: 11, scope: !197)
!202 = !DILocalVariable(name: "data", scope: !197, file: !45, line: 78, type: !42)
!203 = !DILocation(line: 78, column: 12, scope: !197)
!204 = !DILocalVariable(name: "dataBuffer", scope: !197, file: !45, line: 79, type: !62)
!205 = !DILocation(line: 79, column: 10, scope: !197)
!206 = !DILocation(line: 80, column: 12, scope: !197)
!207 = !DILocation(line: 80, column: 10, scope: !197)
!208 = !DILocation(line: 81, column: 11, scope: !209)
!209 = distinct !DILexicalBlock(scope: !197, file: !45, line: 81, column: 5)
!210 = !DILocation(line: 81, column: 9, scope: !209)
!211 = !DILocation(line: 81, column: 16, scope: !212)
!212 = distinct !DILexicalBlock(scope: !209, file: !45, line: 81, column: 5)
!213 = !DILocation(line: 81, column: 18, scope: !212)
!214 = !DILocation(line: 81, column: 5, scope: !209)
!215 = !DILocalVariable(name: "dataLen", scope: !216, file: !45, line: 85, type: !78)
!216 = distinct !DILexicalBlock(scope: !217, file: !45, line: 83, column: 9)
!217 = distinct !DILexicalBlock(scope: !212, file: !45, line: 82, column: 5)
!218 = !DILocation(line: 85, column: 20, scope: !216)
!219 = !DILocation(line: 85, column: 37, scope: !216)
!220 = !DILocation(line: 85, column: 30, scope: !216)
!221 = !DILocalVariable(name: "pFile", scope: !216, file: !45, line: 86, type: !85)
!222 = !DILocation(line: 86, column: 20, scope: !216)
!223 = !DILocation(line: 88, column: 21, scope: !224)
!224 = distinct !DILexicalBlock(scope: !216, file: !45, line: 88, column: 17)
!225 = !DILocation(line: 88, column: 20, scope: !224)
!226 = !DILocation(line: 88, column: 29, scope: !224)
!227 = !DILocation(line: 88, column: 17, scope: !216)
!228 = !DILocation(line: 90, column: 25, scope: !229)
!229 = distinct !DILexicalBlock(scope: !224, file: !45, line: 89, column: 13)
!230 = !DILocation(line: 90, column: 23, scope: !229)
!231 = !DILocation(line: 91, column: 21, scope: !232)
!232 = distinct !DILexicalBlock(scope: !229, file: !45, line: 91, column: 21)
!233 = !DILocation(line: 91, column: 27, scope: !232)
!234 = !DILocation(line: 91, column: 21, scope: !229)
!235 = !DILocation(line: 94, column: 31, scope: !236)
!236 = distinct !DILexicalBlock(scope: !237, file: !45, line: 94, column: 25)
!237 = distinct !DILexicalBlock(scope: !232, file: !45, line: 92, column: 17)
!238 = !DILocation(line: 94, column: 36, scope: !236)
!239 = !DILocation(line: 94, column: 35, scope: !236)
!240 = !DILocation(line: 94, column: 55, scope: !236)
!241 = !DILocation(line: 94, column: 54, scope: !236)
!242 = !DILocation(line: 94, column: 45, scope: !236)
!243 = !DILocation(line: 94, column: 65, scope: !236)
!244 = !DILocation(line: 94, column: 25, scope: !236)
!245 = !DILocation(line: 94, column: 72, scope: !236)
!246 = !DILocation(line: 94, column: 25, scope: !237)
!247 = !DILocation(line: 96, column: 25, scope: !248)
!248 = distinct !DILexicalBlock(scope: !236, file: !45, line: 95, column: 21)
!249 = !DILocation(line: 98, column: 25, scope: !248)
!250 = !DILocation(line: 98, column: 30, scope: !248)
!251 = !DILocation(line: 98, column: 39, scope: !248)
!252 = !DILocation(line: 99, column: 21, scope: !248)
!253 = !DILocation(line: 100, column: 28, scope: !237)
!254 = !DILocation(line: 100, column: 21, scope: !237)
!255 = !DILocation(line: 101, column: 17, scope: !237)
!256 = !DILocation(line: 102, column: 13, scope: !229)
!257 = !DILocation(line: 104, column: 5, scope: !217)
!258 = !DILocation(line: 81, column: 24, scope: !212)
!259 = !DILocation(line: 81, column: 5, scope: !212)
!260 = distinct !{!260, !214, !261, !180}
!261 = !DILocation(line: 104, column: 5, scope: !209)
!262 = !DILocation(line: 105, column: 11, scope: !263)
!263 = distinct !DILexicalBlock(scope: !197, file: !45, line: 105, column: 5)
!264 = !DILocation(line: 105, column: 9, scope: !263)
!265 = !DILocation(line: 105, column: 16, scope: !266)
!266 = distinct !DILexicalBlock(scope: !263, file: !45, line: 105, column: 5)
!267 = !DILocation(line: 105, column: 18, scope: !266)
!268 = !DILocation(line: 105, column: 5, scope: !263)
!269 = !DILocation(line: 108, column: 24, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !45, line: 106, column: 5)
!271 = !DILocation(line: 108, column: 9, scope: !270)
!272 = !DILocation(line: 109, column: 5, scope: !270)
!273 = !DILocation(line: 105, column: 24, scope: !266)
!274 = !DILocation(line: 105, column: 5, scope: !266)
!275 = distinct !{!275, !268, !276, !180}
!276 = !DILocation(line: 109, column: 5, scope: !263)
!277 = !DILocation(line: 110, column: 1, scope: !197)
!278 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 113, type: !53, scopeLine: 114, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!279 = !DILocalVariable(name: "h", scope: !278, file: !45, line: 115, type: !23)
!280 = !DILocation(line: 115, column: 9, scope: !278)
!281 = !DILocalVariable(name: "j", scope: !278, file: !45, line: 115, type: !23)
!282 = !DILocation(line: 115, column: 11, scope: !278)
!283 = !DILocalVariable(name: "data", scope: !278, file: !45, line: 116, type: !42)
!284 = !DILocation(line: 116, column: 12, scope: !278)
!285 = !DILocalVariable(name: "dataBuffer", scope: !278, file: !45, line: 117, type: !62)
!286 = !DILocation(line: 117, column: 10, scope: !278)
!287 = !DILocation(line: 118, column: 12, scope: !278)
!288 = !DILocation(line: 118, column: 10, scope: !278)
!289 = !DILocation(line: 119, column: 11, scope: !290)
!290 = distinct !DILexicalBlock(scope: !278, file: !45, line: 119, column: 5)
!291 = !DILocation(line: 119, column: 9, scope: !290)
!292 = !DILocation(line: 119, column: 16, scope: !293)
!293 = distinct !DILexicalBlock(scope: !290, file: !45, line: 119, column: 5)
!294 = !DILocation(line: 119, column: 18, scope: !293)
!295 = !DILocation(line: 119, column: 5, scope: !290)
!296 = !DILocation(line: 122, column: 16, scope: !297)
!297 = distinct !DILexicalBlock(scope: !293, file: !45, line: 120, column: 5)
!298 = !DILocation(line: 122, column: 9, scope: !297)
!299 = !DILocation(line: 123, column: 5, scope: !297)
!300 = !DILocation(line: 119, column: 24, scope: !293)
!301 = !DILocation(line: 119, column: 5, scope: !293)
!302 = distinct !{!302, !295, !303, !180}
!303 = !DILocation(line: 123, column: 5, scope: !290)
!304 = !DILocation(line: 124, column: 11, scope: !305)
!305 = distinct !DILexicalBlock(scope: !278, file: !45, line: 124, column: 5)
!306 = !DILocation(line: 124, column: 9, scope: !305)
!307 = !DILocation(line: 124, column: 16, scope: !308)
!308 = distinct !DILexicalBlock(scope: !305, file: !45, line: 124, column: 5)
!309 = !DILocation(line: 124, column: 18, scope: !308)
!310 = !DILocation(line: 124, column: 5, scope: !305)
!311 = !DILocation(line: 127, column: 16, scope: !312)
!312 = distinct !DILexicalBlock(scope: !308, file: !45, line: 125, column: 5)
!313 = !DILocation(line: 127, column: 9, scope: !312)
!314 = !DILocation(line: 128, column: 5, scope: !312)
!315 = !DILocation(line: 124, column: 24, scope: !308)
!316 = !DILocation(line: 124, column: 5, scope: !308)
!317 = distinct !{!317, !310, !318, !180}
!318 = !DILocation(line: 128, column: 5, scope: !305)
!319 = !DILocation(line: 129, column: 1, scope: !278)
!320 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_printf_17_good", scope: !45, file: !45, line: 131, type: !53, scopeLine: 132, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!321 = !DILocation(line: 133, column: 5, scope: !320)
!322 = !DILocation(line: 134, column: 5, scope: !320)
!323 = !DILocation(line: 135, column: 1, scope: !320)
!324 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !325, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!325 = !DISubroutineType(types: !326)
!326 = !{null, !42}
!327 = !DILocalVariable(name: "line", arg: 1, scope: !324, file: !3, line: 11, type: !42)
!328 = !DILocation(line: 11, column: 25, scope: !324)
!329 = !DILocation(line: 13, column: 1, scope: !324)
!330 = !DILocation(line: 14, column: 8, scope: !331)
!331 = distinct !DILexicalBlock(scope: !324, file: !3, line: 14, column: 8)
!332 = !DILocation(line: 14, column: 13, scope: !331)
!333 = !DILocation(line: 14, column: 8, scope: !324)
!334 = !DILocation(line: 16, column: 24, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 15, column: 5)
!336 = !DILocation(line: 16, column: 9, scope: !335)
!337 = !DILocation(line: 17, column: 5, scope: !335)
!338 = !DILocation(line: 18, column: 5, scope: !324)
!339 = !DILocation(line: 19, column: 1, scope: !324)
!340 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !325, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!341 = !DILocalVariable(name: "line", arg: 1, scope: !340, file: !3, line: 20, type: !42)
!342 = !DILocation(line: 20, column: 29, scope: !340)
!343 = !DILocation(line: 22, column: 8, scope: !344)
!344 = distinct !DILexicalBlock(scope: !340, file: !3, line: 22, column: 8)
!345 = !DILocation(line: 22, column: 13, scope: !344)
!346 = !DILocation(line: 22, column: 8, scope: !340)
!347 = !DILocation(line: 24, column: 24, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 23, column: 5)
!349 = !DILocation(line: 24, column: 9, scope: !348)
!350 = !DILocation(line: 25, column: 5, scope: !348)
!351 = !DILocation(line: 26, column: 1, scope: !340)
!352 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !353, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!353 = !DISubroutineType(types: !354)
!354 = !{null, !355}
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !79, line: 74, baseType: !23)
!357 = !DILocalVariable(name: "line", arg: 1, scope: !352, file: !3, line: 27, type: !355)
!358 = !DILocation(line: 27, column: 29, scope: !352)
!359 = !DILocation(line: 29, column: 8, scope: !360)
!360 = distinct !DILexicalBlock(scope: !352, file: !3, line: 29, column: 8)
!361 = !DILocation(line: 29, column: 13, scope: !360)
!362 = !DILocation(line: 29, column: 8, scope: !352)
!363 = !DILocation(line: 31, column: 27, scope: !364)
!364 = distinct !DILexicalBlock(scope: !360, file: !3, line: 30, column: 5)
!365 = !DILocation(line: 31, column: 9, scope: !364)
!366 = !DILocation(line: 32, column: 5, scope: !364)
!367 = !DILocation(line: 33, column: 1, scope: !352)
!368 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !369, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!369 = !DISubroutineType(types: !370)
!370 = !{null, !23}
!371 = !DILocalVariable(name: "intNumber", arg: 1, scope: !368, file: !3, line: 35, type: !23)
!372 = !DILocation(line: 35, column: 24, scope: !368)
!373 = !DILocation(line: 37, column: 20, scope: !368)
!374 = !DILocation(line: 37, column: 5, scope: !368)
!375 = !DILocation(line: 38, column: 1, scope: !368)
!376 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !377, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!380 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !376, file: !3, line: 40, type: !379)
!381 = !DILocation(line: 40, column: 28, scope: !376)
!382 = !DILocation(line: 42, column: 21, scope: !376)
!383 = !DILocation(line: 42, column: 5, scope: !376)
!384 = !DILocation(line: 43, column: 1, scope: !376)
!385 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !386, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !388}
!388 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!389 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !385, file: !3, line: 45, type: !388)
!390 = !DILocation(line: 45, column: 28, scope: !385)
!391 = !DILocation(line: 47, column: 20, scope: !385)
!392 = !DILocation(line: 47, column: 5, scope: !385)
!393 = !DILocation(line: 48, column: 1, scope: !385)
!394 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !395, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!395 = !DISubroutineType(types: !396)
!396 = !{null, !113}
!397 = !DILocalVariable(name: "longNumber", arg: 1, scope: !394, file: !3, line: 50, type: !113)
!398 = !DILocation(line: 50, column: 26, scope: !394)
!399 = !DILocation(line: 52, column: 21, scope: !394)
!400 = !DILocation(line: 52, column: 5, scope: !394)
!401 = !DILocation(line: 53, column: 1, scope: !394)
!402 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !403, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!403 = !DISubroutineType(types: !404)
!404 = !{null, !405}
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !406, line: 27, baseType: !407)
!406 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!407 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !112, line: 44, baseType: !113)
!408 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !402, file: !3, line: 55, type: !405)
!409 = !DILocation(line: 55, column: 33, scope: !402)
!410 = !DILocation(line: 57, column: 29, scope: !402)
!411 = !DILocation(line: 57, column: 5, scope: !402)
!412 = !DILocation(line: 58, column: 1, scope: !402)
!413 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !414, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!414 = !DISubroutineType(types: !415)
!415 = !{null, !78}
!416 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !413, file: !3, line: 60, type: !78)
!417 = !DILocation(line: 60, column: 29, scope: !413)
!418 = !DILocation(line: 62, column: 21, scope: !413)
!419 = !DILocation(line: 62, column: 5, scope: !413)
!420 = !DILocation(line: 63, column: 1, scope: !413)
!421 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !422, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!422 = !DISubroutineType(types: !423)
!423 = !{null, !43}
!424 = !DILocalVariable(name: "charHex", arg: 1, scope: !421, file: !3, line: 65, type: !43)
!425 = !DILocation(line: 65, column: 29, scope: !421)
!426 = !DILocation(line: 67, column: 22, scope: !421)
!427 = !DILocation(line: 67, column: 5, scope: !421)
!428 = !DILocation(line: 68, column: 1, scope: !421)
!429 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !430, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!430 = !DISubroutineType(types: !431)
!431 = !{null, !356}
!432 = !DILocalVariable(name: "wideChar", arg: 1, scope: !429, file: !3, line: 70, type: !356)
!433 = !DILocation(line: 70, column: 29, scope: !429)
!434 = !DILocalVariable(name: "s", scope: !429, file: !3, line: 74, type: !435)
!435 = !DICompositeType(tag: DW_TAG_array_type, baseType: !356, size: 64, elements: !436)
!436 = !{!437}
!437 = !DISubrange(count: 2)
!438 = !DILocation(line: 74, column: 13, scope: !429)
!439 = !DILocation(line: 75, column: 16, scope: !429)
!440 = !DILocation(line: 75, column: 9, scope: !429)
!441 = !DILocation(line: 75, column: 14, scope: !429)
!442 = !DILocation(line: 76, column: 9, scope: !429)
!443 = !DILocation(line: 76, column: 14, scope: !429)
!444 = !DILocation(line: 77, column: 21, scope: !429)
!445 = !DILocation(line: 77, column: 5, scope: !429)
!446 = !DILocation(line: 78, column: 1, scope: !429)
!447 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !448, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!448 = !DISubroutineType(types: !449)
!449 = !{null, !7}
!450 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !447, file: !3, line: 80, type: !7)
!451 = !DILocation(line: 80, column: 33, scope: !447)
!452 = !DILocation(line: 82, column: 20, scope: !447)
!453 = !DILocation(line: 82, column: 5, scope: !447)
!454 = !DILocation(line: 83, column: 1, scope: !447)
!455 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !456, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!456 = !DISubroutineType(types: !457)
!457 = !{null, !25}
!458 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !455, file: !3, line: 85, type: !25)
!459 = !DILocation(line: 85, column: 45, scope: !455)
!460 = !DILocation(line: 87, column: 22, scope: !455)
!461 = !DILocation(line: 87, column: 5, scope: !455)
!462 = !DILocation(line: 88, column: 1, scope: !455)
!463 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !464, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!464 = !DISubroutineType(types: !465)
!465 = !{null, !466}
!466 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!467 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !463, file: !3, line: 90, type: !466)
!468 = !DILocation(line: 90, column: 29, scope: !463)
!469 = !DILocation(line: 92, column: 20, scope: !463)
!470 = !DILocation(line: 92, column: 5, scope: !463)
!471 = !DILocation(line: 93, column: 1, scope: !463)
!472 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !473, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!473 = !DISubroutineType(types: !474)
!474 = !{null, !475}
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !476, size: 64)
!476 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !477, line: 100, baseType: !478)
!477 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_026/source_code")
!478 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !477, line: 96, size: 64, elements: !479)
!479 = !{!480, !481}
!480 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !478, file: !477, line: 98, baseType: !23, size: 32)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !478, file: !477, line: 99, baseType: !23, size: 32, offset: 32)
!482 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !472, file: !3, line: 95, type: !475)
!483 = !DILocation(line: 95, column: 40, scope: !472)
!484 = !DILocation(line: 97, column: 26, scope: !472)
!485 = !DILocation(line: 97, column: 47, scope: !472)
!486 = !DILocation(line: 97, column: 55, scope: !472)
!487 = !DILocation(line: 97, column: 76, scope: !472)
!488 = !DILocation(line: 97, column: 5, scope: !472)
!489 = !DILocation(line: 98, column: 1, scope: !472)
!490 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !491, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!491 = !DISubroutineType(types: !492)
!492 = !{null, !493, !78}
!493 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!494 = !DILocalVariable(name: "bytes", arg: 1, scope: !490, file: !3, line: 100, type: !493)
!495 = !DILocation(line: 100, column: 38, scope: !490)
!496 = !DILocalVariable(name: "numBytes", arg: 2, scope: !490, file: !3, line: 100, type: !78)
!497 = !DILocation(line: 100, column: 52, scope: !490)
!498 = !DILocalVariable(name: "i", scope: !490, file: !3, line: 102, type: !78)
!499 = !DILocation(line: 102, column: 12, scope: !490)
!500 = !DILocation(line: 103, column: 12, scope: !501)
!501 = distinct !DILexicalBlock(scope: !490, file: !3, line: 103, column: 5)
!502 = !DILocation(line: 103, column: 10, scope: !501)
!503 = !DILocation(line: 103, column: 17, scope: !504)
!504 = distinct !DILexicalBlock(scope: !501, file: !3, line: 103, column: 5)
!505 = !DILocation(line: 103, column: 21, scope: !504)
!506 = !DILocation(line: 103, column: 19, scope: !504)
!507 = !DILocation(line: 103, column: 5, scope: !501)
!508 = !DILocation(line: 105, column: 24, scope: !509)
!509 = distinct !DILexicalBlock(scope: !504, file: !3, line: 104, column: 5)
!510 = !DILocation(line: 105, column: 30, scope: !509)
!511 = !DILocation(line: 105, column: 9, scope: !509)
!512 = !DILocation(line: 106, column: 5, scope: !509)
!513 = !DILocation(line: 103, column: 31, scope: !504)
!514 = !DILocation(line: 103, column: 5, scope: !504)
!515 = distinct !{!515, !507, !516, !180}
!516 = !DILocation(line: 106, column: 5, scope: !501)
!517 = !DILocation(line: 107, column: 5, scope: !490)
!518 = !DILocation(line: 108, column: 1, scope: !490)
!519 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !520, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!520 = !DISubroutineType(types: !521)
!521 = !{!78, !493, !78, !42}
!522 = !DILocalVariable(name: "bytes", arg: 1, scope: !519, file: !3, line: 113, type: !493)
!523 = !DILocation(line: 113, column: 39, scope: !519)
!524 = !DILocalVariable(name: "numBytes", arg: 2, scope: !519, file: !3, line: 113, type: !78)
!525 = !DILocation(line: 113, column: 53, scope: !519)
!526 = !DILocalVariable(name: "hex", arg: 3, scope: !519, file: !3, line: 113, type: !42)
!527 = !DILocation(line: 113, column: 71, scope: !519)
!528 = !DILocalVariable(name: "numWritten", scope: !519, file: !3, line: 115, type: !78)
!529 = !DILocation(line: 115, column: 12, scope: !519)
!530 = !DILocation(line: 121, column: 5, scope: !519)
!531 = !DILocation(line: 121, column: 12, scope: !519)
!532 = !DILocation(line: 121, column: 25, scope: !519)
!533 = !DILocation(line: 121, column: 23, scope: !519)
!534 = !DILocation(line: 121, column: 34, scope: !519)
!535 = !DILocation(line: 121, column: 37, scope: !519)
!536 = !DILocation(line: 121, column: 67, scope: !519)
!537 = !DILocation(line: 121, column: 70, scope: !519)
!538 = !DILocation(line: 0, scope: !519)
!539 = !DILocalVariable(name: "byte", scope: !540, file: !3, line: 123, type: !23)
!540 = distinct !DILexicalBlock(scope: !519, file: !3, line: 122, column: 5)
!541 = !DILocation(line: 123, column: 13, scope: !540)
