; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_TRUE", scope: !2, file: !3, line: 174, type: !23, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "io.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_175/source_code")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23, !24, !25}
!22 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!23 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!24 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!25 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!26 = !{!0, !27, !29, !31, !33, !35, !37, !39}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FALSE", scope: !2, file: !3, line: 175, type: !23, isLocal: false, isDefinition: true)
!29 = !DIGlobalVariableExpression(var: !30, expr: !DIExpression())
!30 = distinct !DIGlobalVariable(name: "GLOBAL_CONST_FIVE", scope: !2, file: !3, line: 176, type: !23, isLocal: false, isDefinition: true)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "globalTrue", scope: !2, file: !3, line: 181, type: !23, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "globalFalse", scope: !2, file: !3, line: 182, type: !23, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_32.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_175/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badVaSink", scope: !45, file: !45, line: 34, type: !53, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !42, null}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 34, type: !42)
!56 = !DILocation(line: 34, column: 23, scope: !52)
!57 = !DILocalVariable(name: "args", scope: !58, file: !45, line: 37, type: !59)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 36, column: 5)
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !60, line: 52, baseType: !61)
!60 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !62, line: 32, baseType: !63)
!62 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !45, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 192, elements: !71)
!65 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !66)
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !65, file: !45, line: 37, baseType: !7, size: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !65, file: !45, line: 37, baseType: !7, size: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !65, file: !45, line: 37, baseType: !22, size: 64, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !65, file: !45, line: 37, baseType: !22, size: 64, offset: 128)
!71 = !{!72}
!72 = !DISubrange(count: 1)
!73 = !DILocation(line: 37, column: 17, scope: !58)
!74 = !DILocation(line: 38, column: 9, scope: !58)
!75 = !DILocation(line: 40, column: 17, scope: !58)
!76 = !DILocation(line: 40, column: 23, scope: !58)
!77 = !DILocation(line: 40, column: 9, scope: !58)
!78 = !DILocation(line: 41, column: 9, scope: !58)
!79 = !DILocation(line: 43, column: 1, scope: !52)
!80 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_32_bad", scope: !45, file: !45, line: 45, type: !81, scopeLine: 46, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!81 = !DISubroutineType(types: !82)
!82 = !{null}
!83 = !DILocalVariable(name: "data", scope: !80, file: !45, line: 47, type: !42)
!84 = !DILocation(line: 47, column: 12, scope: !80)
!85 = !DILocalVariable(name: "dataPtr1", scope: !80, file: !45, line: 48, type: !41)
!86 = !DILocation(line: 48, column: 13, scope: !80)
!87 = !DILocalVariable(name: "dataPtr2", scope: !80, file: !45, line: 49, type: !41)
!88 = !DILocation(line: 49, column: 13, scope: !80)
!89 = !DILocalVariable(name: "dataBuffer", scope: !80, file: !45, line: 50, type: !90)
!90 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !91)
!91 = !{!92}
!92 = !DISubrange(count: 100)
!93 = !DILocation(line: 50, column: 10, scope: !80)
!94 = !DILocation(line: 51, column: 12, scope: !80)
!95 = !DILocation(line: 51, column: 10, scope: !80)
!96 = !DILocalVariable(name: "data", scope: !97, file: !45, line: 53, type: !42)
!97 = distinct !DILexicalBlock(scope: !80, file: !45, line: 52, column: 5)
!98 = !DILocation(line: 53, column: 16, scope: !97)
!99 = !DILocation(line: 53, column: 24, scope: !97)
!100 = !DILocation(line: 53, column: 23, scope: !97)
!101 = !DILocalVariable(name: "dataLen", scope: !102, file: !45, line: 56, type: !103)
!102 = distinct !DILexicalBlock(scope: !97, file: !45, line: 54, column: 9)
!103 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !104, line: 46, baseType: !105)
!104 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!105 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!106 = !DILocation(line: 56, column: 20, scope: !102)
!107 = !DILocation(line: 56, column: 37, scope: !102)
!108 = !DILocation(line: 56, column: 30, scope: !102)
!109 = !DILocalVariable(name: "pFile", scope: !102, file: !45, line: 57, type: !110)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !112, line: 7, baseType: !113)
!112 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!113 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !114, line: 49, size: 1728, elements: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!115 = !{!116, !117, !118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !131, !133, !134, !135, !139, !140, !142, !144, !147, !149, !152, !155, !156, !157, !158, !159}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !113, file: !114, line: 51, baseType: !23, size: 32)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !113, file: !114, line: 54, baseType: !42, size: 64, offset: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !113, file: !114, line: 55, baseType: !42, size: 64, offset: 128)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !113, file: !114, line: 56, baseType: !42, size: 64, offset: 192)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !113, file: !114, line: 57, baseType: !42, size: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !113, file: !114, line: 58, baseType: !42, size: 64, offset: 320)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !113, file: !114, line: 59, baseType: !42, size: 64, offset: 384)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !113, file: !114, line: 60, baseType: !42, size: 64, offset: 448)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !113, file: !114, line: 61, baseType: !42, size: 64, offset: 512)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !113, file: !114, line: 64, baseType: !42, size: 64, offset: 576)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !113, file: !114, line: 65, baseType: !42, size: 64, offset: 640)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !113, file: !114, line: 66, baseType: !42, size: 64, offset: 704)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !113, file: !114, line: 68, baseType: !129, size: 64, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !130, size: 64)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !114, line: 36, flags: DIFlagFwdDecl)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !113, file: !114, line: 70, baseType: !132, size: 64, offset: 832)
!132 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !113, file: !114, line: 72, baseType: !23, size: 32, offset: 896)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !113, file: !114, line: 73, baseType: !23, size: 32, offset: 928)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !113, file: !114, line: 74, baseType: !136, size: 64, offset: 960)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !137, line: 152, baseType: !138)
!137 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!138 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !113, file: !114, line: 77, baseType: !24, size: 16, offset: 1024)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !113, file: !114, line: 78, baseType: !141, size: 8, offset: 1040)
!141 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !113, file: !114, line: 79, baseType: !143, size: 8, offset: 1048)
!143 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !71)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !113, file: !114, line: 81, baseType: !145, size: 64, offset: 1088)
!145 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !146, size: 64)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !114, line: 43, baseType: null)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !113, file: !114, line: 89, baseType: !148, size: 64, offset: 1152)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !137, line: 153, baseType: !138)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !113, file: !114, line: 91, baseType: !150, size: 64, offset: 1216)
!150 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !151, size: 64)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !114, line: 37, flags: DIFlagFwdDecl)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !113, file: !114, line: 92, baseType: !153, size: 64, offset: 1280)
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !114, line: 38, flags: DIFlagFwdDecl)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !113, file: !114, line: 93, baseType: !132, size: 64, offset: 1344)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !113, file: !114, line: 94, baseType: !22, size: 64, offset: 1408)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !113, file: !114, line: 95, baseType: !103, size: 64, offset: 1472)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !113, file: !114, line: 96, baseType: !23, size: 32, offset: 1536)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !113, file: !114, line: 98, baseType: !160, size: 160, offset: 1568)
!160 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !161)
!161 = !{!162}
!162 = !DISubrange(count: 20)
!163 = !DILocation(line: 57, column: 20, scope: !102)
!164 = !DILocation(line: 59, column: 21, scope: !165)
!165 = distinct !DILexicalBlock(scope: !102, file: !45, line: 59, column: 17)
!166 = !DILocation(line: 59, column: 20, scope: !165)
!167 = !DILocation(line: 59, column: 29, scope: !165)
!168 = !DILocation(line: 59, column: 17, scope: !102)
!169 = !DILocation(line: 61, column: 25, scope: !170)
!170 = distinct !DILexicalBlock(scope: !165, file: !45, line: 60, column: 13)
!171 = !DILocation(line: 61, column: 23, scope: !170)
!172 = !DILocation(line: 62, column: 21, scope: !173)
!173 = distinct !DILexicalBlock(scope: !170, file: !45, line: 62, column: 21)
!174 = !DILocation(line: 62, column: 27, scope: !173)
!175 = !DILocation(line: 62, column: 21, scope: !170)
!176 = !DILocation(line: 65, column: 31, scope: !177)
!177 = distinct !DILexicalBlock(scope: !178, file: !45, line: 65, column: 25)
!178 = distinct !DILexicalBlock(scope: !173, file: !45, line: 63, column: 17)
!179 = !DILocation(line: 65, column: 36, scope: !177)
!180 = !DILocation(line: 65, column: 35, scope: !177)
!181 = !DILocation(line: 65, column: 55, scope: !177)
!182 = !DILocation(line: 65, column: 54, scope: !177)
!183 = !DILocation(line: 65, column: 45, scope: !177)
!184 = !DILocation(line: 65, column: 65, scope: !177)
!185 = !DILocation(line: 65, column: 25, scope: !177)
!186 = !DILocation(line: 65, column: 72, scope: !177)
!187 = !DILocation(line: 65, column: 25, scope: !178)
!188 = !DILocation(line: 67, column: 25, scope: !189)
!189 = distinct !DILexicalBlock(scope: !177, file: !45, line: 66, column: 21)
!190 = !DILocation(line: 69, column: 25, scope: !189)
!191 = !DILocation(line: 69, column: 30, scope: !189)
!192 = !DILocation(line: 69, column: 39, scope: !189)
!193 = !DILocation(line: 70, column: 21, scope: !189)
!194 = !DILocation(line: 71, column: 28, scope: !178)
!195 = !DILocation(line: 71, column: 21, scope: !178)
!196 = !DILocation(line: 72, column: 17, scope: !178)
!197 = !DILocation(line: 73, column: 13, scope: !170)
!198 = !DILocation(line: 75, column: 21, scope: !97)
!199 = !DILocation(line: 75, column: 10, scope: !97)
!200 = !DILocation(line: 75, column: 19, scope: !97)
!201 = !DILocalVariable(name: "data", scope: !202, file: !45, line: 78, type: !42)
!202 = distinct !DILexicalBlock(scope: !80, file: !45, line: 77, column: 5)
!203 = !DILocation(line: 78, column: 16, scope: !202)
!204 = !DILocation(line: 78, column: 24, scope: !202)
!205 = !DILocation(line: 78, column: 23, scope: !202)
!206 = !DILocation(line: 79, column: 19, scope: !202)
!207 = !DILocation(line: 79, column: 25, scope: !202)
!208 = !DILocation(line: 79, column: 9, scope: !202)
!209 = !DILocation(line: 81, column: 1, scope: !80)
!210 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !45, file: !45, line: 88, type: !53, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!211 = !DILocalVariable(name: "data", arg: 1, scope: !210, file: !45, line: 88, type: !42)
!212 = !DILocation(line: 88, column: 27, scope: !210)
!213 = !DILocalVariable(name: "args", scope: !214, file: !45, line: 91, type: !59)
!214 = distinct !DILexicalBlock(scope: !210, file: !45, line: 90, column: 5)
!215 = !DILocation(line: 91, column: 17, scope: !214)
!216 = !DILocation(line: 92, column: 9, scope: !214)
!217 = !DILocation(line: 94, column: 17, scope: !214)
!218 = !DILocation(line: 94, column: 23, scope: !214)
!219 = !DILocation(line: 94, column: 9, scope: !214)
!220 = !DILocation(line: 95, column: 9, scope: !214)
!221 = !DILocation(line: 97, column: 1, scope: !210)
!222 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 99, type: !81, scopeLine: 100, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!223 = !DILocalVariable(name: "data", scope: !222, file: !45, line: 101, type: !42)
!224 = !DILocation(line: 101, column: 12, scope: !222)
!225 = !DILocalVariable(name: "dataPtr1", scope: !222, file: !45, line: 102, type: !41)
!226 = !DILocation(line: 102, column: 13, scope: !222)
!227 = !DILocalVariable(name: "dataPtr2", scope: !222, file: !45, line: 103, type: !41)
!228 = !DILocation(line: 103, column: 13, scope: !222)
!229 = !DILocalVariable(name: "dataBuffer", scope: !222, file: !45, line: 104, type: !90)
!230 = !DILocation(line: 104, column: 10, scope: !222)
!231 = !DILocation(line: 105, column: 12, scope: !222)
!232 = !DILocation(line: 105, column: 10, scope: !222)
!233 = !DILocalVariable(name: "data", scope: !234, file: !45, line: 107, type: !42)
!234 = distinct !DILexicalBlock(scope: !222, file: !45, line: 106, column: 5)
!235 = !DILocation(line: 107, column: 16, scope: !234)
!236 = !DILocation(line: 107, column: 24, scope: !234)
!237 = !DILocation(line: 107, column: 23, scope: !234)
!238 = !DILocation(line: 109, column: 16, scope: !234)
!239 = !DILocation(line: 109, column: 9, scope: !234)
!240 = !DILocation(line: 110, column: 21, scope: !234)
!241 = !DILocation(line: 110, column: 10, scope: !234)
!242 = !DILocation(line: 110, column: 19, scope: !234)
!243 = !DILocalVariable(name: "data", scope: !244, file: !45, line: 113, type: !42)
!244 = distinct !DILexicalBlock(scope: !222, file: !45, line: 112, column: 5)
!245 = !DILocation(line: 113, column: 16, scope: !244)
!246 = !DILocation(line: 113, column: 24, scope: !244)
!247 = !DILocation(line: 113, column: 23, scope: !244)
!248 = !DILocation(line: 114, column: 23, scope: !244)
!249 = !DILocation(line: 114, column: 29, scope: !244)
!250 = !DILocation(line: 114, column: 9, scope: !244)
!251 = !DILocation(line: 116, column: 1, scope: !222)
!252 = distinct !DISubprogram(name: "goodB2GVaSink", scope: !45, file: !45, line: 119, type: !53, scopeLine: 120, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!253 = !DILocalVariable(name: "data", arg: 1, scope: !252, file: !45, line: 119, type: !42)
!254 = !DILocation(line: 119, column: 27, scope: !252)
!255 = !DILocalVariable(name: "args", scope: !256, file: !45, line: 122, type: !59)
!256 = distinct !DILexicalBlock(scope: !252, file: !45, line: 121, column: 5)
!257 = !DILocation(line: 122, column: 17, scope: !256)
!258 = !DILocation(line: 123, column: 9, scope: !256)
!259 = !DILocation(line: 125, column: 23, scope: !256)
!260 = !DILocation(line: 125, column: 9, scope: !256)
!261 = !DILocation(line: 126, column: 9, scope: !256)
!262 = !DILocation(line: 128, column: 1, scope: !252)
!263 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 130, type: !81, scopeLine: 131, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!264 = !DILocalVariable(name: "data", scope: !263, file: !45, line: 132, type: !42)
!265 = !DILocation(line: 132, column: 12, scope: !263)
!266 = !DILocalVariable(name: "dataPtr1", scope: !263, file: !45, line: 133, type: !41)
!267 = !DILocation(line: 133, column: 13, scope: !263)
!268 = !DILocalVariable(name: "dataPtr2", scope: !263, file: !45, line: 134, type: !41)
!269 = !DILocation(line: 134, column: 13, scope: !263)
!270 = !DILocalVariable(name: "dataBuffer", scope: !263, file: !45, line: 135, type: !90)
!271 = !DILocation(line: 135, column: 10, scope: !263)
!272 = !DILocation(line: 136, column: 12, scope: !263)
!273 = !DILocation(line: 136, column: 10, scope: !263)
!274 = !DILocalVariable(name: "data", scope: !275, file: !45, line: 138, type: !42)
!275 = distinct !DILexicalBlock(scope: !263, file: !45, line: 137, column: 5)
!276 = !DILocation(line: 138, column: 16, scope: !275)
!277 = !DILocation(line: 138, column: 24, scope: !275)
!278 = !DILocation(line: 138, column: 23, scope: !275)
!279 = !DILocalVariable(name: "dataLen", scope: !280, file: !45, line: 141, type: !103)
!280 = distinct !DILexicalBlock(scope: !275, file: !45, line: 139, column: 9)
!281 = !DILocation(line: 141, column: 20, scope: !280)
!282 = !DILocation(line: 141, column: 37, scope: !280)
!283 = !DILocation(line: 141, column: 30, scope: !280)
!284 = !DILocalVariable(name: "pFile", scope: !280, file: !45, line: 142, type: !110)
!285 = !DILocation(line: 142, column: 20, scope: !280)
!286 = !DILocation(line: 144, column: 21, scope: !287)
!287 = distinct !DILexicalBlock(scope: !280, file: !45, line: 144, column: 17)
!288 = !DILocation(line: 144, column: 20, scope: !287)
!289 = !DILocation(line: 144, column: 29, scope: !287)
!290 = !DILocation(line: 144, column: 17, scope: !280)
!291 = !DILocation(line: 146, column: 25, scope: !292)
!292 = distinct !DILexicalBlock(scope: !287, file: !45, line: 145, column: 13)
!293 = !DILocation(line: 146, column: 23, scope: !292)
!294 = !DILocation(line: 147, column: 21, scope: !295)
!295 = distinct !DILexicalBlock(scope: !292, file: !45, line: 147, column: 21)
!296 = !DILocation(line: 147, column: 27, scope: !295)
!297 = !DILocation(line: 147, column: 21, scope: !292)
!298 = !DILocation(line: 150, column: 31, scope: !299)
!299 = distinct !DILexicalBlock(scope: !300, file: !45, line: 150, column: 25)
!300 = distinct !DILexicalBlock(scope: !295, file: !45, line: 148, column: 17)
!301 = !DILocation(line: 150, column: 36, scope: !299)
!302 = !DILocation(line: 150, column: 35, scope: !299)
!303 = !DILocation(line: 150, column: 55, scope: !299)
!304 = !DILocation(line: 150, column: 54, scope: !299)
!305 = !DILocation(line: 150, column: 45, scope: !299)
!306 = !DILocation(line: 150, column: 65, scope: !299)
!307 = !DILocation(line: 150, column: 25, scope: !299)
!308 = !DILocation(line: 150, column: 72, scope: !299)
!309 = !DILocation(line: 150, column: 25, scope: !300)
!310 = !DILocation(line: 152, column: 25, scope: !311)
!311 = distinct !DILexicalBlock(scope: !299, file: !45, line: 151, column: 21)
!312 = !DILocation(line: 154, column: 25, scope: !311)
!313 = !DILocation(line: 154, column: 30, scope: !311)
!314 = !DILocation(line: 154, column: 39, scope: !311)
!315 = !DILocation(line: 155, column: 21, scope: !311)
!316 = !DILocation(line: 156, column: 28, scope: !300)
!317 = !DILocation(line: 156, column: 21, scope: !300)
!318 = !DILocation(line: 157, column: 17, scope: !300)
!319 = !DILocation(line: 158, column: 13, scope: !292)
!320 = !DILocation(line: 160, column: 21, scope: !275)
!321 = !DILocation(line: 160, column: 10, scope: !275)
!322 = !DILocation(line: 160, column: 19, scope: !275)
!323 = !DILocalVariable(name: "data", scope: !324, file: !45, line: 163, type: !42)
!324 = distinct !DILexicalBlock(scope: !263, file: !45, line: 162, column: 5)
!325 = !DILocation(line: 163, column: 16, scope: !324)
!326 = !DILocation(line: 163, column: 24, scope: !324)
!327 = !DILocation(line: 163, column: 23, scope: !324)
!328 = !DILocation(line: 164, column: 23, scope: !324)
!329 = !DILocation(line: 164, column: 29, scope: !324)
!330 = !DILocation(line: 164, column: 9, scope: !324)
!331 = !DILocation(line: 166, column: 1, scope: !263)
!332 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_32_good", scope: !45, file: !45, line: 168, type: !81, scopeLine: 169, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!333 = !DILocation(line: 170, column: 5, scope: !332)
!334 = !DILocation(line: 171, column: 5, scope: !332)
!335 = !DILocation(line: 172, column: 1, scope: !332)
!336 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !337, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!337 = !DISubroutineType(types: !338)
!338 = !{null, !42}
!339 = !DILocalVariable(name: "line", arg: 1, scope: !336, file: !3, line: 11, type: !42)
!340 = !DILocation(line: 11, column: 25, scope: !336)
!341 = !DILocation(line: 13, column: 1, scope: !336)
!342 = !DILocation(line: 14, column: 8, scope: !343)
!343 = distinct !DILexicalBlock(scope: !336, file: !3, line: 14, column: 8)
!344 = !DILocation(line: 14, column: 13, scope: !343)
!345 = !DILocation(line: 14, column: 8, scope: !336)
!346 = !DILocation(line: 16, column: 24, scope: !347)
!347 = distinct !DILexicalBlock(scope: !343, file: !3, line: 15, column: 5)
!348 = !DILocation(line: 16, column: 9, scope: !347)
!349 = !DILocation(line: 17, column: 5, scope: !347)
!350 = !DILocation(line: 18, column: 5, scope: !336)
!351 = !DILocation(line: 19, column: 1, scope: !336)
!352 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !337, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!353 = !DILocalVariable(name: "line", arg: 1, scope: !352, file: !3, line: 20, type: !42)
!354 = !DILocation(line: 20, column: 29, scope: !352)
!355 = !DILocation(line: 22, column: 8, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 22, column: 8)
!357 = !DILocation(line: 22, column: 13, scope: !356)
!358 = !DILocation(line: 22, column: 8, scope: !352)
!359 = !DILocation(line: 24, column: 24, scope: !360)
!360 = distinct !DILexicalBlock(scope: !356, file: !3, line: 23, column: 5)
!361 = !DILocation(line: 24, column: 9, scope: !360)
!362 = !DILocation(line: 25, column: 5, scope: !360)
!363 = !DILocation(line: 26, column: 1, scope: !352)
!364 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !365, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DISubroutineType(types: !366)
!366 = !{null, !367}
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !104, line: 74, baseType: !23)
!369 = !DILocalVariable(name: "line", arg: 1, scope: !364, file: !3, line: 27, type: !367)
!370 = !DILocation(line: 27, column: 29, scope: !364)
!371 = !DILocation(line: 29, column: 8, scope: !372)
!372 = distinct !DILexicalBlock(scope: !364, file: !3, line: 29, column: 8)
!373 = !DILocation(line: 29, column: 13, scope: !372)
!374 = !DILocation(line: 29, column: 8, scope: !364)
!375 = !DILocation(line: 31, column: 27, scope: !376)
!376 = distinct !DILexicalBlock(scope: !372, file: !3, line: 30, column: 5)
!377 = !DILocation(line: 31, column: 9, scope: !376)
!378 = !DILocation(line: 32, column: 5, scope: !376)
!379 = !DILocation(line: 33, column: 1, scope: !364)
!380 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !381, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!381 = !DISubroutineType(types: !382)
!382 = !{null, !23}
!383 = !DILocalVariable(name: "intNumber", arg: 1, scope: !380, file: !3, line: 35, type: !23)
!384 = !DILocation(line: 35, column: 24, scope: !380)
!385 = !DILocation(line: 37, column: 20, scope: !380)
!386 = !DILocation(line: 37, column: 5, scope: !380)
!387 = !DILocation(line: 38, column: 1, scope: !380)
!388 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !389, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!389 = !DISubroutineType(types: !390)
!390 = !{null, !391}
!391 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!392 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !388, file: !3, line: 40, type: !391)
!393 = !DILocation(line: 40, column: 28, scope: !388)
!394 = !DILocation(line: 42, column: 21, scope: !388)
!395 = !DILocation(line: 42, column: 5, scope: !388)
!396 = !DILocation(line: 43, column: 1, scope: !388)
!397 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !398, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!398 = !DISubroutineType(types: !399)
!399 = !{null, !400}
!400 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!401 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !397, file: !3, line: 45, type: !400)
!402 = !DILocation(line: 45, column: 28, scope: !397)
!403 = !DILocation(line: 47, column: 20, scope: !397)
!404 = !DILocation(line: 47, column: 5, scope: !397)
!405 = !DILocation(line: 48, column: 1, scope: !397)
!406 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !407, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!407 = !DISubroutineType(types: !408)
!408 = !{null, !138}
!409 = !DILocalVariable(name: "longNumber", arg: 1, scope: !406, file: !3, line: 50, type: !138)
!410 = !DILocation(line: 50, column: 26, scope: !406)
!411 = !DILocation(line: 52, column: 21, scope: !406)
!412 = !DILocation(line: 52, column: 5, scope: !406)
!413 = !DILocation(line: 53, column: 1, scope: !406)
!414 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !415, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!415 = !DISubroutineType(types: !416)
!416 = !{null, !417}
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !418, line: 27, baseType: !419)
!418 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !137, line: 44, baseType: !138)
!420 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !414, file: !3, line: 55, type: !417)
!421 = !DILocation(line: 55, column: 33, scope: !414)
!422 = !DILocation(line: 57, column: 29, scope: !414)
!423 = !DILocation(line: 57, column: 5, scope: !414)
!424 = !DILocation(line: 58, column: 1, scope: !414)
!425 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !426, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!426 = !DISubroutineType(types: !427)
!427 = !{null, !103}
!428 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !425, file: !3, line: 60, type: !103)
!429 = !DILocation(line: 60, column: 29, scope: !425)
!430 = !DILocation(line: 62, column: 21, scope: !425)
!431 = !DILocation(line: 62, column: 5, scope: !425)
!432 = !DILocation(line: 63, column: 1, scope: !425)
!433 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !434, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!434 = !DISubroutineType(types: !435)
!435 = !{null, !43}
!436 = !DILocalVariable(name: "charHex", arg: 1, scope: !433, file: !3, line: 65, type: !43)
!437 = !DILocation(line: 65, column: 29, scope: !433)
!438 = !DILocation(line: 67, column: 22, scope: !433)
!439 = !DILocation(line: 67, column: 5, scope: !433)
!440 = !DILocation(line: 68, column: 1, scope: !433)
!441 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !442, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!442 = !DISubroutineType(types: !443)
!443 = !{null, !368}
!444 = !DILocalVariable(name: "wideChar", arg: 1, scope: !441, file: !3, line: 70, type: !368)
!445 = !DILocation(line: 70, column: 29, scope: !441)
!446 = !DILocalVariable(name: "s", scope: !441, file: !3, line: 74, type: !447)
!447 = !DICompositeType(tag: DW_TAG_array_type, baseType: !368, size: 64, elements: !448)
!448 = !{!449}
!449 = !DISubrange(count: 2)
!450 = !DILocation(line: 74, column: 13, scope: !441)
!451 = !DILocation(line: 75, column: 16, scope: !441)
!452 = !DILocation(line: 75, column: 9, scope: !441)
!453 = !DILocation(line: 75, column: 14, scope: !441)
!454 = !DILocation(line: 76, column: 9, scope: !441)
!455 = !DILocation(line: 76, column: 14, scope: !441)
!456 = !DILocation(line: 77, column: 21, scope: !441)
!457 = !DILocation(line: 77, column: 5, scope: !441)
!458 = !DILocation(line: 78, column: 1, scope: !441)
!459 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !460, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!460 = !DISubroutineType(types: !461)
!461 = !{null, !7}
!462 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !459, file: !3, line: 80, type: !7)
!463 = !DILocation(line: 80, column: 33, scope: !459)
!464 = !DILocation(line: 82, column: 20, scope: !459)
!465 = !DILocation(line: 82, column: 5, scope: !459)
!466 = !DILocation(line: 83, column: 1, scope: !459)
!467 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !468, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!468 = !DISubroutineType(types: !469)
!469 = !{null, !25}
!470 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !467, file: !3, line: 85, type: !25)
!471 = !DILocation(line: 85, column: 45, scope: !467)
!472 = !DILocation(line: 87, column: 22, scope: !467)
!473 = !DILocation(line: 87, column: 5, scope: !467)
!474 = !DILocation(line: 88, column: 1, scope: !467)
!475 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !476, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!476 = !DISubroutineType(types: !477)
!477 = !{null, !478}
!478 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!479 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !475, file: !3, line: 90, type: !478)
!480 = !DILocation(line: 90, column: 29, scope: !475)
!481 = !DILocation(line: 92, column: 20, scope: !475)
!482 = !DILocation(line: 92, column: 5, scope: !475)
!483 = !DILocation(line: 93, column: 1, scope: !475)
!484 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !485, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!485 = !DISubroutineType(types: !486)
!486 = !{null, !487}
!487 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !488, size: 64)
!488 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !489, line: 100, baseType: !490)
!489 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_175/source_code")
!490 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !489, line: 96, size: 64, elements: !491)
!491 = !{!492, !493}
!492 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !490, file: !489, line: 98, baseType: !23, size: 32)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !490, file: !489, line: 99, baseType: !23, size: 32, offset: 32)
!494 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !484, file: !3, line: 95, type: !487)
!495 = !DILocation(line: 95, column: 40, scope: !484)
!496 = !DILocation(line: 97, column: 26, scope: !484)
!497 = !DILocation(line: 97, column: 47, scope: !484)
!498 = !DILocation(line: 97, column: 55, scope: !484)
!499 = !DILocation(line: 97, column: 76, scope: !484)
!500 = !DILocation(line: 97, column: 5, scope: !484)
!501 = !DILocation(line: 98, column: 1, scope: !484)
!502 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !503, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!503 = !DISubroutineType(types: !504)
!504 = !{null, !505, !103}
!505 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!506 = !DILocalVariable(name: "bytes", arg: 1, scope: !502, file: !3, line: 100, type: !505)
!507 = !DILocation(line: 100, column: 38, scope: !502)
!508 = !DILocalVariable(name: "numBytes", arg: 2, scope: !502, file: !3, line: 100, type: !103)
!509 = !DILocation(line: 100, column: 52, scope: !502)
!510 = !DILocalVariable(name: "i", scope: !502, file: !3, line: 102, type: !103)
!511 = !DILocation(line: 102, column: 12, scope: !502)
!512 = !DILocation(line: 103, column: 12, scope: !513)
!513 = distinct !DILexicalBlock(scope: !502, file: !3, line: 103, column: 5)
!514 = !DILocation(line: 103, column: 10, scope: !513)
!515 = !DILocation(line: 103, column: 17, scope: !516)
!516 = distinct !DILexicalBlock(scope: !513, file: !3, line: 103, column: 5)
!517 = !DILocation(line: 103, column: 21, scope: !516)
!518 = !DILocation(line: 103, column: 19, scope: !516)
!519 = !DILocation(line: 103, column: 5, scope: !513)
!520 = !DILocation(line: 105, column: 24, scope: !521)
!521 = distinct !DILexicalBlock(scope: !516, file: !3, line: 104, column: 5)
!522 = !DILocation(line: 105, column: 30, scope: !521)
!523 = !DILocation(line: 105, column: 9, scope: !521)
!524 = !DILocation(line: 106, column: 5, scope: !521)
!525 = !DILocation(line: 103, column: 31, scope: !516)
!526 = !DILocation(line: 103, column: 5, scope: !516)
!527 = distinct !{!527, !519, !528, !529}
!528 = !DILocation(line: 106, column: 5, scope: !513)
!529 = !{!"llvm.loop.mustprogress"}
!530 = !DILocation(line: 107, column: 5, scope: !502)
!531 = !DILocation(line: 108, column: 1, scope: !502)
!532 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !533, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!533 = !DISubroutineType(types: !534)
!534 = !{!103, !505, !103, !42}
!535 = !DILocalVariable(name: "bytes", arg: 1, scope: !532, file: !3, line: 113, type: !505)
!536 = !DILocation(line: 113, column: 39, scope: !532)
!537 = !DILocalVariable(name: "numBytes", arg: 2, scope: !532, file: !3, line: 113, type: !103)
!538 = !DILocation(line: 113, column: 53, scope: !532)
!539 = !DILocalVariable(name: "hex", arg: 3, scope: !532, file: !3, line: 113, type: !42)
!540 = !DILocation(line: 113, column: 71, scope: !532)
!541 = !DILocalVariable(name: "numWritten", scope: !532, file: !3, line: 115, type: !103)
!542 = !DILocation(line: 115, column: 12, scope: !532)
!543 = !DILocation(line: 121, column: 5, scope: !532)
!544 = !DILocation(line: 121, column: 12, scope: !532)
!545 = !DILocation(line: 121, column: 25, scope: !532)
!546 = !DILocation(line: 121, column: 23, scope: !532)
!547 = !DILocation(line: 121, column: 34, scope: !532)
!548 = !DILocation(line: 121, column: 37, scope: !532)
!549 = !DILocation(line: 121, column: 67, scope: !532)
!550 = !DILocation(line: 121, column: 70, scope: !532)
!551 = !DILocation(line: 0, scope: !532)
!552 = !DILocalVariable(name: "byte", scope: !553, file: !3, line: 123, type: !23)
!553 = distinct !DILexicalBlock(scope: !532, file: !3, line: 122, column: 5)
