; ModuleID = 'CWE134_Uncontrolled_Format_String__char_file_vprintf_32.c'
source_filename = "CWE134_Uncontrolled_Format_String__char_file_vprintf_32.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.__va_list_tag = type { i32, i32, i8*, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.1 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.2 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.3 = private unnamed_addr constant [16 x i8] c"fixedstringtest\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"%s\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badVaSink(i8* %data, ...) #0 !dbg !10 {
entry:
  %data.addr = alloca i8*, align 8
  %args = alloca [1 x %struct.__va_list_tag], align 16
  store i8* %data, i8** %data.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !15, metadata !DIExpression()), !dbg !16

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE134_Uncontrolled_Format_String__char_file_vprintf_32.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_080_175/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "badVaSink", scope: !1, file: !1, line: 34, type: !11, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13, null}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DILocalVariable(name: "data", arg: 1, scope: !10, file: !1, line: 34, type: !13)
!16 = !DILocation(line: 34, column: 23, scope: !10)
!17 = !DILocalVariable(name: "args", scope: !18, file: !1, line: 37, type: !19)
!18 = distinct !DILexicalBlock(scope: !10, file: !1, line: 36, column: 5)
!19 = !DIDerivedType(tag: DW_TAG_typedef, name: "va_list", file: !20, line: 52, baseType: !21)
!20 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gnuc_va_list", file: !22, line: 32, baseType: !23)
!22 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stdarg.h", directory: "/home/raoxue")
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "__builtin_va_list", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_array_type, baseType: !25, size: 192, elements: !32)
!25 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", size: 192, elements: !26)
!26 = !{!27, !29, !30, !31}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !25, file: !1, line: 37, baseType: !28, size: 32)
!28 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !25, file: !1, line: 37, baseType: !28, size: 32, offset: 32)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !25, file: !1, line: 37, baseType: !4, size: 64, offset: 64)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !25, file: !1, line: 37, baseType: !4, size: 64, offset: 128)
!32 = !{!33}
!33 = !DISubrange(count: 1)
!34 = !DILocation(line: 37, column: 17, scope: !18)
!35 = !DILocation(line: 38, column: 9, scope: !18)
!36 = !DILocation(line: 40, column: 17, scope: !18)
!37 = !DILocation(line: 40, column: 23, scope: !18)
!38 = !DILocation(line: 40, column: 9, scope: !18)
!39 = !DILocation(line: 41, column: 9, scope: !18)
!40 = !DILocation(line: 43, column: 1, scope: !10)
!41 = distinct !DISubprogram(name: "CWE134_Uncontrolled_Format_String__char_file_vprintf_32_bad", scope: !1, file: !1, line: 45, type: !42, scopeLine: 46, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!42 = !DISubroutineType(types: !43)
!43 = !{null}
!44 = !DILocalVariable(name: "data", scope: !41, file: !1, line: 47, type: !13)
!45 = !DILocation(line: 47, column: 12, scope: !41)
!46 = !DILocalVariable(name: "dataPtr1", scope: !41, file: !1, line: 48, type: !47)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !13, size: 64)
!48 = !DILocation(line: 48, column: 13, scope: !41)
!49 = !DILocalVariable(name: "dataPtr2", scope: !41, file: !1, line: 49, type: !47)
!50 = !DILocation(line: 49, column: 13, scope: !41)
!51 = !DILocalVariable(name: "dataBuffer", scope: !41, file: !1, line: 50, type: !52)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 800, elements: !53)
!53 = !{!54}
!54 = !DISubrange(count: 100)
!55 = !DILocation(line: 50, column: 10, scope: !41)
!56 = !DILocation(line: 51, column: 12, scope: !41)
!57 = !DILocation(line: 51, column: 10, scope: !41)
!58 = !DILocalVariable(name: "data", scope: !59, file: !1, line: 53, type: !13)
!59 = distinct !DILexicalBlock(scope: !41, file: !1, line: 52, column: 5)
!60 = !DILocation(line: 53, column: 16, scope: !59)
!61 = !DILocation(line: 53, column: 24, scope: !59)
!62 = !DILocation(line: 53, column: 23, scope: !59)
!63 = !DILocalVariable(name: "dataLen", scope: !64, file: !1, line: 56, type: !65)
!64 = distinct !DILexicalBlock(scope: !59, file: !1, line: 54, column: 9)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!67 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!68 = !DILocation(line: 56, column: 20, scope: !64)
!69 = !DILocation(line: 56, column: 37, scope: !64)
!70 = !DILocation(line: 56, column: 30, scope: !64)
!71 = !DILocalVariable(name: "pFile", scope: !64, file: !1, line: 57, type: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !74, line: 7, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !76, line: 49, size: 1728, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !93, !95, !96, !97, !101, !103, !105, !107, !110, !112, !115, !118, !119, !120, !121, !122}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !76, line: 51, baseType: !5, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !75, file: !76, line: 54, baseType: !13, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !75, file: !76, line: 55, baseType: !13, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !75, file: !76, line: 56, baseType: !13, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !75, file: !76, line: 57, baseType: !13, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !75, file: !76, line: 58, baseType: !13, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !75, file: !76, line: 59, baseType: !13, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !75, file: !76, line: 60, baseType: !13, size: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !75, file: !76, line: 61, baseType: !13, size: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !75, file: !76, line: 64, baseType: !13, size: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !75, file: !76, line: 65, baseType: !13, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !75, file: !76, line: 66, baseType: !13, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !75, file: !76, line: 68, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !76, line: 36, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !75, file: !76, line: 70, baseType: !94, size: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !75, file: !76, line: 72, baseType: !5, size: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !75, file: !76, line: 73, baseType: !5, size: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !75, file: !76, line: 74, baseType: !98, size: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !99, line: 152, baseType: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !75, file: !76, line: 77, baseType: !102, size: 16, offset: 1024)
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !75, file: !76, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !75, file: !76, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !32)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !75, file: !76, line: 81, baseType: !108, size: 64, offset: 1088)
!108 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !109, size: 64)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !76, line: 43, baseType: null)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !76, line: 89, baseType: !111, size: 64, offset: 1152)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !99, line: 153, baseType: !100)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !75, file: !76, line: 91, baseType: !113, size: 64, offset: 1216)
!113 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !114, size: 64)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !76, line: 37, flags: DIFlagFwdDecl)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !75, file: !76, line: 92, baseType: !116, size: 64, offset: 1280)
!116 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !117, size: 64)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !76, line: 38, flags: DIFlagFwdDecl)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !75, file: !76, line: 93, baseType: !94, size: 64, offset: 1344)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !75, file: !76, line: 94, baseType: !4, size: 64, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !75, file: !76, line: 95, baseType: !65, size: 64, offset: 1472)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !75, file: !76, line: 96, baseType: !5, size: 32, offset: 1536)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !75, file: !76, line: 98, baseType: !123, size: 160, offset: 1568)
!123 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !124)
!124 = !{!125}
!125 = !DISubrange(count: 20)
!126 = !DILocation(line: 57, column: 20, scope: !64)
!127 = !DILocation(line: 59, column: 21, scope: !128)
!128 = distinct !DILexicalBlock(scope: !64, file: !1, line: 59, column: 17)
!129 = !DILocation(line: 59, column: 20, scope: !128)
!130 = !DILocation(line: 59, column: 29, scope: !128)
!131 = !DILocation(line: 59, column: 17, scope: !64)
!132 = !DILocation(line: 61, column: 25, scope: !133)
!133 = distinct !DILexicalBlock(scope: !128, file: !1, line: 60, column: 13)
!134 = !DILocation(line: 61, column: 23, scope: !133)
!135 = !DILocation(line: 62, column: 21, scope: !136)
!136 = distinct !DILexicalBlock(scope: !133, file: !1, line: 62, column: 21)
!137 = !DILocation(line: 62, column: 27, scope: !136)
!138 = !DILocation(line: 62, column: 21, scope: !133)
!139 = !DILocation(line: 65, column: 31, scope: !140)
!140 = distinct !DILexicalBlock(scope: !141, file: !1, line: 65, column: 25)
!141 = distinct !DILexicalBlock(scope: !136, file: !1, line: 63, column: 17)
!142 = !DILocation(line: 65, column: 36, scope: !140)
!143 = !DILocation(line: 65, column: 35, scope: !140)
!144 = !DILocation(line: 65, column: 55, scope: !140)
!145 = !DILocation(line: 65, column: 54, scope: !140)
!146 = !DILocation(line: 65, column: 45, scope: !140)
!147 = !DILocation(line: 65, column: 65, scope: !140)
!148 = !DILocation(line: 65, column: 25, scope: !140)
!149 = !DILocation(line: 65, column: 72, scope: !140)
!150 = !DILocation(line: 65, column: 25, scope: !141)
!151 = !DILocation(line: 67, column: 25, scope: !152)
!152 = distinct !DILexicalBlock(scope: !140, file: !1, line: 66, column: 21)
!153 = !DILocation(line: 69, column: 25, scope: !152)
!154 = !DILocation(line: 69, column: 30, scope: !152)
!155 = !DILocation(line: 69, column: 39, scope: !152)
!156 = !DILocation(line: 70, column: 21, scope: !152)
!157 = !DILocation(line: 71, column: 28, scope: !141)
!158 = !DILocation(line: 71, column: 21, scope: !141)
!159 = !DILocation(line: 72, column: 17, scope: !141)
!160 = !DILocation(line: 73, column: 13, scope: !133)
!161 = !DILocation(line: 75, column: 21, scope: !59)
!162 = !DILocation(line: 75, column: 10, scope: !59)
!163 = !DILocation(line: 75, column: 19, scope: !59)
!164 = !DILocalVariable(name: "data", scope: !165, file: !1, line: 78, type: !13)
!165 = distinct !DILexicalBlock(scope: !41, file: !1, line: 77, column: 5)
!166 = !DILocation(line: 78, column: 16, scope: !165)
!167 = !DILocation(line: 78, column: 24, scope: !165)
!168 = !DILocation(line: 78, column: 23, scope: !165)
!169 = !DILocation(line: 79, column: 19, scope: !165)
!170 = !DILocation(line: 79, column: 25, scope: !165)
!171 = !DILocation(line: 79, column: 9, scope: !165)
!172 = !DILocation(line: 81, column: 1, scope: !41)
!173 = distinct !DISubprogram(name: "goodG2BVaSink", scope: !1, file: !1, line: 88, type: !11, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!174 = !DILocalVariable(name: "data", arg: 1, scope: !173, file: !1, line: 88, type: !13)
!175 = !DILocation(line: 88, column: 27, scope: !173)
!176 = !DILocalVariable(name: "args", scope: !177, file: !1, line: 91, type: !19)
!177 = distinct !DILexicalBlock(scope: !173, file: !1, line: 90, column: 5)
!178 = !DILocation(line: 91, column: 17, scope: !177)
!179 = !DILocation(line: 92, column: 9, scope: !177)
!180 = !DILocation(line: 94, column: 17, scope: !177)
!181 = !DILocation(line: 94, column: 23, scope: !177)
!182 = !DILocation(line: 94, column: 9, scope: !177)
!183 = !DILocation(line: 95, column: 9, scope: !177)
!184 = !DILocation(line: 97, column: 1, scope: !173)
!185 = distinct !DISubprogram(name: "goodG2B", scope: !1, file: !1, line: 99, type: !42, scopeLine: 100, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
