; ModuleID = 'motivating_ex1.c'
source_filename = "motivating_ex1.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [5 x i8] c"Pass\00", align 1
@.str.1 = private unnamed_addr constant [5 x i8] c"Fail\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"raw.txt\00", align 1
@.str.3 = private unnamed_addr constant [4 x i8] c"ab+\00", align 1
@.str.4 = private unnamed_addr constant [5 x i8] c"sink\00", align 1
@sensitive_data = dso_local global [20 x i8] zeroinitializer, align 16, !dbg !0
@.str.5 = private unnamed_addr constant [8 x i8] c"%s: %s\0A\00", align 1
@.str.6 = private unnamed_addr constant [7 x i8] c"passwd\00", align 1
@.str.7 = private unnamed_addr constant [7 x i8] c"source\00", align 1
@.str.8 = private unnamed_addr constant [7 x i8] c"secret\00", align 1
@.str.9 = private unnamed_addr constant [7 x i8] c"dummy\0A\00", align 1
@.str.10 = private unnamed_addr constant [6 x i8] c"start\00", align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "sensitive_data", scope: !2, file: !3, line: 9, type: !44, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !21, globals: !24, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "motivating_ex1.c", directory: "/home/raoxue/Desktop/My_sliver/Sliver/utils/source_code_moti_exp_fuzz")
!4 = !{!5}
!5 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !6, line: 46, baseType: !7, size: 32, elements: !8)
!6 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!7 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!8 = !{!9, !10, !11, !12, !13, !14, !15, !16, !17, !18, !19, !20}
!9 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!10 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!11 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!12 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!13 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!14 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!15 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!16 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!17 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!18 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!19 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!20 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!21 = !{!22, !23}
!22 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!23 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!24 = !{!0, !25, !39}
!25 = !DIGlobalVariableExpression(var: !26, expr: !DIExpression())
!26 = distinct !DIGlobalVariable(name: "in_buf", scope: !27, file: !28, line: 59, type: !36, isLocal: true, isDefinition: true)
!27 = distinct !DISubprogram(name: "afl_init_argv", scope: !28, file: !28, line: 57, type: !29, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !2, retainedNodes: !35)
!28 = !DIFile(filename: "AFL/experimental/argv_fuzzing/argv-fuzz-inl.h", directory: "/home/raoxue/Desktop")
!29 = !DISubroutineType(types: !30)
!30 = !{!31, !34}
!31 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !32, size: 64)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64)
!33 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !22, size: 64)
!35 = !{}
!36 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 800000, elements: !37)
!37 = !{!38}
!38 = !DISubrange(count: 100000)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "ret", scope: !27, file: !28, line: 60, type: !41, isLocal: true, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !32, size: 64000, elements: !42)
!42 = !{!43}
!43 = !DISubrange(count: 1000)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 160, elements: !45)
!45 = !{!46}
!46 = !DISubrange(count: 20)
!47 = !{i32 7, !"Dwarf Version", i32 4}
!48 = !{i32 2, !"Debug Info Version", i32 3}
!49 = !{i32 1, !"wchar_size", i32 4}
!50 = !{!"clang version 12.0.0"}
!51 = distinct !DISubprogram(name: "copy", scope: !3, file: !3, line: 11, type: !52, scopeLine: 11, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!52 = !DISubroutineType(types: !53)
!53 = !{!32, !32, !54}
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64)
!55 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !33)
!56 = !DILocalVariable(name: "dest", arg: 1, scope: !51, file: !3, line: 11, type: !32)
!57 = !DILocation(line: 11, column: 18, scope: !51)
!58 = !DILocalVariable(name: "src", arg: 2, scope: !51, file: !3, line: 11, type: !54)
!59 = !DILocation(line: 11, column: 36, scope: !51)
!60 = !DILocation(line: 12, column: 16, scope: !51)
!61 = !DILocation(line: 12, column: 22, scope: !51)
!62 = !DILocation(line: 12, column: 9, scope: !51)
!63 = !DILocation(line: 12, column: 2, scope: !51)
!64 = distinct !DISubprogram(name: "pass", scope: !3, file: !3, line: 15, type: !65, scopeLine: 15, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!65 = !DISubroutineType(types: !66)
!66 = !{null}
!67 = !DILocation(line: 16, column: 2, scope: !64)
!68 = !DILocation(line: 17, column: 1, scope: !64)
!69 = distinct !DISubprogram(name: "sink_mtd", scope: !3, file: !3, line: 21, type: !70, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!70 = !DISubroutineType(types: !71)
!71 = !{null, !32}
!72 = !DILocalVariable(name: "cmd", arg: 1, scope: !69, file: !3, line: 21, type: !32)
!73 = !DILocation(line: 21, column: 21, scope: !69)
!74 = !DILocalVariable(name: "fp", scope: !69, file: !3, line: 23, type: !75)
!75 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !76, size: 64)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !77, line: 7, baseType: !78)
!77 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !79, line: 49, size: 1728, elements: !80)
!79 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!80 = !{!81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !96, !98, !99, !100, !104, !105, !107, !111, !114, !116, !119, !122, !123, !125, !129, !130}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !78, file: !79, line: 51, baseType: !22, size: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !78, file: !79, line: 54, baseType: !32, size: 64, offset: 64)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !78, file: !79, line: 55, baseType: !32, size: 64, offset: 128)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !78, file: !79, line: 56, baseType: !32, size: 64, offset: 192)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !78, file: !79, line: 57, baseType: !32, size: 64, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !78, file: !79, line: 58, baseType: !32, size: 64, offset: 320)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !78, file: !79, line: 59, baseType: !32, size: 64, offset: 384)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !78, file: !79, line: 60, baseType: !32, size: 64, offset: 448)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !78, file: !79, line: 61, baseType: !32, size: 64, offset: 512)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !78, file: !79, line: 64, baseType: !32, size: 64, offset: 576)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !78, file: !79, line: 65, baseType: !32, size: 64, offset: 640)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !78, file: !79, line: 66, baseType: !32, size: 64, offset: 704)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !78, file: !79, line: 68, baseType: !94, size: 64, offset: 768)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !95, size: 64)
!95 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !79, line: 36, flags: DIFlagFwdDecl)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !78, file: !79, line: 70, baseType: !97, size: 64, offset: 832)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !78, size: 64)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !78, file: !79, line: 72, baseType: !22, size: 32, offset: 896)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !78, file: !79, line: 73, baseType: !22, size: 32, offset: 928)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !78, file: !79, line: 74, baseType: !101, size: 64, offset: 960)
!101 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !102, line: 152, baseType: !103)
!102 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!103 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !78, file: !79, line: 77, baseType: !23, size: 16, offset: 1024)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !78, file: !79, line: 78, baseType: !106, size: 8, offset: 1040)
!106 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !78, file: !79, line: 79, baseType: !108, size: 8, offset: 1048)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 8, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 1)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !78, file: !79, line: 81, baseType: !112, size: 64, offset: 1088)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !79, line: 43, baseType: null)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !78, file: !79, line: 89, baseType: !115, size: 64, offset: 1152)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !102, line: 153, baseType: !103)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !78, file: !79, line: 91, baseType: !117, size: 64, offset: 1216)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !79, line: 37, flags: DIFlagFwdDecl)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !78, file: !79, line: 92, baseType: !120, size: 64, offset: 1280)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !121, size: 64)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !79, line: 38, flags: DIFlagFwdDecl)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !78, file: !79, line: 93, baseType: !97, size: 64, offset: 1344)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !78, file: !79, line: 94, baseType: !124, size: 64, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !78, file: !79, line: 95, baseType: !126, size: 64, offset: 1472)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !127, line: 46, baseType: !128)
!127 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!128 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !78, file: !79, line: 96, baseType: !22, size: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !78, file: !79, line: 98, baseType: !44, size: 160, offset: 1568)
!131 = !DILocation(line: 23, column: 8, scope: !69)
!132 = !DILocation(line: 23, column: 11, scope: !69)
!133 = !DILocalVariable(name: "len_sink", scope: !69, file: !3, line: 24, type: !22)
!134 = !DILocation(line: 24, column: 6, scope: !69)
!135 = !DILocation(line: 25, column: 9, scope: !69)
!136 = !DILocation(line: 25, column: 33, scope: !69)
!137 = !DILocation(line: 25, column: 2, scope: !69)
!138 = !DILocation(line: 26, column: 29, scope: !69)
!139 = !DILocation(line: 26, column: 38, scope: !69)
!140 = !DILocation(line: 26, column: 2, scope: !69)
!141 = !DILocalVariable(name: "len_sensitive_data", scope: !69, file: !3, line: 27, type: !22)
!142 = !DILocation(line: 27, column: 6, scope: !69)
!143 = !DILocation(line: 27, column: 25, scope: !69)
!144 = !DILocation(line: 28, column: 9, scope: !69)
!145 = !DILocation(line: 28, column: 43, scope: !69)
!146 = !DILocation(line: 28, column: 2, scope: !69)
!147 = !DILocation(line: 29, column: 37, scope: !69)
!148 = !DILocation(line: 29, column: 56, scope: !69)
!149 = !DILocation(line: 29, column: 2, scope: !69)
!150 = !DILocation(line: 30, column: 9, scope: !69)
!151 = !DILocation(line: 30, column: 2, scope: !69)
!152 = !DILocation(line: 31, column: 23, scope: !69)
!153 = !DILocation(line: 31, column: 5, scope: !69)
!154 = !DILocation(line: 32, column: 1, scope: !69)
!155 = distinct !DISubprogram(name: "fail", scope: !3, file: !3, line: 18, type: !65, scopeLine: 18, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!156 = !DILocation(line: 19, column: 2, scope: !155)
!157 = !DILocation(line: 20, column: 1, scope: !155)
!158 = distinct !DISubprogram(name: "op", scope: !3, file: !3, line: 34, type: !159, scopeLine: 34, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!159 = !DISubroutineType(types: !160)
!160 = !{null, !161, !54}
!161 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !52, size: 64)
!162 = !DILocalVariable(name: "str_op", arg: 1, scope: !158, file: !3, line: 34, type: !161)
!163 = !DILocation(line: 34, column: 16, scope: !158)
!164 = !DILocalVariable(name: "data", arg: 2, scope: !158, file: !3, line: 34, type: !54)
!165 = !DILocation(line: 34, column: 59, scope: !158)
!166 = !DILocation(line: 35, column: 4, scope: !158)
!167 = !DILocation(line: 35, column: 28, scope: !158)
!168 = !DILocation(line: 35, column: 2, scope: !158)
!169 = !DILocation(line: 36, column: 1, scope: !158)
!170 = distinct !DISubprogram(name: "auth", scope: !3, file: !3, line: 38, type: !171, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !35)
!171 = !DISubroutineType(types: !172)
!172 = !{!22, !54}
!173 = !DILocalVariable(name: "buf", arg: 1, scope: !170, file: !3, line: 38, type: !54)
!174 = !DILocation(line: 38, column: 22, scope: !170)
!175 = !DILocation(line: 39, column: 14, scope: !176)
!176 = distinct !DILexicalBlock(scope: !170, file: !3, line: 39, column: 6)
!177 = !DILocation(line: 39, column: 7, scope: !176)
!178 = !DILocation(line: 39, column: 6, scope: !170)
!179 = !DILocalVariable(name: "fp", scope: !180, file: !3, line: 42, type: !75)
!180 = distinct !DILexicalBlock(scope: !176, file: !3, line: 39, column: 30)
!181 = !DILocation(line: 42, column: 9, scope: !180)
!182 = !DILocation(line: 42, column: 12, scope: !180)
!183 = !DILocalVariable(name: "len_source", scope: !180, file: !3, line: 43, type: !22)
!184 = !DILocation(line: 43, column: 7, scope: !180)
!185 = !DILocation(line: 44, column: 9, scope: !180)
!186 = !DILocation(line: 44, column: 35, scope: !180)
!187 = !DILocation(line: 44, column: 2, scope: !180)
!188 = !DILocation(line: 45, column: 31, scope: !180)
!189 = !DILocation(line: 45, column: 42, scope: !180)
!190 = !DILocation(line: 45, column: 2, scope: !180)
!191 = !DILocalVariable(name: "len_secret", scope: !180, file: !3, line: 46, type: !22)
