; ModuleID = 'llvm-link'
source_filename = "llvm-link"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct._twoIntsStruct = type { i32, i32 }

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1
@GLOBAL_CONST_TRUE = dso_local global i32 1, align 4, !dbg !0
@GLOBAL_CONST_FALSE = dso_local global i32 0, align 4, !dbg !27
@GLOBAL_CONST_FIVE = dso_local global i32 5, align 4, !dbg !29
@globalTrue = dso_local global i32 1, align 4, !dbg !31
@globalFalse = dso_local global i32 0, align 4, !dbg !33
@globalFive = dso_local global i32 5, align 4, !dbg !35
@globalArgc = dso_local global i32 0, align 4, !dbg !37
@globalArgv = dso_local global i8** null, align 8, !dbg !39

!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "globalFive", scope: !2, file: !3, line: 183, type: !23, isLocal: false, isDefinition: true)
!37 = !DIGlobalVariableExpression(var: !38, expr: !DIExpression())
!38 = distinct !DIGlobalVariable(name: "globalArgc", scope: !2, file: !3, line: 214, type: !23, isLocal: false, isDefinition: true)
!39 = !DIGlobalVariableExpression(var: !40, expr: !DIExpression())
!40 = distinct !DIGlobalVariable(name: "globalArgv", scope: !2, file: !3, line: 215, type: !41, isLocal: false, isDefinition: true)
!41 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !42, size: 64)
!42 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!43 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!44 = distinct !DICompileUnit(language: DW_LANG_C99, file: !45, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !46, retainedTypes: !47, splitDebugInlining: false, nameTableKind: None)
!45 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_41.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_098/source_code")
!46 = !{}
!47 = !{!22, !23}
!48 = !{!"clang version 12.0.0"}
!49 = !{i32 7, !"Dwarf Version", i32 4}
!50 = !{i32 2, !"Debug Info Version", i32 3}
!51 = !{i32 1, !"wchar_size", i32 4}
!52 = distinct !DISubprogram(name: "badSink", scope: !45, file: !45, line: 35, type: !53, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!53 = !DISubroutineType(types: !54)
!54 = !{null, !42}
!55 = !DILocalVariable(name: "data", arg: 1, scope: !52, file: !45, line: 35, type: !42)
!56 = !DILocation(line: 35, column: 21, scope: !52)
!57 = !DILocalVariable(name: "i", scope: !58, file: !45, line: 38, type: !23)
!58 = distinct !DILexicalBlock(scope: !52, file: !45, line: 37, column: 5)
!59 = !DILocation(line: 38, column: 13, scope: !58)
!60 = !DILocalVariable(name: "n", scope: !58, file: !45, line: 38, type: !23)
!61 = !DILocation(line: 38, column: 16, scope: !58)
!62 = !DILocalVariable(name: "intVariable", scope: !58, file: !45, line: 38, type: !23)
!63 = !DILocation(line: 38, column: 19, scope: !58)
!64 = !DILocation(line: 39, column: 20, scope: !65)
!65 = distinct !DILexicalBlock(scope: !58, file: !45, line: 39, column: 13)
!66 = !DILocation(line: 39, column: 13, scope: !65)
!67 = !DILocation(line: 39, column: 36, scope: !65)
!68 = !DILocation(line: 39, column: 13, scope: !58)
!69 = !DILocation(line: 42, column: 25, scope: !70)
!70 = distinct !DILexicalBlock(scope: !65, file: !45, line: 40, column: 9)
!71 = !DILocation(line: 43, column: 20, scope: !72)
!72 = distinct !DILexicalBlock(scope: !70, file: !45, line: 43, column: 13)
!73 = !DILocation(line: 43, column: 18, scope: !72)
!74 = !DILocation(line: 43, column: 25, scope: !75)
!75 = distinct !DILexicalBlock(scope: !72, file: !45, line: 43, column: 13)
!76 = !DILocation(line: 43, column: 29, scope: !75)
!77 = !DILocation(line: 43, column: 27, scope: !75)
!78 = !DILocation(line: 43, column: 13, scope: !72)
!79 = !DILocation(line: 46, column: 28, scope: !80)
!80 = distinct !DILexicalBlock(scope: !75, file: !45, line: 44, column: 13)
!81 = !DILocation(line: 47, column: 13, scope: !80)
!82 = !DILocation(line: 43, column: 33, scope: !75)
!83 = !DILocation(line: 43, column: 13, scope: !75)
!84 = distinct !{!84, !78, !85, !86}
!85 = !DILocation(line: 47, column: 13, scope: !72)
!86 = !{!"llvm.loop.mustprogress"}
!87 = !DILocation(line: 48, column: 26, scope: !70)
!88 = !DILocation(line: 48, column: 13, scope: !70)
!89 = !DILocation(line: 49, column: 9, scope: !70)
!90 = !DILocation(line: 51, column: 1, scope: !52)
!91 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_41_bad", scope: !45, file: !45, line: 53, type: !92, scopeLine: 54, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!92 = !DISubroutineType(types: !93)
!93 = !{null}
!94 = !DILocalVariable(name: "data", scope: !91, file: !45, line: 55, type: !42)
!95 = !DILocation(line: 55, column: 12, scope: !91)
!96 = !DILocalVariable(name: "dataBuffer", scope: !91, file: !45, line: 56, type: !97)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 800, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 100)
!100 = !DILocation(line: 56, column: 10, scope: !91)
!101 = !DILocation(line: 57, column: 12, scope: !91)
!102 = !DILocation(line: 57, column: 10, scope: !91)
!103 = !DILocalVariable(name: "dataLen", scope: !104, file: !45, line: 60, type: !105)
!104 = distinct !DILexicalBlock(scope: !91, file: !45, line: 58, column: 5)
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !106, line: 46, baseType: !107)
!106 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!107 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!108 = !DILocation(line: 60, column: 16, scope: !104)
!109 = !DILocation(line: 60, column: 33, scope: !104)
!110 = !DILocation(line: 60, column: 26, scope: !104)
!111 = !DILocalVariable(name: "pFile", scope: !104, file: !45, line: 61, type: !112)
!112 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !113, size: 64)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !114, line: 7, baseType: !115)
!114 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !116, line: 49, size: 1728, elements: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!117 = !{!118, !119, !120, !121, !122, !123, !124, !125, !126, !127, !128, !129, !130, !133, !135, !136, !137, !141, !142, !144, !148, !151, !153, !156, !159, !160, !161, !162, !163}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !115, file: !116, line: 51, baseType: !23, size: 32)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !115, file: !116, line: 54, baseType: !42, size: 64, offset: 64)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !115, file: !116, line: 55, baseType: !42, size: 64, offset: 128)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !115, file: !116, line: 56, baseType: !42, size: 64, offset: 192)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !115, file: !116, line: 57, baseType: !42, size: 64, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !115, file: !116, line: 58, baseType: !42, size: 64, offset: 320)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !115, file: !116, line: 59, baseType: !42, size: 64, offset: 384)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !115, file: !116, line: 60, baseType: !42, size: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !115, file: !116, line: 61, baseType: !42, size: 64, offset: 512)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !115, file: !116, line: 64, baseType: !42, size: 64, offset: 576)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !115, file: !116, line: 65, baseType: !42, size: 64, offset: 640)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !115, file: !116, line: 66, baseType: !42, size: 64, offset: 704)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !115, file: !116, line: 68, baseType: !131, size: 64, offset: 768)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !132, size: 64)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !116, line: 36, flags: DIFlagFwdDecl)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !115, file: !116, line: 70, baseType: !134, size: 64, offset: 832)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !115, file: !116, line: 72, baseType: !23, size: 32, offset: 896)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !115, file: !116, line: 73, baseType: !23, size: 32, offset: 928)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !115, file: !116, line: 74, baseType: !138, size: 64, offset: 960)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !139, line: 152, baseType: !140)
!139 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!140 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !115, file: !116, line: 77, baseType: !24, size: 16, offset: 1024)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !115, file: !116, line: 78, baseType: !143, size: 8, offset: 1040)
!143 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !115, file: !116, line: 79, baseType: !145, size: 8, offset: 1048)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 8, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 1)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !115, file: !116, line: 81, baseType: !149, size: 64, offset: 1088)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64)
!150 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !116, line: 43, baseType: null)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !115, file: !116, line: 89, baseType: !152, size: 64, offset: 1152)
!152 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !139, line: 153, baseType: !140)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !115, file: !116, line: 91, baseType: !154, size: 64, offset: 1216)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !116, line: 37, flags: DIFlagFwdDecl)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !115, file: !116, line: 92, baseType: !157, size: 64, offset: 1280)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !158, size: 64)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !116, line: 38, flags: DIFlagFwdDecl)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !115, file: !116, line: 93, baseType: !134, size: 64, offset: 1344)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !115, file: !116, line: 94, baseType: !22, size: 64, offset: 1408)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !115, file: !116, line: 95, baseType: !105, size: 64, offset: 1472)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !115, file: !116, line: 96, baseType: !23, size: 32, offset: 1536)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !115, file: !116, line: 98, baseType: !164, size: 160, offset: 1568)
!164 = !DICompositeType(tag: DW_TAG_array_type, baseType: !43, size: 160, elements: !165)
!165 = !{!166}
!166 = !DISubrange(count: 20)
!167 = !DILocation(line: 61, column: 16, scope: !104)
!168 = !DILocation(line: 63, column: 17, scope: !169)
!169 = distinct !DILexicalBlock(scope: !104, file: !45, line: 63, column: 13)
!170 = !DILocation(line: 63, column: 16, scope: !169)
!171 = !DILocation(line: 63, column: 25, scope: !169)
!172 = !DILocation(line: 63, column: 13, scope: !104)
!173 = !DILocation(line: 65, column: 21, scope: !174)
!174 = distinct !DILexicalBlock(scope: !169, file: !45, line: 64, column: 9)
!175 = !DILocation(line: 65, column: 19, scope: !174)
!176 = !DILocation(line: 66, column: 17, scope: !177)
!177 = distinct !DILexicalBlock(scope: !174, file: !45, line: 66, column: 17)
!178 = !DILocation(line: 66, column: 23, scope: !177)
!179 = !DILocation(line: 66, column: 17, scope: !174)
!180 = !DILocation(line: 69, column: 27, scope: !181)
!181 = distinct !DILexicalBlock(scope: !182, file: !45, line: 69, column: 21)
!182 = distinct !DILexicalBlock(scope: !177, file: !45, line: 67, column: 13)
!183 = !DILocation(line: 69, column: 32, scope: !181)
!184 = !DILocation(line: 69, column: 31, scope: !181)
!185 = !DILocation(line: 69, column: 51, scope: !181)
!186 = !DILocation(line: 69, column: 50, scope: !181)
!187 = !DILocation(line: 69, column: 41, scope: !181)
!188 = !DILocation(line: 69, column: 61, scope: !181)
!189 = !DILocation(line: 69, column: 21, scope: !181)
!190 = !DILocation(line: 69, column: 68, scope: !181)
!191 = !DILocation(line: 69, column: 21, scope: !182)
!192 = !DILocation(line: 71, column: 21, scope: !193)
!193 = distinct !DILexicalBlock(scope: !181, file: !45, line: 70, column: 17)
!194 = !DILocation(line: 73, column: 21, scope: !193)
!195 = !DILocation(line: 73, column: 26, scope: !193)
!196 = !DILocation(line: 73, column: 35, scope: !193)
!197 = !DILocation(line: 74, column: 17, scope: !193)
!198 = !DILocation(line: 75, column: 24, scope: !182)
!199 = !DILocation(line: 75, column: 17, scope: !182)
!200 = !DILocation(line: 76, column: 13, scope: !182)
!201 = !DILocation(line: 77, column: 9, scope: !174)
!202 = !DILocation(line: 79, column: 13, scope: !91)
!203 = !DILocation(line: 79, column: 5, scope: !91)
!204 = !DILocation(line: 80, column: 1, scope: !91)
!205 = distinct !DISubprogram(name: "goodG2BSink", scope: !45, file: !45, line: 87, type: !53, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!206 = !DILocalVariable(name: "data", arg: 1, scope: !205, file: !45, line: 87, type: !42)
!207 = !DILocation(line: 87, column: 25, scope: !205)
!208 = !DILocalVariable(name: "i", scope: !209, file: !45, line: 90, type: !23)
!209 = distinct !DILexicalBlock(scope: !205, file: !45, line: 89, column: 5)
!210 = !DILocation(line: 90, column: 13, scope: !209)
!211 = !DILocalVariable(name: "n", scope: !209, file: !45, line: 90, type: !23)
!212 = !DILocation(line: 90, column: 16, scope: !209)
!213 = !DILocalVariable(name: "intVariable", scope: !209, file: !45, line: 90, type: !23)
!214 = !DILocation(line: 90, column: 19, scope: !209)
!215 = !DILocation(line: 91, column: 20, scope: !216)
!216 = distinct !DILexicalBlock(scope: !209, file: !45, line: 91, column: 13)
!217 = !DILocation(line: 91, column: 13, scope: !216)
!218 = !DILocation(line: 91, column: 36, scope: !216)
!219 = !DILocation(line: 91, column: 13, scope: !209)
!220 = !DILocation(line: 94, column: 25, scope: !221)
!221 = distinct !DILexicalBlock(scope: !216, file: !45, line: 92, column: 9)
!222 = !DILocation(line: 95, column: 20, scope: !223)
!223 = distinct !DILexicalBlock(scope: !221, file: !45, line: 95, column: 13)
!224 = !DILocation(line: 95, column: 18, scope: !223)
!225 = !DILocation(line: 95, column: 25, scope: !226)
!226 = distinct !DILexicalBlock(scope: !223, file: !45, line: 95, column: 13)
!227 = !DILocation(line: 95, column: 29, scope: !226)
!228 = !DILocation(line: 95, column: 27, scope: !226)
!229 = !DILocation(line: 95, column: 13, scope: !223)
!230 = !DILocation(line: 98, column: 28, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !45, line: 96, column: 13)
!232 = !DILocation(line: 99, column: 13, scope: !231)
!233 = !DILocation(line: 95, column: 33, scope: !226)
!234 = !DILocation(line: 95, column: 13, scope: !226)
!235 = distinct !{!235, !229, !236, !86}
!236 = !DILocation(line: 99, column: 13, scope: !223)
!237 = !DILocation(line: 100, column: 26, scope: !221)
!238 = !DILocation(line: 100, column: 13, scope: !221)
!239 = !DILocation(line: 101, column: 9, scope: !221)
!240 = !DILocation(line: 103, column: 1, scope: !205)
!241 = distinct !DISubprogram(name: "goodG2B", scope: !45, file: !45, line: 105, type: !92, scopeLine: 106, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!242 = !DILocalVariable(name: "data", scope: !241, file: !45, line: 107, type: !42)
!243 = !DILocation(line: 107, column: 12, scope: !241)
!244 = !DILocalVariable(name: "dataBuffer", scope: !241, file: !45, line: 108, type: !97)
!245 = !DILocation(line: 108, column: 10, scope: !241)
!246 = !DILocation(line: 109, column: 12, scope: !241)
!247 = !DILocation(line: 109, column: 10, scope: !241)
!248 = !DILocation(line: 111, column: 12, scope: !241)
!249 = !DILocation(line: 111, column: 5, scope: !241)
!250 = !DILocation(line: 112, column: 17, scope: !241)
!251 = !DILocation(line: 112, column: 5, scope: !241)
!252 = !DILocation(line: 113, column: 1, scope: !241)
!253 = distinct !DISubprogram(name: "goodB2GSink", scope: !45, file: !45, line: 116, type: !53, scopeLine: 117, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!254 = !DILocalVariable(name: "data", arg: 1, scope: !253, file: !45, line: 116, type: !42)
!255 = !DILocation(line: 116, column: 25, scope: !253)
!256 = !DILocalVariable(name: "i", scope: !257, file: !45, line: 119, type: !23)
!257 = distinct !DILexicalBlock(scope: !253, file: !45, line: 118, column: 5)
!258 = !DILocation(line: 119, column: 13, scope: !257)
!259 = !DILocalVariable(name: "n", scope: !257, file: !45, line: 119, type: !23)
!260 = !DILocation(line: 119, column: 16, scope: !257)
!261 = !DILocalVariable(name: "intVariable", scope: !257, file: !45, line: 119, type: !23)
!262 = !DILocation(line: 119, column: 19, scope: !257)
!263 = !DILocation(line: 120, column: 20, scope: !264)
!264 = distinct !DILexicalBlock(scope: !257, file: !45, line: 120, column: 13)
!265 = !DILocation(line: 120, column: 13, scope: !264)
!266 = !DILocation(line: 120, column: 36, scope: !264)
!267 = !DILocation(line: 120, column: 13, scope: !257)
!268 = !DILocation(line: 123, column: 17, scope: !269)
!269 = distinct !DILexicalBlock(scope: !270, file: !45, line: 123, column: 17)
!270 = distinct !DILexicalBlock(scope: !264, file: !45, line: 121, column: 9)
!271 = !DILocation(line: 123, column: 19, scope: !269)
!272 = !DILocation(line: 123, column: 17, scope: !270)
!273 = !DILocation(line: 125, column: 29, scope: !274)
!274 = distinct !DILexicalBlock(scope: !269, file: !45, line: 124, column: 13)
!275 = !DILocation(line: 126, column: 24, scope: !276)
!276 = distinct !DILexicalBlock(scope: !274, file: !45, line: 126, column: 17)
!277 = !DILocation(line: 126, column: 22, scope: !276)
!278 = !DILocation(line: 126, column: 29, scope: !279)
!279 = distinct !DILexicalBlock(scope: !276, file: !45, line: 126, column: 17)
!280 = !DILocation(line: 126, column: 33, scope: !279)
!281 = !DILocation(line: 126, column: 31, scope: !279)
!282 = !DILocation(line: 126, column: 17, scope: !276)
!283 = !DILocation(line: 129, column: 32, scope: !284)
!284 = distinct !DILexicalBlock(scope: !279, file: !45, line: 127, column: 17)
!285 = !DILocation(line: 130, column: 17, scope: !284)
!286 = !DILocation(line: 126, column: 37, scope: !279)
!287 = !DILocation(line: 126, column: 17, scope: !279)
!288 = distinct !{!288, !282, !289, !86}
!289 = !DILocation(line: 130, column: 17, scope: !276)
!290 = !DILocation(line: 131, column: 30, scope: !274)
!291 = !DILocation(line: 131, column: 17, scope: !274)
!292 = !DILocation(line: 132, column: 13, scope: !274)
!293 = !DILocation(line: 133, column: 9, scope: !270)
!294 = !DILocation(line: 135, column: 1, scope: !253)
!295 = distinct !DISubprogram(name: "goodB2G", scope: !45, file: !45, line: 137, type: !92, scopeLine: 138, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!296 = !DILocalVariable(name: "data", scope: !295, file: !45, line: 139, type: !42)
!297 = !DILocation(line: 139, column: 12, scope: !295)
!298 = !DILocalVariable(name: "dataBuffer", scope: !295, file: !45, line: 140, type: !97)
!299 = !DILocation(line: 140, column: 10, scope: !295)
!300 = !DILocation(line: 141, column: 12, scope: !295)
!301 = !DILocation(line: 141, column: 10, scope: !295)
!302 = !DILocalVariable(name: "dataLen", scope: !303, file: !45, line: 144, type: !105)
!303 = distinct !DILexicalBlock(scope: !295, file: !45, line: 142, column: 5)
!304 = !DILocation(line: 144, column: 16, scope: !303)
!305 = !DILocation(line: 144, column: 33, scope: !303)
!306 = !DILocation(line: 144, column: 26, scope: !303)
!307 = !DILocalVariable(name: "pFile", scope: !303, file: !45, line: 145, type: !112)
!308 = !DILocation(line: 145, column: 16, scope: !303)
!309 = !DILocation(line: 147, column: 17, scope: !310)
!310 = distinct !DILexicalBlock(scope: !303, file: !45, line: 147, column: 13)
!311 = !DILocation(line: 147, column: 16, scope: !310)
!312 = !DILocation(line: 147, column: 25, scope: !310)
!313 = !DILocation(line: 147, column: 13, scope: !303)
!314 = !DILocation(line: 149, column: 21, scope: !315)
!315 = distinct !DILexicalBlock(scope: !310, file: !45, line: 148, column: 9)
!316 = !DILocation(line: 149, column: 19, scope: !315)
!317 = !DILocation(line: 150, column: 17, scope: !318)
!318 = distinct !DILexicalBlock(scope: !315, file: !45, line: 150, column: 17)
!319 = !DILocation(line: 150, column: 23, scope: !318)
!320 = !DILocation(line: 150, column: 17, scope: !315)
!321 = !DILocation(line: 153, column: 27, scope: !322)
!322 = distinct !DILexicalBlock(scope: !323, file: !45, line: 153, column: 21)
!323 = distinct !DILexicalBlock(scope: !318, file: !45, line: 151, column: 13)
!324 = !DILocation(line: 153, column: 32, scope: !322)
!325 = !DILocation(line: 153, column: 31, scope: !322)
!326 = !DILocation(line: 153, column: 51, scope: !322)
!327 = !DILocation(line: 153, column: 50, scope: !322)
!328 = !DILocation(line: 153, column: 41, scope: !322)
!329 = !DILocation(line: 153, column: 61, scope: !322)
!330 = !DILocation(line: 153, column: 21, scope: !322)
!331 = !DILocation(line: 153, column: 68, scope: !322)
!332 = !DILocation(line: 153, column: 21, scope: !323)
!333 = !DILocation(line: 155, column: 21, scope: !334)
!334 = distinct !DILexicalBlock(scope: !322, file: !45, line: 154, column: 17)
!335 = !DILocation(line: 157, column: 21, scope: !334)
!336 = !DILocation(line: 157, column: 26, scope: !334)
!337 = !DILocation(line: 157, column: 35, scope: !334)
!338 = !DILocation(line: 158, column: 17, scope: !334)
!339 = !DILocation(line: 159, column: 24, scope: !323)
!340 = !DILocation(line: 159, column: 17, scope: !323)
!341 = !DILocation(line: 160, column: 13, scope: !323)
!342 = !DILocation(line: 161, column: 9, scope: !315)
!343 = !DILocation(line: 163, column: 17, scope: !295)
!344 = !DILocation(line: 163, column: 5, scope: !295)
!345 = !DILocation(line: 164, column: 1, scope: !295)
!346 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_41_good", scope: !45, file: !45, line: 166, type: !92, scopeLine: 167, spFlags: DISPFlagDefinition, unit: !44, retainedNodes: !46)
!347 = !DILocation(line: 168, column: 5, scope: !346)
!348 = !DILocation(line: 169, column: 5, scope: !346)
!349 = !DILocation(line: 170, column: 1, scope: !346)
!350 = distinct !DISubprogram(name: "printLine", scope: !3, file: !3, line: 11, type: !53, scopeLine: 12, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!351 = !DILocalVariable(name: "line", arg: 1, scope: !350, file: !3, line: 11, type: !42)
!352 = !DILocation(line: 11, column: 25, scope: !350)
!353 = !DILocation(line: 13, column: 1, scope: !350)
!354 = !DILocation(line: 14, column: 8, scope: !355)
!355 = distinct !DILexicalBlock(scope: !350, file: !3, line: 14, column: 8)
!356 = !DILocation(line: 14, column: 13, scope: !355)
!357 = !DILocation(line: 14, column: 8, scope: !350)
!358 = !DILocation(line: 16, column: 24, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !3, line: 15, column: 5)
!360 = !DILocation(line: 16, column: 9, scope: !359)
!361 = !DILocation(line: 17, column: 5, scope: !359)
!362 = !DILocation(line: 18, column: 5, scope: !350)
!363 = !DILocation(line: 19, column: 1, scope: !350)
!364 = distinct !DISubprogram(name: "printSinkLine", scope: !3, file: !3, line: 20, type: !53, scopeLine: 21, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!365 = !DILocalVariable(name: "line", arg: 1, scope: !364, file: !3, line: 20, type: !42)
!366 = !DILocation(line: 20, column: 29, scope: !364)
!367 = !DILocation(line: 22, column: 8, scope: !368)
!368 = distinct !DILexicalBlock(scope: !364, file: !3, line: 22, column: 8)
!369 = !DILocation(line: 22, column: 13, scope: !368)
!370 = !DILocation(line: 22, column: 8, scope: !364)
!371 = !DILocation(line: 24, column: 24, scope: !372)
!372 = distinct !DILexicalBlock(scope: !368, file: !3, line: 23, column: 5)
!373 = !DILocation(line: 24, column: 9, scope: !372)
!374 = !DILocation(line: 25, column: 5, scope: !372)
!375 = !DILocation(line: 26, column: 1, scope: !364)
!376 = distinct !DISubprogram(name: "printWLine", scope: !3, file: !3, line: 27, type: !377, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!377 = !DISubroutineType(types: !378)
!378 = !{null, !379}
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !106, line: 74, baseType: !23)
!381 = !DILocalVariable(name: "line", arg: 1, scope: !376, file: !3, line: 27, type: !379)
!382 = !DILocation(line: 27, column: 29, scope: !376)
!383 = !DILocation(line: 29, column: 8, scope: !384)
!384 = distinct !DILexicalBlock(scope: !376, file: !3, line: 29, column: 8)
!385 = !DILocation(line: 29, column: 13, scope: !384)
!386 = !DILocation(line: 29, column: 8, scope: !376)
!387 = !DILocation(line: 31, column: 27, scope: !388)
!388 = distinct !DILexicalBlock(scope: !384, file: !3, line: 30, column: 5)
!389 = !DILocation(line: 31, column: 9, scope: !388)
!390 = !DILocation(line: 32, column: 5, scope: !388)
!391 = !DILocation(line: 33, column: 1, scope: !376)
!392 = distinct !DISubprogram(name: "printIntLine", scope: !3, file: !3, line: 35, type: !393, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!393 = !DISubroutineType(types: !394)
!394 = !{null, !23}
!395 = !DILocalVariable(name: "intNumber", arg: 1, scope: !392, file: !3, line: 35, type: !23)
!396 = !DILocation(line: 35, column: 24, scope: !392)
!397 = !DILocation(line: 37, column: 20, scope: !392)
!398 = !DILocation(line: 37, column: 5, scope: !392)
!399 = !DILocation(line: 38, column: 1, scope: !392)
!400 = distinct !DISubprogram(name: "printShortLine", scope: !3, file: !3, line: 40, type: !401, scopeLine: 41, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !403}
!403 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!404 = !DILocalVariable(name: "shortNumber", arg: 1, scope: !400, file: !3, line: 40, type: !403)
!405 = !DILocation(line: 40, column: 28, scope: !400)
!406 = !DILocation(line: 42, column: 21, scope: !400)
!407 = !DILocation(line: 42, column: 5, scope: !400)
!408 = !DILocation(line: 43, column: 1, scope: !400)
!409 = distinct !DISubprogram(name: "printFloatLine", scope: !3, file: !3, line: 45, type: !410, scopeLine: 46, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!410 = !DISubroutineType(types: !411)
!411 = !{null, !412}
!412 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!413 = !DILocalVariable(name: "floatNumber", arg: 1, scope: !409, file: !3, line: 45, type: !412)
!414 = !DILocation(line: 45, column: 28, scope: !409)
!415 = !DILocation(line: 47, column: 20, scope: !409)
!416 = !DILocation(line: 47, column: 5, scope: !409)
!417 = !DILocation(line: 48, column: 1, scope: !409)
!418 = distinct !DISubprogram(name: "printLongLine", scope: !3, file: !3, line: 50, type: !419, scopeLine: 51, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!419 = !DISubroutineType(types: !420)
!420 = !{null, !140}
!421 = !DILocalVariable(name: "longNumber", arg: 1, scope: !418, file: !3, line: 50, type: !140)
!422 = !DILocation(line: 50, column: 26, scope: !418)
!423 = !DILocation(line: 52, column: 21, scope: !418)
!424 = !DILocation(line: 52, column: 5, scope: !418)
!425 = !DILocation(line: 53, column: 1, scope: !418)
!426 = distinct !DISubprogram(name: "printLongLongLine", scope: !3, file: !3, line: 55, type: !427, scopeLine: 56, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!427 = !DISubroutineType(types: !428)
!428 = !{null, !429}
!429 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !430, line: 27, baseType: !431)
!430 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stdint-intn.h", directory: "")
!431 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !139, line: 44, baseType: !140)
!432 = !DILocalVariable(name: "longLongIntNumber", arg: 1, scope: !426, file: !3, line: 55, type: !429)
!433 = !DILocation(line: 55, column: 33, scope: !426)
!434 = !DILocation(line: 57, column: 29, scope: !426)
!435 = !DILocation(line: 57, column: 5, scope: !426)
!436 = !DILocation(line: 58, column: 1, scope: !426)
!437 = distinct !DISubprogram(name: "printSizeTLine", scope: !3, file: !3, line: 60, type: !438, scopeLine: 61, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!438 = !DISubroutineType(types: !439)
!439 = !{null, !105}
!440 = !DILocalVariable(name: "sizeTNumber", arg: 1, scope: !437, file: !3, line: 60, type: !105)
!441 = !DILocation(line: 60, column: 29, scope: !437)
!442 = !DILocation(line: 62, column: 21, scope: !437)
!443 = !DILocation(line: 62, column: 5, scope: !437)
!444 = !DILocation(line: 63, column: 1, scope: !437)
!445 = distinct !DISubprogram(name: "printHexCharLine", scope: !3, file: !3, line: 65, type: !446, scopeLine: 66, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!446 = !DISubroutineType(types: !447)
!447 = !{null, !43}
!448 = !DILocalVariable(name: "charHex", arg: 1, scope: !445, file: !3, line: 65, type: !43)
!449 = !DILocation(line: 65, column: 29, scope: !445)
!450 = !DILocation(line: 67, column: 22, scope: !445)
!451 = !DILocation(line: 67, column: 5, scope: !445)
!452 = !DILocation(line: 68, column: 1, scope: !445)
!453 = distinct !DISubprogram(name: "printWcharLine", scope: !3, file: !3, line: 70, type: !454, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!454 = !DISubroutineType(types: !455)
!455 = !{null, !380}
!456 = !DILocalVariable(name: "wideChar", arg: 1, scope: !453, file: !3, line: 70, type: !380)
!457 = !DILocation(line: 70, column: 29, scope: !453)
!458 = !DILocalVariable(name: "s", scope: !453, file: !3, line: 74, type: !459)
!459 = !DICompositeType(tag: DW_TAG_array_type, baseType: !380, size: 64, elements: !460)
!460 = !{!461}
!461 = !DISubrange(count: 2)
!462 = !DILocation(line: 74, column: 13, scope: !453)
!463 = !DILocation(line: 75, column: 16, scope: !453)
!464 = !DILocation(line: 75, column: 9, scope: !453)
!465 = !DILocation(line: 75, column: 14, scope: !453)
!466 = !DILocation(line: 76, column: 9, scope: !453)
!467 = !DILocation(line: 76, column: 14, scope: !453)
!468 = !DILocation(line: 77, column: 21, scope: !453)
!469 = !DILocation(line: 77, column: 5, scope: !453)
!470 = !DILocation(line: 78, column: 1, scope: !453)
!471 = distinct !DISubprogram(name: "printUnsignedLine", scope: !3, file: !3, line: 80, type: !472, scopeLine: 81, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!472 = !DISubroutineType(types: !473)
!473 = !{null, !7}
!474 = !DILocalVariable(name: "unsignedNumber", arg: 1, scope: !471, file: !3, line: 80, type: !7)
!475 = !DILocation(line: 80, column: 33, scope: !471)
!476 = !DILocation(line: 82, column: 20, scope: !471)
!477 = !DILocation(line: 82, column: 5, scope: !471)
!478 = !DILocation(line: 83, column: 1, scope: !471)
!479 = distinct !DISubprogram(name: "printHexUnsignedCharLine", scope: !3, file: !3, line: 85, type: !480, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!480 = !DISubroutineType(types: !481)
!481 = !{null, !25}
!482 = !DILocalVariable(name: "unsignedCharacter", arg: 1, scope: !479, file: !3, line: 85, type: !25)
!483 = !DILocation(line: 85, column: 45, scope: !479)
!484 = !DILocation(line: 87, column: 22, scope: !479)
!485 = !DILocation(line: 87, column: 5, scope: !479)
!486 = !DILocation(line: 88, column: 1, scope: !479)
!487 = distinct !DISubprogram(name: "printDoubleLine", scope: !3, file: !3, line: 90, type: !488, scopeLine: 91, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!488 = !DISubroutineType(types: !489)
!489 = !{null, !490}
!490 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!491 = !DILocalVariable(name: "doubleNumber", arg: 1, scope: !487, file: !3, line: 90, type: !490)
!492 = !DILocation(line: 90, column: 29, scope: !487)
!493 = !DILocation(line: 92, column: 20, scope: !487)
!494 = !DILocation(line: 92, column: 5, scope: !487)
!495 = !DILocation(line: 93, column: 1, scope: !487)
!496 = distinct !DISubprogram(name: "printStructLine", scope: !3, file: !3, line: 95, type: !497, scopeLine: 96, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!497 = !DISubroutineType(types: !498)
!498 = !{null, !499}
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !500, size: 64)
!500 = !DIDerivedType(tag: DW_TAG_typedef, name: "twoIntsStruct", file: !501, line: 100, baseType: !502)
!501 = !DIFile(filename: "./std_testcase.h", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_098/source_code")
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_twoIntsStruct", file: !501, line: 96, size: 64, elements: !503)
!503 = !{!504, !505}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "intOne", scope: !502, file: !501, line: 98, baseType: !23, size: 32)
!505 = !DIDerivedType(tag: DW_TAG_member, name: "intTwo", scope: !502, file: !501, line: 99, baseType: !23, size: 32, offset: 32)
!506 = !DILocalVariable(name: "structTwoIntsStruct", arg: 1, scope: !496, file: !3, line: 95, type: !499)
!507 = !DILocation(line: 95, column: 40, scope: !496)
!508 = !DILocation(line: 97, column: 26, scope: !496)
!509 = !DILocation(line: 97, column: 47, scope: !496)
!510 = !DILocation(line: 97, column: 55, scope: !496)
!511 = !DILocation(line: 97, column: 76, scope: !496)
!512 = !DILocation(line: 97, column: 5, scope: !496)
!513 = !DILocation(line: 98, column: 1, scope: !496)
!514 = distinct !DISubprogram(name: "printBytesLine", scope: !3, file: !3, line: 100, type: !515, scopeLine: 101, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!515 = !DISubroutineType(types: !516)
!516 = !{null, !517, !105}
!517 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !25, size: 64)
!518 = !DILocalVariable(name: "bytes", arg: 1, scope: !514, file: !3, line: 100, type: !517)
!519 = !DILocation(line: 100, column: 38, scope: !514)
!520 = !DILocalVariable(name: "numBytes", arg: 2, scope: !514, file: !3, line: 100, type: !105)
!521 = !DILocation(line: 100, column: 52, scope: !514)
!522 = !DILocalVariable(name: "i", scope: !514, file: !3, line: 102, type: !105)
!523 = !DILocation(line: 102, column: 12, scope: !514)
!524 = !DILocation(line: 103, column: 12, scope: !525)
!525 = distinct !DILexicalBlock(scope: !514, file: !3, line: 103, column: 5)
!526 = !DILocation(line: 103, column: 10, scope: !525)
!527 = !DILocation(line: 103, column: 17, scope: !528)
!528 = distinct !DILexicalBlock(scope: !525, file: !3, line: 103, column: 5)
!529 = !DILocation(line: 103, column: 21, scope: !528)
!530 = !DILocation(line: 103, column: 19, scope: !528)
!531 = !DILocation(line: 103, column: 5, scope: !525)
!532 = !DILocation(line: 105, column: 24, scope: !533)
!533 = distinct !DILexicalBlock(scope: !528, file: !3, line: 104, column: 5)
!534 = !DILocation(line: 105, column: 30, scope: !533)
!535 = !DILocation(line: 105, column: 9, scope: !533)
!536 = !DILocation(line: 106, column: 5, scope: !533)
!537 = !DILocation(line: 103, column: 31, scope: !528)
!538 = !DILocation(line: 103, column: 5, scope: !528)
!539 = distinct !{!539, !531, !540, !86}
!540 = !DILocation(line: 106, column: 5, scope: !525)
!541 = !DILocation(line: 107, column: 5, scope: !514)
!542 = !DILocation(line: 108, column: 1, scope: !514)
!543 = distinct !DISubprogram(name: "decodeHexChars", scope: !3, file: !3, line: 113, type: !544, scopeLine: 114, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !46)
!544 = !DISubroutineType(types: !545)
!545 = !{!105, !517, !105, !42}
!546 = !DILocalVariable(name: "bytes", arg: 1, scope: !543, file: !3, line: 113, type: !517)
!547 = !DILocation(line: 113, column: 39, scope: !543)
!548 = !DILocalVariable(name: "numBytes", arg: 2, scope: !543, file: !3, line: 113, type: !105)
!549 = !DILocation(line: 113, column: 53, scope: !543)
!550 = !DILocalVariable(name: "hex", arg: 3, scope: !543, file: !3, line: 113, type: !42)
!551 = !DILocation(line: 113, column: 71, scope: !543)
!552 = !DILocalVariable(name: "numWritten", scope: !543, file: !3, line: 115, type: !105)
!553 = !DILocation(line: 115, column: 12, scope: !543)
!554 = !DILocation(line: 121, column: 5, scope: !543)
!555 = !DILocation(line: 121, column: 12, scope: !543)
!556 = !DILocation(line: 121, column: 25, scope: !543)
!557 = !DILocation(line: 121, column: 23, scope: !543)
!558 = !DILocation(line: 121, column: 34, scope: !543)
!559 = !DILocation(line: 121, column: 37, scope: !543)
!560 = !DILocation(line: 121, column: 67, scope: !543)
!561 = !DILocation(line: 121, column: 70, scope: !543)
!562 = !DILocation(line: 0, scope: !543)
!563 = !DILocalVariable(name: "byte", scope: !564, file: !3, line: 123, type: !23)
!564 = distinct !DILexicalBlock(scope: !543, file: !3, line: 122, column: 5)
!565 = !DILocation(line: 123, column: 13, scope: !564)
