; ModuleID = 'CWE606_Unchecked_Loop_Condition__char_file_41.c'
source_filename = "CWE606_Unchecked_Loop_Condition__char_file_41.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque

@.str = private unnamed_addr constant [3 x i8] c"%d\00", align 1
@.str.1 = private unnamed_addr constant [14 x i8] c"/tmp/file.txt\00", align 1
@.str.2 = private unnamed_addr constant [2 x i8] c"r\00", align 1
@.str.3 = private unnamed_addr constant [15 x i8] c"fgets() failed\00", align 1
@.str.4 = private unnamed_addr constant [3 x i8] c"15\00", align 1

; Function Attrs: noinline nounwind optnone uwtable
define dso_local void @badSink(i8* %data) #0 !dbg !10 {
entry:
  %data.addr = alloca i8*, align 8
  %i = alloca i32, align 4
  %n = alloca i32, align 4
  %intVariable = alloca i32, align 4
  store i8* %data, i8** %data.addr, align 8
  call void @llvm.dbg.declare(metadata i8** %data.addr, metadata !15, metadata !DIExpression()), !dbg !16
  call void @llvm.dbg.declare(metadata i32* %i, metadata !17, metadata !DIExpression()), !dbg !19

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 12.0.0", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "CWE606_Unchecked_Loop_Condition__char_file_41.c", directory: "/home/raoxue/Desktop/MemVerif/workspace/000_109_098/source_code")
!2 = !{}
!3 = !{!4, !5}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!6 = !{i32 7, !"Dwarf Version", i32 4}
!7 = !{i32 2, !"Debug Info Version", i32 3}
!8 = !{i32 1, !"wchar_size", i32 4}
!9 = !{!"clang version 12.0.0"}
!10 = distinct !DISubprogram(name: "badSink", scope: !1, file: !1, line: 35, type: !11, scopeLine: 36, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!11 = !DISubroutineType(types: !12)
!12 = !{null, !13}
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!15 = !DILocalVariable(name: "data", arg: 1, scope: !10, file: !1, line: 35, type: !13)
!16 = !DILocation(line: 35, column: 21, scope: !10)
!17 = !DILocalVariable(name: "i", scope: !18, file: !1, line: 38, type: !5)
!18 = distinct !DILexicalBlock(scope: !10, file: !1, line: 37, column: 5)
!19 = !DILocation(line: 38, column: 13, scope: !18)
!20 = !DILocalVariable(name: "n", scope: !18, file: !1, line: 38, type: !5)
!21 = !DILocation(line: 38, column: 16, scope: !18)
!22 = !DILocalVariable(name: "intVariable", scope: !18, file: !1, line: 38, type: !5)
!23 = !DILocation(line: 38, column: 19, scope: !18)
!24 = !DILocation(line: 39, column: 20, scope: !25)
!25 = distinct !DILexicalBlock(scope: !18, file: !1, line: 39, column: 13)
!26 = !DILocation(line: 39, column: 13, scope: !25)
!27 = !DILocation(line: 39, column: 36, scope: !25)
!28 = !DILocation(line: 39, column: 13, scope: !18)
!29 = !DILocation(line: 42, column: 25, scope: !30)
!30 = distinct !DILexicalBlock(scope: !25, file: !1, line: 40, column: 9)
!31 = !DILocation(line: 43, column: 20, scope: !32)
!32 = distinct !DILexicalBlock(scope: !30, file: !1, line: 43, column: 13)
!33 = !DILocation(line: 43, column: 18, scope: !32)
!34 = !DILocation(line: 43, column: 25, scope: !35)
!35 = distinct !DILexicalBlock(scope: !32, file: !1, line: 43, column: 13)
!36 = !DILocation(line: 43, column: 29, scope: !35)
!37 = !DILocation(line: 43, column: 27, scope: !35)
!38 = !DILocation(line: 43, column: 13, scope: !32)
!39 = !DILocation(line: 46, column: 28, scope: !40)
!40 = distinct !DILexicalBlock(scope: !35, file: !1, line: 44, column: 13)
!41 = !DILocation(line: 47, column: 13, scope: !40)
!42 = !DILocation(line: 43, column: 33, scope: !35)
!43 = !DILocation(line: 43, column: 13, scope: !35)
!44 = distinct !{!44, !38, !45, !46}
!45 = !DILocation(line: 47, column: 13, scope: !32)
!46 = !{!"llvm.loop.mustprogress"}
!47 = !DILocation(line: 48, column: 26, scope: !30)
!48 = !DILocation(line: 48, column: 13, scope: !30)
!49 = !DILocation(line: 49, column: 9, scope: !30)
!50 = !DILocation(line: 51, column: 1, scope: !10)
!51 = distinct !DISubprogram(name: "CWE606_Unchecked_Loop_Condition__char_file_41_bad", scope: !1, file: !1, line: 53, type: !52, scopeLine: 54, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!52 = !DISubroutineType(types: !53)
!53 = !{null}
!54 = !DILocalVariable(name: "data", scope: !51, file: !1, line: 55, type: !13)
!55 = !DILocation(line: 55, column: 12, scope: !51)
!56 = !DILocalVariable(name: "dataBuffer", scope: !51, file: !1, line: 56, type: !57)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 800, elements: !58)
!58 = !{!59}
!59 = !DISubrange(count: 100)
!60 = !DILocation(line: 56, column: 10, scope: !51)
!61 = !DILocation(line: 57, column: 12, scope: !51)
!62 = !DILocation(line: 57, column: 10, scope: !51)
!63 = !DILocalVariable(name: "dataLen", scope: !64, file: !1, line: 60, type: !65)
!64 = distinct !DILexicalBlock(scope: !51, file: !1, line: 58, column: 5)
!65 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !66, line: 46, baseType: !67)
!66 = !DIFile(filename: "node_modules/llvm-12.0.0.obj/lib/clang/12.0.0/include/stddef.h", directory: "/home/raoxue")
!67 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!68 = !DILocation(line: 60, column: 16, scope: !64)
!69 = !DILocation(line: 60, column: 33, scope: !64)
!70 = !DILocation(line: 60, column: 26, scope: !64)
!71 = !DILocalVariable(name: "pFile", scope: !64, file: !1, line: 61, type: !72)
!72 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !73, size: 64)
!73 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !74, line: 7, baseType: !75)
!74 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/FILE.h", directory: "")
!75 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !76, line: 49, size: 1728, elements: !77)
!76 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_FILE.h", directory: "")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !93, !95, !96, !97, !101, !103, !105, !109, !112, !114, !117, !120, !121, !122, !123, !124}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !75, file: !76, line: 51, baseType: !5, size: 32)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !75, file: !76, line: 54, baseType: !13, size: 64, offset: 64)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !75, file: !76, line: 55, baseType: !13, size: 64, offset: 128)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !75, file: !76, line: 56, baseType: !13, size: 64, offset: 192)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !75, file: !76, line: 57, baseType: !13, size: 64, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !75, file: !76, line: 58, baseType: !13, size: 64, offset: 320)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !75, file: !76, line: 59, baseType: !13, size: 64, offset: 384)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !75, file: !76, line: 60, baseType: !13, size: 64, offset: 448)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !75, file: !76, line: 61, baseType: !13, size: 64, offset: 512)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !75, file: !76, line: 64, baseType: !13, size: 64, offset: 576)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !75, file: !76, line: 65, baseType: !13, size: 64, offset: 640)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !75, file: !76, line: 66, baseType: !13, size: 64, offset: 704)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !75, file: !76, line: 68, baseType: !91, size: 64, offset: 768)
!91 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !92, size: 64)
!92 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !76, line: 36, flags: DIFlagFwdDecl)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !75, file: !76, line: 70, baseType: !94, size: 64, offset: 832)
!94 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !75, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !75, file: !76, line: 72, baseType: !5, size: 32, offset: 896)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !75, file: !76, line: 73, baseType: !5, size: 32, offset: 928)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !75, file: !76, line: 74, baseType: !98, size: 64, offset: 960)
!98 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !99, line: 152, baseType: !100)
!99 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!100 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !75, file: !76, line: 77, baseType: !102, size: 16, offset: 1024)
!102 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !75, file: !76, line: 78, baseType: !104, size: 8, offset: 1040)
!104 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !75, file: !76, line: 79, baseType: !106, size: 8, offset: 1048)
!106 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 8, elements: !107)
!107 = !{!108}
!108 = !DISubrange(count: 1)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !75, file: !76, line: 81, baseType: !110, size: 64, offset: 1088)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !76, line: 43, baseType: null)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !75, file: !76, line: 89, baseType: !113, size: 64, offset: 1152)
!113 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !99, line: 153, baseType: !100)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !75, file: !76, line: 91, baseType: !115, size: 64, offset: 1216)
!115 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !116, size: 64)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !76, line: 37, flags: DIFlagFwdDecl)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !75, file: !76, line: 92, baseType: !118, size: 64, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !76, line: 38, flags: DIFlagFwdDecl)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !75, file: !76, line: 93, baseType: !94, size: 64, offset: 1344)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !75, file: !76, line: 94, baseType: !4, size: 64, offset: 1408)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !75, file: !76, line: 95, baseType: !65, size: 64, offset: 1472)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !75, file: !76, line: 96, baseType: !5, size: 32, offset: 1536)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !75, file: !76, line: 98, baseType: !125, size: 160, offset: 1568)
!125 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 160, elements: !126)
!126 = !{!127}
!127 = !DISubrange(count: 20)
!128 = !DILocation(line: 61, column: 16, scope: !64)
!129 = !DILocation(line: 63, column: 17, scope: !130)
!130 = distinct !DILexicalBlock(scope: !64, file: !1, line: 63, column: 13)
!131 = !DILocation(line: 63, column: 16, scope: !130)
!132 = !DILocation(line: 63, column: 25, scope: !130)
!133 = !DILocation(line: 63, column: 13, scope: !64)
!134 = !DILocation(line: 65, column: 21, scope: !135)
!135 = distinct !DILexicalBlock(scope: !130, file: !1, line: 64, column: 9)
!136 = !DILocation(line: 65, column: 19, scope: !135)
!137 = !DILocation(line: 66, column: 17, scope: !138)
!138 = distinct !DILexicalBlock(scope: !135, file: !1, line: 66, column: 17)
!139 = !DILocation(line: 66, column: 23, scope: !138)
!140 = !DILocation(line: 66, column: 17, scope: !135)
!141 = !DILocation(line: 69, column: 27, scope: !142)
!142 = distinct !DILexicalBlock(scope: !143, file: !1, line: 69, column: 21)
!143 = distinct !DILexicalBlock(scope: !138, file: !1, line: 67, column: 13)
!144 = !DILocation(line: 69, column: 32, scope: !142)
!145 = !DILocation(line: 69, column: 31, scope: !142)
!146 = !DILocation(line: 69, column: 51, scope: !142)
!147 = !DILocation(line: 69, column: 50, scope: !142)
!148 = !DILocation(line: 69, column: 41, scope: !142)
!149 = !DILocation(line: 69, column: 61, scope: !142)
!150 = !DILocation(line: 69, column: 21, scope: !142)
!151 = !DILocation(line: 69, column: 68, scope: !142)
!152 = !DILocation(line: 69, column: 21, scope: !143)
!153 = !DILocation(line: 71, column: 21, scope: !154)
!154 = distinct !DILexicalBlock(scope: !142, file: !1, line: 70, column: 17)
!155 = !DILocation(line: 73, column: 21, scope: !154)
!156 = !DILocation(line: 73, column: 26, scope: !154)
!157 = !DILocation(line: 73, column: 35, scope: !154)
!158 = !DILocation(line: 74, column: 17, scope: !154)
!159 = !DILocation(line: 75, column: 24, scope: !143)
!160 = !DILocation(line: 75, column: 17, scope: !143)
!161 = !DILocation(line: 76, column: 13, scope: !143)
!162 = !DILocation(line: 77, column: 9, scope: !135)
!163 = !DILocation(line: 79, column: 13, scope: !51)
!164 = !DILocation(line: 79, column: 5, scope: !51)
!165 = !DILocation(line: 80, column: 1, scope: !51)
!166 = distinct !DISubprogram(name: "goodG2BSink", scope: !1, file: !1, line: 87, type: !11, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
!167 = !DILocalVariable(name: "data", arg: 1, scope: !166, file: !1, line: 87, type: !13)
!168 = !DILocation(line: 87, column: 25, scope: !166)
!169 = !DILocalVariable(name: "i", scope: !170, file: !1, line: 90, type: !5)
!170 = distinct !DILexicalBlock(scope: !166, file: !1, line: 89, column: 5)
!171 = !DILocation(line: 90, column: 13, scope: !170)
!172 = !DILocalVariable(name: "n", scope: !170, file: !1, line: 90, type: !5)
!173 = !DILocation(line: 90, column: 16, scope: !170)
!174 = !DILocalVariable(name: "intVariable", scope: !170, file: !1, line: 90, type: !5)
!175 = !DILocation(line: 90, column: 19, scope: !170)
!176 = !DILocation(line: 91, column: 20, scope: !177)
!177 = distinct !DILexicalBlock(scope: !170, file: !1, line: 91, column: 13)
!178 = !DILocation(line: 91, column: 13, scope: !177)
!179 = !DILocation(line: 91, column: 36, scope: !177)
!180 = !DILocation(line: 91, column: 13, scope: !170)
!181 = !DILocation(line: 94, column: 25, scope: !182)
!182 = distinct !DILexicalBlock(scope: !177, file: !1, line: 92, column: 9)
!183 = !DILocation(line: 95, column: 20, scope: !184)
!184 = distinct !DILexicalBlock(scope: !182, file: !1, line: 95, column: 13)
!185 = !DILocation(line: 95, column: 18, scope: !184)
!186 = !DILocation(line: 95, column: 25, scope: !187)
!187 = distinct !DILexicalBlock(scope: !184, file: !1, line: 95, column: 13)
